      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZCGP01
      * プログラム名称 : 取引差分更新処理再読込処理ルーチン
      * 処理概要       : 取引差分管理テーブルより対象のファンド、
      *                  ポートフォリオ、銘柄を抽出して、再処理要ポート
      *                  フォリオ一覧（取引）テーブルに取り込む。追加
      *                  で処理対象となった、ファンド、ポートフォリオ、
      *                  銘柄については、メッセージに出力する。
      *                  （※ワーニング扱いとする。）
      * 参照ＤＢ       : 取引差分更新管理テーブル（TKMZSK00）
      *                  再処理要ポートフォリオ一覧（取引）（TKDYGP12）
      *                  再処理要ポートフォリオ一覧(銘柄属性)(TKDYGP16)
      * 更新ＤＢ       : 再処理要ポートフォリオ一覧（取引）（TKDYGP12）
      * 引数           : IN  起動ログインユーザ会社コード
      *                : IN  利用会社コード
      *                : IN  処理実行日
      *                : IN  起動ID
      *                : IN  業務タスクID
      *                : IN  起動ユーザID
      *                : IN  残高基準日FROM
      *                : IN  残高基準日TO
      *                : OUT RTNパッケージ
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- ----  ---------  ------  ------------------------
      * 20100624   新規  SCS        常峰    新規作成
      * 20100818   修正  SCS        常峰    総合障害4389対応
      * 20100823   修正  SCS        楊超    総合障害4394
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZCGP01.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  10-06-24.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZCGP01".
         05  CNS-TKMZSK00          PIC  X(08)  VALUE  "TKMZSK00".
         05  CNS-TKDYGP12          PIC  X(08)  VALUE  "TKDYGP12".
         05  CNS-TKDYGP16          PIC  X(08)  VALUE  "TKDYGP16".
         05  CNS-T                 PIC  X(01)  VALUE  "T".
         05  CNS-1                 PIC  9(01)  VALUE  1.
         05  CNS-MA99              PIC  X(04)  VALUE  "MA99".
         05  CNS-W000456           PIC  X(07)  VALUE  "W000456".
         05  CNS-TK-MOJI           PIC  X(28)
             VALUE  "取引差分更新より再読込データ".
      ******************************************************************
      *                   フラグ  エリア
      ******************************************************************
       01  FLAG-AREA.
      *----------  FETCH終了フラグ
         05  FLG-CUR1-OPEN         PIC  9(01).
         05  FLG-CUR1-FETCH        PIC  9(01).
         05  FLG-CUR2-OPEN         PIC  9(01).
         05  FLG-CUR2-FETCH        PIC  9(01).
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-DATA-IN.
      *----------  起動ログインユーザ会社コード
           10  KIDOU-RIYO-CMP-CD   PIC  X(04).
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
      *----------  処理実行日
           10  SYORI-YMD           PIC  9(08).
      *----------  起動ID
           10  KIDOU-ID            PIC  X(04).
      *----------  業務タスクID
           10  GYOMU-TASK-ID       PIC  X(07).
      *----------  起動ユーザID
           10  KIDOU-USER-ID       PIC  X(20).
      *----------  残高基準日FROM
           10  ZN-KJN-YMD-FROM     PIC  9(08).
      *----------  残高基準日TO
           10  ZN-KJN-YMD-TO       PIC  9(08).
         05  WK-TKMZSK00-ID        PIC  X(13).
         05  WK-TKDYGP12-ID        PIC  X(13).
         05  WK-TKDYGP16-ID        PIC  X(13).
         05  WK-SQLSTMT1           PIC  X(3000).
         05  WK-SQLSTMT2           PIC  X(3000).
         05  WK-SQLSTMT3           PIC  X(3000).
      *------  件数
         05  WK-FETCH1-COUNT       PIC  S9(04).
         05  WK-FETCH2-COUNT       PIC  S9(04).
      ******************************************************************
      *                ORACLE ホスト変数定義
      ******************************************************************
      *----------ＳＱＬコミュニケーション領域
           EXEC  SQL      INCLUDE   SQLCA        END-EXEC.
           EXEC  SQL      INCLUDE   ORACA        END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HOST-AREA.
         05  SQLSTMT               PIC  X(2500).
         05  SQLSTMT1              PIC  X(2500).
         05  SQLSTMT2              PIC  X(2500).
         05  SQLSTMT3              PIC  X(2500).
         05  HST-FUND-CD1          PIC  X(12).
         05  HST-PTF-CD1           PIC  X(04).
         05  HST-ZN-KJN-YMD-FROM   PIC  S9(08).
         05  HST-ZN-KJN-YMD-TO     PIC  S9(08).
         05  HST-TKDYGP12.
      *------  ファンドコード
           10  HST-FUND-CD         PIC  X(12).
      *------  ポートフォリオコード
           10  HST-PTF-CD          PIC  X(04).
      *------  評価系列コード
           10  HST-HYK-KRTU-CD     PIC  X(04).
      *------  証券種別コード
           10  HST-SEC-SBT-CD      PIC  X(04).
      *------  変換前証券種別コード
           10  HST-ZHKZ-SEC-SBT-CD PIC  X(04).
      *------  銘柄コード
           10  HST-MEG-CD          PIC  X(15).
      *------  更新日時ＦＲＯＭ
           10  HST-UPD-DATE-FROM   PIC  X(14).
      *------  更新日時ＴＯ
           10  HST-UPD-DATE-TO     PIC  X(14).
      *------  計算期間ＦＲＯＭ
           10  HST-CALC-KKN-FROM   PIC  S9(08).
      *------  計算期間ＴＯ
           10  HST-CALC-KKN-TO     PIC  S9(08).
      *------  ＧＸ取引接続対象フラグ
           10  HST-GX-TORI-TAISYO-FLG
                                   PIC  X(01).
      *------  日次関連対象フラグ
           10  HST-NITIJI-TAISYO-FLG
                                   PIC  X(01).
      *------  更新ログインユーザ会社コード
           10  HST-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
      *------  更新ユーザＩＤ
           10  HST-UPD-SID         PIC  X(20).
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *                ＳＱＬ文作成  エリア
      ******************************************************************
       01  SQL-TBL.
         05  SQL-SELECT-1.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------    ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------    ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID          PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " UNION ".
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------    ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------    ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID1         PIC  X(13).
         05  SQL-SELECT-2.
           10  SQL-SELECT-2-1.
             15  FILLER            PIC  X(07)  VALUE  "SELECT ".
      *----------    評価系列コード
             15  FILLER            PIC  X(14)  VALUE  "B.HYK_KRTU_CD,".
      *----------    証券種別
             15  FILLER            PIC  X(13)  VALUE  "A.SEC_SBT_CD,".
      *----------    銘柄コード
             15  FILLER            PIC  X(09)  VALUE  "A.MEG_CD,".
      *----------    MAX(ＧＸ取引接続対象フラグ)
             15  FILLER            PIC  X(26)  VALUE
                                   "MAX(B.GX_TORI_TAISYO_FLG),".
      *----------    MAX(日次関連対象フラグ)
             15  FILLER            PIC  X(25)  VALUE
                                   "MAX(B.NITIJI_TAISYO_FLG),".
      *----------    更新日時FROM
             15  FILLER            PIC  X(45)  VALUE
                 "TO_CHAR(MIN(A.UPD_DATE), 'YYYYMMDDHH24MISS'),".
      *----------    更新日時TO
             15  FILLER            PIC  X(45)  VALUE
                 "TO_CHAR(MAX(A.UPD_DATE), 'YYYYMMDDHH24MISS'),".
           10  SQL-SELECT-2-2.
      *----------    MIN(差分計算開始日(約定))
             15  FILLER            PIC  X(24)  VALUE
                                   "MIN(A.SBN_CALC_FROM_YKJ)".
           10  SQL-SELECT-2-3.
      *----------    MIN(差分計算開始日(受渡))
             15  FILLER            PIC  X(24)  VALUE
                                   "MIN(A.SBN_CALC_FROM_UKE)".
           10  SQL-SELECT-2-4.
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL-ID1       PIC  X(13).
             15  FILLER            PIC  X(03)  VALUE  " A,".
             15  FILLER            PIC  X(10)  VALUE  " ( SELECT ".
      *----------    ファンドコード
             15  FILLER            PIC  X(08)  VALUE  "FUND_CD,".
      *----------    ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  " PTF_CD,".
      *----------    評価系列コード
             15  FILLER            PIC  X(13)  VALUE  " HYK_KRTU_CD,".
      *----------    ＧＸ取引接続対象フラグ
             15  FILLER            PIC  X(20)  VALUE
                                   " GX_TORI_TAISYO_FLG,".
      *----------    日次関連対象フラグ
             15  FILLER            PIC  X(17)  VALUE
                                   "NITIJI_TAISYO_FLG".
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL-ID2       PIC  X(13).
             15  FILLER            PIC  X(07)  VALUE  " UNION ".
             15  FILLER            PIC  X(08)  VALUE  " SELECT ".
      *----------    ファンドコード
             15  FILLER            PIC  X(08)  VALUE  "FUND_CD,".
      *----------    ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  " PTF_CD,".
      *----------    評価系列コード
             15  FILLER            PIC  X(13)  VALUE  " HYK_KRTU_CD,".
      *----------    ＧＸ取引接続対象フラグ
             15  FILLER            PIC  X(20)  VALUE
                                   " GX_TORI_TAISYO_FLG,".
      *----------    日次関連対象フラグ
             15  FILLER            PIC  X(17)  VALUE
                                   "NITIJI_TAISYO_FLG".
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL-ID3       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " )".
             15  FILLER            PIC  X(09)  VALUE  " B WHERE ".
      *----------    A.削除区分 ＝ '△'
             15  FILLER            PIC  X(19)  VALUE
                 "A.SAKUJO_KBN = ' ' ".
      *----------    A.ファンドコード＝WK-SQL-ファンドコード
             15  FILLER            PIC  X(28)  VALUE
                 "AND A.FUND_CD = :P_FUND_CD1 ".
      *----------    A.ポートフォリオコード＝WK-SQL-ポートフォリオコード
             15  FILLER            PIC  X(26)  VALUE
                 "AND A.PTF_CD = :P_PTF_CD1 ".
           10  SQL-SELECT-2-6.
      *----------    A.差分計算開始日(約定) ≦ ARG1.残高基準日TO
             15  FILLER            PIC  X(44)  VALUE
                 "AND A.SBN_CALC_FROM_YKJ <= :P_ZN_KJN_YMD_TO ".
      *----------    A.差分計算開始日(約定) ≠0
             15  FILLER            PIC  X(29)  VALUE
                 "AND A.SBN_CALC_FROM_YKJ <> 0 ".
           10  SQL-SELECT-2-8.
      *----------    A.差分計算開始日(受渡)  ≦ ARG1.残高基準日TO
             15  FILLER            PIC  X(44)  VALUE
                 "AND A.SBN_CALC_FROM_UKE <= :P_ZN_KJN_YMD_TO ".
      *----------    A.差分計算開始日(受渡)  ≠0
             15  FILLER            PIC  X(29)  VALUE
                 "AND A.SBN_CALC_FROM_UKE <> 0 ".
           10  SQL-SELECT-2-9.
      *----------    A.ファンドコード＝B.ファンドコード
             15  FILLER            PIC  X(26)  VALUE
                 "AND A.FUND_CD = B.FUND_CD ".
      *----------    A.ポートフォリオコード＝B.ポートフォリオコード
             15  FILLER            PIC  X(24)  VALUE
                 "AND A.PTF_CD = B.PTF_CD ".
             15  FILLER            PIC  X(09)  VALUE  "GROUP BY ".
      *----------    B.ファンドコード
             15  FILLER            PIC  X(10)  VALUE  "B.FUND_CD,".
      *----------    B.ポートフォリオコード
             15  FILLER            PIC  X(09)  VALUE  "B.PTF_CD,".
      *----------    B.評価系列コード
             15  FILLER            PIC  X(14)  VALUE  "B.HYK_KRTU_CD,".
      *----------    A.証券種別
             15  FILLER            PIC  X(13)  VALUE  "A.SEC_SBT_CD,".
      *----------    A.銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "A.MEG_CD".
           10  SQL-SELECT-2-10.
      *----------    ARG1.残高基準日FROM
             15  FILLER            PIC  X(19)  VALUE
                                   ":P_ZN_KJN_YMD_FROM1".
         05  SQL-INSERT.
           10  FILLER              PIC  X(12)  VALUE  "INSERT INTO ".
           10  SQL-TBL-ID          PIC  X(13).
      *----------    対象種別
           10  FILLER              PIC  X(13)  VALUE  " (TAISYO_SBT,".
      *----------    ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------    ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD,".
      *----------    評価系列コード
           10  FILLER              PIC  X(12)  VALUE  "HYK_KRTU_CD,".
      *----------    証券種別コード
           10  FILLER              PIC  X(11)  VALUE  "SEC_SBT_CD,".
      *----------    変換前証券種別コード
           10  FILLER              PIC  X(15)  VALUE  "HKZ_SEC_SBT_CD,".
      *----------    銘柄コード
           10  FILLER              PIC  X(07)  VALUE  "MEG_CD,".
      *----------    更新日時ＦＲＯＭ
           10  FILLER              PIC  X(14)  VALUE  "UPD_DATE_FROM,".
      *----------    更新日時ＴＯ
           10  FILLER              PIC  X(12)  VALUE  "UPD_DATE_TO,".
      *----------    更新フラグ
           10  FILLER              PIC  X(08)  VALUE  "UPD_FLG,".
      *----------    選択フラグ
           10  FILLER              PIC  X(08)  VALUE  "SEL_FLG,".
      *----------    計算期間ＦＲＯＭ
           10  FILLER              PIC  X(14)  VALUE  "CALC_KKN_FROM,".
      *----------    計算期間ＴＯ
           10  FILLER              PIC  X(12)  VALUE  "CALC_KKN_TO,".
      *----------    取引対象フラグ
           10  FILLER              PIC  X(16)
                                   VALUE  "TORI_TAISYO_FLG,".
      *----------    配当対象フラグ
           10  FILLER              PIC  X(16)
                                   VALUE  "HAIT_TAISYO_FLG,".
      *----------    ＧＸ取引接続対象フラグ
           10  FILLER              PIC  X(19)
                                   VALUE  "GX_TORI_TAISYO_FLG,".
      *----------    日次関連対象フラグ
           10  FILLER              PIC  X(18)
                                   VALUE  "NITIJI_TAISYO_FLG,".
      *----------    更新日時
           10  FILLER              PIC  X(09)  VALUE  "UPD_DATE,".
      *----------    更新ログインユーザ会社コード
           10  FILLER              PIC  X(17)
                                   VALUE  "UPD_LOGIN_CMP_CD,".
      *----------    更新ユーザＩＤ
           10  FILLER              PIC  X(08)  VALUE  "UPD_SID,".
      *----------    更新プログラムＩＤ
           10  FILLER              PIC  X(09)  VALUE  "UPD_PGMID".
           10  FILLER              PIC  X(10)  VALUE  ") VALUES (".
      *----------    対象種別
           10  FILLER              PIC  X(04)  VALUE  "'4',".
      *----------    ファンドコード
           10  FILLER              PIC  X(11)  VALUE  ":P_FUND_CD,".
      *----------    ポートフォリオコード
           10  FILLER              PIC  X(10)  VALUE  ":P_PTF_CD,".
      *----------    評価系列コード
           10  FILLER              PIC  X(15)  VALUE  ":P_HYK_KRTU_CD,".
      *----------    証券種別コード
           10  FILLER              PIC  X(14)  VALUE  ":P_SEC_SBT_CD,".
      *----------    変換前証券種別コード
           10  FILLER              PIC  X(18)
                                   VALUE  ":P_HKZ_SEC_SBT_CD,".
      *----------    銘柄コード
           10  FILLER              PIC  X(10)  VALUE  ":P_MEG_CD,".
      *----------    更新日時ＦＲＯＭ
           10  FILLER              PIC  X(45)
               VALUE  "TO_DATE(:P_UPD_DATE_FROM,'YYYYMMDDHH24MISS'),".
      *----------    更新日時ＴＯ
           10  FILLER              PIC  X(43)
               VALUE  "TO_DATE(:P_UPD_DATE_TO,'YYYYMMDDHH24MISS'),".
      *----------    更新フラグ
           10  FILLER              PIC  X(04)  VALUE  "' ',".
      *----------    選択フラグ
           10  FILLER              PIC  X(04)  VALUE  "'1',".
      *----------    計算期間ＦＲＯＭ
           10  FILLER              PIC  X(17)
                                   VALUE  ":P_CALC_KKN_FROM,".
      *----------    計算期間ＴＯ
           10  FILLER              PIC  X(15)  VALUE  ":P_CALC_KKN_TO,".
      *----------    取引対象フラグ
           10  FILLER              PIC  X(04)  VALUE  "'1',".
      *----------    配当対象フラグ
           10  FILLER              PIC  X(04)  VALUE  "'0',".
      *----------    ＧＸ取引接続対象フラグ
           10  FILLER              PIC  X(22)
                                   VALUE  ":P_GX_TORI_TAISYO_FLG,".
      *----------    日次関連対象フラグ
           10  FILLER              PIC  X(21)
                                   VALUE  ":P_NITIJI_TAISYO_FLG,".
      *----------    更新日時
           10  FILLER              PIC  X(08)  VALUE  "SYSDATE,".
      *----------    更新ログインユーザ会社コード
           10  FILLER              PIC  X(20)
                                   VALUE  ":P_UPD_LOGIN_CMP_CD,".
      *----------    更新ユーザＩＤ
           10  FILLER              PIC  X(11)  VALUE  ":P_UPD_SID,".
      *----------    更新プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE  "'SMZCGP01')".
         05  SQL-UPDATE.
           10  FILLER              PIC  X(07)  VALUE  "UPDATE ".
           10  SQL-TBL-ID          PIC  X(13).
           10  FILLER              PIC  X(05)  VALUE  " SET ".
      *----------    計算期間ＦＲＯＭ
           10  FILLER              PIC  X(33)
               VALUE  "CALC_KKN_FROM = :P_CALC_KKN_FROM,".
      *----------    更新日時ＦＲＯＭ
           10  FILLER              PIC  X(15)  VALUE  "UPD_DATE_FROM =".
           10  FILLER              PIC  X(46)
               VALUE  " TO_DATE(:P_UPD_DATE_FROM,'YYYYMMDDHH24MISS'),".
      *----------    更新日時ＴＯ
           10  FILLER              PIC  X(13)  VALUE  "UPD_DATE_TO =".
      *----------    更新日時ＴＯ
           10  FILLER              PIC  X(44)
               VALUE  " TO_DATE(:P_UPD_DATE_TO,'YYYYMMDDHH24MISS'),".
      *----------    取引対象フラグ
           10  FILLER              PIC  X(22)
               VALUE  "TORI_TAISYO_FLG = '1',".
      *----------    更新日時
           10  FILLER              PIC  X(19)
               VALUE  "UPD_DATE = SYSDATE,".
      *----------    更新ログインユーザ会社コード
           10  FILLER              PIC  X(39)
               VALUE  "UPD_LOGIN_CMP_CD = :P_UPD_LOGIN_CMP_CD,".
      *----------    更新ユーザＩＤ
           10  FILLER              PIC  X(21)
               VALUE  "UPD_SID = :P_UPD_SID,".
      *----------    更新プログラムＩＤ
           10  FILLER              PIC  X(22)
               VALUE  "UPD_PGMID = 'SMZCGP01'".
      *----------    ファンドコード＝WK-SQL-ファンドコード
           10  FILLER              PIC  X(28)  VALUE
                 " WHERE FUND_CD = :P_FUND_CD ".
      *----------    ポートフォリオコード＝WK-SQL-ポートフォリオコード
           10  FILLER              PIC  X(23)  VALUE
                 "AND PTF_CD = :P_PTF_CD ".
      *----------    評価系列コード ＝ WK-SQL-評価系列コード
           10  FILLER              PIC  X(33)  VALUE
                 "AND HYK_KRTU_CD = :P_HYK_KRTU_CD ".
      *----------    証券種別コード ＝ WK-変換後証券種別コード
           10  FILLER              PIC  X(31)  VALUE
                 "AND SEC_SBT_CD = :P_SEC_SBT_CD ".
      *----------    銘柄コード ＝ WK-SQL-銘柄コード
           10  FILLER              PIC  X(23)  VALUE
                 "AND MEG_CD = :P_MEG_CD ".
      *----------    銘柄コード ＝ WK-SQL-銘柄コード
           10  FILLER              PIC  X(37)  VALUE
                 "AND CALC_KKN_FROM > :P_CALC_KKN_FROM1".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      *---------- テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *---------- ポートフォリオ属性取得ルーチン
       01  PARM-SCZY4007-INOUT.
           COPY  "SCZY4007.cpy".
      *---------- 内部⇒外部銘柄コード変換ルーチン
       01  PARM-SCZY3002-INOUT.
           COPY  "SCZY3002.cpy".
      *---------- バッチメッセージＩＮＳルーチン
       01  PARM-SCZY7080-INOUT.
           COPY  "SCZY7080.cpy".
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZCGP01-INOUT.
           COPY  "SMZCGP01.cpy".
       01  PARM-SMZCGP01-RTNPKG.
         05  PARM-SMZCGP01-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZCGP01-INOUT
                  PARM-SMZCGP01-RTNPKG.
      ******************************************************************
      *                 取引差分更新処理再読込処理ルーチン
      ******************************************************************
       BASE-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  SMZCGP01  START  ****"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  SMZCGP01  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *    3.1  前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  前処理  START  ****"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 パラメータチェック処理
           PERFORM  INPUT-CHECK-RTN
      *----------  3.1.3 テーブルID取得処理
           PERFORM  TBL-ID-INIT-RTN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  前処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     FLAG-AREA
                          WORK-AREA
                          SQL-TBL
                          HOST-AREA
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-SCZY1160-INOUT
                          PARM-SCZY4007-INOUT
                          PARM-SCZY3002-INOUT
                          PARM-SCZY7080-INOUT
                          PARM-RTNPKG
           MOVE  CNS-RTN-000
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLAG-AREA        = ["FLAG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":WORK-AREA        = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-TBL          = ["SQL-TBL  "]"
      D    DISPLAY  CNS-PGM-ID":HOST-AREA        = ["HOST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN = ["PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG= ["
      D                                          PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT  = ["
      D                                           PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4007-INOUT = ["
      D                                           PARM-SCZY4007-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY3002-INOUT= ["
      D                                           PARM-SCZY3002-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7080-INOUT  = ["
      D                                           PARM-SCZY7080-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG           = ["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           MOVE  PARM-SMZCGP01-ARG1     OF  PARM-SMZCGP01-INOUT
             TO  WK-DATA-IN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 起動ログインユーザ会社コード   "
      D                       "=[" KIDOU-RIYO-CMP-CD  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID": 利用会社コード   "
      D                       "=[" RIYO-CMP-CD        OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID": 処理実行日   "
      D                       "=[" SYORI-YMD          OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID": 起動ID   "
      D                       "=[" KIDOU-ID           OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID": 業務タスクID   "
      D                       "=[" GYOMU-TASK-ID      OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID": 起動ユーザID   "
      D                       "=[" KIDOU-USER-ID      OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID": 残高基準日FROM   "
      D                       "=[" ZN-KJN-YMD-FROM    OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID": 残高基準日TO   "
      D                       "=[" ZN-KJN-YMD-TO      OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *        3.1.2 パラメータチェック処理
      ******************************************************************
       INPUT-CHECK-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  パラメータチェック処理 START  ***"
      *-----------------------------------------------------------------
           IF  KIDOU-RIYO-CMP-CD  OF  WK-DATA-IN = SPACE
            OR RIYO-CMP-CD        OF  WK-DATA-IN = SPACE
            OR SYORI-YMD          OF  WK-DATA-IN = ZERO
            OR KIDOU-ID           OF  WK-DATA-IN = SPACE
            OR GYOMU-TASK-ID      OF  WK-DATA-IN = SPACE
            OR KIDOU-USER-ID      OF  WK-DATA-IN = SPACE
            OR ZN-KJN-YMD-TO      OF  WK-DATA-IN = ZERO
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":パラメータチェック 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  パラメータチェック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INPUT-CHECK-EXT.
           EXIT.
      ******************************************************************
      *        3.1.3 テーブルID取得処理
      ******************************************************************
       TBL-ID-INIT-RTN        SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-RTNPKG
                       PARM-SCZY1160-INOUT
      *---------- 利用会社コード
           MOVE  RIYO-CMP-CD            OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
           MOVE  CNS-TKMZSK00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
           MOVE  CNS-TKDYGP12
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
           MOVE  CNS-TKDYGP16
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID    =["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID    =["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID    =["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(3)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SCZY1160)=["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TKMZSK00-ID
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TKDYGP12-ID
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TKDYGP16-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID1=["WK-TKMZSK00-ID"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID2=["WK-TKDYGP12-ID"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID3=["WK-TKDYGP16-ID"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブルID取得エラー"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.2  主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  主処理  START  ****"
      *-----------------------------------------------------------------
      *----------- 3.2.1 カーソル1定義処理
           PERFORM  CUR1-DEC-RTN
      *----------- 3.2.2 カーソル1オープン処理
           PERFORM  CUR1-OPEN-RTN
      *----------- 3.2.3 カーソル1フェッチ処理
           PERFORM  CUR1-FET-RTN
             UNTIL  FLG-CUR1-FETCH = CNS-ON
      *----------- 3.2.4 カーソル1クローズ処理
           PERFORM  CUR1-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  主処理   END   ****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1 カーソル1定義処理
      ******************************************************************
       CUR1-DEC-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル1定義処理 START  ***"
      *-----------------------------------------------------------------
      *------  テーブルID
           MOVE  WK-TKDYGP12-ID
             TO  SQL-TBL-ID             OF  SQL-SELECT-1
           MOVE  WK-TKDYGP16-ID
             TO  SQL-TBL-ID1            OF  SQL-SELECT-1
           INITIALIZE  SQLSTMT
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1           TO  SQLSTMT
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"
      *-----------------------------------------------------------------
           EXEC  SQL  PREPARE  S1  FROM :SQLSTMT  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-003
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SQLSTMT
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CUR1  CURSOR  FOR S1 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル1定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CUR1-DEC-EXT.
           EXIT.
      ******************************************************************
      *   3.2.2 カーソル1オープン処理
      ******************************************************************
       CUR1-OPEN-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル1オープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN CUR1
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-CUR1-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CUR1-OPEN=[" FLG-CUR1-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-004
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SQLSTMT
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル1オープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CUR1-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3 カーソル1フェッチ処理
      ******************************************************************
       CUR1-FET-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル1フェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   HST-FUND-CD1
                                        HST-PTF-CD1
           EXEC  SQL
               FETCH
                    CUR1
               INTO :HST-FUND-CD1,
                    :HST-PTF-CD1
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               COMPUTE  WK-FETCH1-COUNT = WK-FETCH1-COUNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-FETCH1-COUNT=["WK-FETCH1-COUNT"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =[" HST-FUND-CD1 "]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =[" HST-PTF-CD1 "]"
      *-----------------------------------------------------------------
      *----------  3.2.3.1 ポートフォリオ属性取得処理
               PERFORM  SCZY4007-CALL-RTN
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON           TO    FLG-CUR1-FETCH
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FETCH終了フラグ=[" FLG-CUR1-FETCH "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-005
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               MOVE  SQLSTMT
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル1フェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CUR1-FET-EXT.
           EXIT.
      ******************************************************************
      *   3.2.4 カーソル1クローズ処理
      ******************************************************************
       CUR1-CLOSE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル1クローズ処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CUR1
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CUR1-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CUR1-OPEN=[" FLG-CUR1-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-006
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SQLSTMT
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル1クローズ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CUR1-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.1 ポートフォリオ属性取得処理
      ******************************************************************
       SCZY4007-CALL-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ポートフォリオ属性取得処理"
      D                       "  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SCZY4007-INOUT
                        PARM-RTNPKG
      *----------  【SCZY4007】パラメータの設定
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD            OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY4007-ARG1
      *----------  ファンドコード
           MOVE  HST-FUND-CD1
             TO  FUND-CD                OF  PARM-SCZY4007-ARG1
      *----------  ポートフォリオコード
           MOVE  HST-PTF-CD1
             TO  PTF-CD                 OF  PARM-SCZY4007-ARG1
      *----------  基準日
           MOVE  ZN-KJN-YMD-TO          OF  WK-DATA-IN
             TO  TEKIYO-FROM            OF  PARM-SCZY4007-ARG1
      *-----------------------------------------------------------------
      D    DISPLAY  "利用会社コード=["
      D              RIYO-CMP-CD  OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  "ファンドコード=["
      D              FUND-CD  OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  "ポートフォリオコード=["
      D              PTF-CD  OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  "基準日=["TEKIYO-FROM OF PARM-SCZY4007-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY4007"            USING  PARM-SCZY4007-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4007)=["
      D             RTN-CD              OF  PARM-RTNPKG(
      D                         COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-RTNPKG=["
      D             COUNTER             OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4007 正常"
      D    DISPLAY  CNS-PGM-ID":【SCZY4007】の戻り値."
      D             "仕訳計算パターンコードの一つ桁目=["
      D             SWK-KJN-PTN-CD OF  PARM-SCZY4007-ARG2(1:1)"]"
      *-----------------------------------------------------------------
      *----------  3.2.3.1.1 取引差分更新管理テーブルから対象データ取得処理
               PERFORM  TKMZSK00-GET-RTN
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
               MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-007
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               MOVE  SPACE
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ポートフォリオ属性取得処理"
      D                        "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4007-CALL-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.1.1 取引差分更新管理テーブルから対象データ取得処理
      ******************************************************************
       TKMZSK00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  取引差分更新管理テーブルから"
      D                         "対象データ取得処理  START  ****"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF          TO  FLG-CUR2-FETCH
      *----------- 3.2.3.1.1.1 カーソル2定義処理
           PERFORM  CUR2-DEC-RTN
      *----------- 3.2.3.1.1.2 カーソル2オープン処理
           PERFORM  CUR2-OPEN-RTN
      *----------- 3.2.3.1.1.3 カーソル2フェッチ処理
           PERFORM  CUR2-FET-RTN
             UNTIL  FLG-CUR2-FETCH = CNS-ON
      *----------- 3.2.3.1.1.4 カーソル2クローズ処理
           PERFORM  CUR2-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  取引差分更新管理テーブルから"
      D                         "対象データ取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSK00-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.1.1.1 カーソル2定義処理
      ******************************************************************
       CUR2-DEC-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2定義処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   SQL-SELECT-2
                        SQLSTMT1
                        WK-SQLSTMT1
      *------  テーブルID
           MOVE  WK-TKMZSK00-ID
             TO  SQL-TBL-ID1            OF  SQL-SELECT-2-4
                                        OF  SQL-SELECT-2
           MOVE  WK-TKDYGP12-ID
             TO  SQL-TBL-ID2            OF  SQL-SELECT-2-4
                                        OF  SQL-SELECT-2
           MOVE  WK-TKDYGP16-ID
             TO  SQL-TBL-ID3            OF  SQL-SELECT-2-4
                                        OF  SQL-SELECT-2
           IF  SWK-KJN-PTN-CD OF  PARM-SCZY4007-ARG2(1:1) = CNS-T
           THEN
             IF  ZN-KJN-YMD-FROM OF PARM-SMZCGP01-ARG1 = ZERO
             THEN
               STRING  SQL-SELECT-2-1  OF  SQL-SELECT-2
                       SQL-SELECT-2-2  OF  SQL-SELECT-2
                       SQL-SELECT-2-4  OF  SQL-SELECT-2
                       SQL-SELECT-2-6  OF  SQL-SELECT-2
                       SQL-SELECT-2-9  OF  SQL-SELECT-2
                       DELIMITED BY SIZE
                       INTO  SQLSTMT1
             ELSE
               STRING  SQL-SELECT-2-1  OF  SQL-SELECT-2
                       SQL-SELECT-2-10 OF  SQL-SELECT-2
                       SQL-SELECT-2-4  OF  SQL-SELECT-2
                       SQL-SELECT-2-6  OF  SQL-SELECT-2
                       SQL-SELECT-2-9  OF  SQL-SELECT-2
                       DELIMITED BY SIZE
                       INTO  SQLSTMT1
             END-IF
           ELSE
             IF  ZN-KJN-YMD-FROM OF PARM-SMZCGP01-ARG1 = ZERO
             THEN
               STRING  SQL-SELECT-2-1  OF  SQL-SELECT-2
                       SQL-SELECT-2-3  OF  SQL-SELECT-2
                       SQL-SELECT-2-4  OF  SQL-SELECT-2
                       SQL-SELECT-2-8  OF  SQL-SELECT-2
                       SQL-SELECT-2-9  OF  SQL-SELECT-2
                       DELIMITED BY SIZE
                       INTO  SQLSTMT1
             ELSE
               STRING  SQL-SELECT-2-1  OF  SQL-SELECT-2
                       SQL-SELECT-2-10 OF  SQL-SELECT-2
                       SQL-SELECT-2-4  OF  SQL-SELECT-2
                       SQL-SELECT-2-8  OF  SQL-SELECT-2
                       SQL-SELECT-2-9  OF  SQL-SELECT-2
                       DELIMITED BY SIZE
                       INTO  SQLSTMT1
             END-IF
           END-IF
           MOVE  ZN-KJN-YMD-FROM        OF  PARM-SMZCGP01-ARG1
             TO  HST-ZN-KJN-YMD-FROM
           MOVE  ZN-KJN-YMD-TO          OF  PARM-SMZCGP01-ARG1
             TO  HST-ZN-KJN-YMD-TO
      *----ＳＱＬ文
           IF  ZN-KJN-YMD-FROM OF PARM-SMZCGP01-ARG1 = ZERO
           THEN
             STRING SQLSTMT1(1:FUNCTION  LENGTH(SQLSTMT1))
                  "[:P_FUND_CD1="
                  HST-FUND-CD1
                  "][:P_PTF_CD1="
                  HST-PTF-CD1
                  "][:P_ZN_KJN_YMD_TO="
                  HST-ZN-KJN-YMD-TO
                  "]"
                   DELIMITED BY SIZE
                   INTO  WK-SQLSTMT1
             END-STRING
           ELSE
             STRING SQLSTMT1(1:FUNCTION  LENGTH(SQLSTMT1))
                  "[:P_ZN_KJN_YMD_FROM1="
                  HST-ZN-KJN-YMD-FROM
                  "][:P_FUND_CD1="
                  HST-FUND-CD1
                  "][:P_PTF_CD1="
                  HST-PTF-CD1
                  "][:P_ZN_KJN_YMD_TO="
                  HST-ZN-KJN-YMD-TO
                  "]"
                   DELIMITED BY SIZE
                   INTO  WK-SQLSTMT1
             END-STRING
           END-IF
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"
      D    DISPLAY  CNS-PGM-ID":WK-SQLSTMT1=["WK-SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC  SQL  PREPARE  S2  FROM :SQLSTMT1  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE2=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE2)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-008
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  WK-SQLSTMT1
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CUR2  CURSOR  FOR S2 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE2=["SQLCODE"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CUR2-DEC-EXT.
           EXIT.
      ******************************************************************
      *   3.2.3.1.1.2 カーソル1オープン処理
      ******************************************************************
       CUR2-OPEN-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2オープン処理 START  ***"
      *-----------------------------------------------------------------
           IF  ZN-KJN-YMD-FROM OF PARM-SMZCGP01-ARG1 = ZERO
           THEN
             EXEC  SQL
                 OPEN CUR2
                   USING :HST-FUND-CD1,
                         :HST-PTF-CD1,
                         :HST-ZN-KJN-YMD-TO
             END-EXEC
           ELSE
             EXEC  SQL
                 OPEN CUR2
                   USING :HST-ZN-KJN-YMD-FROM,
                         :HST-FUND-CD1,
                         :HST-PTF-CD1,
                         :HST-ZN-KJN-YMD-TO
             END-EXEC
           END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN2=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-CUR2-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CUR2-OPEN=[" FLG-CUR2-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN2)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-009
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  WK-SQLSTMT1
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2オープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CUR2-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.1.1.3 カーソル2フェッチ処理
      ******************************************************************
       CUR2-FET-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2フェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   HST-HYK-KRTU-CD          OF  HST-TKDYGP12
                        HST-ZHKZ-SEC-SBT-CD      OF  HST-TKDYGP12
                        HST-MEG-CD               OF  HST-TKDYGP12
                        HST-GX-TORI-TAISYO-FLG   OF  HST-TKDYGP12
                        HST-NITIJI-TAISYO-FLG    OF  HST-TKDYGP12
                        HST-UPD-DATE-FROM        OF  HST-TKDYGP12
                        HST-UPD-DATE-TO          OF  HST-TKDYGP12
                        HST-CALC-KKN-FROM        OF  HST-TKDYGP12
                        HST-SEC-SBT-CD           OF  HST-TKDYGP12
           EXEC  SQL
               FETCH
                    CUR2
               INTO :HST-TKDYGP12.HST-HYK-KRTU-CD,
                    :HST-TKDYGP12.HST-ZHKZ-SEC-SBT-CD,
                    :HST-TKDYGP12.HST-MEG-CD,
                    :HST-TKDYGP12.HST-GX-TORI-TAISYO-FLG,
                    :HST-TKDYGP12.HST-NITIJI-TAISYO-FLG,
                    :HST-TKDYGP12.HST-UPD-DATE-FROM,
                    :HST-TKDYGP12.HST-UPD-DATE-TO,
                    :HST-TKDYGP12.HST-CALC-KKN-FROM
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH2=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               COMPUTE  WK-FETCH2-COUNT = WK-FETCH2-COUNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-FETCH2-COUNT=["WK-FETCH2-COUNT"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード  =["
      D                               HST-HYK-KRTU-CD OF HST-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":変換前証券種別コード  =["
      D                           HST-ZHKZ-SEC-SBT-CD OF HST-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード  =["
      D                                    HST-MEG-CD OF HST-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":ＧＸ取引接続対象フラグ  =["
      D                        HST-GX-TORI-TAISYO-FLG OF HST-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":日次関連対象フラグ  =["
      D                         HST-NITIJI-TAISYO-FLG OF HST-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":更新日時ＦＲＯＭ  =["
      D                             HST-UPD-DATE-FROM OF HST-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":更新日時ＴＯ  =["
      D                               HST-UPD-DATE-TO OF HST-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":計算期間ＦＲＯＭ  =["
      D                             HST-CALC-KKN-FROM OF HST-TKDYGP12"]"
      *-----------------------------------------------------------------
               MOVE  HST-ZHKZ-SEC-SBT-CD  OF  HST-TKDYGP12
                 TO  HST-SEC-SBT-CD       OF  HST-TKDYGP12
               IF  HST-ZHKZ-SEC-SBT-CD    OF  HST-TKDYGP12 = CNS-MA99
               THEN
      *----------  3.2.3.1.1.3.1 外部銘柄コード変換
                 PERFORM  SCZY3002-CALL-RTN
               ELSE
                 CONTINUE
               END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券種別コード  =["
      D                                HST-SEC-SBT-CD OF HST-TKDYGP12"]"
      *-----------------------------------------------------------------
      *----------  3.2.3.1.1.3.2 再処理要ポートフォリオ一覧（取引）登録処理
               PERFORM  TKDYGP12-INSERT-RTN
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-CUR2-FETCH
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FETCH終了フラグ=[" FLG-CUR1-FETCH "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH2)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-010
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               MOVE  WK-SQLSTMT1
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2フェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CUR2-FET-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.1.1.4 カーソル2クローズ処理
      ******************************************************************
       CUR2-CLOSE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2クローズ処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CUR2
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE2=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CUR2-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CUR2-OPEN=[" FLG-CUR2-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE2)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-011
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  WK-SQLSTMT1
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2クローズ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CUR2-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *     3.2.3.1.1.3.1 外部銘柄コード変換
      ******************************************************************
       SCZY3002-CALL-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "***  外部銘柄コード変換 START  ***"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         PARM-RTNPKG
                              PARM-SCZY3002-INOUT
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SMZCGP01-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  内部銘柄コード
           MOVE  HST-MEG-CD           OF  HST-TKDYGP12
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  基準日
           MOVE  ZN-KJN-YMD-TO        OF  PARM-SMZCGP01-ARG1
                                      TO  KJN-YMD
                                      OF  PARM-SCZY3002-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード         =["
      D        RIYO-CMP-CD            OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID ":内部銘柄コード         =["
      D        NAIBU-MEG-CD           OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID ":商品分類コード         =["
      D        SYOHIN-BUNRUI-CD       OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード         =["
      D        SEC-SBT-CD             OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID ":元証券種別コード         =["
      D        MOTO-SEC-SBT-CD        OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID ":銘柄通貨コード         =["
      D        MEG-TUKA-CD            OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID ":コードリファレンス系列コード=["
      D        CD-REF-KRTU-CD         OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID ":業務タスクID         =["
      D        GYOMU-TASK-ID          OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID ":基準日         =["
      D        KJN-YMD                OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3002  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY3002"       USING   PARM-SCZY3002-INOUT
                                          PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  PARM-RTNPKG
      D             ") OF SCZY3002=[" RTN-CD
      D                               OF  PARM-RTNPKG
      D              ( COUNTER        OF  PARM-RTNPKG )              "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3002  END  ***"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG )
      *----------  正常の場合
             WHEN  CNS-RTN-000
               MOVE  SEC-SBT-CD       OF  PARM-SCZY3002-ARG2
                 TO  HST-SEC-SBT-CD   OF  HST-TKDYGP12
             WHEN  CNS-RTN-002
               CONTINUE
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID       TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-012      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO             TO  DETAIL-RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE            TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "***  外部銘柄コード変換 END  ***".
      *-----------------------------------------------------------------
       SCZY3002-CALL-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.1.1.3.2 再処理要ポートフォリオ一覧（取引）登録処理
      ******************************************************************
       TKDYGP12-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****   再処理要ポートフォリオ一覧"
      D             "（取引）登録処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE   SQL-INSERT
                        SQLSTMT2
                        WK-SQLSTMT2
           MOVE  HST-FUND-CD1
             TO  HST-FUND-CD          OF  HST-TKDYGP12
           MOVE  HST-PTF-CD1
             TO  HST-PTF-CD           OF  HST-TKDYGP12
           MOVE  ZN-KJN-YMD-TO        OF  PARM-SMZCGP01-ARG1
             TO  HST-CALC-KKN-TO      OF  HST-TKDYGP12
           MOVE  KIDOU-RIYO-CMP-CD    OF  PARM-SMZCGP01-ARG1
             TO  HST-UPD-LOGIN-CMP-CD OF  HST-TKDYGP12
           MOVE  KIDOU-USER-ID        OF  PARM-SMZCGP01-ARG1
             TO  HST-UPD-SID          OF  HST-TKDYGP12
           MOVE  WK-TKDYGP12-ID
             TO  SQL-TBL-ID           OF  SQL-INSERT
           MOVE  SQL-INSERT           TO  SQLSTMT2
           STRING SQLSTMT2(1:FUNCTION  LENGTH(SQLSTMT2))
                 "[:P_FUND_CD="
                 HST-FUND-CD OF HST-TKDYGP12
                 "][:P_PTF_CD="
                 HST-PTF-CD OF HST-TKDYGP12
                 "][:P_HYK_KRTU_CD="
                 HST-HYK-KRTU-CD OF HST-TKDYGP12
                 "][:P_SEC_SBT_CD="
                 HST-SEC-SBT-CD OF HST-TKDYGP12
                 "][:P_ZHKZ_SEC_SBT_CD="
                 HST-ZHKZ-SEC-SBT-CD OF HST-TKDYGP12
                 "][:P_MEG_CD="
                 HST-MEG-CD OF HST-TKDYGP12
                 "][:P_UPD_DATE_FROM="
                 HST-UPD-DATE-FROM OF HST-TKDYGP12
                 "][:P_UPD_DATE_TO="
                 HST-UPD-DATE-TO OF HST-TKDYGP12
                 "][:P_CALC_KKN_FROM="
                 HST-CALC-KKN-FROM OF HST-TKDYGP12
                 "][:P_CALC_KKN_TO="
                 HST-CALC-KKN-TO OF HST-TKDYGP12
                 "][:P_GX_TORI_TAISYO_FLG="
                 HST-GX-TORI-TAISYO-FLG OF HST-TKDYGP12
                 "][:P_NITIJI_TAISYO_FLG="
                 HST-NITIJI-TAISYO-FLG OF HST-TKDYGP12
                 "][:P_UPD_LOGIN_CMP_CD="
                 HST-UPD-LOGIN-CMP-CD OF HST-TKDYGP12
                 "][:P_UPD_SID="
                 HST-UPD-SID OF HST-TKDYGP12
                 "]"
                 DELIMITED BY SIZE
                 INTO  WK-SQLSTMT2
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":ファンドコード                  =["
      D            HST-FUND-CD                 OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード            =["
      D            HST-PTF-CD                  OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":評価系列コード                  =["
      D            HST-HYK-KRTU-CD             OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード                  =["
      D            HST-SEC-SBT-CD              OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":変換前証券種別コード            =["
      D            HST-ZHKZ-SEC-SBT-CD         OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード                      =["
      D            HST-MEG-CD                  OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":更新日時ＦＲＯＭ                =["
      D            HST-UPD-DATE-FROM           OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":更新日時ＴＯ                    =["
      D            HST-UPD-DATE-TO             OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":計算期間ＦＲＯＭ                =["
      D            HST-CALC-KKN-FROM           OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":計算期間ＴＯ                    =["
      D            HST-CALC-KKN-TO             OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":ＧＸ取引接続対象フラグ          =["
      D            HST-GX-TORI-TAISYO-FLG      OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":日次関連対象フラグ              =["
      D            HST-NITIJI-TAISYO-FLG       OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード    =["
      D            HST-UPD-LOGIN-CMP-CD        OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":更新ユーザＩＤ                  =["
      D            HST-UPD-SID                 OF  HST-TKDYGP12"]"
      D    DISPLAY CNS-PGM-ID":SQLSTMT2=["SQLSTMT2 "]"
      D    DISPLAY CNS-PGM-ID":WK-SQLSTMT2=["WK-SQLSTMT2 "]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S3 FROM :SQLSTMT2 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE3=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-013
               TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT2
               TO  FREE-MSG                  OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
             CONTINUE
           END-IF
           EXEC SQL
               EXECUTE S3
                 USING :HST-TKDYGP12.HST-FUND-CD,
                       :HST-TKDYGP12.HST-PTF-CD,
                       :HST-TKDYGP12.HST-HYK-KRTU-CD,
                       :HST-TKDYGP12.HST-SEC-SBT-CD,
                       :HST-TKDYGP12.HST-ZHKZ-SEC-SBT-CD,
                       :HST-TKDYGP12.HST-MEG-CD,
                       :HST-TKDYGP12.HST-UPD-DATE-FROM,
                       :HST-TKDYGP12.HST-UPD-DATE-TO,
                       :HST-TKDYGP12.HST-CALC-KKN-FROM,
                       :HST-TKDYGP12.HST-CALC-KKN-TO,
                       :HST-TKDYGP12.HST-GX-TORI-TAISYO-FLG,
                       :HST-TKDYGP12.HST-NITIJI-TAISYO-FLG,
                       :HST-TKDYGP12.HST-UPD-LOGIN-CMP-CD,
                       :HST-TKDYGP12.HST-UPD-SID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  バッチメッセージＩＮＳルーチンをコール
               PERFORM  SCZY7080-CALL-RTN
               PERFORM  DB-COMMIT-RTN
             WHEN  CNS-SQL-UNIQUE
      *----------  3.2.3.1.1.3.2.1 再処理要ポートフォリオ一覧（取引）更新処理
               PERFORM  TKDYGP12-UPDATE-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-014
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-SQLSTMT2
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****   再処理要ポートフォリオ一覧"
      D             "（取引）登録処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKDYGP12-INSERT-EXT.
           EXIT.
      ******************************************************************
      *    バッチメッセージＩＮＳルーチンをコール
      ******************************************************************
       SCZY7080-CALL-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "***  バッチメッセージＩＮＳルーチン"
      D                                               "  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7080-INOUT
                       PARM-RTNPKG
           MOVE  RIYO-CMP-CD            OF PARM-SMZCGP01-ARG1
             TO  RIYO-CMP-CD            OF PARM-SCZY7080-ARG1
           MOVE  SYORI-YMD              OF PARM-SMZCGP01-ARG1
             TO  SYORI-YMD              OF PARM-SCZY7080-ARG1
           MOVE  KIDOU-ID               OF PARM-SMZCGP01-ARG1
             TO  KIDOU-ID               OF PARM-SCZY7080-ARG1
           MOVE  GYOMU-TASK-ID          OF PARM-SMZCGP01-ARG1
             TO  GYOMU-TASK-ID          OF PARM-SCZY7080-ARG1
           MOVE  HST-FUND-CD            OF HST-TKDYGP12
             TO  FUND-CD                OF PARM-SCZY7080-ARG2(1)
           MOVE  HST-PTF-CD             OF HST-TKDYGP12
             TO  PTF-CD                 OF PARM-SCZY7080-ARG2(1)
           MOVE  HST-HYK-KRTU-CD        OF HST-TKDYGP12
             TO  HYK-KRTU-CD            OF PARM-SCZY7080-ARG2(1)
           MOVE  HST-CALC-KKN-FROM      OF HST-TKDYGP12
             TO  KJN-YMD-FROM           OF PARM-SCZY7080-ARG2(1)
           MOVE  ZN-KJN-YMD-TO          OF PARM-SMZCGP01-ARG1
             TO  KJN-YMD-TO             OF PARM-SCZY7080-ARG2(1)
           MOVE  CNS-W000456
             TO  MSG-ID                 OF PARM-SCZY7080-ARG2(1)
           MOVE  CNS-TK-MOJI
             TO  TIKAN-MOJI             OF PARM-SCZY7080-ARG2(1)
           STRING  "証券種別="
                    HST-SEC-SBT-CD OF HST-TKDYGP12
                    " 銘柄コード="
                    HST-MEG-CD OF HST-TKDYGP12
             DELIMITED BY SIZE
             INTO  FREE-MSG             OF PARM-SCZY7080-ARG2(1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-SCZY7080-ARG1:["
      D              RIYO-CMP-CD        OF PARM-SCZY7080-ARG1"]"
      D    DISPLAY  "SYORI-YMD          OF PARM-SCZY7080-ARG1:["
      D              SYORI-YMD          OF PARM-SCZY7080-ARG1"]"
      D    DISPLAY  "KIDOU-ID           OF PARM-SCZY7080-ARG1:["
      D              KIDOU-ID           OF PARM-SCZY7080-ARG1"]"
      D    DISPLAY  "GYOMU-TASK-ID      OF PARM-SCZY7080-ARG1:["
      D              GYOMU-TASK-ID      OF PARM-SCZY7080-ARG1"]"
      D    DISPLAY  "FUND-CD            OF PARM-SCZY7080-ARG2:["
      D              FUND-CD            OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "PTF-CD             OF PARM-SCZY7080-ARG2:["
      D              PTF-CD             OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "HYK-KRTU-CD        OF PARM-SCZY7080-ARG2:["
      D              HYK-KRTU-CD        OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "REP-ID             OF PARM-SCZY7080-ARG2:["
      D              REP-ID             OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "REP-ANY-CD         OF PARM-SCZY7080-ARG2:["
      D              REP-ANY-CD         OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "KJN-YMD-FROM       OF PARM-SCZY7080-ARG2:["
      D              KJN-YMD-FROM       OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "MSG-ID             OF PARM-SCZY7080-ARG2:["
      D              MSG-ID             OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "TIKAN-MOJI         OF PARM-SCZY7080-ARG2:["
      D              TIKAN-MOJI         OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY7080-ARG2:["
      D              FREE-MSG           OF PARM-SCZY7080-ARG2(1)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY7080"
           USING  PARM-SCZY7080-INOUT
                  PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD             OF PARM-SCZY7080-ARG3:["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
               = CNS-RTN-000
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-015
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD              OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  バッチメッセージＩＮＳルーチン  "
      D                                          "END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7080-CALL-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミット処理
      ******************************************************************
       DB-COMMIT-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミット処理  START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)=["SQLCODE"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 正常"
      *--------------------<DEBUG>--------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 システムエラー"
      *--------------------<DEBUG>--------------------------------------
      *----------  エラー処理
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-016
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-COMMIT-ERR
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       DB-COMMIT-EXT.
           EXIT.
      ******************************************************************
      *     3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージの設定
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理 START ***"
      *-----------------------------------------------------------------
           MOVE  CNS-RTN-000
             TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":RTN-CD    OF  PARM-SCZY1170-ARG1=["
      D                        RTN-CD    OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"             USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO     PARM-SMZCGP01-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":PARM-SCZY1170-RTNPKG=["
      D            PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":  COUNTER = ["
      D            COUNTER               OF PARM-SMZCGP01-ARG2"]"
      D    DISPLAY CNS-PGM-ID":  エラー検知プログラム名 = ["
      D            ERR-PGM-ID            OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  ポジション = ["
      D            ERR-POS               OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  リターンコード = ["
      D            RTN-CD                OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコード = ["
      D            DETAIL-RTN-CD         OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D            DETAIL-RTN-CD-FLG     OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  フリーメッセージ = ["
      D            FREE-MSG              OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":***リターンパッケージの処理   END  ***"
      D    DISPLAY  CNS-PGM-ID":***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *     エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CUR2-OPEN=["FLG-CUR2-OPEN"]"
      *-----------------------------------------------------------------
           IF FLG-CUR2-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CUR2
             END-EXEC
             MOVE  CNS-OFF               TO     FLG-CUR2-OPEN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CUR2-OPEN=["FLG-CUR2-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-CUR1-OPEN=["FLG-CUR1-OPEN"]"
      *-----------------------------------------------------------------
           IF FLG-CUR1-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CUR1
             END-EXEC
             MOVE  CNS-OFF               TO     FLG-CUR1-OPEN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CUR2-OPEN=["FLG-CUR1-OPEN"]"
      *-----------------------------------------------------------------
      *----------  リターンパッケージの設定
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理 START ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"             USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO     PARM-SMZCGP01-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":PARM-SCZY1170-RTNPKG=["
      D            PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":  COUNTER = ["
      D            COUNTER               OF PARM-SMZCGP01-ARG2"]"
      D    DISPLAY CNS-PGM-ID":  エラー検知プログラム名 = ["
      D            ERR-PGM-ID            OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  ポジション = ["
      D            ERR-POS               OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  リターンコード = ["
      D            RTN-CD                OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコード = ["
      D            DETAIL-RTN-CD         OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D            DETAIL-RTN-CD-FLG     OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      D    DISPLAY CNS-PGM-ID":  フリーメッセージ = ["
      D            FREE-MSG              OF PARM-SMZCGP01-ARG2(COUNTER
      D                                  OF PARM-SMZCGP01-ARG2)"]"
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理  END  ***"
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
      ******************************************************************
      *    3.2.3.1.1.3.2.1 再処理要ポートフォリオ一覧（取引）更新処理
      ******************************************************************
       TKDYGP12-UPDATE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****   再処理要ポートフォリオ一覧"
      D             "（取引）更新処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE   SQL-UPDATE
                        SQLSTMT3
                        WK-SQLSTMT3
           MOVE  WK-TKDYGP12-ID
             TO  SQL-TBL-ID           OF  SQL-UPDATE
           MOVE  SQL-UPDATE           TO  SQLSTMT3
           STRING SQLSTMT3(1:FUNCTION  LENGTH(SQLSTMT3))
                 "[:P_CALC_KKN_FROM="
                 HST-CALC-KKN-FROM OF HST-TKDYGP12
                 "][:P_UPD_DATE_FROM="
                 HST-UPD-DATE-FROM OF HST-TKDYGP12
                 "][:P_UPD_DATE_TO="
                 HST-UPD-DATE-TO OF HST-TKDYGP12
                 "][:P_UPD_LOGIN_CMP_CD="
                 HST-UPD-LOGIN-CMP-CD OF HST-TKDYGP12
                 "][:P_UPD_SID="
                 HST-UPD-SID OF HST-TKDYGP12
                 "][:P_FUND_CD="
                 HST-FUND-CD OF HST-TKDYGP12
                 "][:P_PTF_CD="
                 HST-PTF-CD OF HST-TKDYGP12
                 "][:P_HYK_KRTU_CD="
                 HST-HYK-KRTU-CD OF HST-TKDYGP12
                 "][:P_SEC_SBT_CD="
                 HST-SEC-SBT-CD OF HST-TKDYGP12
                 "][:P_MEG_CD="
                 HST-MEG-CD OF HST-TKDYGP12
                 "][:P_CALC_KKN_FROM1="
                 HST-CALC-KKN-FROM OF HST-TKDYGP12
                 "]"
                 DELIMITED BY SIZE
                 INTO  WK-SQLSTMT3
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLSTMT3=["SQLSTMT3 "]"
      D    DISPLAY CNS-PGM-ID":WK-SQLSTMT3=["WK-SQLSTMT3 "]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S4 FROM :SQLSTMT3 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE4=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-017
               TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT2
               TO  FREE-MSG                  OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
             CONTINUE
           END-IF
           EXEC SQL
               EXECUTE S4
                 USING :HST-TKDYGP12.HST-CALC-KKN-FROM,
                       :HST-TKDYGP12.HST-UPD-DATE-FROM,
                       :HST-TKDYGP12.HST-UPD-DATE-TO,
                       :HST-TKDYGP12.HST-UPD-LOGIN-CMP-CD,
                       :HST-TKDYGP12.HST-UPD-SID,
                       :HST-TKDYGP12.HST-FUND-CD,
                       :HST-TKDYGP12.HST-PTF-CD,
                       :HST-TKDYGP12.HST-HYK-KRTU-CD,
                       :HST-TKDYGP12.HST-SEC-SBT-CD,
                       :HST-TKDYGP12.HST-MEG-CD,
                       :HST-TKDYGP12.HST-CALC-KKN-FROM
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":UPDATE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  バッチメッセージＩＮＳルーチンをコール
               PERFORM  SCZY7080-CALL-RTN
               PERFORM  DB-COMMIT-RTN
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-018
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-SQLSTMT3
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****   再処理要ポートフォリオ一覧"
      D             "（取引）登録処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKDYGP12-UPDATE-EXT.
           EXIT.
