      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ2120
      * プログラム名称 : 債券過去経過利息計算
      * 処理概要       : 利払日の債券過去経過利息データを作成して、
      *                  入金取引の債券過去経過利息データを作成して、
      *                  基準日の債券過去経過利息を計算する。
      * 参照ＤＢ       : 残高異動計算データテーブル（TKMZBW06）
      *                : 取引テーブル（TKMXTR00）
      *                : 対象取引情報テーブル（TKMZBW04）
      *                : 債券過去経過利息テーブル（TKMZBW06）
      *                : 債券過去経過利息計算データテーブル（TKMZBW09）
      * 更新ＤＢ       : 債券過去経過利息計算データテーブル（TKMZBW09）
      * 引数           : IN  銘柄別断面情報
      *                : IN  基準日断面情報
      *                : IN  通貨デフォールト端数処理
      *                : IN  銘柄属性データ
      *                : IN  開始時残高数量残高（利付）
      *                : IN  市場通貨コード
      *                : IN  管理数量単位
      *                : IN  料率パターンコード
      *                : OUT 基準日の経過利息データ
      *                : OUT RTNパッケージ
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- ----  ---------  ------  ------------------------
      * 20080227   新規  SCS        于 瓊   新規作成
      * 20080718   修正  SCS        于 瓊   修正
      * 20080819   修正  SCS        于 瓊   残タスク69
      * 20081222   修正  SCS        張凌翔  連結障害892対応
      * 20081226   修正  SCS        周運棟  0000996対応
      * 20090108   修正  SCS        顧建鋒  0001056対応
      * 20090206   修正  SCS        王粒    残タスク91対応
      * 20090316   修正  SCS        顧建鋒  残タスク202対応
      * 20090526   修正  SCS        顧建鋒  ①総合障害453対応
      * 20090623   修正  SCS        顧建鋒  総合障害927
      * 20090625   修正  SCS        顧建鋒  総合障害688
      * 20090625   修正  SCS        顧建鋒  総合障害1162
      * 20090709   修正  SCS        顧建鋒  総合障害1408
      * 20090714   修正  SCS        顧建鋒  総合障害836対応
      * 20090720   修正  SCS        顧建鋒  総合障害1498対応
      * 20090721   修正  SCS        何傑文  総合障害1515対応
      * 20090722   修正  SCS        顧建鋒  総合1698
      * 20090805   修正  SCS        王飛    総合障害1552対応
      * 20090817   修正  SCS        何傑文  総合障害1425対応
      * 20090817   修正  SCS        何傑文  総合障害1516対応
      * 20090820   修正  SCS        王飛    総合障害1871
      * 20090901   修正  SCS        楊超    テーマ981
      * 20090901   修正  SCS        楊超    総合障害2329
      * 20090910   修正  SCS        楊超    総合障害1870
      * 20090924   修正  SCS        王飛    総合障害2533-2
      * 20091010   修正  SCS        何傑文  総合障害2882対応
      * 20091012   修正  SCS        王飛    総合障害1967対応
      * 20091021   修正  SCS        王飛    総合障害3114
      * 20091028   修正  SCS        顧建鋒  テーマ1840
      * 20091029   修正  SCS        顧建鋒  テーマ1926
      * 20091214   修正  SCS        顧建鋒  テーマ2237
      * 20091228   修正  SCS        顧建鋒  本番障害
      * 20100119   修正  SCS        何傑文  テーマ2464
      * 20100125   修正  SCS        何傑文  テーマ2509
      * 20100125   修正  SCS        何傑文  総合障害3975
      * 20100129   修正  SCS        楊 超   テーマ2509
      * 20110118   修正  SCS        楊 超   テーマ3169
      * @SEINO@@   修正  BTH        山崎    性能改善対応
      * 20110419   修正  SCS        兪志杰  性能改善対応
      * 20130715   修正  SCS        沈敏敏  テーマ3530
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ2120.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-02-27.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ2120".
      *----------  債券過去経過利息テーブル
         05  CNS-TBL-TKMZKR00      PIC  X(08)  VALUE  "TKMZKR00".
      *----------  取引テーブル
         05  CNS-TBL-TKMXTR00      PIC  X(08)  VALUE  "TKMXTR00".
      *----------  対象取引情報テーブル
         05  CNS-TBL-TKMZBW04      PIC  X(08)  VALUE  "TKMZBW04".
      *----------  残高異動計算データテーブル
         05  CNS-TBL-TKMZBW06      PIC  X(08)  VALUE  "TKMZBW06".
      *----------  債券過去経過利息計算データテーブル
         05  CNS-TBL-TKMZBW09      PIC  X(08)  VALUE  "TKMZBW09".
      *----------  残高異動テーブル
         05  CNS-TBL-TKMZZI00      PIC  X(08)  VALUE  "TKMZZI00".
      *----------  残高履歴テーブル
         05  CNS-TBL-TKMZZR00      PIC  X(08)  VALUE  "TKMZZR00".
      *----------  次回利払日種類
         05  CNS-JIKAI-RBY-SYRU-1  PIC  X(01)  VALUE  "1".
         05  CNS-JIKAI-RBY-SYRU-2  PIC  X(01)  VALUE  "2".
         05  CNS-JIKAI-RBY-SYRU-3  PIC  X(01)  VALUE  "3".
         05  CNS-JIKAI-RBY-SYRU-4  PIC  X(01)  VALUE  "4".
         05  CNS-JIKAI-RBY-SYRU-5  PIC  X(01)  VALUE  "5".
         05  CNS-JIKAI-RBY-SYRU-6  PIC  X(01)  VALUE  "6".
         05  CNS-JIKAI-RBY-SYRU-7  PIC  X(01)  VALUE  "7".
      *----------  計算方法
         05  CNS-CALC-HOHO-1       PIC  X(01)  VALUE  "1".
         05  CNS-CALC-HOHO-2       PIC  X(01)  VALUE  "2".
         05  CNS-CALC-HOHO-3       PIC  X(01)  VALUE  "3".
         05  CNS-CALC-HOHO-4       PIC  X(01)  VALUE  "4".
      *----------  証券種別コード
         05  CNS-SEC-SBT-CD-B      PIC  X(01)  VALUE  "B".
      *----------  前々回利払日計算フラグ
         05  CNS-ZZEN-RBY-FLG-0    PIC  X(01)  VALUE  "0".
         05  CNS-ZZEN-RBY-FLG-1    PIC  X(01)  VALUE  "1".
      *----------  自計算フラグ
         05  CNS-JI-KEISAN-FLG-0   PIC  X(01)  VALUE  "0".
         05  CNS-JI-KEISAN-FLG-1   PIC  X(01)  VALUE  "1".
      *----------  ループフラグ
         05  CNS-LOOP-ON           PIC  X(01)  VALUE  "1".
         05  CNS-LOOP-OFF          PIC  X(01)  VALUE  "0".
      *----------  計算区分
         05  CNS-CALC-KBN-2        PIC  X(01)  VALUE  "2".
         05  CNS-CALC-KBN-3        PIC  X(01)  VALUE  "3".
      *----------  市場通貨／運用通貨区分
         05  CNS-SJ-UY-TUKA-KBN-1  PIC  X(01)  VALUE  "1".
      *----------  計算項目
         05  CNS-CALC-KOUMO-00     PIC  X(02)  VALUE  "00".
      *---------- 計算ベース区分
         05  CNS-IXCAL-COMP-BASE-1
                                   PIC  X(01)  VALUE  "1".
         05  CNS-IXCAL-COMP-BASE-2
                                   PIC  X(01)  VALUE  "2".
      *----------  日数
         05  CNS-IXCAL-COMP-DAYS-1
                                   PIC  9(01)  VALUE  1.
      *----------  単位区分
         05  CNS-IXCAL-TANI-KBN-1  PIC  X(01)  VALUE  "1".
         05  CNS-IXCAL-TANI-KBN-2  PIC  X(01)  VALUE  "2".
      *----------  機能区分
         05  CNS-IXCAL-FUNCTION-3  PIC  X(01)  VALUE  "3".
         05  CNS-IXCAL-FUNCTION-4  PIC  X(01)  VALUE  "4".
      *----------  前後区分1
         05  CNS-IXCAL-ZENGO-KBN-1-1
                                   PIC  X(01)  VALUE  "1".
         05  CNS-IXCAL-ZENGO-KBN-1-2
                                   PIC  X(01)  VALUE  "2".
      *----------  前回利払日種類
         05  CNS-ZENKAI-RB-YMD-SYURUI-3
                                   PIC  X(01)  VALUE  "3".
         05  CNS-ZENKAI-RB-YMD-SYURUI-4
                                   PIC  X(01)  VALUE  "4".
      *----------  次回利払日種類
         05  CNS-JIKAI-RB-YMD-SYURUI-3
                                   PIC  X(01)  VALUE  "3".
         05  CNS-JIKAI-RB-YMD-SYURUI-6
                                   PIC  X(01)  VALUE  "6".
      *----------  業務データフラグ
         05  CNS-GYOMU-DATA-FLG-0  PIC  X(01)  VALUE  "0".
         05  CNS-GYOMU-DATA-FLG-1  PIC  X(01)  VALUE  "1".
      *----------  中間データフラグ
         05  CNS-CHKN-DATA-FLG-1   PIC  X(01)  VALUE  "1".
         05  CNS-CHKN-DATA-FLG-0   PIC  X(01)  VALUE  "0".
      *----------  採用データルート
         05  CNS-SAYO-DATA-ROOT-1  PIC  X(01)  VALUE  "1".
         05  CNS-SAYO-DATA-ROOT-2  PIC  X(01)  VALUE  "2".
         05  CNS-SAYO-DATA-ROOT-3  PIC  X(01)  VALUE  "3".
         05  CNS-SAYO-DATA-ROOT-9  PIC  X(01)  VALUE  "9".
      *----------  休日区分
         05  CNS-KYUJITU-KBN-2     PIC  X(01)  VALUE  "2".
      *----------  市場通貨経過利息
         05  CNS-SJTK-KEKA-RSK-9   PIC  S9(12)V9(06)
                                        VALUE  999999999999.999999.
      *----------  市場通貨源泉税
         05  CNS-SJTK-GENSEN-TAX-9 PIC  S9(15)V9(03)
                                        VALUE  999999999999999.999.
      *----------  未入金対象額面残高
         05  CNS-MNK-TSHO-FACE-ZAN-9
                                   PIC  S9(12)V9(06)
                                        VALUE  999999999999.999999.
      *----------  ファクター・連動係数
         05  CNS-FACTOR-RENDOU-KESU-9
                                   PIC  S9(08)V9(10)
                                        VALUE  99999999.9999999999.
      *----------  ALL9
         05  CNS-ALL9              PIC  S9(18)V9(18)
                           VALUE  999999999999999999.999999999999999999.
      *----------  直前債券過去経過利息計算データフラグ
         05  CNS-CHZN-TKMZBW09-FLG-0
                                   PIC  X(01)  VALUE  "0".
         05  CNS-CHZN-TKMZBW09-FLG-1
                                   PIC  X(01)  VALUE  "1".
      *----------  直前債券過去経過利息フラグ
         05  CNS-CHZN-TKMZKR00-FLG-0
                                   PIC  X(01)  VALUE  "0".
         05  CNS-CHZN-TKMZKR00-FLG-1
                                   PIC  X(01)  VALUE  "1".
      *----------  約定ベース受渡順フラグ
         05  CNS-YKJ-UKE-JUN-FLG-1 PIC  X(01)  VALUE  "1".
      *----------  フェッチフラグ
         05  CNS-FLG-1             PIC  9(01)  VALUE  1.
         05  CNS-FLG-0             PIC  9(01)  VALUE  0.
         05  CNS-X-0               PIC  X(01)  VALUE  "0".
         05  CNS-RTN-114           PIC  X(03)  VALUE  "114".
         05  CNS-RTN-113           PIC  X(03)  VALUE  "113".
         05  CNS-RTN-112           PIC  X(03)  VALUE  "112".
      *---------- 固定変動区分
         05  CNS-FV-KBN-0          PIC  X(01)  VALUE  "0".
      *----------  連動係数参照区分
         05  CNS-RK-REF-KBN-2      PIC  X(01)  VALUE  "2".
      *----------  投資対象国コード
         05  CNS-JPN               PIC  X(03)  VALUE  "JPN".
      *----------  パラメータエラーメッセージ
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-SQL-MSG-INSERT    PIC  X(17)  VALUE
                                               " SQL-MSG(INSERT):".
         05  CNS-SQL-MSG-UPDATE    PIC  X(17)  VALUE
                                               " SQL-MSG(UPDATE):".
      *---------- フリーメッセージ
         05  CNS-FREE-MSG          PIC  X(48)  VALUE
                   "入金日以前の債券過去経過利息データはありません。".
      *---------- =
         05  CNS-EQUAL             PIC  X(01)  VALUE  "=".
      *---------- ORDER BY (SQL1-2,SQL1-15)
         05  CNS-ODBY-UKE-YMD      PIC  X(13)  VALUE  "UKE_YMD DESC,".
         05  CNS-ODBY-UPD-DATE     PIC  X(14)  VALUE  "UPD_DATE DESC,".
         05  CNS-ODBY-KJO-KJB      PIC  X(20)  VALUE
                                               "KEIJOU_KIJUNBI DESC,".
         05  CNS-ODBY-IDO-KJN      PIC  X(26)  VALUE
                                               "IDO_KJY_JUN DESC".
         05  CNS-1                 PIC  9(01)  VALUE  1.
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-DATA-IN.
      *----------  銘柄別断面情報
           10  WK-TKMZBW03-PARM.
      *----------  利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  基準日
             15  WK-KJN-YMD        PIC  9(08).
      *----------  開始基準日
             15  WK-KAISI-KJN-YMD  PIC  9(08).
      *----------  銘柄コード
             15  WK-MEG-CD         PIC  X(15).
      *----------  証券種別コード
             15  WK-SEC-SBT-CD     PIC  X(04).
      *----------  資産負債・買建売建フラグ
             15  WK-TATE-FLG       PIC  X(01).
      *----------  玉ID
             15  WK-GYOKU-ID       PIC  X(10).
      *----------  処理実行日
             15  WK-SYORI-YMD      PIC  9(08).
      *----------  起動ID
             15  WK-KIDOU-ID       PIC  X(04).
      *----------  差分更新From日
             15  WK-SABON-UPDATE-FROM
                                   PIC  9(08).
      *----------  基準日断面情報
           10  WK-KYJ-YMD-DMN-INFO.
      *----------  開始基準日の翌日
             15  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  通貨デフォールト端数処理
           10  WK-TUKA-DEF-HASU-SYRI-PARM.
      *----------  運用通貨端数処理方法
             15  WK-LC-HS          PIC  X(01).
      *----------  運用通貨小数点以下桁数
             15  WK-LC-SYOSU-TENYIKA-KETASU
                                   PIC  9(02).
      *----------  市場通貨端数処理方法
             15  WK-BC-HS          PIC  X(01).
      *----------  市場通貨小数点以下桁数
             15  WK-BC-SYOSU-TENYIKA-KETASU
                                   PIC  9(02).
      *----------  銘柄属性データ
           10  WK-MEG-ZOKUSEI-DATA-PARM.
      *----------  初期利払起算日
             15  WK-SHOKI-RIBAR-KS-YMD
                                   PIC  9(08).
      *----------  初期利払日
             15  WK-SHOKI-RIBAR-YMD
                                   PIC  9(08).
      *----------  最終利払起算日
             15  WK-LAST-RIBAR-KISAN-YMD
                                   PIC  9(08).
      *----------  終期利払日
             15  WK-SHUKI-RIBAR-YMD
                                   PIC  9(08).
      *----------  利払回数
             15  WK-RIBAR-KAISU    PIC  X(02).
      *----------  利払日１
             15  WK-RIBAR-YMD-1    PIC  9(04).
      *----------  利払日２
             15  WK-RIBAR-YMD-2    PIC  9(04).
      *----------  利払日３
             15  WK-RIBAR-YMD-3    PIC  9(04).
      *----------  利払日４
             15  WK-RIBAR-YMD-4    PIC  9(04).
      *----------  ファクター・連動係数
             15  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  利払日休日処理区分
             15  WK-RIBAR-YMD-QJT-SR-KBN
                                   PIC  X(01).
      *----------  初期利払日休日処理区分
             15  WK-SHOKI-RB-YMD-QJT-KBN
                                   PIC  X(01).
      *----------  終期利払日休日処理区分
             15  WK-SHUKI-RB-YMD-QJT-KBN
                                   PIC  X(01).
      *----------  固定変動区分
             15  WK-FIX-VRBL-KBN   PIC  X(01).
      *----------  連動係数参照区分
             15  WK-RENKSU-REF-KBN PIC  X(01).
      *----------  開始時残高数量残高（利付）
           10  WK-KAISIZN-SRYZN-RIT
                                   PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  管理数量単位
           10  WK-KANRI-SURYO-TANI
                                   PIC  S9(12)V9(06).
      *----------  料率パターンコード
           10  WK-COMMISSION-PATTERN
                                   PIC  X(04).
      *----------  約定ベース受渡順フラグ
           10  WK-YKJ-UKE-JUN-FLG  PIC  X(01).
      *----------  跨ぎ異動数量（利付）集計
           10  WK-MTGI-IDO-SURYO-SHUKE
                                   PIC  S9(12)V9(06).
      *----------  銘柄属性データ3
           10  WK-MEG-SKJO-DATA-3.
      *----------  利払日数
             15  WK-KEKA-NISU      PIC  9(03).
      *----------  ワーク利払日計算パッケージ
         05  WK-RIBAR-YMD-CALC-PKG.
      *----------  入力年月日
           10  WK-IN-YMD           PIC  9(08).
      *----------  次回利払日
           10  WK-JIKAI-RIBAR-YMD  PIC  9(08).
      *----------  利付き数量
           10  WK-RIT-SRY          PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  市場通貨経過利息
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
      *----------  市場通貨経過利息(中間)
           10  WK-SJTK-KEKA-RSK-CHUKAN
                                   PIC  S9(18)V9(18).
      *----------  市場通貨源泉税(中間)
           10  WK-SJTK-GENSEN-TAX-CHUKAN
                                   PIC  S9(18)V9(18).
      *----------  ファクター・連動係数
           10  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  ワーク入金日計算パッケージ
         05  WK-NKY-CALC-PKG.
      *----------  利払日（直前データ検索用）
           10  WK-RIBAR-YMD        PIC  9(08).
      *----------  適用開始日（直前データ検索用）
           10  WK-TEKIYO-FROM      PIC  9(08).
      *----------  市場通貨経過利息
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
      *----------  市場通貨経過利息(中間)
           10  WK-SJTK-KEKA-RSK-CHUKAN
                                   PIC  S9(18)V9(18).
      *----------  市場通貨源泉税(中間)
           10  WK-SJTK-GENSEN-TAX-CHUKAN
                                   PIC  S9(18)V9(18).
      *----------  ワーク基準日計算パッケージ
         05  WK-KJY-CALC-PKG.
      *----------  計算方法
           10  WK-CALC-HOHO        PIC  X(01).
      *----------  前回利払日
           10  WK-ZEN-RIBAR-YMD    PIC  9(08).
      *----------  前々回利払日
           10  WK-ZZEN-RIBAR-YMD   PIC  9(08).
      *----------  前々回利払日計算フラグ
           10  WK-ZZEN-RIBAR-YMD-FLG
                                   PIC  X(01).
      *----------  次回利払日
           10  WK-JIKAI-RIBAR-YMD  PIC  9(08).
      *----------  利付き数量
           10  WK-RIT-SRY          PIC  S9(12)V9(06).
      *----------  ワーク利払日～基準日結果パッケージ
         05  WK-RBY-KJY-PKG.
      *----------  市場通貨経過利息
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
      *----------  市場通貨経過利息(中間)
           10  WK-SJTK-KEKA-RSK-CHUKAN
                                   PIC  S9(18)V9(18).
      *----------  市場通貨源泉税(中間)
           10  WK-SJTK-GENSEN-TAX-CHUKAN
                                   PIC  S9(18)V9(18).
      *----------  ワーク前回利払日結果パッケージ
         05  WK-ZNKAI-RBY-KEKKA-PKG.
      *----------  市場通貨経過利息
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
      *----------  採用データルート
           10  WK-SAYO-DATA-ROOT   PIC  X(01).
      *----------  中間データフラグ
           10  WK-CHKN-DATA-FLG    PIC  X(01).
      *----------  業務データフラグ
           10  WK-GYOMU-DATA-FLG   PIC  X(01).
      *----------  ワーク前々回利払日結果パッケージ
         05  WK-ZZNKAI-RBY-KEKKA-PKG.
      *----------  市場通貨経過利息
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
      *----------  採用データルート
           10  WK-SAYO-DATA-ROOT   PIC  X(01).
      *----------  中間データフラグ
           10  WK-CHKN-DATA-FLG    PIC  X(01).
      *----------  業務データフラグ
           10  WK-GYOMU-DATA-FLG   PIC  X(01).
      *----------  債券過去経過利息データなしフラグ
         05  WK-TKMZBW09-NO-DATA-FLG
                                   PIC  9(01).
      *----------  ワーク終了フラグ
         05  WK-END-FLG            PIC  9(01).
      *----------  データ計数
         05  WK-DATA-CNT           PIC  9(04).
      *----------  ワーク経過利息計算しないフラグ
         05  WK-KEKA-RSK-CALC-FLG  PIC  9(01).
      *----------  ワーク休日区分
         05  WK-KYUJITU-KBN        PIC  X(01).
      *----------  ワーク更新用適用開始日
         05  WK-KSY-TEKIYO-FROM    PIC  9(08).
      *----------  ワーク直前債券過去経過利息計算データ
         05  WK-CHZN-TKMZBW09.
      *----------  適用開始日
           10  WK-TEKIYO-FROM      PIC  9(08).
      *----------  利払日
           10  WK-RIB-YMD          PIC  9(08).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  利払対象額面
           10  WK-RIB-TSHO-FACE    PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  WK-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
      *----------  ワーク直前債券過去経過利息計算データフラグ
         05  WK-CHZN-TKMZBW09-FLG  PIC  X(01).
      *----------  ワーク直前債券過去経過利息
         05  WK-CHZN-TKMZKR00.
      *----------  適用開始日
           10  WK-TEKIYO-FROM      PIC  9(08).
      *----------  利払日
           10  WK-RIB-YMD          PIC  9(08).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  利払対象額面
           10  WK-RIB-TSHO-FACE    PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
      *----------  市場通貨経過利息（入力値）
           10  WK-SJTK-KEKA-RSK-IN
                                   PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
      *----------  市場通貨源泉税（入力値）
           10  WK-SJTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  ファクター・連動係数（入力値）
           10  WK-FACTOR-RENDOU-KESU-IN
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  WK-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
      *----------  未入金対象額面残高（入力値）
           10  WK-MNK-TSHO-FACE-ZAN-IN
                                   PIC  S9(12)V9(06).
      *----------  ワーク直前債券過去経過利息フラグ
         05  WK-CHZN-TKMZKR00-FLG  PIC  X(01).
      *----------  ワーク直前債券過去経過利息確定
         05  WK-CHZN-SAI-KAKUNIN.
      *----------  利払日
           10  WK-RIB-YMD          PIC  9(08).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  利払対象額面
           10  WK-RIB-TSHO-FACE    PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  WK-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
      *----------  ワークSMZC3250
         05  WK-SMZC3250-PARM.
      *----------  ワーク基準日
           10  WK-KJN-YMD          PIC  9(08).
      *----------  ワーク利払日From
           10  WK-RIB-YMD-FROM     PIC  9(08).
      *----------  ワーク利払日To
           10  WK-RIB-YMD-TO       PIC  9(08).
      *----------  ワーク銘柄コード
           10  WK-MEG-CD           PIC  X(15).
      *----------  ワーク証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
      *----------  ワーク利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  ワーク計算区分
           10  WK-CALC-KBN         PIC  X(01).
      *----------  ワーク額面数量
           10  WK-FACE             PIC  S9(12)V9(06).
      *----------  ワークSMZC3251
         05  WK-SMZC3251-PARM.
      *----------  入力年月日
           10  WK-IN-YMD           PIC  9(08).
      *----------  ワークSMZC3254
         05  WK-SMZC3254-PARM.
      *----------  入力年月日
           10  WK-IN-YMD           PIC  9(08).
      *----------  ワークSMZY1020
         05  WK-SCZY1020-PARM.
      *----------  基準年月日１
           10  WK-IXCAL-KJN-YMD1   PIC  9(08).
      *----------  前後区分1
           10  WK-IXCAL-ZENGO-KBN-1
                                   PIC  X(01).
      *----------  中間データフラグ(中間)
         05  WK-CHKN-DATA-FLG-CHUKAN
                                   PIC  X(01).
      *----------  業務データフラグ(中間)
         05  WK-GYOMU-DATA-FLG-CHUKAN
                                   PIC  X(01).
      *----------  ワーク採用データルート(中間)
         05  WK-SAYO-DATA-ROOT-CHUKAN
                                   PIC  X(01).
      *----------  ワーク市場通貨経過利息(編集後)
         05  WK-SJTK-KEKA-RSK-HENSYUGO
                                   PIC  S9(12)V9(06).
      *----------  ワーク市場通貨源泉税(編集後)
         05  WK-SJTK-GENSEN-TAX-HENSYUGO
                                   PIC  S9(15)V9(03).
      *---------- ワークフェッチフラグ
         05  WK-FETCH-FLG          PIC  X(01).
         05  WK-1-9-FETCH-FLG      PIC  9(01).
      *---------- ポジション
         05  WK-ERR-POS            PIC  X(04).
      *---------- ポジション1
         05  WK-ERR-POS1           PIC  X(04).
      *---------- ポジション2
         05  WK-ERR-POS2           PIC  X(04).
      *---------- ポジション1
         05  WK-ERR-POS3           PIC  X(04).
      *---------- ポジション2
         05  WK-ERR-POS4           PIC  X(04).
      *----------  未入金対象額面残高差
         05  WK-MNK-TSHO-FACE-ZAN-SA
                                   PIC  S9(12)V9(06).
      *----------  ワーク市場通貨経過利息和
         05  WK-SJTK-KEKA-RSK-WA   PIC  S9(13)V9(06).
      *----------  ワーク市場通貨源泉税和
         05  WK-SJTK-GENSEN-TAX-WA
                                   PIC  S9(16)V9(03).
      *----------  ワーク自計算フラグ
         05  WK-JI-KEISAN-FLG      PIC  X(01).
      *----------  ワークループフラグ
         05  WK-LOOP-FLG           PIC  X(01).
      *----------  ワークモーケージ債フラグ
         05  WK-MORTGAGE-FLG       PIC  9(01).
      *----------  ワーク休日調整後の次回利払日
         05  WK-KJA-KJC-RIB-YMD    PIC  9(08).
      *----------  ワーク休日調整後の次回利払日（基準日用）
         05  WK-KJA-KJC-RIB-YMD-K  PIC  9(08).
      *----------  ワークスキップフラグ
         05  WK-SKIP-FLG           PIC  9(01).
      *----------  ワークの戻り値1
         05  WK-RTN-CD-1.
      *----------  ワーク前回利払日種類1
           10  WK-ZENKAI-RB-YMD-SYURUI-1  
                                   PIC  X(01).
      *----------  ワーク次回利払日種類1
           10  WK-JIKAI-RB-YMD-SYURUI-1
                                   PIC  X(01).
      *----------  ワーク前回利払日1
           10  WK-ZENKAI-RIBAR-YMD-1
                                   PIC  9(08).
      *----------  ワーク次回利払日1
           10  WK-JIKAI-RIBAR-YMD-1
                                   PIC  9(08).
      *----------  ワークの戻り値2
         05  WK-RTN-CD-2.
      *----------  ワーク前回利払日種類2
           10  WK-ZENKAI-RB-YMD-SYURUI-2  
                                   PIC  X(01).
      *----------  ワーク次回利払日種類2
           10  WK-JIKAI-RB-YMD-SYURUI-2
                                   PIC  X(01).
      *----------  ワーク前回利払日2
           10  WK-ZENKAI-RIBAR-YMD-2
                                   PIC  9(08).
      *----------  ワーク次回利払日2
           10  WK-JIKAI-RIBAR-YMD-2
                                   PIC  9(08).
      ******************************************************************
      *    フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  債券過去経過利息カーソルオープンフラグ
         05  FLG-TKMZKR00-CR-OPEN  PIC  9(01).
         05  FLG-TKMZKR00-CR-1-OPEN
                                   PIC  9(01).
         05  FLG-TKMZKR00-CR-2-OPEN
                                   PIC  9(01).
         05  FLG-TKMZKR00-CR-3-OPEN
                                   PIC  9(01).
         05  FLG-TKMZKR00-CR-4-OPEN
                                   PIC  9(01).
      *----------  取引カーソルオープンフラグ
         05  FLG-TKMXTR00-CR-OPEN  PIC  9(01).
      *----------  対象取引情報カーソルオープンフラグ
         05  FLG-TKMZBW04-CR-OPEN  PIC  9(01).
      *----------  残高異動計算データカーソルオープンフラグ
         05  FLG-TKMZBW06-CR-OPEN  PIC  9(01).
         05  FLG-TKMZBW06-CR-1-OPEN
                                   PIC  9(01).
      *----------  債券過去経過利息計算データカーソルオープンフラグ
         05  FLG-TKMZBW09-CR-OPEN  PIC  9(01).
         05  FLG-TKMZBW09-CR-1-OPEN
                                   PIC  9(01).
         05  FLG-TKMZBW09-CR-2-OPEN
                                   PIC  9(01).
      *----------  残高異動カーソルオープンフラグ
         05  FLG-TKMZZI00-CR-OPEN  PIC  9(01).
         05  FLG-TKMZZI00-CR-2-OPEN
                                   PIC  9(01).
         05  FLG-TKMZZI00-CR1-OPEN PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZZI00-CR-3-OPEN                                     @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  残高履歴カーソルオープンフラグ
         05  FLG-TKMZZR00-CR-OPEN  PIC  9(01).
         05  FLG-TKMZBW09-S3-INSERT                                     @SEINO@@
                                   PIC  9(01).                          @SEINO@@
         05  FLG-TKMZBW09-S10-UPDATE                                    @SEINO@@
                                   PIC  9(01).                          @SEINO@@
       01  FIRST-SW                PIC  X(03)  VALUE  'YES'.            @SEINO@@
      ******************************************************************
      *    ＯＲＡＣＬＥホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  残高異動計算データTBL(別紙1-1)
         05  H-TKMZBW06.
      *----------  異動後数量残高（利付）
           10  H-IDOG-SRYZN-RIT    PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  残高異動計算データTBL
         05  H-TKMZBW06-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  残高異動TBL(別紙1-2)
         05  H-TKMZZI00.
      *----------  異動後数量残高（利付）
           10  H-IDOG-SRYZN-RIT    PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  残高異動計算データTBL
         05  H-TKMZZI00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  債券過去経過利息計算データTBL(別紙1-3)
         05  H-TKMZBW09-I.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  利払対象額面
           10  H-RIB-TSHO-FACE     PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  H-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  H-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  対象取引情報テーブルTBL(別紙1-4)
         05  H-TKMZBW04.
      *----------  原取引ID
           10  H-TORI-ID           PIC  S9(10).
      *----------  対象取引情報テーブルTBL
         05  H-TKMZBW04-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD
                                   PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  取引TBL(別紙1-5)
         05  H-TKMXTR00.
      *----------  投資対象国コード
           10  H-TSTSK-CD          PIC  X(04).
      *----------  権利数量
           10  H-KENRI-SURYO       PIC  S9(12)V9(06).
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  効力発生日
           10  H-KOURYOKU-YMD      PIC  S9(08).
      *----------  約定金額（市場通貨換算額）
           10  H-S-KSG-G-YJKG      PIC  S9(15)V9(03).
      *----------  現地源泉税（市場通貨換算額）
           10  H-S-KSG-G-GSZ       PIC  S9(15)V9(03).
      *----------  国内源泉税（市場通貨換算額）
           10  H-S-KSG-U-GSZ       PIC  S9(15)V9(03).
      *----------  取引TBL
         05  H-TKMXTR00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  原取引ID
           10  H-TORI-ID           PIC  S9(10).
      *----------  債券過去経過利息計算データTBL(別紙1-6)
         05  H-TKMZBW09.
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  利払対象額面
           10  H-RIB-TSHO-FACE     PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  H-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  H-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
      *----------  債券過去経過利息計算データTBL
         05  H-TKMZBW09-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  債券過去経過利息TBL(別紙1-7)
         05  H-TKMZKR00.
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  利払対象額面
           10  H-RIB-TSHO-FACE     PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  市場通貨経過利息（入力値）
           10  H-SJTK-KEKA-RSK-IN  PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  市場通貨源泉税（入力値）
           10  H-SJTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  H-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  ファクター・連動係数（入力値）
           10  H-FACTOR-RENDOU-KESU-IN
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  H-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
      *----------  未入金対象額面残高（入力値）
           10  H-MNK-TSHO-FACE-ZAN-IN
                                   PIC  S9(12)V9(06).
      *----------  債券過去経過利息TBL
         05  H-TKMZKR00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  債券過去経過利息計算データTBL(別紙1-10)
         05  H-TKMZBW09-3.
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  利払対象額面
           10  H-RIB-TSHO-FACE     PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  H-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  H-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  債券過去経過利息計算データTBL(別紙1-10)
         05  H-TKMZBW09-S-3.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  債券過去経過利息TBL(別紙1-11)
         05  H-TKMZKR00-1.
      *----------  市場通貨経過利息（入力値）
           10  H-SJTK-KEKA-RSK-IN  PIC  S9(12)V9(06).
      *----------  市場通貨源泉税（入力値）
           10  H-SJTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  運用通貨経過利息（入力値）
           10  H-UYTK-KEKA-RSK-IN  PIC  S9(12)V9(06).
      *----------  運用通貨源泉税（入力値）
           10  H-UYTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  評価為替レート（入力値）
           10  H-HYK-KWS-IN        PIC  S9(08)V9(10).
      *----------  源泉税評価為替レート（入力値）
           10  H-GENS-TAX-HYK-KWS-IN
                                   PIC  S9(08)V9(10).
      *----------  ファクター・連動係数（入力値）
           10  H-FACTOR-RENDOU-KESU-IN
                                   PIC  S9(08)V9(10).
      *----------  債券過去経過利息TBL
         05  H-TKMZKR00-S-1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  残高異動計算データTBL(別紙1-12)
         05  H-TKMZBW06-1.
      *----------  異動後数量残高（利付）
           10  H-IDOG-SRYZN-RIT    PIC  S9(12)V9(06).
      *----------  残高異動計算データTBL
         05  H-TKMZBW06-S-1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  債券過去経過利息計算データTBL(別紙1-13)
         05  H-TKMZBW09-1.
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  債券過去経過利息計算データTBL
         05  H-TKMZBW09-S-1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  債券過去経過利息TBL(別紙1-14)
         05  H-TKMZKR00-2.
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  市場通貨経過利息（入力値）
           10  H-SJTK-KEKA-RSK-IN  PIC  S9(12)V9(06).
      *----------  市場通貨源泉税（入力値）
           10  H-SJTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  債券過去経過利息TBL
         05  H-TKMZKR00-S-2.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  債券過去経過利息TBL(別紙1-9)
         05  H-TKMZKR00-3.
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  債券過去経過利息TBL(別紙1-9)
         05  H-TKMZKR00-S-3.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  債券過去経過利息計算データTBL(別紙1-9)
         05  H-TKMZBW09-S-2.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  残高異動TBL(別紙1-15)
         05  H-TKMZZI00-2.
      *----------  異動後数量残高（利付）
           10  H-IDOG-SRYZN-RIT    PIC  S9(12)V9(06).
      *----------  残高異動計算データTBL
         05  H-TKMZZI00-S2.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  計上基準日
           10  H-KEIJOU-KIJUNBI    PIC  S9(08).
           10  H-KEIJOU-KIJUNBI1   PIC  S9(08).
      *----------  残高履歴TBL(別紙1-16)
         05  H-TKMZZR00.
      *----------  数量残高（利付）
           10  H-SRYZN-RIT         PIC  S9(12)V9(06).
      *----------  残高履歴TBL
         05  H-TKMZZR00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
         05  SQLSTMT1              PIC  X(700).                         @3212SEINO@@
         05  SQLSTMT2              PIC  X(450).                         @3212SEINO@@
         05  SQLSTMT3              PIC  X(200).                         @3212SEINO@@
         05  SQLSTMT4              PIC  X(900).                         @3212SEINO@@
         05  SQLSTMT5              PIC  X(700).                         @3212SEINO@@
         05  SQLSTMT6              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT7              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT8              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT9              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT10             PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT11             PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT12             PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT13             PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT14             PIC  X(550).                         @3212SEINO@@
         05  SQLSTMT15             PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT16             PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT17             PIC  X(300).                         @3212SEINO@@
         05  SQLSTMT18             PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT19             PIC  X(400).                         @3212SEINO@@
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *            SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  残高異動計算データSQL文(別紙1-1)
         05  SQL-SELECT-1-1.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  異動後数量残高（利付）
           10  FILLER              PIC  X(16)  VALUE
               "IDOG_SRYZN_RIT, ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(13)  VALUE  "SIJO_TUKA_CD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZBW06    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  受渡日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "UKE_YMD < ".
           10  FILLER              PIC  X(10)  VALUE  ":P_UKE_YMD".
      *----------  処理実行日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------  起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_KIDOU_ID".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  受渡日  降順
           10  FILLER              PIC  X(14)  VALUE  "UKE_YMD DESC, ".
      *----------  異動計上順序  降順
           10  FILLER              PIC  X(16)  VALUE
               "IDO_KJY_JUN DESC".
      *----------  残高異動SQL文(別紙1-2)
         05  SQL-SELECT-1-2.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  異動後数量残高（利付）
           10  FILLER              PIC  X(16)  VALUE
               "IDOG_SRYZN_RIT, ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(13)  VALUE  "SIJO_TUKA_CD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZZI00    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  受渡日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "UKE_YMD < ".
           10  FILLER              PIC  X(10)  VALUE  ":P_UKE_YMD".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  債券過去経過利息計算データSQL文(別紙1-3,別紙1-8)
         05  SQL-INSERT-1-3.
           10  FILLER              PIC  X(13)  VALUE  " INSERT INTO ".
           10  SQL-TBL-TKMZBW09    PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE  " (".
      *----------  処理実行日
           10  FILLER              PIC  X(11)  VALUE  " SYORI_YMD,".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE  " KIDOU_ID,".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE  " RIYO_CMP_CD,".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  " FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  " PTF_CD,".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  " SEC_SBT_CD,".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  " MEG_CD,".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE  " TATE_FLG,".
      *----------  玉ID
           10  FILLER              PIC  X(10)  VALUE  " GYOKU_ID,".
      *----------  適用開始日
           10  FILLER              PIC  X(13)  VALUE  " TEKIYO_FROM,".
      *----------  利払日
           10  FILLER              PIC  X(09)  VALUE  " RIB_YMD,".
      *----------  市場通貨コード
           10  FILLER              PIC  X(14)  VALUE  " SIJO_TUKA_CD,".
      *----------  利払対象額面
           10  FILLER              PIC  X(15)  VALUE  " RIB_TSHO_FACE,".
      *----------  市場通貨経過利息
           10  FILLER              PIC  X(15)  VALUE  " SJTK_KEKA_RSK,".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(17)  VALUE
               " SJTK_GENSEN_TAX,".
      *----------  ファクター・連動係数
           10  FILLER              PIC  X(20)  VALUE
               " FACTOR_RENDOU_KESU,".
      *----------  未入金対象額面残高
           10  FILLER              PIC  X(19)  VALUE
               " MNK_TSHO_FACE_ZAN,".
      *----------  削除区分
           10  FILLER              PIC  X(12)  VALUE  " SAKUJO_KBN,".
      *----------  更新日時
           10  FILLER              PIC  X(10)  VALUE  " UPD_DATE,".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)  VALUE
               " UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(09)  VALUE  " UPD_SID,".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(12)  VALUE  " UPD_PGMID )".
      *----------  VALUES
           10  FILLER              PIC  X(09)  VALUE  "  VALUES ".
           10  FILLER              PIC  X(04)  VALUE  "  ( ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SYORI_YMD,".
           10  FILLER              PIC  X(12)  VALUE  ":P_KIDOU_ID,".
           10  FILLER              PIC  X(15)  VALUE  ":P_RIYO_CMP_CD,".
           10  FILLER              PIC  X(11)  VALUE  ":P_FUND_CD,".
           10  FILLER              PIC  X(10)  VALUE  ":P_PTF_CD,".
           10  FILLER              PIC  X(14)  VALUE  ":P_SEC_SBT_CD,".
           10  FILLER              PIC  X(10)  VALUE  ":P_MEG_CD,".
           10  FILLER              PIC  X(12)  VALUE  ":P_TATE_FLG,".
           10  FILLER              PIC  X(12)  VALUE  ":P_GYOKU_ID,".
           10  FILLER              PIC  X(15)  VALUE  ":P_TEKIYO_FROM,".
           10  FILLER              PIC  X(11)  VALUE  ":P_RIB_YMD,".
           10  FILLER              PIC  X(16)  VALUE
               ":P_SIJO_TUKA_CD,".
           10  FILLER              PIC  X(17)  VALUE
               ":P_RIB_TSHO_FACE,".
           10  FILLER              PIC  X(17)  VALUE
               ":P_SJTK_KEKA_RSK,".
           10  FILLER              PIC  X(19)  VALUE
               ":P_SJTK_GENSEN_TAX,".
           10  FILLER              PIC  X(22)  VALUE
               ":P_FACTOR_RENDOU_KESU,".
           10  FILLER              PIC  X(21)  VALUE
               ":P_MNK_TSHO_FACE_ZAN,".
           10  FILLER              PIC  X(04)  VALUE  "' ',".
           10  FILLER              PIC  X(08)  VALUE  "SYSDATE,".
           10  FILLER              PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
           10  FILLER              PIC  X(04)  VALUE  "' ',".
           10  FILLER              PIC  X(12)  VALUE  "'SMZJ2120' )".
      *----------  対象取引情報SQL文(別紙1-4)
         05  SQL-SELECT-1-4.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  原取引ID
           10  FILLER              PIC  X(08)  VALUE  "TORI_ID ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZBW04    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE   ":P_SYORI_YMD".
      *----------  起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_KIDOU_ID".
      *----------  利用会社コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  開始基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(16)  VALUE "KAISI_KJN_YMD = ".
           10  FILLER              PIC  X(16)  VALUE ":P_KAISI_KJN_YMD".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "KJN_YMD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_KJN_YMD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  未収計算対象フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
               "MSKS_TARGET_FLG = ".
           10  FILLER              PIC  X(03)  VALUE  "'1'".
      *----------  未収計算種類
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "MSKS_SHRU = ".
           10  FILLER              PIC  X(04)  VALUE  "'11'".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  処理順  昇順
           10  FILLER              PIC  X(05)  VALUE  "SRJUN".
      *----------  取引SQL文(別紙1-5)
         05  SQL-SELECT-1-5.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  投資対象国コード
           10  FILLER              PIC  X(10)  VALUE  "TSTSK_CD, ".
      *----------  権利数量
           10  FILLER              PIC  X(13)  VALUE  "KENRI_SURYO, ".
      *----------  受渡日
           10  FILLER              PIC  X(09)  VALUE  "UKE_YMD, ".
      *----------  効力発生日
           10  FILLER              PIC  X(14)  VALUE  "KOURYOKU_YMD, ".
      *----------  約定金額（市場通貨換算額）
           10  FILLER              PIC  X(14)  VALUE  "S_KSG_G_YJKG, ".
      *----------  現地源泉税（市場通貨換算額）
           10  FILLER              PIC  X(13)  VALUE  "S_KSG_G_GSZ, ".
      *----------  国内源泉税（市場通貨換算額）
           10  FILLER              PIC  X(12)  VALUE  "S_KSG_U_GSZ ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMXTR00    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  原取引ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "TORI_ID = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_TORI_ID".
      *----------  債券過去経過利息計算データSQL文(別紙1-6)
         05  SQL-SELECT-1-6.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  適用開始日
           10  FILLER              PIC  X(13)  VALUE  " TEKIYO_FROM,".
      *----------  利払日
           10  FILLER              PIC  X(09)  VALUE  " RIB_YMD,".
      *----------  市場通貨コード
           10  FILLER              PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  利払対象額面
           10  FILLER              PIC  X(15)  VALUE  "RIB_TSHO_FACE, ".
      *----------  市場通貨経過利息
           10  FILLER              PIC  X(15)  VALUE  "SJTK_KEKA_RSK, ".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(17)  VALUE
               "SJTK_GENSEN_TAX, ".
      *----------  ファクター・連動係数
           10  FILLER              PIC  X(20)  VALUE
               "FACTOR_RENDOU_KESU, ".
      *----------  未入金対象額面残高
           10  FILLER              PIC  X(18)  VALUE
               "MNK_TSHO_FACE_ZAN ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZBW09    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  利払日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "RIB_YMD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_RIB_YMD".
      *----------  適用開始日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE  "TEKIYO_FROM <= ".
           10  FILLER              PIC  X(10)  VALUE  ":P_UKE_YMD".
      *----------  処理実行日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------  起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_KIDOU_ID".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  適用開始日  降順
           10  FILLER              PIC  X(16)  VALUE
               "TEKIYO_FROM DESC".
      *----------  債券過去経過利息SQL文(別紙1-7)
         05  SQL-SELECT-1-7.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  適用開始日
           10  FILLER              PIC  X(13)  VALUE  " TEKIYO_FROM,".
      *----------  利払日
           10  FILLER              PIC  X(09)  VALUE  " RIB_YMD,".
      *----------  市場通貨コード
           10  FILLER              PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  利払対象額面
           10  FILLER              PIC  X(15)  VALUE  "RIB_TSHO_FACE, ".
      *----------  市場通貨経過利息
           10  FILLER              PIC  X(15)  VALUE  "SJTK_KEKA_RSK, ".
      *----------  市場通貨経過利息（入力値）
           10  FILLER              PIC  X(18)  VALUE
               "SJTK_KEKA_RSK_IN, ".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(17)  VALUE
               "SJTK_GENSEN_TAX, ".
      *----------  市場通貨源泉税（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "SJTK_GENSEN_TAX_IN, ".
      *----------  ファクター・連動係数
           10  FILLER              PIC  X(20)  VALUE
               "FACTOR_RENDOU_KESU, ".
      *----------  ファクター・連動係数（入力値）
           10  FILLER              PIC  X(23)  VALUE
               "FACTOR_RENDOU_KESU_IN, ".
      *----------  未入金対象額面残高
           10  FILLER              PIC  X(19)  VALUE
               "MNK_TSHO_FACE_ZAN, ".
      *----------  未入金対象額面残高（入力値）
           10  FILLER              PIC  X(21)  VALUE
               "MNK_TSHO_FACE_ZAN_IN ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZKR00    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  利払日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "RIB_YMD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_RIB_YMD".
      *----------  適用開始日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE  "TEKIYO_FROM <= ".
           10  FILLER              PIC  X(10)  VALUE  ":P_UKE_YMD".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  適用開始日  降順
           10  FILLER              PIC  X(16)  VALUE
               "TEKIYO_FROM DESC".
      *----------  債券過去経過利息SQL文(別紙1-9)
         05  SQL-SELECT-1-9.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  利払日
           10  FILLER              PIC  X(10)  VALUE  "A.RIB_YMD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ID
           10  FILLER              PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  利払日
           10  FILLER              PIC  X(08)  VALUE  "RIB_YMD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZKR00    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  適用開始日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE  "TEKIYO_FROM <= ".
           10  FILLER              PIC  X(10)  VALUE  ":P_UKE_YMD".
      *----------  利払日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  " RIB_YMD <> 0".
      *----------  UNION
           10  FILLER              PIC  X(11)  VALUE  " UNION ALL ".
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ID
           10  FILLER              PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  利払日
           10  FILLER              PIC  X(08)  VALUE  "RIB_YMD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZBW09    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  適用開始日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE  "TEKIYO_FROM <= ".
           10  FILLER              PIC  X(10)  VALUE  ":P_UKE_YMD".
      *----------  処理実行日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------  起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_KIDOU_ID".
           10  FILLER              PIC  X(03)  VALUE  ") A".
      *----------  GROUP BY
           10  FILLER              PIC  X(10)  VALUE  " GROUP BY ".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)  VALUE  "A.RIYO_CMP_CD, ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE  "A.FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(10)  VALUE  "A.PTF_CD, ".
      *----------  証券種別コード
           10  FILLER              PIC  X(14)  VALUE  "A.SEC_SBT_CD, ".
      *----------  銘柄コード
           10  FILLER              PIC  X(10)  VALUE  "A.MEG_CD, ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(12)  VALUE  "A.TATE_FLG, ".
      *----------  玉ID
           10  FILLER              PIC  X(12)  VALUE  "A.GYOKU_ID, ".
      *----------  利払日
           10  FILLER              PIC  X(09)  VALUE  "A.RIB_YMD".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  利払日
           10  FILLER              PIC  X(09)  VALUE  "A.RIB_YMD".
      *----------  債券過去経過利息計算データSQL文(別紙1-10)
         05  SQL-UPDATE-1-10.
           10  FILLER              PIC  X(07)  VALUE  "UPDATE ".
           10  SQL-TBL-TKMZBW09    PIC  X(13).
           10  FILLER              PIC  X(05)  VALUE  " SET ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(15)  VALUE  "SIJO_TUKA_CD = ".
           10  FILLER              PIC  X(15)  VALUE  ":P_SIJO_TUKA_CD".
           10  FILLER              PIC  X(02)  VALUE  ", ".
      *----------  利払対象額面
           10  FILLER              PIC  X(16)  VALUE
               "RIB_TSHO_FACE = ".
           10  FILLER              PIC  X(16)  VALUE
               ":P_RIB_TSHO_FACE".
           10  FILLER              PIC  X(02)  VALUE  ", ".
      *----------  市場通貨経過利息
           10  FILLER              PIC  X(16)  VALUE
               "SJTK_KEKA_RSK = ".
           10  FILLER              PIC  X(16)  VALUE
               ":P_SJTK_KEKA_RSK".
           10  FILLER              PIC  X(02)  VALUE  ", ".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(18)  VALUE
               "SJTK_GENSEN_TAX = ".
           10  FILLER              PIC  X(18)  VALUE
               ":P_SJTK_GENSEN_TAX".
           10  FILLER              PIC  X(02)  VALUE  ", ".
      *----------  ファクター・連動係数
           10  FILLER              PIC  X(21)  VALUE
               "FACTOR_RENDOU_KESU = ".
           10  FILLER              PIC  X(21)  VALUE
               ":P_FACTOR_RENDOU_KESU".
           10  FILLER              PIC  X(02)  VALUE  ", ".
      *----------  未入金対象額面残高
           10  FILLER              PIC  X(20)  VALUE
               "MNK_TSHO_FACE_ZAN = ".
           10  FILLER              PIC  X(20)  VALUE
               ":P_MNK_TSHO_FACE_ZAN".
           10  FILLER              PIC  X(02)  VALUE  ", ".
      *----------  更新日時
           10  FILLER              PIC  X(11)  VALUE  "UPD_DATE = ".
           10  FILLER              PIC  X(07)  VALUE  "SYSDATE".
           10  FILLER              PIC  X(02)  VALUE  ", ".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(19)  VALUE
               "UPD_LOGIN_CMP_CD = ".
           10  FILLER              PIC  X(19)  VALUE
               ":P_UPD_LOGIN_CMP_CD".
           10  FILLER              PIC  X(02)  VALUE  ", ".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(15)  VALUE  "UPD_SID = ' ', ".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(23)  VALUE
               "UPD_PGMID = 'SMZJ2120' ".
           10  FILLER              PIC  X(06)  VALUE  "WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  適用開始日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(14)  VALUE  "TEKIYO_FROM = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_UKE_YMD".
      *----------  利払日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "RIB_YMD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_RIB_YMD".
      *----------  処理実行日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------  起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_KIDOU_ID".
      *----------  債券過去経過利息SQL文(別紙1-11)
         05  SQL-SELECT-1-11.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  市場通貨経過利息（入力値）
           10  FILLER              PIC  X(18)  VALUE
               "SJTK_KEKA_RSK_IN, ".
      *----------  市場通貨源泉税（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "SJTK_GENSEN_TAX_IN, ".
      *----------  運用通貨経過利息（入力値）
           10  FILLER              PIC  X(18)  VALUE
               "UYTK_KEKA_RSK_IN, ".
      *----------  運用通貨源泉税（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "UYTK_GENSEN_TAX_IN, ".
      *----------  評価為替レート（入力値）
           10  FILLER              PIC  X(12)  VALUE  "HYK_KWS_IN, ".
      *----------  源泉税評価為替レート（入力値）
           10  FILLER              PIC  X(21)  VALUE
               "GENS_TAX_HYK_KWS_IN, ".
      *----------  ファクター・連動係数（入力値）
           10  FILLER              PIC  X(22)  VALUE
               "FACTOR_RENDOU_KESU_IN ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZKR00    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  利払日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "RIB_YMD = 0".
      *----------  適用開始日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(14)  VALUE  "TEKIYO_FROM = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_KJN_YMD".
      *----------  残高異動計算データSQL文(別紙1-12)
         05  SQL-SELECT-1-12.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  異動後数量残高（利付）
           10  FILLER              PIC  X(15)  VALUE
               "IDOG_SRYZN_RIT ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZBW06    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  処理実行日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------  起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_KIDOU_ID".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  異動計上順序  降順
           10  FILLER              PIC  X(16)  VALUE
               "IDO_KJY_JUN DESC".
      *----------  債券過去経過利息計算データSQL文(別紙1-13)
         05  SQL-SELECT-1-13.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  適用開始日
           10  FILLER              PIC  X(13)  VALUE  "TEKIYO_FROM, ".
      *----------  市場通貨経過利息
           10  FILLER              PIC  X(15)  VALUE
               "SJTK_KEKA_RSK, ".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZBW09    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  利払日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "RIB_YMD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_RIB_YMD".
      *----------  適用開始日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE  "TEKIYO_FROM <= ".
           10  FILLER              PIC  X(10)  VALUE  ":P_KJN_YMD".
      *----------  処理実行日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------  起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_KIDOU_ID".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  適用開始日  降順
           10  FILLER              PIC  X(16)  VALUE
               "TEKIYO_FROM DESC".
      *----------  債券過去経過利息計算データSQL文(別紙1-14)
         05  SQL-SELECT-1-14.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  適用開始日
           10  FILLER              PIC  X(13)  VALUE  "TEKIYO_FROM, ".
      *----------  市場通貨経過利息
           10  FILLER              PIC  X(15)  VALUE  "SJTK_KEKA_RSK, ".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(17)  VALUE
               "SJTK_GENSEN_TAX, ".
      *----------  市場通貨経過利息（入力値）
           10  FILLER              PIC  X(18)  VALUE
               "SJTK_KEKA_RSK_IN, ".
      *----------  市場通貨源泉税（入力値）
           10  FILLER              PIC  X(19)  VALUE
               "SJTK_GENSEN_TAX_IN ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZKR00    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  利払日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "RIB_YMD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_RIB_YMD".
      *----------  適用開始日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE  "TEKIYO_FROM <= ".
           10  FILLER              PIC  X(10)  VALUE  ":P_KJN_YMD".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  適用開始日  降順
           10  FILLER              PIC  X(16)  VALUE
               "TEKIYO_FROM DESC".
      *----------  残高異動SQL文(別紙1-15)
         05  SQL-SELECT-1-15.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  異動後数量残高（利付）
           10  FILLER              PIC  X(16)  VALUE
               "IDOG_SRYZN_RIT  ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZZI00    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  計上基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(17)  VALUE
                                                   "KEIJOU_KIJUNBI > ".
           10  FILLER              PIC  X(18)  VALUE
                                                  ":P_KEIJOU_KIJUNBI1".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                                  "KEIJOU_KIJUNBI <= ".
           10  FILLER              PIC  X(17)  VALUE
                                                   ":P_KEIJOU_KIJUNBI".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  残高履歴SQL文(別紙1-16)
         05  SQL-SELECT-1-16.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  数量残高（利付）
           10  FILLER              PIC  X(10)  VALUE
               "SRYZN_RIT ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-TKMZZR00    PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "KJN_YMD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_KJN_YMD".
      *----------  決算日断面区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(28)  VALUE
               "KSN_YMD_DMN_KBN IN ('0','2')".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- SELECT SQL文(別紙1-1,別紙1-12)
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW06     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(16)  VALUE
               "' AND UKE_YMD < ".
           10  WK-EQUAL            PIC  X(01).
           10  WK-UKE-YMD          PIC  S9(08).
           10  FILLER              PIC  X(17)  VALUE
               " AND SYORI_YMD = ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SELECT SQL文(別紙1-2)
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZZI00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(15)  VALUE
               " AND UKE_YMD < ".
           10  WK-UKE-YMD          PIC  S9(08).
      *---------- INSERT SQL文(別紙1-3,別紙1-8)
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW09     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(13)  VALUE
               " SYORI_YMD = ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(20)  VALUE
               "' AND RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(20)  VALUE
               "' AND TEKIYO_FROM = ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
           10  FILLER              PIC  X(15)  VALUE
               " AND RIB_YMD = ".
           10  WK-RIB-YMD          PIC  S9(08).
           10  FILLER              PIC  X(20)  VALUE
               " AND SIJO_TUKA_CD ='".
           10  WK-SIJO-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(22)  VALUE
               "' AND RIB_TSHO_FACE = ".
           10  WK-RIB-TSHO-FACE    PIC  S9(12)V9(06).
           10  FILLER              PIC  X(21)  VALUE
               " AND SJTK_KEKA_RSK = ".
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
           10  FILLER              PIC  X(23)  VALUE
               " AND SJTK_GENSEN_TAX = ".
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
           10  FILLER              PIC  X(26)  VALUE
               " AND FACTOR_RENDOU_KESU = ".
           10  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
           10  FILLER              PIC  X(25)  VALUE
               " AND MNK_TSHO_FACE_ZAN = ".
           10  WK-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
      *---------- SELECT SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW04     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(13)  VALUE
               " SYORI_YMD = ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(20)  VALUE
               "' AND RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(22)  VALUE
               "' AND KAISI_KJN_YMD = ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(15)  VALUE
               " AND KJN_YMD = ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(26)  VALUE
               "' AND MSKS_TARGET_FLG ='1'".
           10  FILLER              PIC  X(20)  VALUE
               " AND MSKS_SHRU ='11'".
      *---------- SELECT SQL文(別紙1-5)
         05  WK-MSG-1-5.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMXTR00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND TORI_ID = ".
           10  WK-TORI-ID          PIC  S9(10).
      *---------- SELECT SQL文(別紙1-6)
         05  WK-MSG-1-6.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW09     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(16)  VALUE
               "' AND RIB_YMD = ".
           10  WK-RIB-YMD          PIC  S9(08).
           10  FILLER              PIC  X(20)  VALUE
               " AND TEKIYO_FROM <= ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
           10  FILLER              PIC  X(17)  VALUE
               " AND SYORI_YMD = ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SELECT SQL文(別紙1-7)
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZKR00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(16)  VALUE
               "' AND RIB_YMD = ".
           10  WK-RIB-YMD          PIC  S9(08).
           10  FILLER              PIC  X(20)  VALUE
               " AND TEKIYO_FROM <= ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *---------- SELECT SQL文(別紙1-11)
         05  WK-MSG-1-11.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZKR00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(17)  VALUE
               "' AND RIB_YMD = 0".
           10  FILLER              PIC  X(19)  VALUE
               " AND TEKIYO_FROM = ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *---------- SELECT SQL文(別紙1-13)
         05  WK-MSG-1-13.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW09     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(16)  VALUE
               "' AND RIB_YMD = ".
           10  WK-RIB-YMD          PIC  S9(08).
           10  FILLER              PIC  X(20)  VALUE
               " AND TEKIYO_FROM <= ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
           10  FILLER              PIC  X(17)  VALUE
               " AND SYORI_YMD = ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SELECT SQL文(別紙1-14)
         05  WK-MSG-1-14.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZKR00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(16)  VALUE
               "' AND RIB_YMD = ".
           10  WK-RIB-YMD          PIC  S9(08).
           10  FILLER              PIC  X(20)  VALUE
               " AND TEKIYO_FROM <= ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *---------- SELECT SQL文(別紙1-9)
         05  WK-MSG-1-9.
           10  WK-MSG-TKMZKR00.
             15  FILLER            PIC  X(08)  VALUE
                 " TBL-ID(".
             15  WK-TBL-TKMZKR00   PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(15)  VALUE
                 " RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD    PIC  X(04).
             15  FILLER            PIC  X(16)  VALUE
                 "' AND FUND_CD ='".
             15  WK-FUND-CD        PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-PTF-CD         PIC  X(04).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND MEG_CD ='".
             15  WK-MEG-CD         PIC  X(15).
             15  FILLER            PIC  X(19)  VALUE
                 "' AND SEC_SBT_CD ='".
             15  WK-SEC-SBT-CD     PIC  X(04).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND TATE_FLG ='".
             15  WK-TATE-FLG       PIC  X(01).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND GYOKU_ID ='".
             15  WK-GYOKU-ID       PIC  X(10).
             15  FILLER            PIC  X(19)  VALUE
                 " AND TEKIYO_FROM = ".
             15  WK-TEKIYO-FROM    PIC  S9(08).
             15  FILLER            PIC  X(18)  VALUE
                 " AND RIB_YMD <> 0 ".
           10  WK-MSG-TKMZBW09.
             15  FILLER            PIC  X(08)  VALUE
                 " TBL-ID(".
             15  WK-TBL-TKMZBW09   PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(15)  VALUE
                 " RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD    PIC  X(04).
             15  FILLER            PIC  X(16)  VALUE
                 "' AND FUND_CD ='".
             15  WK-FUND-CD        PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-PTF-CD         PIC  X(04).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND MEG_CD ='".
             15  WK-MEG-CD         PIC  X(15).
             15  FILLER            PIC  X(19)  VALUE
                 "' AND SEC_SBT_CD ='".
             15  WK-SEC-SBT-CD     PIC  X(04).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND TATE_FLG ='".
             15  WK-TATE-FLG       PIC  X(01).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND GYOKU_ID ='".
             15  WK-GYOKU-ID       PIC  X(10).
             15  FILLER            PIC  X(19)  VALUE
                 " AND TEKIYO_FROM = ".
             15  WK-TEKIYO-FROM    PIC  S9(08).
             15  FILLER            PIC  X(17)  VALUE
                 " AND SYORI_YMD = ".
             15  WK-SYORI-YMD      PIC  S9(08).
             15  FILLER            PIC  X(16)  VALUE
                 " AND KIDOU_ID ='".
             15  WK-KIDOU-ID       PIC  X(04).
             15  FILLER            PIC  X(01)  VALUE
                 "'".
      *---------- SELECT SQL文(別紙1-10)
         05  WK-MSG-1-10.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW09     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *---------- 市場通貨コード
           10  FILLER              PIC  X(18)  VALUE
               "SET SIJO_TUKA_CD='".
           10  WK-SIJO-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 利払対象額面
           10  FILLER              PIC  X(14)  VALUE
               "RIB_TSHO_FACE=".
           10  WK-RIB-TSHO-FACE    PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨経過利息
           10  FILLER              PIC  X(14)  VALUE
               "SJTK_KEKA_RSK=".
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨源泉税
           10  FILLER              PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX=".
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- ファクター・連動係数
           10  FILLER              PIC  X(20)  VALUE
               "FACTOR_RENDOU_KESU='".
           10  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 未入金対象額面残高
           10  FILLER              PIC  X(19)  VALUE
               "MNK_TSHO_FACE_ZAN='".
           10  WK-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新日時
           10  FILLER              PIC  X(17)  VALUE
               "UPD_DATE=SYSDATE,".
      *---------- 更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)  VALUE
               "UPD_LOGIN_CMP_CD='".
           10  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新ユーザＩＤ
           10  FILLER              PIC  X(12)  VALUE
               "UPD_SID=' ',".
      *---------- 更新プログラムＩＤ
           10  FILLER              PIC  X(20)  VALUE
               "UPD_PGMID='SMZJ2120'".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(19)  VALUE
               " AND TEKIYO_FROM = ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               "' AND RIB_YMD = ".
           10  WK-RIB-YMD          PIC  S9(08).
           10  FILLER              PIC  X(17)  VALUE
               " AND SYORI_YMD = ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SELECT SQL文(別紙1-15)
         05  WK-MSG-1-15.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZZI00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(23)  VALUE
               "' AND KEIJOU_KIJUNBI > ".
           10  WK-KEIJOU-KIJUNBI1  PIC  S9(08).
           10  FILLER              PIC  X(23)  VALUE
               " AND KEIJOU_KIJUNBI <= ".
           10  WK-KEIJOU-KIJUNBI   PIC  S9(08).
      *---------- SELECT SQL文(別紙1-16)
         05  WK-MSG-1-16.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZZR00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(15)  VALUE
               " AND KJN_YMD = ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(33)  VALUE
               " AND KSN_YMD_DMN_KBN IN ('0','2')".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  SMZC3251 経過利息利払日計算ルーチン
       01  PARM-SMZC3251-INOUT.
           COPY  "SMZC3251.cpy".
      *----------  経過日数固定の経過利息利払日計算ルーチン
       01  PARM-SMZC3254-INOUT.
           COPY  "SMZC3254.cpy".
      *----------  SMZY1020 カレンダールーチン
       01  PARM-SCZY1020-INOUT.
           COPY  "SCZY1020.cpy".
      *----------  SMZC3250 経過利息計算ルーチン
       01  PARM-SMZC3250-INOUT.
           COPY  "SMZC3250.cpy".
      *----------  SMZC3260 経過利息普通計算ルーチン
       01  PARM-SMZC3260-INOUT.
           COPY  "SMZC3260.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
      *----------  リターンパッケージセットルーチンコピー句
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  異動計算項目端数処理ルーチン
       01  PARM-SMZC1501-INOUT.
           COPY  "SMZC1501.cpy".
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ2120-INOUT.
           COPY  "SMZJ2120.cpy".
       01  PARM-SMZJ2120-RTNPKG.
         05  PARM-SMZJ2120-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ2120-INOUT
                  PARM-SMZJ2120-RTNPKG.
      ******************************************************************
      *                 債券過去経過利息計算
      ******************************************************************
       BASE-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ2120処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ2120処理  正常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *                 3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBLID-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     WORK-AREA
      ******************* FLG-AREA                                      @SEINO@@
                          HST-AREA
                          SQL-AREA
                          E-MSG-TBL
                          PARM-SCZY1160-INOUT
                          PARM-SCZY1020-INOUT
                          PARM-SMZC3251-INOUT
                          PARM-SMZC3254-INOUT
                          PARM-SMZC3250-INOUT
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-RTNPKG
                          PARM-SMZJ2120-ARG2  OF  PARM-SMZJ2120-INOUT
                          PARM-SMZJ2120-RTNPKG
      *----初回コール時のみFLAG-AREAを初期化する                        @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":初回ＣＡＬＬ時のみフラグエリア２の初期化を行う"
      D    DISPLAY  CNS-PGM-ID":複数回起動チェック =[ "FIRST-SW "]"
      *-----------------------------------------------------------------
           IF  FIRST-SW = 'YES'                                         @SEINO@@
           THEN                                                         @SEINO@@
             INITIALIZE  FLG-AREA                                       @SEINO@@
             MOVE  'NO '                TO  FIRST-SW                    @SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":複数回起動チェック =[ "FIRST-SW "]"
      D    DISPLAY  CNS-PGM-ID":WORK-AREA        = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLG-AREA         = ["FLG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HST-AREA         = ["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA         = ["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL        = ["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT = ["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1020-INOUT = ["
      D             PARM-SCZY1020-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZC3251-INOUT = ["
      D             PARM-SMZC3251-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZC3250-INOUT = ["
      D             PARM-SMZC3250-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN = ["PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG= ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG = ["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2120-ARG2  = ["
      D             PARM-SMZJ2120-ARG2   OF  PARM-SMZJ2120-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2120-RTNPKG = ["
      D             PARM-SMZJ2120-RTNPKG"]"
      *-----------------------------------------------------------------
      *----------  銘柄別断面情報
           MOVE  TKMZBW03-PARM           OF  PARM-SMZJ2120-ARG1
             TO  WK-TKMZBW03-PARM        OF  WK-DATA-IN
      *----------  基準日断面情報
           MOVE  KYJ-YMD-DMN-INFO        OF  PARM-SMZJ2120-ARG1
             TO  WK-KYJ-YMD-DMN-INFO     OF  WK-DATA-IN
      *----------  通貨デフォールト端数処理
           MOVE  TUKA-DEF-HASU-SYRI-PARM
             OF  PARM-SMZJ2120-ARG1
             TO  WK-TUKA-DEF-HASU-SYRI-PARM
             OF  WK-DATA-IN
      *----------  銘柄属性データ
           MOVE  MEG-ZOKUSEI-DATA-PARM   OF  PARM-SMZJ2120-ARG1
             TO  WK-MEG-ZOKUSEI-DATA-PARM
             OF  WK-DATA-IN
      *----------  開始時残高数量残高（利付）
           MOVE  KAISIZN-SRYZN-RIT       OF  PARM-SMZJ2120-ARG1
             TO  WK-KAISIZN-SRYZN-RIT    OF  WK-DATA-IN
      *----------  市場通貨コード
           MOVE  SIJO-TUKA-CD            OF  PARM-SMZJ2120-ARG1
             TO  WK-SIJO-TUKA-CD         OF  WK-DATA-IN
      *----------  管理数量単位
           MOVE  KANRI-SURYO-TANI        OF  PARM-SMZJ2120-ARG1
             TO  WK-KANRI-SURYO-TANI     OF  WK-DATA-IN
      *----------  料率パターンコード
           MOVE  COMMISSION-PATTERN      OF  PARM-SMZJ2120-ARG1
             TO  WK-COMMISSION-PATTERN   OF  WK-DATA-IN
      *----------  約定ベース受渡順フラグ
           MOVE  YKJ-UKE-JUN-FLG         OF  PARM-SMZJ2120-ARG1
             TO  WK-YKJ-UKE-JUN-FLG      OF  WK-DATA-IN
      *----------  跨ぎ異動数量（利付）集計
           MOVE  MTGI-IDO-SURYO-SHUKE    OF  PARM-SMZJ2120-ARG1
             TO  WK-MTGI-IDO-SURYO-SHUKE
                                         OF  WK-DATA-IN
      *----------  利払日数
           MOVE  KEKA-NISU               OF  PARM-SMZJ2120-ARG1
             TO  WK-KEKA-NISU            OF  WK-DATA-IN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報            =["
      D             WK-TKMZBW03-PARM     OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面情報            =["
      D             WK-KYJ-YMD-DMN-INFO  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":通貨デフォールト端数処理  =["
      D             WK-TUKA-DEF-HASU-SYRI-PARM  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":銘柄属性データ            =["
      D             WK-MEG-ZOKUSEI-DATA-PARM    OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":開始時残高数量残高（利付）=["
      D             WK-KAISIZN-SRYZN-RIT  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["
      D             WK-SIJO-TUKA-CD       OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":管理数量単位=["
      D             WK-KANRI-SURYO-TANI   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":料率パターンコード=["
      D             WK-COMMISSION-PATTERN OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":約定ベース受渡順フラグ=["
      D             WK-YKJ-UKE-JUN-FLG    OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動数量（利付）集計=["
      D             WK-MTGI-IDO-SURYO-SHUKE
      D                                   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":利払日数=["
      D             WK-KEKA-NISU          OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.証券種別コード=["
      D             WK-SEC-SBT-CD         OF  WK-TKMZBW03-PARM
      D                                   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":銘柄属性データ.固定変動区分=["
      D             WK-FIX-VRBL-KBN       OF  WK-MEG-ZOKUSEI-DATA-PARM
      D                                   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":銘柄属性データ.連動係数参照区分=["
      D             WK-RENKSU-REF-KBN     OF  WK-MEG-ZOKUSEI-DATA-PARM
      D                                   OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           IF  (WK-SEC-SBT-CD        OF  WK-TKMZBW03-PARM
                                     OF  WK-DATA-IN  = CNS-SEC-SBT-CD-B)
           AND (WK-FIX-VRBL-KBN      OF  WK-MEG-ZOKUSEI-DATA-PARM
                                     OF  WK-DATA-IN  = CNS-FV-KBN-0)
           AND (WK-RENKSU-REF-KBN    OF  WK-MEG-ZOKUSEI-DATA-PARM
                                     OF  WK-DATA-IN  = CNS-RK-REF-KBN-2)
           THEN
             MOVE  CNS-FLG-1            TO  WK-MORTGAGE-FLG
           ELSE
             MOVE  CNS-FLG-0            TO  WK-MORTGAGE-FLG
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークモーケージ債フラグ = ["
      D             WK-MORTGAGE-FLG"]"
      *-----------------------------------------------------------------
           MOVE  CNS-RTN-000
             TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD  OF  PARM-SCZY1170-ARG1 = ["
      D             RTN-CD  OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  RIYO-CMP-CD             OF  PARM-SCZY1160-ARG1
      *----------  債券過去経過利息テーブル
           MOVE  CNS-TBL-TKMZKR00
             TO  TBL-ID                  OF  PARM-SCZY1160-ARG1(1)
      *----------  取引テーブル
           MOVE  CNS-TBL-TKMXTR00
             TO  TBL-ID                  OF  PARM-SCZY1160-ARG1(2)
      *----------  対象取引情報テーブル
           MOVE  CNS-TBL-TKMZBW04
             TO  TBL-ID                  OF  PARM-SCZY1160-ARG1(3)
      *----------  残高異動計算データテーブル
           MOVE  CNS-TBL-TKMZBW06
             TO  TBL-ID                  OF  PARM-SCZY1160-ARG1(4)
      *----------  債券過去経過利息計算データテーブル
           MOVE  CNS-TBL-TKMZBW09
             TO  TBL-ID                  OF  PARM-SCZY1160-ARG1(5)
      *----------  残高異動テーブル
           MOVE  CNS-TBL-TKMZZI00
             TO  TBL-ID                  OF  PARM-SCZY1160-ARG1(6)
      *----------  残高履歴テーブル
           MOVE  CNS-TBL-TKMZZR00
             TO  TBL-ID                  OF  PARM-SCZY1160-ARG1(7)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD  OF PARM-SCZY1160-ARG1=["
      D             RIYO-CMP-CD          OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(1)=["
      D             TBL-ID               OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(2)=["
      D             TBL-ID               OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(3)=["
      D             TBL-ID               OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(4)=["
      D             TBL-ID               OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(5)=["
      D             TBL-ID               OF  PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(6)=["
      D             TBL-ID               OF  PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(7)=["
      D             TBL-ID               OF  PARM-SCZY1160-ARG1(7)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"              USING   PARM-SCZY1160-INOUT
                                                 PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG          =["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ワーク債券過去経過利息テーブル
             MOVE  HENSYUGO-TBL-ID       OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKMZKR00       OF  WK-MSG-1-7,
                   WK-TBL-TKMZKR00       OF  WK-MSG-1-9,
                   WK-TBL-TKMZKR00       OF  WK-MSG-1-11,
                   WK-TBL-TKMZKR00       OF  WK-MSG-1-14,
                   SQL-TBL-TKMZKR00      OF  SQL-SELECT-1-7,
                   SQL-TBL-TKMZKR00      OF  SQL-SELECT-1-9,
                   SQL-TBL-TKMZKR00      OF  SQL-SELECT-1-11,
                   SQL-TBL-TKMZKR00      OF  SQL-SELECT-1-14
      *----------  ワーク取引テーブル
             MOVE  HENSYUGO-TBL-ID       OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TBL-TKMXTR00       OF  WK-MSG-1-5,
                   SQL-TBL-TKMXTR00      OF  SQL-SELECT-1-5
      *----------  ワーク対象取引情報テーブル
             MOVE  HENSYUGO-TBL-ID       OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TBL-TKMZBW04       OF  WK-MSG-1-4,
                   SQL-TBL-TKMZBW04      OF  SQL-SELECT-1-4
      *----------  ワーク残高異動計算データテーブル
             MOVE  HENSYUGO-TBL-ID       OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TBL-TKMZBW06       OF  WK-MSG-1-1,
                   SQL-TBL-TKMZBW06      OF  SQL-SELECT-1-1,
                   SQL-TBL-TKMZBW06      OF  SQL-SELECT-1-12
      *----------  ワーク債券過去経過利息計算データテーブル
             MOVE  HENSYUGO-TBL-ID       OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TBL-TKMZBW09       OF  WK-MSG-1-3,
                   WK-TBL-TKMZBW09       OF  WK-MSG-1-6,
                   WK-TBL-TKMZBW09       OF  WK-MSG-1-9,
                   WK-TBL-TKMZBW09       OF  WK-MSG-1-10,
                   WK-TBL-TKMZBW09       OF  WK-MSG-1-13,
                   SQL-TBL-TKMZBW09      OF  SQL-INSERT-1-3,
                   SQL-TBL-TKMZBW09      OF  SQL-SELECT-1-6,
                   SQL-TBL-TKMZBW09      OF  SQL-SELECT-1-9,
                   SQL-TBL-TKMZBW09      OF  SQL-UPDATE-1-10,
                   SQL-TBL-TKMZBW09      OF  SQL-SELECT-1-13
      *----------  ワーク残高異動テーブル
             MOVE  HENSYUGO-TBL-ID       OF  PARM-SCZY1160-ARG2(6)
               TO  WK-TBL-TKMZZI00       OF  WK-MSG-1-2,
                   SQL-TBL-TKMZZI00      OF  SQL-SELECT-1-2,
                   WK-TBL-TKMZZI00       OF  WK-MSG-1-15,
                   SQL-TBL-TKMZZI00      OF  SQL-SELECT-1-15
      *----------  ワーク残高履歴テーブル
             MOVE  HENSYUGO-TBL-ID       OF  PARM-SCZY1160-ARG2(7)
               TO  WK-TBL-TKMZZR00       OF  WK-MSG-1-16,
                   SQL-TBL-TKMZZR00      OF  SQL-SELECT-1-16
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク債券過去経過利息テーブル  =["
      D             WK-TBL-TKMZKR00      OF  WK-MSG-1-7"]"
      D    DISPLAY  CNS-PGM-ID":ワーク取引テーブル              =["
      D             WK-TBL-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク対象取引情報テーブル      =["
      D             WK-TBL-TKMZBW04"]"
      D    DISPLAY  CNS-PGM-ID":ワーク残高異動計算データテーブル=["
      D             WK-TBL-TKMZBW06      OF  WK-MSG-1-1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク債券過去経過利息計算データテーブル  =["
      D             WK-TBL-TKMZBW09      OF  WK-MSG-1-3"]"
      D    DISPLAY  CNS-PGM-ID":ワーク残高異動テーブル=["
      D             WK-TBL-TKMZZI00      OF  WK-MSG-1-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク残高異動テーブル=["
      D             WK-TBL-TKMZZI00      OF  WK-MSG-1-15"]"
      D    DISPLAY  CNS-PGM-ID":ワーク残高履歴テーブル=["
      D             WK-TBL-TKMZZR00      OF  WK-MSG-1-16"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得処理  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *                 3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  主処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.2.1.利払日計算の処理
           PERFORM  RIB-YMD-CALC-RTN
      *----------  3.2.2.入金取引計算の処理
           PERFORM  NYKI-TRHK-CALC-RTN
      *----------  3.2.3.債券過去経過利息の基準日計算の処理
           PERFORM  KJN-YMD-CALC-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1. 利払日計算の処理
      ******************************************************************
       RIB-YMD-CALC-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  利払日計算の処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ワーク利払日計算パッケージ.入力年月日
           MOVE  WK-KAISI-KJN-YMD-NEXT   OF  WK-KYJ-YMD-DMN-INFO
             TO  WK-IN-YMD               OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報．開始基準日の翌日=["
      D             WK-KAISI-KJN-YMD-NEXT   OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.入力年月日=["
      D             WK-IN-YMD            OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
      *----------  入力年月日の前月取得処理
           PERFORM  SCZY1020-3-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日=["
      D             WK-KJA-KJC-RIB-YMD"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報．基準日               =["
      D             WK-KJN-YMD           OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           MOVE  CNS-LOOP-ON             TO  WK-LOOP-FLG
           PERFORM  UNTIL  WK-KJA-KJC-RIB-YMD > WK-KJN-YMD OF WK-DATA-IN
                OR  WK-LOOP-FLG = CNS-LOOP-OFF
      *----------   ワーク休日調整後の次回利払日＜＝銘柄別断面情報．基準日の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日"
      D             "＜＝銘柄別断面情報．基準日の場合 LOOP処理  START"
      *-----------------------------------------------------------------
             MOVE  CNS-FLG-0             TO  WK-KEKA-RSK-CALC-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
      *----------  1）利払日の取得処理
             PERFORM  RIBAR-YMD-SHDK-RTN
             IF  WK-LOOP-FLG = CNS-LOOP-OFF
             THEN
               CONTINUE
             ELSE
      *----------  2) 経過利息を取得する
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
               IF  WK-KEKA-RSK-CALC-FLG  =  CNS-FLG-0
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類1=["
      D             WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利払日数=["
      D             WK-KEKA-NISU              OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  A)ARG1.利払日数＝0and (ワーク次回利払日種類1＝'4'（利払日）or　'5'（最終利払起算日）)の場合
                 IF WK-KEKA-NISU               OF  WK-DATA-IN = 
                    ZERO                       AND
                    (WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1 =
                    CNS-JIKAI-RBY-SYRU-4     OR
                    WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1 =
                    CNS-JIKAI-RBY-SYRU-5)
                 THEN
                   PERFORM  SMZC3260-RTN
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":経過利息を取得 START"
      *-----------------------------------------------------------------
                   INITIALIZE  WK-SMZC3250-PARM
      *----------  ワーク基準日
                   MOVE  ZERO
                     TO  WK-KJN-YMD        OF  WK-SMZC3250-PARM
      *----------  ワーク利払日From
                   MOVE  WK-ZENKAI-RIBAR-YMD-1
                                           OF  WK-RTN-CD-1
                     TO  WK-RIB-YMD-FROM   OF  WK-SMZC3250-PARM
      *----------  ワーク利払日To
                   MOVE  WK-JIKAI-RIBAR-YMD-1
                                           OF  WK-RTN-CD-1
                     TO  WK-RIB-YMD-TO     OF  WK-SMZC3250-PARM
      *----------  ワーク銘柄コード
                   MOVE  WK-MEG-CD         OF  WK-DATA-IN
                     TO  WK-MEG-CD         OF  WK-SMZC3250-PARM
      *----------  ワーク証券種別コード
                   MOVE  WK-SEC-SBT-CD     OF  WK-DATA-IN
                     TO  WK-SEC-SBT-CD     OF  WK-SMZC3250-PARM
      *----------  ワーク利用会社コード
                   MOVE  WK-RIYO-CMP-CD    OF  WK-DATA-IN
                     TO  WK-RIYO-CMP-CD    OF  WK-SMZC3250-PARM
      *----------  ワーク計算区分
                   MOVE  CNS-CALC-KBN-3
                     TO  WK-CALC-KBN       OF  WK-SMZC3250-PARM
      *----------  ワーク額面数量
                   MOVE  WK-RIT-SRY        OF  WK-RIBAR-YMD-CALC-PKG
                     TO  WK-FACE           OF  WK-SMZC3250-PARM
      *----------  ワークポジション
                   MOVE  CNS-POS-002       TO  WK-ERR-POS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク基準日    = ["
      D             WK-KJN-YMD           OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク利払日From= ["
      D             WK-RIB-YMD-FROM      OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク利払日To  = ["
      D             WK-RIB-YMD-TO        OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク銘柄コード= ["
      D             WK-MEG-CD            OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク証券種別コード= ["
      D             WK-SEC-SBT-CD        OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク利用会社コード= ["
      D             WK-RIYO-CMP-CD       OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク計算区分  = ["
      D             WK-CALC-KBN          OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク額面数量  = ["
      D             WK-FACE              OF  WK-SMZC3250-PARM"]"
      *-----------------------------------------------------------------
                   PERFORM  SMZC3250-2-RTN
      *----------  ワーク利払日計算パッケージ.市場通貨経過利息
                   MOVE  KEKA-RSK        OF  PARM-SMZC3250-ARG2
                     TO  WK-SJTK-KEKA-RSK
                                         OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.市場通貨源泉税
                   MOVE  GENSEN-TAX      OF  PARM-SMZC3250-ARG2
                     TO  WK-SJTK-GENSEN-TAX
                                         OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.ファクター・連動係数
                   MOVE  FACTOR-RENDOU-KESU
                                         OF  PARM-SMZC3250-ARG2
                     TO  WK-FACTOR-RENDOU-KESU
                                         OF  WK-RIBAR-YMD-CALC-PKG
                   IF  BIKOU-FLG    OF  PARM-SMZC3250-ARG1 NOT = CNS-X-0
                   THEN
      *----------  ワーク経過利息計算しないフラグ
                     MOVE  CNS-FLG-1     TO  WK-KEKA-RSK-CALC-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク経過利息計算しないフラグ  = ["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":ワーク利払日計算パッケージ.市場通貨経過利息= ["
      D            WK-SJTK-KEKA-RSK      OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY CNS-PGM-ID
      D            ":ワーク利払日計算パッケージ.市場通貨源泉税  = ["
      D            WK-SJTK-GENSEN-TAX    OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY CNS-PGM-ID
      D            ":ワーク利払日計算パッケージ.ファクター・連動係数=["
      D            WK-FACTOR-RENDOU-KESU OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":経過利息を取得 END"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
               IF  WK-KEKA-RSK-CALC-FLG  =  CNS-FLG-0
               THEN
      *----------  3) 経過利息、源泉税編集
                 PERFORM  KEKA-RSK-HENSYU-RTN
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
               IF  WK-KEKA-RSK-CALC-FLG  =  CNS-FLG-0
               THEN
      *----------  4)適用開始日再セット
                 PERFORM  TEKIYO-FROM-RESET-RTN
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
               IF  WK-KEKA-RSK-CALC-FLG  =  CNS-FLG-0
               THEN
      *----------  5)債券過去経過利息計算データINSERT処理
                 MOVE  CNS-POS-003       TO  WK-ERR-POS1
                 MOVE  CNS-POS-004       TO  WK-ERR-POS2
                 MOVE  CNS-POS-005       TO  WK-ERR-POS3
                 PERFORM  TKMZBW09-INSERT1-RTN
               ELSE
                 CONTINUE
               END-IF
      *----------  6)ワーク利払日計算パッケージ.入力年月日 ← SMZC3251戻り値.次回利払日の翌日
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日1            =["
      D             WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1"]"
      *-----------------------------------------------------------------
      *----------  ワーク基準年月日１
               MOVE  WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1
                 TO  WK-IXCAL-KJN-YMD1
                 OF  WK-SCZY1020-PARM
      *----------  ワーク前後区分1
               MOVE  CNS-IXCAL-ZENGO-KBN-1-1
                 TO  WK-IXCAL-ZENGO-KBN-1
                 OF  WK-SCZY1020-PARM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準年月日１=["
      D             WK-IXCAL-KJN-YMD1    OF  WK-SCZY1020-PARM"]"
      D    DISPLAY  CNS-PGM-ID":ワーク前後区分1   =["
      D             WK-IXCAL-ZENGO-KBN-1 OF  WK-SCZY1020-PARM"]"
      *-----------------------------------------------------------------
      *----------  カレンダールーチンをコールする
               PERFORM  SCZY1020-RTN
               IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
                =  CNS-RTN-000
      *----------  正常
               THEN
      *----------  ワーク利払日計算パッケージ.入力年月日← SCZY1020戻り値.基準年月日２
                 MOVE  IXCAL-KJN-YMD-2
                   OF  PARM-SCZY1020-ARG1
                   TO  WK-IN-YMD       OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カレンダールーチン  正常"
      D    DISPLAY  CNS-PGM-ID":SCZY1020戻り値.基準年月日２          =["
      D             IXCAL-KJN-YMD-2      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.入力年月日=["
      D             WK-IN-YMD            OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  エラー
                 MOVE  PARM-RTNPKG     TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-006
                   TO  ERR-POS         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-901
                   TO  RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
                   TO  DETAIL-RTN-CD   OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-0
                   TO  DETAIL-RTN-CD-FLG
                   OF PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 MOVE  SPACE
                   TO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カレンダールーチン  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名=["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション=["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード=["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード=["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ=["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
               END-IF
             END-IF
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  LOOP処理  END  ***"
      D    DISPLAY  CNS-PGM-ID  ":***  利払日計算の処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       RIB-YMD-CALC-EXT.
           EXIT.
      ******************************************************************
      *    カレンダールーチンをコールする
      ******************************************************************
       SCZY1020-3-RTN         SECTION.
            INITIALIZE  PARM-SCZY1020-INOUT
                       PARM-RTNPKG
      *----------  機能区分
            MOVE  CNS-IXCAL-FUNCTION-3
              TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *----------  基準年月日１ ← ワーク利払日計算パッケージ.入力年月日
            MOVE  WK-IN-YMD              OF  WK-RIBAR-YMD-CALC-PKG
              TO  IXCAL-KJN-YMD-1        OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
            MOVE  CNS-IXCAL-COMP-BASE-1
              TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *----------  前後区分1
            MOVE  CNS-IXCAL-ZENGO-KBN-1-2
              TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *---------- 単位区分
            MOVE  CNS-IXCAL-TANI-KBN-2
              TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *----------  日数
            MOVE  CNS-IXCAL-COMP-DAYS-1
              TO  IXCAL-DAYS             OF  PARM-SCZY1020-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１=["
      D             IXCAL-KJN-YMD1       OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分=["
      D             IXCAL-FUNCTION       OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分=["
      D             IXCAL-COMP-BASE      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１=["
      D             IXCAL-ZENGO-KBN-1    OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分=["
      D             IXCAL-TANI-KBN       OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数=["
      D             IXCAL-DAYS           OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":*** SCZY1020-3 "
      D             "カレンダールーチン START ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1020"              USING  PARM-SCZY1020-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SCZY1020 "
      D             "カレンダールーチン 正常 ***"
      *-----------------------------------------------------------------
      *----------  ワーク利払日計算パッケージ.入力年月日 ← SCZY1020リターンパッケージ.基準年月日２
             MOVE  IXCAL-KJN-YMD2        OF  PARM-SCZY1020-ARG1
               TO  WK-IN-YMD             OF  WK-RIBAR-YMD-CALC-PKG
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日２          =["
      D             IXCAL-KJN-YMD2       OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク利払日計算パッケージ.入力年月日"
      D         "=["WK-IN-YMD            OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-007
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SCZY1020 "
      D             "カレンダールーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY1020-2 "
      D             "カレンダールーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1020-3-EXT.
           EXIT.
      ******************************************************************
      *    1）利払日の取得処理
      ******************************************************************
       RIBAR-YMD-SHDK-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  利払日の取得処理 START  ***"
      D    DISPLAY  CNS-PGM-ID":利払日数             =["
      D             WK-KEKA-NISU         OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           IF  WK-KEKA-NISU              OF  WK-DATA-IN  = ZERO
      *----------  ARG1.利払日数＝0の場合
           THEN
              INITIALIZE  PARM-SMZC3251-INOUT
                          PARM-RTNPKG
                          WK-SMZC3251-PARM
      *----------  SMZC3251の入力年月日
              MOVE  WK-IN-YMD               OF  WK-RIBAR-YMD-CALC-PKG
                TO  WK-IN-YMD               OF  WK-SMZC3251-PARM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SMZC3251の入力年月日=["
      D             WK-IN-YMD            OF  WK-SMZC3251-PARM"]"
      *-----------------------------------------------------------------
      *----------  経過利息利払日計算ルーチンをコールする
              PERFORM  SMZC3251-RTN
      *----------  ワーク次回利払日種類1
              MOVE  JIKAI-RB-YMD-SYURUI       OF  PARM-SMZC3251-ARG2
                TO  WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1
      *----------  ワーク前回利払日1
              MOVE  ZENKAI-RIBAR-YMD          OF  PARM-SMZC3251-ARG2
                TO  WK-ZENKAI-RIBAR-YMD-1     OF  WK-RTN-CD-1
      *----------  ワーク次回利払日1
              MOVE  JIKAI-RIBAR-YMD           OF  PARM-SMZC3251-ARG2
                TO  WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1
      *----------  ワーク利払日計算パッケージ.次回利払日
              MOVE  JIKAI-RIBAR-YMD           OF  PARM-SMZC3251-ARG2
                TO  WK-JIKAI-RIBAR-YMD        OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類1=["
      D             WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク前回利払日1=["
      D             WK-ZENKAI-RIBAR-YMD-1     OF  WK-RTN-CD-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日1=["
      D             WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.次回利払日=["
      D             WK-JIKAI-RIBAR-YMD      OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ARG1.利払日数<>0の場合
              INITIALIZE  PARM-SMZC3254-INOUT
                          PARM-RTNPKG
                          WK-SMZC3254-PARM
      *----------  SMZC3254の入力年月日
              MOVE  WK-IN-YMD               OF  WK-RIBAR-YMD-CALC-PKG
                TO  WK-IN-YMD               OF  WK-SMZC3254-PARM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SMZC3254の入力年月日=["
      D             WK-IN-YMD            OF  WK-SMZC3254-PARM"]"
      *-----------------------------------------------------------------
      *----------  経過利息利払日計算ルーチンをコールする
              PERFORM  SMZC3254-RTN
      *----------  ワーク次回利払日種類1
              MOVE  JIKAI-RIBAR-SHRU          OF  PARM-SMZC3254-ARG2
                TO  WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1
      *----------  ワーク前回利払日1
              MOVE  ZENKAI-RIBAR-YMD          OF  PARM-SMZC3254-ARG2
                TO  WK-ZENKAI-RIBAR-YMD-1     OF  WK-RTN-CD-1
      *----------  ワーク次回利払日1
              MOVE  JIKAI-RIBAR-YMD           OF  PARM-SMZC3254-ARG2
                TO  WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1
      *----------  ワーク利払日計算パッケージ.次回利払日
              MOVE  JIKAI-RIBAR-YMD           OF  PARM-SMZC3254-ARG2
                TO  WK-JIKAI-RIBAR-YMD        OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類1=["
      D             WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク前回利払日1=["
      D             WK-ZENKAI-RIBAR-YMD-1     OF  WK-RTN-CD-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日1=["
      D             WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.次回利払日=["
      D             WK-JIKAI-RIBAR-YMD      OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
           END-IF
      *----------  B)ワーク次回利払日種類1＝'7':ZERO（なし）の場合
           IF WK-JIKAI-RB-YMD-SYURUI-1      OF  WK-RTN-CD-1 =
              CNS-JIKAI-RBY-SYRU-7
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類1=["
      D             WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1"]"
      *-----------------------------------------------------------------
      *----------  ワークループフラグ←'0'
             MOVE  CNS-LOOP-OFF        TO  WK-LOOP-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークループフラグ=["WK-LOOP-FLG"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  C)休日調整後の次回利払日取得処理
           IF  WK-LOOP-FLG = CNS-LOOP-OFF
           THEN
             CONTINUE
           ELSE
      *----------  ①ワーク休日区分編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類1        =["
      D             WK-JIKAI-RB-YMD-SYURUI-1       OF  WK-RTN-CD-1"]"
      *-----------------------------------------------------------------
             EVALUATE  WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1
               WHEN  CNS-JIKAI-RB-YMD-SYURUI-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":A)ワーク次回利払日種類1"
      D                 "＝'3':初期利払日の場合"
      *-----------------------------------------------------------------
      *----------  ワーク休日区分←ARG1.銘柄属性データ.初期利払日休日処理区分
               MOVE  WK-SHOKI-RB-YMD-QJT-KBN
                                       OF  WK-MEG-ZOKUSEI-DATA-PARM
                 TO  WK-KYUJITU-KBN
               WHEN  CNS-JIKAI-RB-YMD-SYURUI-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":B)ワーク次回利払日種類1"
      D                 "＝'6':終期利払日の場合"
      *-----------------------------------------------------------------
      *----------  ワーク休日区分←ARG1.銘柄属性データ.終期利払日休日処理区分
               MOVE  WK-SHUKI-RB-YMD-QJT-KBN
                                       OF  WK-MEG-ZOKUSEI-DATA-PARM
                 TO  WK-KYUJITU-KBN
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":C)ワーク次回利払日種類1"
      D                 "は上記以外の場合"
      *-----------------------------------------------------------------
      *----------  ワーク休日区分←ARG1.銘柄属性データ.利払日休日処理区分
               MOVE  WK-RIBAR-YMD-QJT-SR-KBN
                                       OF  WK-MEG-ZOKUSEI-DATA-PARM
                 TO  WK-KYUJITU-KBN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日区分= ["
      D             WK-KYUJITU-KBN"]"
      *-----------------------------------------------------------------
             EVALUATE  WK-KYUJITU-KBN
               WHEN  CNS-KYUJITU-KBN-2
      *----------  ②◆ワーク休日区分＝'2':前営業日の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":②◆ワーク休日区分＝'2':前営業日の場合"
      D    DISPLAY  CNS-PGM-ID":利払日の前営業日取得処理"
      *-----------------------------------------------------------------
                 PERFORM  SCZY1020-2-RTN
               WHEN  OTHER
      *----------   ◆ワーク休日調整後の次回利払日←ワーク次回利払日1
                 MOVE  WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1
                   TO  WK-KJA-KJC-RIB-YMD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日  =["
      D             WK-KJA-KJC-RIB-YMD"]"
      *-----------------------------------------------------------------
             END-EVALUATE
           END-IF
      *----------  E)ワーク休日調整後の次回利払日＞ARG1.銘柄別断面情報．基準日の場合
           IF  WK-LOOP-FLG = CNS-LOOP-OFF
           THEN
             CONTINUE
           ELSE
             IF   WK-KJA-KJC-RIB-YMD
               >  WK-KJN-YMD          OF  WK-DATA-IN
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日  =["
      D             WK-KJA-KJC-RIB-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報．基準日 =["
      D             WK-KJN-YMD          OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日＞ARG1.銘柄"
      D             "別断面情報．基準日の場合"
      *-----------------------------------------------------------------
      *----------  ワークループフラグ←'0'
                 MOVE  CNS-LOOP-OFF       TO  WK-LOOP-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークループフラグ=["WK-LOOP-FLG"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           END-IF
      *----------  F)ワーク休日調整後の次回利払日≦ARG1.銘柄別断面情報．基準日の場合
           IF  WK-LOOP-FLG = CNS-LOOP-OFF
           THEN
             CONTINUE
           ELSE
             IF WK-KJA-KJC-RIB-YMD  <=  WK-KJN-YMD  OF  WK-DATA-IN AND
                WK-KJA-KJC-RIB-YMD  >=  WK-KAISI-KJN-YMD-NEXT
                                    OF  WK-KYJ-YMD-DMN-INFO
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日  =["
      D             WK-KJA-KJC-RIB-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報．基準日 =["
      D             WK-KJN-YMD           OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報．開始基準日の翌日=["
      D             WK-KAISI-KJN-YMD-NEXT  OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日≦ARG1.銘柄"
      D             "別断面情報．基準日且つ ワーク休日調整後の次回利払"
      D             "日≧ARG1.基準日断面情報．開始基準日の翌日の場合"
      *-----------------------------------------------------------------
      *----------  (a)ワーク次回利払日種類1＝'1'(初期利払起算日)の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類1  =["
      D              WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1"]"
      *-----------------------------------------------------------------
               IF  WK-JIKAI-RB-YMD-SYURUI-1  OF  WK-RTN-CD-1 =
                   CNS-JIKAI-RBY-SYRU-1
               THEN
                 MOVE  CNS-FLG-1
                   TO  WK-KEKA-RSK-CALC-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データから利付き数量を取得"
      *-----------------------------------------------------------------
      *----------  あ)残高異動計算データから利付き数量を取得する
                 PERFORM  TKMZBW06-GET-RTN
      *----------  い)ワーク利払日計算パッケージ.利付き数量＜0の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY           OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
                 IF  WK-RIT-SRY           OF  WK-RIBAR-YMD-CALC-PKG
                  <  ZERO
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":い)ワーク利払日計算パッケージ."
      D             "利付き数量＜0の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-FLG-1     TO  WK-KEKA-RSK-CALC-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
             ELSE
               CONTINUE
             END-IF
           END-IF
      *----------  F)ワーク休日調整後の次回利払日<ARG1.銘柄別断面情報．基準日の場合
           IF  WK-LOOP-FLG = CNS-LOOP-OFF
           THEN
             CONTINUE
           ELSE
             IF WK-KJA-KJC-RIB-YMD
              < WK-KAISI-KJN-YMD-NEXT  OF  WK-KYJ-YMD-DMN-INFO
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日  =["
      D             WK-KJA-KJC-RIB-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報．開始基準日の翌日=["
      D             WK-KAISI-KJN-YMD-NEXT  OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払"
      D             "日<ARG1.基準日断面情報．開始基準日の翌日の場合"
      *-----------------------------------------------------------------
      *----------  ワーク経過利息計算しないフラグ
             MOVE  CNS-FLG-1           TO  WK-KEKA-RSK-CALC-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           END-IF
           CONTINUE.
       RIBAR-YMD-SHDK-EXT.
           EXIT.
      ******************************************************************
      *    経過利息利払日計算ルーチンをコールする
      ******************************************************************
       SMZC3251-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SMZC3251 "
      D             "経過利息利払日計算ルーチン START ***"
      *-----------------------------------------------------------------
      *----------  入力年月日
           MOVE  WK-IN-YMD               OF  WK-SMZC3251-PARM
             TO  IN-YMD                  OF  PARM-SMZC3251-ARG1
      *----------  初期利払起算日
           MOVE  WK-SHOKI-RIBAR-KS-YMD   OF  WK-DATA-IN
             TO  SHOKI-RIBAR-KS-YMD      OF  PARM-SMZC3251-ARG1
      *----------  初期利払日
           MOVE  WK-SHOKI-RIBAR-YMD      OF  WK-DATA-IN
             TO  SHOKI-RIBAR-YMD         OF  PARM-SMZC3251-ARG1
      *----------  最終利払起算日
           MOVE  WK-LAST-RIBAR-KISAN-YMD
             OF  WK-DATA-IN
             TO  LAST-RIBAR-KISAN-YMD    OF  PARM-SMZC3251-ARG1
      *----------  終期利払日
           MOVE  WK-SHUKI-RIBAR-YMD      OF  WK-DATA-IN
             TO  SHUKI-RIBAR-YMD         OF  PARM-SMZC3251-ARG1
      *----------  利払回数
           MOVE  WK-RIBAR-KAISU          OF  WK-DATA-IN
             TO  RIBAR-KAISU             OF  PARM-SMZC3251-ARG1
      *----------  利払日１
           MOVE  WK-RIBAR-YMD-1          OF  WK-DATA-IN
             TO  RIBAR-YMD-1             OF  PARM-SMZC3251-ARG1
      *----------  利払日２
           MOVE  WK-RIBAR-YMD-2          OF  WK-DATA-IN
             TO  RIBAR-YMD-2             OF  PARM-SMZC3251-ARG1
      *----------  利払日３
           MOVE  WK-RIBAR-YMD-3          OF  WK-DATA-IN
             TO  RIBAR-YMD-3             OF  PARM-SMZC3251-ARG1
      *----------  利払日４
           MOVE  WK-RIBAR-YMD-4          OF  WK-DATA-IN
             TO  RIBAR-YMD-4             OF  PARM-SMZC3251-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 入力年月日    = ["
      D             IN-YMD               OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 初期利払起算日= ["
      D             SHOKI-RIBAR-KS-YMD   OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 初期利払日    = ["
      D             SHOKI-RIBAR-YMD      OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 最終利払起算日= ["
      D             LAST-RIBAR-KISAN-YMD  OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 終期利払日    = ["
      D             SHUKI-RIBAR-YMD      OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払回数      = ["
      D             RIBAR-KAISU          OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払日１      = ["
      D             RIBAR-YMD-1          OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払日２      = ["
      D             RIBAR-YMD-2          OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払日３      = ["
      D             RIBAR-YMD-3          OF  PARM-SMZC3251-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払日４      = ["
      D             RIBAR-YMD-4          OF  PARM-SMZC3251-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZC3251"              USING  PARM-SMZC3251-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC3251)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             CONTINUE
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-008
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":経過利息利払日計算ルーチン  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           CONTINUE.
       SMZC3251-EXT.
           EXIT.
      ******************************************************************
      *    経過日数固定の経過利息利払日計算ルーチンをコールする
      ******************************************************************
       SMZC3254-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SMZC3254 "
      D             "経過日数固定の経過利息利払日計算ルーチン START ***"
      *-----------------------------------------------------------------
      *----------  入力年月日
           MOVE  WK-IN-YMD                   OF  WK-SMZC3254-PARM
             TO  IN-YMD                      OF  PARM-SMZC3254-ARG1
      *----------  初期利払起算日
           MOVE  WK-SHOKI-RIBAR-KS-YMD       OF  WK-DATA-IN
             TO  SHOKI-RIBAR-KISAN-YMD       OF  PARM-SMZC3254-ARG1
      *----------  最終利払起算日
           MOVE  WK-LAST-RIBAR-KISAN-YMD     OF  WK-DATA-IN
             TO  SAISHU-RIBAR-KISAN-YMD      OF  PARM-SMZC3254-ARG1
      *----------  終期利払日
           MOVE  WK-SHUKI-RIBAR-YMD          OF  WK-DATA-IN
             TO  SHUKI-RIBAR-YMD             OF  PARM-SMZC3254-ARG1
      *----------  初期利払日
           MOVE  WK-SHOKI-RIBAR-YMD          OF  WK-DATA-IN
             TO  SHOKI-RIBAR-YMD             OF  PARM-SMZC3254-ARG1
      *----------  利払日数
           MOVE  WK-KEKA-NISU                OF  WK-DATA-IN
             TO  KEKA-NISU                   OF  PARM-SMZC3254-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SMZC3254.ARG1.入力年月日             =["
      D             IN-YMD                   OF  PARM-SMZC3254-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SMZC3254.ARG1.初期利払起算日         =["
      D             SHOKI-RIBAR-KISAN-YMD    OF  PARM-SMZC3254-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SMZC3254.ARG1.最終利払起算日         =["
      D             SAISHU-RIBAR-KISAN-YMD   OF  PARM-SMZC3254-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SMZC3254.ARG1.終期利払日             =["
      D             SHUKI-RIBAR-YMD          OF  PARM-SMZC3254-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SMZC3254.ARG1.初期利払日             =["
      D             SHOKI-RIBAR-YMD          OF  PARM-SMZC3254-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SMZC3254.ARG1.利払日数               =["
      D             KEKA-NISU                OF  PARM-SMZC3254-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SMZC3254をコール START"
      *-----------------------------------------------------------------
           CALL  "SMZC3254"             USING  PARM-SMZC3254-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SMZC3254をコール END"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC3254)=["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-RTNPKG=["
      D             COUNTER             OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
          IF  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
              CONTINUE
                ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-097
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":経過日数固定の経過利息利払日計算"
      D                          "ルーチン  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           CONTINUE.
       SMZC3254-EXT.
           EXIT.
      ******************************************************************
      *        カレンダールーチン
      ******************************************************************
       SCZY1020-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** カレンダールーチン  START  ***"
      *-----------------------------------------------------------------
            INITIALIZE   PARM-SCZY1020-INOUT
                         PARM-RTNPKG
      *----------  基準年月日１
            MOVE  WK-IXCAL-KJN-YMD1
              TO  IXCAL-KJN-YMD-1        OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
            MOVE  CNS-IXCAL-COMP-BASE-1
              TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *----------  日数
            MOVE  CNS-IXCAL-COMP-DAYS-1
              TO  IXCAL-DAYS             OF  PARM-SCZY1020-ARG1
      *----------  単位区分
            MOVE  CNS-IXCAL-TANI-KBN-1
              TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *----------  機能区分
            MOVE  CNS-IXCAL-FUNCTION-3
              TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *----------  前後区分1
            MOVE  WK-IXCAL-ZENGO-KBN-1
              TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１         =["
      D             IXCAL-KJN-YMD-1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分       =["
      D             IXCAL-COMP-BASE      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数                 =["
      D             IXCAL-DAYS           OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分             =["
      D             IXCAL-TANI-KBN       OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分             =["
      D             IXCAL-FUNCTION       OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分1            =["
      D             IXCAL-ZENGO-KBN-1    OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY1020"             USING  PARM-SCZY1020-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)=["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1020-EXT.
           EXIT.
      ******************************************************************
      *    残高異動計算データから利付き数量を取得
      ******************************************************************
       TKMZBW06-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高異動計算データから利付き数量"
      D             "を取得  START ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCURSOR PREPARE  START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT15                                      @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZBW06-S,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-1
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZBW06-S,
                   WK-FUND-CD            OF  WK-MSG-1-1
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZBW06-S,
                   WK-PTF-CD             OF  WK-MSG-1-1
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZBW06-S,
                   WK-MEG-CD             OF  WK-MSG-1-1
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZBW06-S,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-1
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZBW06-S,
                   WK-TATE-FLG           OF  WK-MSG-1-1
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZBW06-S,
                   WK-GYOKU-ID           OF  WK-MSG-1-1
      *----------  受渡日
             MOVE  WK-JIKAI-RIBAR-YMD-1  OF  WK-RTN-CD-1
               TO  H-UKE-YMD             OF  H-TKMZBW06-S,
                   WK-UKE-YMD            OF  WK-MSG-1-1
      *----------  処理実行日
             MOVE  WK-SYORI-YMD          OF  WK-DATA-IN
               TO  H-SYORI-YMD           OF  H-TKMZBW06-S,
                   WK-SYORI-YMD          OF  WK-MSG-1-1
      *----------  起動ID
             MOVE  WK-KIDOU-ID           OF  WK-DATA-IN
               TO  H-KIDOU-ID            OF  H-TKMZBW06-S,
                   WK-KIDOU-ID           OF  WK-MSG-1-1
             MOVE  SQL-SELECT-1-1        TO  SQLSTMT15                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":受渡日                    =["
      D             H-UKE-YMD            OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":処理実行日                =["
      D             H-SYORI-YMD          OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                    =["
      D             H-KIDOU-ID           OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT15=[" SQLSTMT15 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW06-CR-OPEN =["
      D            FLG-TKMZBW06-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
             IF  FLG-TKMZBW06-CR-OPEN = CNS-OFF                         @SEINO@@
             THEN                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS1第一回"
      *-----------------------------------------------------------------
      *----------  残高異動計算データCURSOR PREPARE
             EXEC  SQL
               PREPARE  S1  FROM  :SQLSTMT15
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":残高異動計算データCURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-009
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                      =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZBW06_CUR  CURSOR  FOR  S1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動計算データCUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE                                                       @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             END-IF                                                     @SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZBW06_CUR
                 USING :H-TKMZBW06-S.H-RIYO-CMP-CD,
                       :H-TKMZBW06-S.H-FUND-CD,
                       :H-TKMZBW06-S.H-PTF-CD,
                       :H-TKMZBW06-S.H-MEG-CD,
                       :H-TKMZBW06-S.H-SEC-SBT-CD,
                       :H-TKMZBW06-S.H-TATE-FLG,
                       :H-TKMZBW06-S.H-GYOKU-ID,
                       :H-TKMZBW06-S.H-UKE-YMD,
                       :H-TKMZBW06-S.H-SYORI-YMD,
                       :H-TKMZBW06-S.H-KIDOU-ID
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動計算データCUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZBW06-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW06-CR-OPEN=["
      D             FLG-TKMZBW06-CR-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-010
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCURSOR OPEN END ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZBW06_CUR
               INTO  :H-TKMZBW06.H-IDOG-SRYZN-RIT,
                     :H-TKMZBW06.H-SIJO-TUKA-CD
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動計算データCUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-1.異動後数量残高（利付）=["
      D             H-IDOG-SRYZN-RIT     OF  H-TKMZBW06"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-1.市場通貨コード=["
      D             H-SIJO-TUKA-CD       OF  H-TKMZBW06"]"
      *-----------------------------------------------------------------
      *----------  ワーク利払日計算パッケージ.利付き数量
                 MOVE  H-IDOG-SRYZN-RIT  OF  H-TKMZBW06
                   TO  WK-RIT-SRY        OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.市場通貨コード
                 MOVE  H-SIJO-TUKA-CD    OF  H-TKMZBW06
                   TO  WK-SIJO-TUKA-CD   OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY           OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利払日計算パッケージ.市場通貨コード      =["
      D             WK-SIJO-TUKA-CD      OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR FETCH NOTFOUND"
      D    DISPLAY  CNS-PGM-ID":残高異動から利付き数量を取得する"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":IF-ELSE テースト"
      D    DISPLAY  CNS-PGM-ID":約定ベース受渡順フラグ=["
      D             WK-YKJ-UKE-JUN-FLG    OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
                 IF  WK-YKJ-UKE-JUN-FLG      OF  WK-DATA-IN
                   =  CNS-YKJ-UKE-JUN-FLG-1
                 THEN
                   PERFORM  TKMZZI00-GET-RTN
                 ELSE
                   PERFORM  TKMZZI00-GET1-RTN
                 END-IF
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-011
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-1      DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCURSOR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":*** 残高異動計算データCURSOR CLOSE START ***"     @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW06-CR-OPEN= ["               @SEINO@@
      *D*           FLG-TKMZBW06-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***    EXEC  SQL                                                  @SEINO@@
      ***      CLOSE TKMZBW06_CUR                                       @SEINO@@
      ***    END-EXEC                                                   @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"残高異動計算データ"                      @SEINO@@
      *D*           "CUR CLOSE SQLCODE=["SQLCODE"]"                     @SEINO@@
      *-----------------------------------------------------------------
      ***    IF  SQLCODE = CNS-SQL-NORMAL                               @SEINO@@
      ***    THEN                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR CLOSE  正常"   @SEINO@@
      *-----------------------------------------------------------------
      ***      MOVE  CNS-OFF             TO  FLG-TKMZBW06-CR-OPEN       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW06-CR-OPEN =["               @SEINO@@
      *D*           FLG-TKMZBW06-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***    ELSE                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR CLOSE  異常"   @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***      MOVE  CNS-PGM-ID                                         @SEINO@@
      ***        TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***      MOVE  CNS-POS-012                                        @SEINO@@
      ***        TO  ERR-POS             OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***      MOVE  CNS-RTN-900                                        @SEINO@@
      ***        TO  RTN-CD              OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***      MOVE  SQLCODE                                            @SEINO@@
      ***        TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***      MOVE  CNS-DETAIL-1                                       @SEINO@@
      ***        TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***      STRING  CNS-SQL-MSG-SELECT,                              @SEINO@@
      ***              WK-MSG-1-1        DELIMITED  BY  SIZE            @SEINO@@
      ***        INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***      PERFORM  ERR-RTN                                         @SEINO@@
      ***    END-IF                                                     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":***残高異動計算データCUR CLOSE END ***"@SEINO@@
      *-------------------<DEBUG>---------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID ":***残高異動計算データから利付き数量"
      D             "を取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW06-GET-EXT.
           EXIT.
      ******************************************************************
      *    残高異動から利付き数量を取得
      ******************************************************************
       TKMZZI00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高異動から利付き数量"
      D             "を取得  START ***"
      D    DISPLAY  CNS-PGM-ID":約定ベース受渡順フラグ= 1 "
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR PREPARE  START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT16                                      @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZZI00-S,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-2
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZZI00-S,
                   WK-FUND-CD            OF  WK-MSG-1-2
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZZI00-S,
                   WK-PTF-CD             OF  WK-MSG-1-2
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZZI00-S,
                   WK-MEG-CD             OF  WK-MSG-1-2
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZZI00-S,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-2
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZZI00-S,
                   WK-TATE-FLG           OF  WK-MSG-1-2
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZZI00-S,
                   WK-GYOKU-ID           OF  WK-MSG-1-2
      *----------  受渡日
             MOVE  WK-JIKAI-RIBAR-YMD-1  OF  WK-RTN-CD-1
               TO  H-UKE-YMD             OF  H-TKMZZI00-S,
                   WK-UKE-YMD            OF  WK-MSG-1-2
             STRING  SQL-SELECT-1-2,
                     CNS-ODBY-UKE-YMD,
                     CNS-ODBY-UPD-DATE,
                     CNS-ODBY-IDO-KJN  DELIMITED  BY  SIZE
               INTO  SQLSTMT16                                          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":受渡日                    =["
      D             H-UKE-YMD            OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT16=[" SQLSTMT16 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZZI00-CR-OPEN =["
      D            FLG-TKMZZI00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMZZI00-CR-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  対象取引情報(別紙1-5)CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS2第一回"
      *-----------------------------------------------------------------
      *----------  残高異動CURSOR PREPARE
             EXEC  SQL
               PREPARE  S2  FROM  :SQLSTMT16                            @3212SEINO@@
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":残高異動CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-013
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-2        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                      =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZZI00_CUR  CURSOR  FOR  S2
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZZI00_CUR
                 USING :H-TKMZZI00-S.H-RIYO-CMP-CD,
                       :H-TKMZZI00-S.H-FUND-CD,
                       :H-TKMZZI00-S.H-PTF-CD,
                       :H-TKMZZI00-S.H-MEG-CD,
                       :H-TKMZZI00-S.H-SEC-SBT-CD,
                       :H-TKMZZI00-S.H-TATE-FLG,
                       :H-TKMZZI00-S.H-GYOKU-ID,
                       :H-TKMZZI00-S.H-UKE-YMD
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZZI00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR-OPEN=["
      D             FLG-TKMZZI00-CR-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-014
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-2        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR OPEN END ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZZI00_CUR
               INTO  :H-TKMZZI00.H-IDOG-SRYZN-RIT,
                     :H-TKMZZI00.H-SIJO-TUKA-CD
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-2.異動後数量残高（利付）=["
      D             H-IDOG-SRYZN-RIT     OF  H-TKMZZI00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-2.市場通貨コード=["
      D             H-SIJO-TUKA-CD       OF  H-TKMZZI00"]"
      *-----------------------------------------------------------------
      *----------  ワーク利払日計算パッケージ.利付き数量
                 MOVE  H-IDOG-SRYZN-RIT  OF  H-TKMZZI00
                   TO  WK-RIT-SRY        OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.市場通貨コード
                 MOVE  H-SIJO-TUKA-CD    OF  H-TKMZZI00
                   TO  WK-SIJO-TUKA-CD   OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY           OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利払日計算パッケージ.市場通貨コード      =["
      D             WK-SIJO-TUKA-CD      OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
      *---------- 銘柄別断面情報.開始基準日の残高履歴を取得する (別紙1-16)
                 PERFORM  TKMZZR00-GET-RTN
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-015
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-2      DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR FETCH END ***"
      *    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      *             ":*** 残高異動CURSOR CLOSE START ***"               @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMZZI00-CR-OPEN= ["               @3212SEINO@@
      *             FLG-TKMZZI00-CR-OPEN "]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      EXEC  SQL                                                  @3212SEINO@@
      *        CLOSE TKMZZI00_CUR                                       @3212SEINO@@
      *      END-EXEC                                                   @3212SEINO@@
      *----------------------単体テスト專用-----------------------------@3212SEINO@@
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID"残高異動"                                @3212SEINO@@
      *             "CUR CLOSE SQLCODE=["SQLCODE"]"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      IF  SQLCODE = CNS-SQL-NORMAL                               @3212SEINO@@
      *      THEN                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":残高異動CURSOR CLOSE  正常"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *        MOVE  CNS-OFF             TO  FLG-TKMZZI00-CR-OPEN       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMZZI00-CR-OPEN =["               @3212SEINO@@
      *             FLG-TKMZZI00-CR-OPEN "]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      ELSE                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":残高異動CURSOR CLOSE  異常"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *        MOVE  CNS-PGM-ID                                         @3212SEINO@@
      *          TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *        MOVE  CNS-POS-016                                        @3212SEINO@@
      *          TO  ERR-POS             OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *        MOVE  CNS-RTN-900                                        @3212SEINO@@
      *          TO  RTN-CD              OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *        MOVE  SQLCODE                                            @3212SEINO@@
      *          TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *        MOVE  CNS-DETAIL-1                                       @3212SEINO@@
      *          TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *        STRING  CNS-SQL-MSG-SELECT,                              @3212SEINO@@
      *                WK-MSG-1-2        DELIMITED  BY  SIZE            @3212SEINO@@
      *          INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      *             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      *             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      *             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      *             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      *             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      *             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
      *        PERFORM  ERR-RTN                                         @3212SEINO@@
      *      END-IF                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID ":***残高異動CUR CLOSE END ***"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":***残高異動から利付き数量"
      D             "を取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-GET-EXT.
           EXIT.
      ******************************************************************
      *    銘柄別断面情報.開始基準日の残高履歴を取得 (別紙1-16)
      ******************************************************************
       TKMZZR00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 銘柄別断面情報.開始基準日の残高履歴"
      D             "を取得  START ***"
      D    DISPLAY  CNS-PGM-ID":*** 残高履歴 CURSOR PREPARE  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT17                                        @3212SEINO@@
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03-PARM
                                        OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKMZZR00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-16
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03-PARM
                                        OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKMZZR00-S,
                 WK-FUND-CD             OF  WK-MSG-1-16
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03-PARM
                                        OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKMZZR00-S,
                 WK-PTF-CD              OF  WK-MSG-1-16
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03-PARM
                                        OF  WK-DATA-IN
             TO  H-SEC-SBT-CD           OF  H-TKMZZR00-S,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-16
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03-PARM
                                        OF  WK-DATA-IN
             TO  H-MEG-CD               OF  H-TKMZZR00-S,
                 WK-MEG-CD              OF  WK-MSG-1-16
      *----------  資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG            OF  WK-TKMZBW03-PARM
                                        OF  WK-DATA-IN
             TO  H-TATE-FLG             OF  H-TKMZZR00-S,
                 WK-TATE-FLG            OF  WK-MSG-1-16
      *----------  玉ID
           MOVE  WK-GYOKU-ID            OF  WK-TKMZBW03-PARM
                                        OF  WK-DATA-IN
             TO  H-GYOKU-ID             OF  H-TKMZZR00-S,
                 WK-GYOKU-ID            OF  WK-MSG-1-16
      *----------  基準日
           MOVE  WK-KAISI-KJN-YMD       OF  WK-TKMZBW03-PARM
                                        OF  WK-DATA-IN
             TO  H-KJN-YMD              OF  H-TKMZZR00-S,
                 WK-KJN-YMD             OF  WK-MSG-1-16
           MOVE  SQL-SELECT-1-16        TO  SQLSTMT17                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD       OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD           OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD            OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD        OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD            OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID          OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":基準日                    =["
      D             H-KJN-YMD           OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT17=[" SQLSTMT17 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZZR00-CR-OPEN =["
      D            FLG-TKMZZR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZZR00-CR-OPEN = CNS-OFF                           @SEINO@@
           THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS16第一回"
      *-----------------------------------------------------------------
      *----------  残高履歴CURSOR PREPARE
           EXEC  SQL
             PREPARE  S16  FROM  :SQLSTMT17
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高履歴CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CUR PREPARE 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-017
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-16        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高履歴CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
           EXEC  SQL
             DECLARE  TKMZZR00_CUR  CURSOR  FOR  S16
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMZZR00_CUR
               USING :H-TKMZZR00-S.H-RIYO-CMP-CD,
                     :H-TKMZZR00-S.H-FUND-CD,
                     :H-TKMZZR00-S.H-PTF-CD,
                     :H-TKMZZR00-S.H-SEC-SBT-CD,
                     :H-TKMZZR00-S.H-MEG-CD,
                     :H-TKMZZR00-S.H-TATE-FLG,
                     :H-TKMZZR00-S.H-GYOKU-ID,
                     :H-TKMZZR00-S.H-KJN-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZZR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZR00-CR-OPEN=["
      D             FLG-TKMZZR00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-018
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-16        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高履歴CURSOR OPEN END ***"
      D    DISPLAY  CNS-PGM-ID":*** 残高履歴CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH TKMZZR00_CUR
             INTO  :H-TKMZZR00.H-SRYZN-RIT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-16.数量残高（利付）=["
      D             H-SRYZN-RIT         OF  H-TKMZZR00"]"
      *-----------------------------------------------------------------
      *----------  ワーク利払日計算パッケージ.利付き数量
               MOVE  H-SRYZN-RIT        OF  H-TKMZZR00
                 TO  WK-RIT-SRY         OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.市場通貨コード
               MOVE  WK-SIJO-TUKA-CD    OF  WK-DATA-IN
                 TO  WK-SIJO-TUKA-CD    OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY          OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利払日計算パッケージ.市場通貨コード      =["
      D             WK-SIJO-TUKA-CD     OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CURSOR FETCH NOTFOUND"
      *-----------------------------------------------------------------
      *----------  ワーク利払日計算パッケージ.利付き数量
               MOVE  ZERO
                 TO  WK-RIT-SRY         OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.市場通貨コード
               MOVE  WK-SIJO-TUKA-CD    OF  WK-DATA-IN
                 TO  WK-SIJO-TUKA-CD    OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY          OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利払日計算パッケージ.市場通貨コード      =["
      D             WK-SIJO-TUKA-CD     OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-019
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-16      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高履歴CURSOR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 残高履歴CURSOR CLOSE START ***"     @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FLG-TKMZZR00-CR-OPEN= ["                @SEINO@@
      *D*           FLG-TKMZZR00-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZZR00_CUR                                         @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"残高履歴CUR CLOSE SQLCODE=["SQLCODE"]"   @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":残高履歴CURSOR CLOSE  正常"             @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF              TO  FLG-TKMZZR00-CR-OPEN        @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZZR00-CR-OPEN =["               @SEINO@@
      *D*           FLG-TKMZZR00-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":残高履歴CURSOR CLOSE  異常"             @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-020                                          @SEINO@@
      ***      TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-16        DELIMITED  BY  SIZE             @SEINO@@
      ***      INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":***残高履歴CUR CLOSE END ***"          @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 銘柄別断面情報.開始基準日の残高履歴"
      D             "を取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-GET-EXT.
           EXIT.
      ******************************************************************
      *    経過利息計算ルーチンをコールする
      ******************************************************************
       SMZC3250-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SMZC3250 "
      D             "経過利息計算ルーチン START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZC3250-INOUT
                       PARM-RTNPKG
      *----------  基準日
           MOVE  WK-KJN-YMD              OF  WK-SMZC3250-PARM
             TO  KJN-YMD                 OF  PARM-SMZC3250-ARG1
      *----------  利払日From
           MOVE  WK-RIB-YMD-FROM         OF  WK-SMZC3250-PARM
             TO  RIB-YMD-FROM            OF  PARM-SMZC3250-ARG1
      *----------  利払日To
           MOVE  WK-RIB-YMD-TO           OF  WK-SMZC3250-PARM
             TO  RIB-YMD-TO              OF  PARM-SMZC3250-ARG1
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-SMZC3250-PARM
             TO  MEG-CD                  OF  PARM-SMZC3250-ARG1
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-SMZC3250-PARM
             TO  SEC-SBT-CD              OF  PARM-SMZC3250-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-SMZC3250-PARM
             TO  RIYO-CMP-CD             OF  PARM-SMZC3250-ARG1
      *----------  計算区分
           MOVE  WK-CALC-KBN             OF  WK-SMZC3250-PARM
             TO  CALC-KBN                OF  PARM-SMZC3250-ARG1
      *----------  額面数量
           MOVE  WK-FACE                 OF  WK-SMZC3250-PARM
             TO  FACE                    OF  PARM-SMZC3250-ARG1
      *----------  管理数量単位
           MOVE  WK-KANRI-SURYO-TANI     OF  WK-DATA-IN
             TO  KANRI-SURYO-TANI        OF  PARM-SMZC3250-ARG1
      *----------  通貨デフォールト端数処理.市場通貨小数点以下桁数
           MOVE  WK-BC-SYOSU-TENYIKA-KETASU
             OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  BC-SYOSU-TENYIKA-KETASU
             OF  PARM-SMZC3250-ARG1
      *----------  通貨デフォールト端数処理.市場通貨端数処理方法
           MOVE  WK-BC-HS                OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  BC-HS                   OF  PARM-SMZC3250-ARG1
      *----------  料率パターンコード
           MOVE  WK-COMMISSION-PATTERN   OF  WK-DATA-IN
             TO  COMMISSION-PATTERN      OF  PARM-SMZC3250-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 受渡日    = ["
      D             UKE-YMD              OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 基準日    = ["
      D             KJN-YMD              OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払日From= ["
      D             RIB-YMD-FROM         OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払日To  = ["
      D             RIB-YMD-TO           OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 銘柄コード= ["
      D             MEG-CD               OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 証券種別コード= ["
      D             SEC-SBT-CD           OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利用会社コード= ["
      D             RIYO-CMP-CD          OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 経過利息区分= ["
      D             KEKA-RSK-KBN         OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 計算区分  = ["
      D             CALC-KBN             OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 額面数量  = ["
      D             FACE                 OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":管理数量単位=["
      D             KANRI-SURYO-TANI     OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":通貨デフォールト端数処理.市場通貨小数点以下桁数=["
      D             BC-SYOSU-TENYIKA-KETASU  OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":通貨デフォールト端数処理.市場通貨端数処理方法=["
      D             BC-HS                OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":料率パターンコード=["
      D             COMMISSION-PATTERN   OF  PARM-SMZC3250-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZC3250"              USING  PARM-SMZC3250-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC3250)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
           WHEN  CNS-RTN-000
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3250経過利息計算ルーチン 正常 ***"
      *-----------------------------------------------------------------
             CONTINUE
           WHEN  CNS-RTN-112
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-112
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3250経過利息計算ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           WHEN  OTHER
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3250経過利息計算ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** SMZC3250経過利息計算ルーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZC3250-EXT.
           EXIT.
      ******************************************************************
      *    経過利息計算ルーチンをコールする
      ******************************************************************
       SMZC3250-2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SMZC3250 "
      D             "経過利息計算ルーチン START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZC3250-INOUT
                       PARM-RTNPKG
      *----------  基準日
           MOVE  WK-KJN-YMD              OF  WK-SMZC3250-PARM
             TO  KJN-YMD                 OF  PARM-SMZC3250-ARG1
      *----------  利払日From
           MOVE  WK-RIB-YMD-FROM         OF  WK-SMZC3250-PARM
             TO  RIB-YMD-FROM            OF  PARM-SMZC3250-ARG1
      *----------  利払日To
           MOVE  WK-RIB-YMD-TO           OF  WK-SMZC3250-PARM
             TO  RIB-YMD-TO              OF  PARM-SMZC3250-ARG1
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-SMZC3250-PARM
             TO  MEG-CD                  OF  PARM-SMZC3250-ARG1
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-SMZC3250-PARM
             TO  SEC-SBT-CD              OF  PARM-SMZC3250-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-SMZC3250-PARM
             TO  RIYO-CMP-CD             OF  PARM-SMZC3250-ARG1
      *----------  計算区分
           MOVE  WK-CALC-KBN             OF  WK-SMZC3250-PARM
             TO  CALC-KBN                OF  PARM-SMZC3250-ARG1
      *----------  額面数量
           MOVE  WK-FACE                 OF  WK-SMZC3250-PARM
             TO  FACE                    OF  PARM-SMZC3250-ARG1
      *----------  管理数量単位
           MOVE  WK-KANRI-SURYO-TANI     OF  WK-DATA-IN
             TO  KANRI-SURYO-TANI        OF  PARM-SMZC3250-ARG1
      *----------  通貨デフォールト端数処理.市場通貨小数点以下桁数
           MOVE  WK-BC-SYOSU-TENYIKA-KETASU
             OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  BC-SYOSU-TENYIKA-KETASU
             OF  PARM-SMZC3250-ARG1
      *----------  通貨デフォールト端数処理.市場通貨端数処理方法
           MOVE  WK-BC-HS                OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  BC-HS                   OF  PARM-SMZC3250-ARG1
      *----------  料率パターンコード
           MOVE  WK-COMMISSION-PATTERN   OF  WK-DATA-IN
             TO  COMMISSION-PATTERN      OF  PARM-SMZC3250-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 受渡日    = ["
      D             UKE-YMD              OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 基準日    = ["
      D             KJN-YMD              OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払日From= ["
      D             RIB-YMD-FROM         OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利払日To  = ["
      D             RIB-YMD-TO           OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 銘柄コード= ["
      D             MEG-CD               OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 証券種別コード= ["
      D             SEC-SBT-CD           OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利用会社コード= ["
      D             RIYO-CMP-CD          OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 経過利息区分= ["
      D             KEKA-RSK-KBN         OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 計算区分  = ["
      D             CALC-KBN             OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 額面数量  = ["
      D             FACE                 OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":管理数量単位=["
      D             KANRI-SURYO-TANI     OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":通貨デフォールト端数処理.市場通貨小数点以下桁数=["
      D             BC-SYOSU-TENYIKA-KETASU  OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":通貨デフォールト端数処理.市場通貨端数処理方法=["
      D             BC-HS                OF  PARM-SMZC3250-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":料率パターンコード=["
      D             COMMISSION-PATTERN   OF  PARM-SMZC3250-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZC3250"              USING  PARM-SMZC3250-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC3250)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
           WHEN  CNS-RTN-000
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3250経過利息計算ルーチン 正常 ***"
      *-----------------------------------------------------------------
             CONTINUE
           WHEN  CNS-RTN-112
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-112
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3250経過利息計算ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           WHEN  CNS-RTN-114
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-114
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3250経過利息計算ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           WHEN  OTHER
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3250経過利息計算ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** SMZC3250経過利息計算ルーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZC3250-2-EXT.
           EXIT.
      ******************************************************************
      *    経過利息普通計算ルーチンをコールする
      ******************************************************************
       SMZC3260-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SMZC3260 "
      D             "経過利息普通計算ルーチン START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZC3260-INOUT
                       PARM-RTNPKG
      *----------  基準日
           MOVE  WK-JIKAI-RIBAR-YMD-1    OF  WK-RTN-CD-1
             TO  KJN-YMD                 OF  PARM-SMZC3260-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  RIYO-CMP-CD             OF  PARM-SMZC3260-ARG1
      *----------  額面数量
           MOVE  WK-RIT-SRY              OF  WK-RIBAR-YMD-CALC-PKG
             TO  FACE                    OF  PARM-SMZC3260-ARG1
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-DATA-IN
             TO  MEG-CD                  OF  PARM-SMZC3260-ARG1
      *----------  管理数量単位
           MOVE  WK-KANRI-SURYO-TANI     OF  WK-DATA-IN
             TO  KANRI-SURYO-TANI        OF  PARM-SMZC3260-ARG1
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-DATA-IN
             TO  SEC-SBT-CD              OF  PARM-SMZC3260-ARG1
      *----------  通貨デフォールト端数処理.市場通貨小数点以下桁数
           MOVE  WK-BC-SYOSU-TENYIKA-KETASU
             OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  BC-SYOSU-TENYIKA-KETASU
             OF  PARM-SMZC3260-ARG1
      *----------  通貨デフォールト端数処理.市場通貨端数処理方法
           MOVE  WK-BC-HS                OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  BC-HS                   OF  PARM-SMZC3260-ARG1
      *----------  料率パターンコード
           MOVE  WK-COMMISSION-PATTERN   OF  WK-DATA-IN
             TO  COMMISSION-PATTERN      OF  PARM-SMZC3260-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 基準日    = ["
      D             KJN-YMD              OF  PARM-SMZC3260-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 利用会社コード= ["
      D             RIYO-CMP-CD          OF  PARM-SMZC3260-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 額面数量  = ["
      D             FACE                 OF  PARM-SMZC3260-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 銘柄コード= ["
      D             MEG-CD               OF  PARM-SMZC3260-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 管理数量単位= ["
      D             KANRI-SURYO-TANI     OF  PARM-SMZC3260-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 証券種別コード= ["
      D             SEC-SBT-CD           OF  PARM-SMZC3260-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":通貨デフォールト端数処理.市場通貨小数点以下桁数=["
      D             BC-SYOSU-TENYIKA-KETASU  OF  PARM-SMZC3260-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":通貨デフォールト端数処理.市場通貨端数処理方法=["
      D             BC-HS                OF  PARM-SMZC3260-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":料率パターンコード=["
      D             COMMISSION-PATTERN   OF  PARM-SMZC3260-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZC3260"              USING  PARM-SMZC3260-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC3260)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
           WHEN  CNS-RTN-000
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3260経過利息普通計算ルーチン 正常 ***"
      *-----------------------------------------------------------------
      *----------  ワーク利払日計算パッケージ.市場通貨経過利息
             MOVE  KEKA-RSK              OF  PARM-SMZC3260-ARG2
               TO  WK-SJTK-KEKA-RSK      OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.市場通貨源泉税
             MOVE  GENSEN-TAX            OF  PARM-SMZC3260-ARG2
               TO  WK-SJTK-GENSEN-TAX    OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.ファクター・連動係数
             MOVE  FACTOR-RENDOU-KESU    OF  PARM-SMZC3260-ARG2
               TO  WK-FACTOR-RENDOU-KESU OF  WK-RIBAR-YMD-CALC-PKG
             IF  BOND-FLG      OF  PARM-SMZC3260-ARG2  NOT =  CNS-X-0
             THEN
      *----------  ワーク経過利息計算しないフラグ
               MOVE  CNS-FLG-1           TO  WK-KEKA-RSK-CALC-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク経過利息計算しないフラグ  =["
      D             WK-KEKA-RSK-CALC-FLG"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利払日計算パッケージ.市場通貨経過利息= ["
      D             WK-SJTK-KEKA-RSK     OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利払日計算パッケージ.市場通貨源泉税  = ["
      D             WK-SJTK-GENSEN-TAX   OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利払日計算パッケージ.ファクター・連動係数=["
      D             WK-FACTOR-RENDOU-KESU   OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
           WHEN  CNS-RTN-112
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-021
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-112
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3260経過利息計算ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           WHEN  CNS-RTN-114
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-022
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-114
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3260経過利息計算ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           WHEN OTHER
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-023
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC3260経過利息普通計算ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** SMZC3260経過利息普通計算ルーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZC3260-EXT.
           EXIT.
      ******************************************************************
      *    経過利息、源泉税編集
      ******************************************************************
       KEKA-RSK-HENSYU-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 経過利息、源泉税編集 START ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利払日計算パッケージ.ファクター・連動係数=["
      D             WK-FACTOR-RENDOU-KESU OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワークモーケージ債フラグ =["
      D             WK-MORTGAGE-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-FACTOR-RENDOU-KESU      OF  WK-RIBAR-YMD-CALC-PKG
           NOT=  ZERO  AND  WK-MORTGAGE-FLG = CNS-FLG-0
           THEN
      *----------  A)ファクター・連動係数乗算
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.ファクター・"
      D             "連動係数≠0 and ワークモーケージ債フラグ=0の場合"
      *-----------------------------------------------------------------
      *----------  ワーク利払日計算パッケージ.市場通貨経過利息(中間)
             COMPUTE  WK-SJTK-KEKA-RSK-CHUKAN
                      OF  WK-RIBAR-YMD-CALC-PKG
                   =  WK-SJTK-KEKA-RSK      OF  WK-RIBAR-YMD-CALC-PKG
                   *  WK-FACTOR-RENDOU-KESU OF  WK-RIBAR-YMD-CALC-PKG
      *----------  ワーク利払日計算パッケージ.市場通貨源泉税(中間)
             COMPUTE  WK-SJTK-GENSEN-TAX-CHUKAN
                      OF  WK-RIBAR-YMD-CALC-PKG
                   =  WK-SJTK-GENSEN-TAX    OF  WK-RIBAR-YMD-CALC-PKG
                   *  WK-FACTOR-RENDOU-KESU OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":計算後ワーク利払日計算パッケージ.市場通貨経過利息(中間)= ["
      D    WK-SJTK-KEKA-RSK-CHUKAN       OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":計算後ワーク利払日計算パッケージ.市場通貨源泉税(中間)  = ["
      D    WK-SJTK-GENSEN-TAX-CHUKAN     OF  WK-RIBAR-YMD-CALC-PKG"]"
      *-----------------------------------------------------------------
      *----------  B)端数処理
             INITIALIZE  PARM-SMZC1501-INOUT
                         PARM-RTNPKG
      *----------  入力データ ← ワーク利払日計算パッケージ.市場通貨源泉税(中間)
             MOVE  WK-SJTK-GENSEN-TAX-CHUKAN
               OF  WK-RIBAR-YMD-CALC-PKG
               TO  IN-SUTI                 OF  PARM-SMZC1501-INOUT
      *----------  エラーポジション
             MOVE  CNS-POS-024          TO  WK-ERR-POS
             PERFORM  GENSEN-TAX-RTN
      *----------  端数処理後源泉税
             MOVE  OUT-SUTI              OF  PARM-SMZC1501-INOUT
               TO  WK-SJTK-GENSEN-TAX    OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":端数処理後源泉税               = ["
      D             WK-SJTK-GENSEN-TAX   OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID ":***  源泉税の端数処理  END  ***"
      *-----------------------------------------------------------------
             INITIALIZE  PARM-SMZC1501-INOUT
                         PARM-RTNPKG
      *----------  入力データ ← ワーク利払日計算パッケージ.市場通貨経過利息(中間)
             MOVE  WK-SJTK-KEKA-RSK-CHUKAN
               OF  WK-RIBAR-YMD-CALC-PKG
               TO  IN-SUTI                 OF  PARM-SMZC1501-INOUT
      *----------  エラーポジション
             MOVE  CNS-POS-025          TO  WK-ERR-POS
             PERFORM  KEKA-RSK-RTN
      *----------  端数処理後経過利息
             MOVE  OUT-SUTI              OF  PARM-SMZC1501-INOUT
               TO  WK-SJTK-KEKA-RSK      OF  WK-RIBAR-YMD-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":端数処理後経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-RIBAR-YMD-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID ":***  経過利息の端数処理  END  ***"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  経過利息、源泉税編集  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KEKA-RSK-HENSYU-EXT.
           EXIT.
      ******************************************************************
      *    適用開始日再セット
      ******************************************************************
       TEKIYO-FROM-RESET-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 適用開始日再セット START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日1            =["
      D             WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1"]"
      *-----------------------------------------------------------------
      *----------  ①ワーク更新用適用開始日←ワーク次回利払日1
           MOVE  WK-JIKAI-RIBAR-YMD-1      OF  WK-RTN-CD-1
             TO  WK-KSY-TEKIYO-FROM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク更新用適用開始日               =["
      D             WK-KSY-TEKIYO-FROM"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日区分= ["
      D             WK-KYUJITU-KBN"]"
      *-----------------------------------------------------------------
            IF  WK-KYUJITU-KBN          =  CNS-KYUJITU-KBN-2
            THEN
      *----------  ③◆ワーク休日区分＝'2':前営業日の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":③◆ワーク休日区分＝'2':前営業日の場合"
      D    DISPLAY  CNS-PGM-ID":利払日の前営業日取得処理"
      *-----------------------------------------------------------------
      *----------  ワーク更新用適用開始日 ← ワーク休日調整後の次回利払日
              MOVE  WK-KJA-KJC-RIB-YMD   TO  WK-KSY-TEKIYO-FROM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク更新用適用開始日               =["
      D             WK-KSY-TEKIYO-FROM"]"
      *-----------------------------------------------------------------
            ELSE
              CONTINUE
            END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  適用開始日再セット  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TEKIYO-FROM-RESET-EXT.
           EXIT.
      ******************************************************************
      *        源泉税の端数処理
      ******************************************************************
       GENSEN-TAX-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  源泉税の端数処理  START  ***"
      *-----------------------------------------------------------------
      *----------  通貨デフォールト端数処理 ← 通貨デフォールト端数処理
           MOVE  WK-TUKA-DEF-HASU-SYRI-PARM
             OF  WK-DATA-IN
             TO  TUKA-DEF-HASU-SYRI-PARM
             OF  PARM-SMZC1501-INOUT
      *----------  市場通貨／運用通貨区分 ← '1'
           MOVE  CNS-SJ-UY-TUKA-KBN-1
             TO  SIJO-UNYOU-TUKA-KBN     OF  PARM-SMZC1501-INOUT
      *----------  計算項目 ← '00'
           MOVE  CNS-CALC-KOUMO-00
             TO  CALC-KOUMO              OF  PARM-SMZC1501-INOUT
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":入力データ=["
      D             IN-SUTI              OF  PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":異動計算パターン=["
      D             YIDOU-CALC-PARM      OF  PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":通貨デフォールト端数処理=["
      D             TUKA-DEF-HASU-SYRI-PARM
      D                                  OF  PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":市場通貨／運用通貨区分=["
      D             SIJO-UNYOU-TUKA-KBN  OF  PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":計算項目        =["
      D             CALC-KOUMO           OF  PARM-SMZC1501-INOUT"]"
      *-----------------------------------------------------------------
      *---------- 異動計算項目端数処理ルーチンをコールする
           PERFORM  SMZC1501-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SMZC1501取得の出力データ=["
      D             OUT-SUTI             OF  PARM-SMZC1501-INOUT"]"
      *-----------------------------------------------------------------
           CONTINUE.
       GENSEN-TAX-EXT.
           EXIT.
      ******************************************************************
      *        経過利息の端数処理
      ******************************************************************
       KEKA-RSK-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  経過利息の端数処理  START  ***"
      *-----------------------------------------------------------------
      *----------  通貨デフォールト端数処理 ← 通貨デフォールト端数処理
           MOVE  WK-TUKA-DEF-HASU-SYRI-PARM
             OF  WK-DATA-IN
             TO  TUKA-DEF-HASU-SYRI-PARM
             OF  PARM-SMZC1501-INOUT
      *----------  市場通貨／運用通貨区分 ← '1'
           MOVE  CNS-SJ-UY-TUKA-KBN-1
             TO  SIJO-UNYOU-TUKA-KBN     OF  PARM-SMZC1501-INOUT
      *----------  計算項目 ← '00'
           MOVE  CNS-CALC-KOUMO-00
             TO  CALC-KOUMO              OF  PARM-SMZC1501-INOUT
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":入力データ=["
      D             IN-SUTI              OF  PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":異動計算パターン=["
      D             YIDOU-CALC-PARM      OF  PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":通貨デフォールト端数処理=["
      D             TUKA-DEF-HASU-SYRI-PARM
      D                                  OF  PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":市場通貨／運用通貨区分=["
      D             SIJO-UNYOU-TUKA-KBN  OF  PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":計算項目        =["
      D             CALC-KOUMO           OF  PARM-SMZC1501-INOUT"]"
      *-----------------------------------------------------------------
      *---------- 異動計算項目端数処理ルーチンをコールする
           PERFORM  SMZC1501-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SMZC1501取得の出力データ=["
      D             OUT-SUTI             OF  PARM-SMZC1501-INOUT"]"
      *-----------------------------------------------------------------
           CONTINUE.
       KEKA-RSK-EXT.
           EXIT.
      ******************************************************************
      *    異動計算項目端数処理ルーチンをコールする
      ******************************************************************
       SMZC1501-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SMZC1501 "
      D             "異動計算項目端数処理ルーチン START ***"
      *-----------------------------------------------------------------
           CALL  "SMZC1501"              USING  PARM-SMZC1501-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC1501)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SMZC1501 "
      D             "異動計算項目端数処理ルーチン 正常 ***"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SMZC1501 "
      D             "異動計算項目端数処理ルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SMZC1501 "
      D             "異動計算項目端数処理ルーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZC1501-EXT.
           EXIT.
      ******************************************************************
      *    カレンダールーチンをコールする
      ******************************************************************
       SCZY1020-2-RTN         SECTION.
           INITIALIZE  PARM-SCZY1020-INOUT
                       PARM-RTNPKG
      *----------  基準年月日１ ← SMZC3251戻り値．次回利払日
            MOVE  WK-JIKAI-RIBAR-YMD     OF  WK-RIBAR-YMD-CALC-PKG
              TO  IXCAL-KJN-YMD-1        OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
            MOVE  CNS-IXCAL-COMP-BASE-2
              TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *----------  機能区分
            MOVE  CNS-IXCAL-FUNCTION-4
              TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *----------  前後区分1
            MOVE  CNS-IXCAL-ZENGO-KBN-1-2
              TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１=["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分=["
      D             IXCAL-COMP-BASE      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分=["
      D             IXCAL-FUNCTION       OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１=["
      D             IXCAL-ZENGO-KBN-1    OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":*** SCZY1020-2 "
      D             "カレンダールーチン START ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1020"              USING  PARM-SCZY1020-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SCZY1020 "
      D             "カレンダールーチン 正常 ***"
      *-----------------------------------------------------------------
      *----------  ワーク休日調整後の次回利払日 ← SCZY1020リターンパッケージ.基準年月日２
             MOVE  IXCAL-KJN-YMD2        OF  PARM-SCZY1020-ARG1
               TO  WK-KJA-KJC-RIB-YMD
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日２          =["
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク休日調整後の次回利払日=["
      D             WK-KJA-KJC-RIB-YMD"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-026
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SCZY1020 "
      D             "カレンダールーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY1020-2 "
      D             "カレンダールーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1020-2-EXT.
           EXIT.
      ******************************************************************
      *         5)債券過去経過利息計算データINSERT処理
      ******************************************************************
       TKMZBW09-INSERT1-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***4)債券過去経過利息計算データ "
      D             "INSERT処理  START***"
      *-----------------------------------------------------------------
      *---------- 債券過去経過利息計算データINSERT処理（「別紙1-3 SQL説明」を参照）
           INITIALIZE  H-TKMZBW09-I
      *----------  処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-DATA-IN
             TO  H-SYORI-YMD             OF  H-TKMZBW09-I,
                 WK-SYORI-YMD            OF  WK-MSG-1-3
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-DATA-IN
             TO  H-KIDOU-ID              OF  H-TKMZBW09-I,
                 WK-KIDOU-ID             OF  WK-MSG-1-3,
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMZBW09-I,
                 H-UPD-LOGIN-CMP-CD      OF  H-TKMZBW09-I,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-DATA-IN
             TO  H-FUND-CD               OF  H-TKMZBW09-I,
                 WK-FUND-CD              OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-DATA-IN
             TO  H-PTF-CD                OF  H-TKMZBW09-I,
                 WK-PTF-CD               OF  WK-MSG-1-3
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-DATA-IN
             TO  H-SEC-SBT-CD            OF  H-TKMZBW09-I,
                 WK-SEC-SBT-CD           OF  WK-MSG-1-3
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-DATA-IN
             TO  H-MEG-CD                OF  H-TKMZBW09-I,
                 WK-MEG-CD               OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG             OF  WK-DATA-IN
             TO  H-TATE-FLG              OF  H-TKMZBW09-I,
                 WK-TATE-FLG             OF  WK-MSG-1-3
      *----------  玉ID
           MOVE  WK-GYOKU-ID             OF  WK-DATA-IN
             TO  H-GYOKU-ID              OF  H-TKMZBW09-I,
                 WK-GYOKU-ID             OF  WK-MSG-1-3
      *----------  適用開始日
           MOVE  WK-KSY-TEKIYO-FROM
             TO  H-TEKIYO-FROM           OF  H-TKMZBW09-I,
                 WK-TEKIYO-FROM          OF  WK-MSG-1-3
      *----------  利払日
           MOVE  WK-JIKAI-RIBAR-YMD-1    OF  WK-RTN-CD-1
             TO  H-RIB-YMD               OF  H-TKMZBW09-I,
                 WK-RIB-YMD              OF  WK-MSG-1-3
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD         OF  WK-RIBAR-YMD-CALC-PKG
             TO  H-SIJO-TUKA-CD          OF  H-TKMZBW09-I,
                 WK-SIJO-TUKA-CD         OF  WK-MSG-1-3
      *----------  利払対象額面
           MOVE  WK-RIT-SRY              OF  WK-RIBAR-YMD-CALC-PKG
             TO  H-RIB-TSHO-FACE         OF  H-TKMZBW09-I,
                 WK-RIB-TSHO-FACE        OF  WK-MSG-1-3
      *----------  市場通貨経過利息
           MOVE  WK-SJTK-KEKA-RSK        OF  WK-RIBAR-YMD-CALC-PKG
             TO  H-SJTK-KEKA-RSK         OF  H-TKMZBW09-I,
                 WK-SJTK-KEKA-RSK        OF  WK-MSG-1-3
      *----------  市場通貨源泉税
           MOVE  WK-SJTK-GENSEN-TAX      OF  WK-RIBAR-YMD-CALC-PKG
             TO  H-SJTK-GENSEN-TAX       OF  H-TKMZBW09-I,
                 WK-SJTK-GENSEN-TAX      OF  WK-MSG-1-3
      *----------  ファクター・連動係数
           MOVE  WK-FACTOR-RENDOU-KESU   OF  WK-RIBAR-YMD-CALC-PKG
             TO  H-FACTOR-RENDOU-KESU    OF  H-TKMZBW09-I,
                 WK-FACTOR-RENDOU-KESU   OF  WK-MSG-1-3
      *----------  未入金対象額面残高
           MOVE  WK-RIT-SRY              OF  WK-RIBAR-YMD-CALC-PKG
             TO  H-MNK-TSHO-FACE-ZAN     OF  H-TKMZBW09-I,
                 WK-MNK-TSHO-FACE-ZAN    OF  WK-MSG-1-3
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日  =["
      D             H-SYORI-YMD          OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":起動ID  =["
      D             H-KIDOU-ID           OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード    =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード    =["
      D             H-FUND-CD            OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD             OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD         OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD             OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ=["
      D             H-GYOKU-ID           OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":利払日=["
      D             H-RIB-YMD            OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["
      D             H-SIJO-TUKA-CD       OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":利払対象額面=["
      D             H-RIB-TSHO-FACE      OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息=["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数=["
      D             H-FACTOR-RENDOU-KESU OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象額面残高=["
      D             H-MNK-TSHO-FACE-ZAN  OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             H-UPD-LOGIN-CMP-CD   OF  H-TKMZBW09-I"]"
      *-----------------------------------------------------------------
           PERFORM  TKMZBW09-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***4)債券過去経過利息計算データ"
      D             "INSERT処理  END***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-INSERT1-EXT.
           EXIT.
      ******************************************************************
      *         債券過去経過利息計算データINSERT処理
      ******************************************************************
       TKMZBW09-INSERT2-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***債券過去経過利息計算データ "
      D             "INSERT処理  START***"
      *-----------------------------------------------------------------
      *---------- 債券過去経過利息計算データINSERT処理（「別紙1-8 SQL説明」を参照）
           INITIALIZE  H-TKMZBW09-I
      *----------  処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-DATA-IN
             TO  H-SYORI-YMD             OF  H-TKMZBW09-I,
                 WK-SYORI-YMD            OF  WK-MSG-1-3
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-DATA-IN
             TO  H-KIDOU-ID              OF  H-TKMZBW09-I,
                 WK-KIDOU-ID             OF  WK-MSG-1-3,
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMZBW09-I,
                 H-UPD-LOGIN-CMP-CD      OF  H-TKMZBW09-I,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-DATA-IN
             TO  H-FUND-CD               OF  H-TKMZBW09-I,
                 WK-FUND-CD              OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-DATA-IN
             TO  H-PTF-CD                OF  H-TKMZBW09-I,
                 WK-PTF-CD               OF  WK-MSG-1-3
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-DATA-IN
             TO  H-SEC-SBT-CD            OF  H-TKMZBW09-I,
                 WK-SEC-SBT-CD           OF  WK-MSG-1-3
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-DATA-IN
             TO  H-MEG-CD                OF  H-TKMZBW09-I,
                 WK-MEG-CD               OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG             OF  WK-DATA-IN
             TO  H-TATE-FLG              OF  H-TKMZBW09-I,
                 WK-TATE-FLG             OF  WK-MSG-1-3
      *----------  玉ID
           MOVE  WK-GYOKU-ID             OF  WK-DATA-IN
             TO  H-GYOKU-ID              OF  H-TKMZBW09-I,
                 WK-GYOKU-ID             OF  WK-MSG-1-3
      *----------  適用開始日
           MOVE  H-UKE-YMD               OF  H-TKMXTR00
             TO  H-TEKIYO-FROM           OF  H-TKMZBW09-I,
                 WK-TEKIYO-FROM          OF  WK-MSG-1-3
      *----------  利払日
           MOVE  WK-RIB-YMD
             OF  WK-CHZN-SAI-KAKUNIN
             TO  H-RIB-YMD               OF  H-TKMZBW09-I,
                 WK-RIB-YMD              OF  WK-MSG-1-3
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD
             OF  WK-CHZN-SAI-KAKUNIN
             TO  H-SIJO-TUKA-CD          OF  H-TKMZBW09-I,
                 WK-SIJO-TUKA-CD         OF  WK-MSG-1-3
      *----------  利払対象額面
           MOVE  WK-RIB-TSHO-FACE
             OF  WK-CHZN-SAI-KAKUNIN
             TO  H-RIB-TSHO-FACE         OF  H-TKMZBW09-I,
                 WK-RIB-TSHO-FACE        OF  WK-MSG-1-3
      *----------  市場通貨経過利息
           MOVE  WK-SJTK-KEKA-RSK        OF  WK-NKY-CALC-PKG
             TO  H-SJTK-KEKA-RSK         OF  H-TKMZBW09-I,
                 WK-SJTK-KEKA-RSK        OF  WK-MSG-1-3
      *----------  市場通貨源泉税
           MOVE  WK-SJTK-GENSEN-TAX      OF  WK-NKY-CALC-PKG
             TO  H-SJTK-GENSEN-TAX       OF  H-TKMZBW09-I,
                 WK-SJTK-GENSEN-TAX      OF  WK-MSG-1-3
      *----------  ファクター・連動係数
           MOVE  WK-FACTOR-RENDOU-KESU
             OF  WK-CHZN-SAI-KAKUNIN
             TO  H-FACTOR-RENDOU-KESU    OF  H-TKMZBW09-I,
                 WK-FACTOR-RENDOU-KESU   OF  WK-MSG-1-3
      *----------  未入金対象額面残高差
           COMPUTE  WK-MNK-TSHO-FACE-ZAN-SA
                 =  WK-MNK-TSHO-FACE-ZAN
                    OF  WK-CHZN-SAI-KAKUNIN -
                    H-KENRI-SURYO        OF  H-TKMXTR00
           IF  WK-MNK-TSHO-FACE-ZAN-SA < 0
           THEN
             MOVE  ZERO                  TO  WK-MNK-TSHO-FACE-ZAN-SA
           ELSE
             CONTINUE
           END-IF
      *----------  未入金対象額面残高
           MOVE  WK-MNK-TSHO-FACE-ZAN-SA
             TO  H-MNK-TSHO-FACE-ZAN     OF  H-TKMZBW09-I,
                 WK-MNK-TSHO-FACE-ZAN    OF  WK-MSG-1-3
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日  =["
      D             H-SYORI-YMD          OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":起動ID  =["
      D             H-KIDOU-ID           OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード    =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード    =["
      D             H-FUND-CD            OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD             OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD         OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD             OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ=["
      D             H-GYOKU-ID           OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":利払日=["
      D             H-RIB-YMD            OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["
      D             H-SIJO-TUKA-CD       OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":利払対象額面=["
      D             H-RIB-TSHO-FACE      OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息=["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数=["
      D             H-FACTOR-RENDOU-KESU OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象額面残高=["
      D             H-MNK-TSHO-FACE-ZAN  OF  H-TKMZBW09-I"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             H-UPD-LOGIN-CMP-CD   OF  H-TKMZBW09-I"]"
      *-----------------------------------------------------------------
           PERFORM  TKMZBW09-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***債券過去経過利息計算データ"
      D             "INSERT処理  END***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-INSERT2-EXT.
           EXIT.
      ******************************************************************
      *    TKMZBW09テーブルへの1件インサートする
      ******************************************************************
       TKMZBW09-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** TKMZBW09テーブルへの1件"
      D             "インサート処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT1                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-INSERT-1-3          TO  SQLSTMT1                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW09-S3-INSERT =["
      D            FLG-TKMZBW09-S3-INSERT"]"
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @SEINO@@
           IF  FLG-TKMZBW09-S3-INSERT = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS3第一回"
      *-----------------------------------------------------------------
           EXEC SQL
               PREPARE S3 FROM :SQLSTMT1
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "PREPARE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ PREPARE 正常"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
             MOVE  WK-ERR-POS1
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-3          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
           EXEC SQL
               EXECUTE S3
                 USING :H-TKMZBW09-I
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D         ":債券過去経過利息計算データINSERT SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW09-S3-INSERT      @SEINO@@
               CONTINUE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ INSERT  正常"
      *-----------------------------------------------------------------
      *----------  一意制約違反
             WHEN  CNS-SQL-UNIQUE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ INSERT "
      D             " 一意制約違反"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
               MOVE  WK-ERR-POS2
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-300
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-3        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ INSERT  異常"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
               MOVE  WK-ERR-POS3
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
              MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-3        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** TKMZBW09テーブルへの1件"
      D             "インサート処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2. 入金取引計算の処理
      ******************************************************************
       NYKI-TRHK-CALC-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  入金取引計算の処理  START  ***"
      *-----------------------------------------------------------------
      *----------  1）対象取引情報を取得する
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 対象取引情報"
      D                       "CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
      *---------- 処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-DATA-IN
             TO  H-SYORI-YMD             OF  H-TKMZBW04-S,
                 WK-SYORI-YMD            OF  WK-MSG-1-4
      *---------- 起動ID
           MOVE  WK-KIDOU-ID             OF  WK-DATA-IN
             TO  H-KIDOU-ID              OF  H-TKMZBW04-S,
                 WK-KIDOU-ID             OF  WK-MSG-1-4
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMZBW04-S,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-4
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-DATA-IN
             TO  H-FUND-CD               OF  H-TKMZBW04-S,
                 WK-FUND-CD              OF  WK-MSG-1-4
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-DATA-IN
             TO  H-PTF-CD                OF  H-TKMZBW04-S,
                 WK-PTF-CD               OF  WK-MSG-1-4
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD        OF  WK-DATA-IN
             TO  H-KAISI-KJN-YMD         OF  H-TKMZBW04-S,
                 WK-KAISI-KJN-YMD        OF  WK-MSG-1-4
      *----------  基準日
           MOVE  WK-KJN-YMD              OF  WK-DATA-IN
             TO  H-KJN-YMD               OF  H-TKMZBW04-S,
                 WK-KJN-YMD              OF  WK-MSG-1-4
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-DATA-IN
             TO  H-MEG-CD                OF  H-TKMZBW04-S,
                 WK-MEG-CD               OF  WK-MSG-1-4
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-DATA-IN
             TO  H-SEC-SBT-CD            OF  H-TKMZBW04-S,
                 WK-SEC-SBT-CD           OF  WK-MSG-1-4
      *----------  資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG             OF  WK-DATA-IN
             TO  H-TATE-FLG              OF  H-TKMZBW04-S,
                 WK-TATE-FLG             OF  WK-MSG-1-4
      *---------- 玉ID
           MOVE  WK-GYOKU-ID             OF  WK-DATA-IN
             TO  H-GYOKU-ID              OF  H-TKMZBW04-S,
                 WK-GYOKU-ID             OF  WK-MSG-1-4
           MOVE  SQL-SELECT-1-4          TO  SQLSTMT2                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":処理実行日=["
      D             H-SYORI-YMD          OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID=["
      D             H-KIDOU-ID           OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード=["
      D             H-FUND-CD            OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード=["
      D             H-PTF-CD             OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":開始基準日=["
      D             H-KAISI-KJN-YMD      OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":基準日=["
      D             H-KJN-YMD            OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード=["
      D             H-MEG-CD             OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード=["
      D             H-SEC-SBT-CD         OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID=["
      D             H-GYOKU-ID           OF  H-TKMZBW04-S"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT2=[" SQLSTMT2 "]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW04-CR-OPEN =["
      D            FLG-TKMZBW04-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZBW04-CR-OPEN = CNS-OFF                           @SEINO@@
           THEN                                                         @SEINO@@
      *----------  対象取引情報CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS4第一回"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S4  FROM  :SQLSTMT2                               @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":対象取引情報CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報 CUR PREPARE 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報 CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-027
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 対象取引情報 CURSOR PREPARE END ***"
      D    DISPLAY  CNS-PGM-ID":*** 対象取引情報 CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
           EXEC  SQL
             DECLARE  TKMZBW04_CUR  CURSOR  FOR  S4
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D        ":対象取引情報 CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMZBW04_CUR
               USING :H-TKMZBW04-S.H-SYORI-YMD,
                     :H-TKMZBW04-S.H-KIDOU-ID,
                     :H-TKMZBW04-S.H-RIYO-CMP-CD,
                     :H-TKMZBW04-S.H-FUND-CD,
                     :H-TKMZBW04-S.H-PTF-CD,
                     :H-TKMZBW04-S.H-KAISI-KJN-YMD,
                     :H-TKMZBW04-S.H-KJN-YMD,
                     :H-TKMZBW04-S.H-MEG-CD,
                     :H-TKMZBW04-S.H-SEC-SBT-CD,
                     :H-TKMZBW04-S.H-TATE-FLG,
                     :H-TKMZBW04-S.H-GYOKU-ID
           END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":対象取引情報CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON                TO  FLG-TKMZBW04-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報 CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-CR-OPEN=["
      D             FLG-TKMZBW04-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報 CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-028
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 対象取引情報  CURSOR OPEN END ***"
      *-----------------------------------------------------------------
      *----------  2）『対象取引情報データ』カーソルフェッチ
      *----------  CURSOR FETCH
           MOVE  CNS-ON                  TO  WK-FETCH-FLG
           PERFORM  UNTIL  WK-FETCH-FLG = CNS-OFF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 対象取引情報  CURSOR FETCH START ***"
      *-----------------------------------------------------------------
             EXEC SQL
               FETCH TKMZBW04_CUR
               INTO  :H-TKMZBW04
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":対象取引情報 CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報 CURSOR FETCH  正常"
      *-----------------------------------------------------------------
      *----------  ① 取引TBLから入金落日データを取得する
                 PERFORM  TKMXTR00-GET-RTN
               WHEN  CNS-SQL-NOTFOUND
                 MOVE  CNS-OFF           TO  WK-FETCH-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報 CURSOR FETCH  NOTFOUND"
      D    DISPLAY  CNS-PGM-ID":WK-FETCH-FLG=["WK-FETCH-FLG"]"
      *-----------------------------------------------------------------
                 CONTINUE
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報 CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-029
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-4      DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 対象取引情報 CURSOR FETCH END ***"
      *-----------------------------------------------------------------
      *----------  3）『対象取引情報データ』カーソルクローズ処理
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":*** 対象取引情報 CURSOR CLOSE START ***"@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW04-CR-OPEN= ["               @SEINO@@
      *D*           FLG-TKMZBW04-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZBW04_CUR                                         @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*         "対象取引情報CUR CLOSE SQLCODE=["SQLCODE"]"           @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":対象取引情報 CURSOR CLOSE  正常"        @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZBW04-CR-OPEN       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW04-CR-OPEN =["               @SEINO@@
      *D*           FLG-TKMZBW04-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":対象取引情報 CURSOR CLOSE  異常"        @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-030                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-4          DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":***対象取引情報 CURSOR CLOSE END ***"  @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID  ":***  入金取引計算の処理 正常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       NYKI-TRHK-CALC-EXT.
           EXIT.
      ******************************************************************
      *        取引TBLから入金落日データを取得する
      ******************************************************************
       TKMXTR00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  取引TBLから入金落日データを取得"
      D             "  START  ***"
      D    DISPLAY  CNS-PGM-ID ":*** 取引  CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT3                                         @3212SEINO@@
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMXTR00-S,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-5
      *----------  原取引ID
           MOVE  H-TORI-ID               OF  H-TKMZBW04
             TO  H-TORI-ID               OF  H-TKMXTR00-S,
                 WK-TORI-ID              OF  WK-MSG-1-5
           MOVE  SQL-SELECT-1-5          TO  SQLSTMT3                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D             H-RIYO-CMP-CD        OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":原取引ID      =["
      D             H-TORI-ID            OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT3=[" SQLSTMT3 "]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMXTR00-CR-OPEN =["
      D            FLG-TKMXTR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMXTR00-CR-OPEN = CNS-OFF                           @SEINO@@
           THEN                                                         @SEINO@@
      *----------  取引 CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS5第一回"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S5  FROM  :SQLSTMT3                               @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取引CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引 CURSOR PREPARE 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引 CURSOR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-031
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引 CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
           EXEC  SQL
             DECLARE  TKMXTR00_CUR  CURSOR  FOR  S5
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引 CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMXTR00_CUR
               USING :H-TKMXTR00-S.H-RIYO-CMP-CD,
                     :H-TKMXTR00-S.H-TORI-ID
           END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE           TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引 CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON                TO  FLG-TKMXTR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引 CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-OPEN=["
      D             FLG-TKMXTR00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引 CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-032
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引 CURSOR OPEN END ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH TKMXTR00_CUR
             INTO  :H-TKMXTR00
           END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引 CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引 CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.投資対象国コード=["
      D             H-TSTSK-CD           OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.権利数量=["
      D             H-KENRI-SURYO        OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.受渡日=["
      D             H-UKE-YMD            OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.効力発生日=["
      D             H-KOURYOKU-YMD       OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.約定金額（市場通貨換算額）=["
      D             H-S-KSG-G-YJKG       OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.現地源泉税（市場通貨換算額）=["
      D             H-S-KSG-G-GSZ        OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.国内源泉税（市場通貨換算額）=["
      D             H-S-KSG-U-GSZ        OF  H-TKMXTR00"]"
      *-----------------------------------------------------------------
      *----------  A)◇取得取引．効力発生日≠0の場合
               IF  H-KOURYOKU-YMD        OF  H-TKMXTR00 NOT = ZERO
               THEN
      *----------  a)ワーク入金日計算パッケージ.利払日（直前データ検索用）←取得取引．効力発生日
                 MOVE  H-KOURYOKU-YMD    OF  H-TKMXTR00
                   TO  WK-RIBAR-YMD      OF  WK-NKY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":別紙1-5.受渡日=["
      D             H-UKE-YMD            OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.効力発生日=["
      D             H-KOURYOKU-YMD       OF  H-TKMXTR00"]"
      *-----------------------------------------------------------------
      *----------  「別紙1-5 SQL説明」．効力発生日 ＞「別紙1-5 SQL説明」．受渡日
                 IF  H-KOURYOKU-YMD      OF  H-TKMXTR00   >
                     H-UKE-YMD           OF  H-TKMXTR00
                 THEN
      *----------  ワーク入金日計算パッケージ.適用開始日（直前データ検索用）←「別紙1-5 SQL説明」．効力発生日
                   MOVE  H-KOURYOKU-YMD  OF  H-TKMXTR00
                     TO  WK-TEKIYO-FROM  OF  WK-NKY-CALC-PKG
                 ELSE
      *----------  ワーク入金日計算パッケージ.適用開始日（直前データ検索用）←「別紙1-5 SQL説明」．受渡日
                   MOVE  H-UKE-YMD       OF  H-TKMXTR00
                     TO  WK-TEKIYO-FROM  OF  WK-NKY-CALC-PKG
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":ワーク入金日計算パッケージ.利払日（直前データ検索用）=["
      D             WK-RIBAR-YMD         OF  WK-NKY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク入金日計算パッケージ.適用開始日"
      D             "（直前データ検索用）=["
      D             WK-TEKIYO-FROM       OF  WK-NKY-CALC-PKG"]"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息データなしフラグ
                 MOVE  CNS-FLG-0         TO  WK-TKMZBW09-NO-DATA-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息データなしフラグ=["
      D             WK-TKMZBW09-NO-DATA-FLG"]"
      *-----------------------------------------------------------------
      *----------  b）直前の債券過去経過利息情報を取得
      *----------  3.5.直前の債券過去経過利息情報取得処理
                 PERFORM  KEKA-RSK-JOHO-RTN
               ELSE
                 CONTINUE
               END-IF
      *----------  B)取得取引．効力発生日＝0  または  債券過去経過利息データなしフラグ＝1の場合
               IF  H-KOURYOKU-YMD        OF  H-TKMXTR00  = ZERO  OR
                 WK-TKMZBW09-NO-DATA-FLG = CNS-FLG-1
               THEN
      *----------  ワーク終了フラグ←0
                 MOVE  CNS-FLG-0         TO  WK-END-FLG
      *----------  データ計数←0
                 MOVE  ZERO              TO  WK-DATA-CNT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      D    DISPLAY  CNS-PGM-ID":データ計数      =["WK-DATA-CNT"]"
      *-----------------------------------------------------------------
                 PERFORM  TKMZKR00-3-GET-RTN
                 MOVE  CNS-OFF           TO  WK-1-9-FETCH-FLG
                 PERFORM  TKMZKR00-FETCH-RTN  UNTIL
                   WK-END-FLG  NOT = ZERO OR WK-1-9-FETCH-FLG = CNS-ON
                 IF  WK-END-FLG = ZERO
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                   MOVE  CNS-PGM-ID
                     TO  ERR-PGM-ID      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-033
                     TO  ERR-POS         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-113
                     TO  RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE
                     TO  DETAIL-RTN-CD   OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-1
                     TO  DETAIL-RTN-CD-FLG
                     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                   MOVE  CNS-FREE-MSG
                     TO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  ワークスキップフラグ
                   MOVE  CNS-FLG-1       TO  WK-SKIP-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークスキップフラグ = ["WK-SKIP-FLG"]"
      *-----------------------------------------------------------------
                 ELSE
                   CONTINUE
                 END-IF
      ********** PERFORM  TKMZKR00-CLOSE-RTN                            @SEINO@@
               ELSE
                 CONTINUE
               END-IF
      *----------  C)経過利息、源泉税編集
               IF  WK-SKIP-FLG   =  CNS-FLG-1
               THEN
                 CONTINUE
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  経過利息、源泉税編集  START  ***"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.投資対象国コード=["
      D             H-TSTSK-CD           OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息確定."
      D             "市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息確定."
      D             "市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.約定金額（市場通貨換算額）=["
      D             H-S-KSG-G-YJKG       OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.現地源泉税（市場通貨換算額）=["
      D             H-S-KSG-G-GSZ        OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.国内源泉税（市場通貨換算額）=["
      D             H-S-KSG-U-GSZ        OF  H-TKMXTR00"]"
      *-----------------------------------------------------------------
      *----------  (a)引落処理
      *----------  ワーク入金日計算パッケージ.市場通貨経過利息
                 IF  H-TSTSK-CD          OF  H-TKMXTR00 = CNS-JPN
                 THEN
                   COMPUTE  WK-SJTK-KEKA-RSK    OF  WK-NKY-CALC-PKG
                         =  WK-SJTK-KEKA-RSK    OF  WK-CHZN-SAI-KAKUNIN
                         -  H-S-KSG-G-YJKG      OF  H-TKMXTR00
                         +  H-S-KSG-G-GSZ       OF  H-TKMXTR00
                         +  H-S-KSG-U-GSZ       OF  H-TKMXTR00
      *----------  ワーク入金日計算パッケージ.市場通貨源泉税
                   COMPUTE  WK-SJTK-GENSEN-TAX  OF  WK-NKY-CALC-PKG
                         =  WK-SJTK-GENSEN-TAX  OF  WK-CHZN-SAI-KAKUNIN
                         -  H-S-KSG-G-GSZ       OF  H-TKMXTR00
                         -  H-S-KSG-U-GSZ       OF  H-TKMXTR00
                 ELSE
                   COMPUTE  WK-SJTK-KEKA-RSK    OF  WK-NKY-CALC-PKG
                         =  WK-SJTK-KEKA-RSK    OF  WK-CHZN-SAI-KAKUNIN
                         -  H-S-KSG-G-YJKG      OF  H-TKMXTR00
                         +  H-S-KSG-G-GSZ       OF  H-TKMXTR00
      *----------  ワーク入金日計算パッケージ.市場通貨源泉税
                   COMPUTE  WK-SJTK-GENSEN-TAX  OF  WK-NKY-CALC-PKG
                         =  WK-SJTK-GENSEN-TAX  OF  WK-CHZN-SAI-KAKUNIN
                         -  H-S-KSG-G-GSZ       OF  H-TKMXTR00
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク入金日計算パッケージ.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK        OF  WK-NKY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク入金日計算パッケージ.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX      OF  WK-NKY-CALC-PKG"]"
      *-----------------------------------------------------------------
      *----------  (b)負数判定処理
      *----------  ワーク入金日計算パッケージ.市場通貨経過利息
               IF  WK-SJTK-KEKA-RSK         OF  WK-NKY-CALC-PKG  < 0  OR
                  (WK-MNK-TSHO-FACE-ZAN     OF  WK-CHZN-SAI-KAKUNIN
                   - H-KENRI-SURYO          OF  H-TKMXTR00 <= ZERO)
               THEN
                 MOVE  ZERO
                   TO  WK-SJTK-KEKA-RSK     OF  WK-NKY-CALC-PKG
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク入金日計算パッケージ.市場通貨源泉税
               IF  WK-SJTK-GENSEN-TAX       OF  WK-NKY-CALC-PKG  < 0  OR
                  (WK-MNK-TSHO-FACE-ZAN     OF  WK-CHZN-SAI-KAKUNIN
                   - H-KENRI-SURYO          OF  H-TKMXTR00 <= ZERO)
               THEN
                 MOVE  ZERO
                   TO  WK-SJTK-GENSEN-TAX   OF  WK-NKY-CALC-PKG
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク入金日計算パッケージ.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK        OF  WK-NKY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク入金日計算パッケージ.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX      OF  WK-NKY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID ":***  経過利息、源泉税編集  END  ***"
      *-----------------------------------------------------------------
      *----------  D）債券過去経過利息データUPDATE処理
               PERFORM  TKMZBW09-UPDATE-RTN
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引 CURSOR FETCH NOTFOUND"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-034
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-5        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  ワークスキップフラグ
               MOVE  CNS-FLG-1           TO  WK-SKIP-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークスキップフラグ = ["WK-SKIP-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引 CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-035
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-5        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引 CURSOR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 取引 CURSOR CLOSE START ***"        @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-OPEN= ["                @SEINO@@
      *D*           FLG-TKMXTR00-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMXTR00_CUR                                         @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":取引 CUR CLOSE SQLCODE=["SQLCODE"]"     @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":取引 CURSOR CLOSE  正常"                @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMXTR00-CR-OPEN       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMXTR00-CR-OPEN =["               @SEINO@@
      *D*           FLG-TKMXTR00-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":取引 CURSOR CLOSE  異常"                @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-036                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-5          DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":***取引 CURSOR CLOSE END ***"          @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D             ":***  取引TBLから入金落日データを取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-GET-EXT.
           EXIT.
      ******************************************************************
      *    入金日以前の債券過去経過利息データの利払日を取得する
      ******************************************************************
       TKMZKR00-3-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 入金日以前の債券過去経過利息データ"
      D             "の利払日を取得する  START ***"
      D    DISPLAY  CNS-PGM-ID ":(別紙1-9) CUR PREPARE  START"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMZKR00-S-3,
                 H-RIYO-CMP-CD           OF  H-TKMZBW09-S-2,
                 WK-RIYO-CMP-CD          OF  WK-MSG-TKMZKR00
                 OF  WK-MSG-1-9,
                 WK-RIYO-CMP-CD          OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-DATA-IN
             TO  H-FUND-CD               OF  H-TKMZKR00-S-3,
                 H-FUND-CD               OF  H-TKMZBW09-S-2,
                 WK-FUND-CD              OF  WK-MSG-TKMZKR00
                 OF  WK-MSG-1-9,
                 WK-FUND-CD              OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-DATA-IN
             TO  H-PTF-CD                OF  H-TKMZKR00-S-3,
                 H-PTF-CD                OF  H-TKMZBW09-S-2,
                 WK-PTF-CD               OF  WK-MSG-TKMZKR00
                 OF  WK-MSG-1-9,
                 WK-PTF-CD               OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-DATA-IN
             TO  H-MEG-CD                OF  H-TKMZKR00-S-3,
                 H-MEG-CD                OF  H-TKMZBW09-S-2,
                 WK-MEG-CD               OF  WK-MSG-TKMZKR00
                 OF  WK-MSG-1-9,
                 WK-MEG-CD               OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-DATA-IN
             TO  H-SEC-SBT-CD            OF  H-TKMZKR00-S-3,
                 H-SEC-SBT-CD            OF  H-TKMZBW09-S-2,
                 WK-SEC-SBT-CD           OF  WK-MSG-TKMZKR00
                 OF  WK-MSG-1-9,
                 WK-SEC-SBT-CD           OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG             OF  WK-DATA-IN
             TO  H-TATE-FLG              OF  H-TKMZKR00-S-3,
                 H-TATE-FLG              OF  H-TKMZBW09-S-2,
                 WK-TATE-FLG             OF  WK-MSG-TKMZKR00
                 OF  WK-MSG-1-9,
                 WK-TATE-FLG             OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  玉ID
           MOVE  WK-GYOKU-ID             OF  WK-DATA-IN
             TO  H-GYOKU-ID              OF  H-TKMZKR00-S-3,
                 H-GYOKU-ID              OF  H-TKMZBW09-S-2,
                 WK-GYOKU-ID             OF  WK-MSG-TKMZKR00
                 OF  WK-MSG-1-9,
                 WK-GYOKU-ID             OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  適用開始日
           MOVE  H-UKE-YMD               OF  H-TKMXTR00
             TO  H-TEKIYO-FROM           OF  H-TKMZKR00-S-3,
                 H-TEKIYO-FROM           OF  H-TKMZBW09-S-2,
                 WK-TEKIYO-FROM          OF  WK-MSG-TKMZKR00
                 OF  WK-MSG-1-9,
                 WK-TEKIYO-FROM          OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-DATA-IN
             TO  H-SYORI-YMD             OF  H-TKMZBW09-S-2,
                 WK-SYORI-YMD            OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-DATA-IN
             TO  H-KIDOU-ID              OF  H-TKMZBW09-S-2,
                 WK-KIDOU-ID             OF  WK-MSG-TKMZBW09
                 OF  WK-MSG-1-9
           MOVE  SQL-SELECT-1-9          TO  SQLSTMT4                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZKR00-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZKR00-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZKR00-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZKR00-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZKR00-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZKR00-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZKR00-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日                =["
      D             H-TEKIYO-FROM        OF  H-TKMZKR00-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード-S-2        =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード-S-2        =["
      D             H-FUND-CD            OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード-S-2  =["
      D             H-PTF-CD             OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード-S-2            =["
      D             H-MEG-CD             OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード-S-2        =["
      D             H-SEC-SBT-CD         OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ-S-2=["
      D             H-TATE-FLG           OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID-S-2                  =["
      D             H-GYOKU-ID           OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日-S-2            =["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":処理実行日                =["
      D             H-SYORI-YMD          OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                    =["
      D             H-KIDOU-ID           OF  H-TKMZBW09-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT4=[" SQLSTMT4 "]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZKR00-CR-3-OPEN =["
      D            FLG-TKMZKR00-CR-3-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZKR00-CR-3-OPEN = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
      *----------  CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS9第一回"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S9  FROM  :SQLSTMT4                               @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":(別紙1-9)CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9)CUR PREPARE 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9)CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-037
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9)CUR PREPARE END "
      D    DISPLAY  CNS-PGM-ID":(別紙1-9)CUR OPEN START "
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
           EXEC  SQL
             DECLARE  TKMZKR00_CUR_3  CURSOR  FOR  S9
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":(別紙1-9)CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMZKR00_CUR_3
               USING :H-TKMZKR00-S-3.H-RIYO-CMP-CD,
                     :H-TKMZKR00-S-3.H-FUND-CD,
                     :H-TKMZKR00-S-3.H-PTF-CD,
                     :H-TKMZKR00-S-3.H-MEG-CD,
                     :H-TKMZKR00-S-3.H-SEC-SBT-CD,
                     :H-TKMZKR00-S-3.H-TATE-FLG,
                     :H-TKMZKR00-S-3.H-GYOKU-ID,
                     :H-TKMZKR00-S-3.H-TEKIYO-FROM,
                     :H-TKMZBW09-S-2.H-RIYO-CMP-CD,
                     :H-TKMZBW09-S-2.H-FUND-CD,
                     :H-TKMZBW09-S-2.H-PTF-CD,
                     :H-TKMZBW09-S-2.H-MEG-CD,
                     :H-TKMZBW09-S-2.H-SEC-SBT-CD,
                     :H-TKMZBW09-S-2.H-TATE-FLG,
                     :H-TKMZBW09-S-2.H-GYOKU-ID,
                     :H-TKMZBW09-S-2.H-TEKIYO-FROM,
                     :H-TKMZBW09-S-2.H-SYORI-YMD,
                     :H-TKMZBW09-S-2.H-KIDOU-ID
           END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE           TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9)CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON                TO  FLG-TKMZKR00-CR-3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9) CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-CR-3-OPEN=["
      D             FLG-TKMZKR00-CR-3-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9) CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-038
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9)CUR OPEN END "
      D    DISPLAY  CNS-PGM-ID ":*** 入金日以前の債券過去経過利息データ"
      D             "の利払日を取得する  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-3-GET-EXT.
           EXIT.
      ******************************************************************
      *    入金日以前の債券過去経過利息データカーソルフェッチする
      ******************************************************************
       TKMZKR00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9)CUR FETCH START "
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH TKMZKR00_CUR_3
             INTO  :H-TKMZKR00-3.H-RIB-YMD
           END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"(別紙1-9) CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *----------  a)ワーク入金日計算パッケージ.利払日（直前データ検索用）←取得利払日
               MOVE  H-RIB-YMD         OF  H-TKMZKR00-3
                 TO  WK-RIBAR-YMD      OF  WK-NKY-CALC-PKG
      *----------  ワーク入金日計算パッケージ.適用開始日（直前データ検索用）←「別紙1-5 SQL説明」．受渡日
               MOVE  H-UKE-YMD         OF  H-TKMXTR00
                 TO  WK-TEKIYO-FROM    OF  WK-NKY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":ワーク入金日計算パッケージ.利払日（直前データ検索用）=["
      D             WK-RIBAR-YMD         OF  WK-NKY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-5.受渡日=["
      D             H-UKE-YMD            OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク入金日計算パッケージ.適用開始日"
      D       "（直前データ検索用）=["
      D             WK-TEKIYO-FROM       OF  WK-NKY-CALC-PKG"]"
      *-----------------------------------------------------------------
      *----------  b）直前の債券過去経過利息情報を取得
      *----------  3.5.直前の債券過去経過利息情報取得処理
               PERFORM  KEKA-RSK-JOHO-RTN
      *----------  c)ワーク直前債券過去経過利息確定.市場通貨経過利息≠0
      *---------- 又は ワーク直前債券過去経過利息確定.市場通貨源泉税≠0の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
               IF  WK-SJTK-KEKA-RSK      OF  WK-CHZN-SAI-KAKUNIN
                 NOT = ZERO  OR
                   WK-SJTK-GENSEN-TAX    OF  WK-CHZN-SAI-KAKUNIN
                 NOT = ZERO
               THEN
      *----------  ワーク終了フラグ←1
                 MOVE  CNS-FLG-1         TO  WK-END-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *----------  d)データ計数←データ計数＋１
               COMPUTE  WK-DATA-CNT = WK-DATA-CNT + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ計数      =["WK-DATA-CNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------  データ計数
               IF  WK-DATA-CNT = ZERO
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ計数      =["WK-DATA-CNT"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-039
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-113
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 MOVE  CNS-FREE-MSG
                   TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 MOVE  CNS-ON            TO  WK-1-9-FETCH-FLG
      *----------  ワーク終了フラグ←1
                 MOVE  CNS-FLG-1         TO  WK-END-FLG
      *----------  ワークスキップフラグ
                 MOVE  CNS-FLG-1         TO  WK-SKIP-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-1-9-FETCH-FLG=["WK-1-9-FETCH-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク終了フラグ     =["WK-END-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワークスキップフラグ =["WK-SKIP-FLG"]"
      *-----------------------------------------------------------------
               ELSE
                 MOVE  CNS-ON            TO  WK-1-9-FETCH-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-1-9-FETCH-FLG=["WK-1-9-FETCH-FLG"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9) CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-040
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-9        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": (別紙1-9)CUR FETCH END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    入金日以前の債券過去経過利息データカーソルクローズする
      ******************************************************************
      *TKMZKR00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-9) CUR CLOSE START "
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-3-OPEN= ["
      *             FLG-TKMZKR00-CR-3-OPEN "]"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *      CLOSE TKMZKR00_CUR_3
      *    END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID"(別紙1-9) CUR CLOSE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-9) CURSOR CLOSE  正常"
      *-----------------------------------------------------------------
      *      MOVE  CNS-OFF               TO  FLG-TKMZKR00-CR-3-OPEN
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-3-OPEN =["
      *             FLG-TKMZKR00-CR-3-OPEN "]"
      *-----------------------------------------------------------------
      *    ELSE
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-9) CURSOR CLOSE  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-041
      *        TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-9          DELIMITED  BY  SIZE
      *        INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      *             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      *             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      *             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      *             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      *             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      *             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID ":(別紙1-9) CUR CLOSE END "
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZKR00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *        債券過去経過利息データUPDATE処理
      ******************************************************************
       TKMZBW09-UPDATE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  債券過去経過利息データUPDATE処理 START ***"
      D    DISPLAY  CNS-PGM-ID ":(別紙1-10) CUR PREPARE  START"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT5                                         @3212SEINO@@
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD         OF  WK-CHZN-SAI-KAKUNIN
             TO  H-SIJO-TUKA-CD          OF  H-TKMZBW09-3,
                 WK-SIJO-TUKA-CD         OF  WK-MSG-1-10
      *----------  利払対象額面
           MOVE  WK-RIB-TSHO-FACE        OF  WK-CHZN-SAI-KAKUNIN
             TO  H-RIB-TSHO-FACE         OF  H-TKMZBW09-3,
                 WK-RIB-TSHO-FACE        OF  WK-MSG-1-10
      *----------  市場通貨経過利息
           MOVE  WK-SJTK-KEKA-RSK        OF  WK-NKY-CALC-PKG
             TO  H-SJTK-KEKA-RSK         OF  H-TKMZBW09-3,
                 WK-SJTK-KEKA-RSK        OF  WK-MSG-1-10
      *----------  市場通貨源泉税
           MOVE  WK-SJTK-GENSEN-TAX      OF  WK-NKY-CALC-PKG
             TO  H-SJTK-GENSEN-TAX       OF  H-TKMZBW09-3,
                 WK-SJTK-GENSEN-TAX      OF  WK-MSG-1-10
      *----------  ファクター・連動係数
           MOVE  WK-FACTOR-RENDOU-KESU   OF  WK-CHZN-SAI-KAKUNIN
             TO  H-FACTOR-RENDOU-KESU    OF  H-TKMZBW09-3,
                 WK-FACTOR-RENDOU-KESU   OF  WK-MSG-1-10
      *----------  未入金対象額面残高
           COMPUTE  H-MNK-TSHO-FACE-ZAN  OF  H-TKMZBW09-3
                 =  WK-MNK-TSHO-FACE-ZAN  OF  WK-CHZN-SAI-KAKUNIN -
                    H-KENRI-SURYO        OF  H-TKMXTR00
           IF  H-MNK-TSHO-FACE-ZAN       OF  H-TKMZBW09-3 < ZERO
           THEN
              MOVE  ZERO
                TO  H-MNK-TSHO-FACE-ZAN  OF  H-TKMZBW09-3
           ELSE
             CONTINUE
           END-IF
           MOVE  H-MNK-TSHO-FACE-ZAN     OF  H-TKMZBW09-3
             TO  WK-MNK-TSHO-FACE-ZAN    OF  WK-MSG-1-10
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  H-UPD-LOGIN-CMP-CD      OF  H-TKMZBW09-3,
                 WK-UPD-LOGIN-CMP-CD     OF  WK-MSG-1-10
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMZBW09-S-3,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-10
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-DATA-IN
             TO  H-FUND-CD               OF  H-TKMZBW09-S-3,
                 WK-FUND-CD              OF  WK-MSG-1-10
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-DATA-IN
             TO  H-PTF-CD                OF  H-TKMZBW09-S-3,
                 WK-PTF-CD               OF  WK-MSG-1-10
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-DATA-IN
             TO  H-MEG-CD                OF  H-TKMZBW09-S-3,
                 WK-MEG-CD               OF  WK-MSG-1-10
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-DATA-IN
             TO  H-SEC-SBT-CD            OF  H-TKMZBW09-S-3,
                 WK-SEC-SBT-CD           OF  WK-MSG-1-10
      *----------  資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG             OF  WK-DATA-IN
             TO  H-TATE-FLG              OF  H-TKMZBW09-S-3,
                 WK-TATE-FLG             OF  WK-MSG-1-10
      *----------  玉ＩＤ
           MOVE  WK-GYOKU-ID             OF  WK-DATA-IN
             TO  H-GYOKU-ID              OF  H-TKMZBW09-S-3,
                 WK-GYOKU-ID             OF  WK-MSG-1-10
      *----------  適用開始日
           MOVE  H-UKE-YMD               OF  H-TKMXTR00
             TO  H-TEKIYO-FROM           OF  H-TKMZBW09-S-3,
                 WK-TEKIYO-FROM          OF  WK-MSG-1-10
      *----------  利払日
           MOVE  WK-RIB-YMD              OF  WK-CHZN-SAI-KAKUNIN
             TO  H-RIB-YMD               OF  H-TKMZBW09-S-3,
                 WK-RIB-YMD              OF  WK-MSG-1-10
      *----------  処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-DATA-IN
             TO  H-SYORI-YMD             OF  H-TKMZBW09-S-3,
                 WK-SYORI-YMD            OF  WK-MSG-1-10
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-DATA-IN
             TO  H-KIDOU-ID              OF  H-TKMZBW09-S-3,
                 WK-KIDOU-ID             OF  WK-MSG-1-10
           MOVE  SQL-UPDATE-1-10         TO  SQLSTMT5                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":UPDATEデータ"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード               =["
      D             H-SIJO-TUKA-CD       OF  H-TKMZBW09-3"]"
      D    DISPLAY  CNS-PGM-ID":利払対象額面                 =["
      D             H-RIB-TSHO-FACE      OF  H-TKMZBW09-3"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息             =["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZBW09-3"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税               =["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZBW09-3"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数         =["
      D             H-FACTOR-RENDOU-KESU  OF  H-TKMZBW09-3"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象額面残高           =["
      D             H-MNK-TSHO-FACE-ZAN  OF  H-TKMZBW09-3"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード =["
      D             H-UPD-LOGIN-CMP-CD   OF  H-TKMZBW09-3"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":利用会社コード               =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード               =["
      D             H-FUND-CD            OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード         =["
      D             H-PTF-CD             OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード                   =["
      D             H-MEG-CD             OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード               =["
      D             H-SEC-SBT-CD         OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ   =["
      D             H-TATE-FLG           OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                       =["
      D             H-GYOKU-ID           OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日                   =["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":利払日                       =["
      D             H-RIB-YMD            OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":処理実行日                =["
      D             H-SYORI-YMD          OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                    =["
      D             H-KIDOU-ID           OF  H-TKMZBW09-S-3"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT5=["SQLSTMT5"]"                  @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW09-S10-UPDATE =["
      D            FLG-TKMZBW09-S10-UPDATE"]"
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @SEINO@@
           IF  FLG-TKMZBW09-S10-UPDATE = CNS-OFF                        @SEINO@@
           THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS10第一回"
      *-----------------------------------------------------------------
           EXEC  SQL  PREPARE  S10  FROM :SQLSTMT5  END-EXEC            @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-UPDATE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-UPDATE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-042
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-10         DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
           EXEC SQL
               EXECUTE S10
                 USING  :H-TKMZBW09-3.H-SIJO-TUKA-CD,
                        :H-TKMZBW09-3.H-RIB-TSHO-FACE,
                        :H-TKMZBW09-3.H-SJTK-KEKA-RSK,
                        :H-TKMZBW09-3.H-SJTK-GENSEN-TAX,
                        :H-TKMZBW09-3.H-FACTOR-RENDOU-KESU,
                        :H-TKMZBW09-3.H-MNK-TSHO-FACE-ZAN,
                        :H-TKMZBW09-3.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW09-S-3.H-RIYO-CMP-CD,
                        :H-TKMZBW09-S-3.H-FUND-CD,
                        :H-TKMZBW09-S-3.H-PTF-CD,
                        :H-TKMZBW09-S-3.H-MEG-CD,
                        :H-TKMZBW09-S-3.H-SEC-SBT-CD,
                        :H-TKMZBW09-S-3.H-TATE-FLG,
                        :H-TKMZBW09-S-3.H-GYOKU-ID,
                        :H-TKMZBW09-S-3.H-TEKIYO-FROM,
                        :H-TKMZBW09-S-3.H-RIB-YMD,
                        :H-TKMZBW09-S-3.H-SYORI-YMD,
                        :H-TKMZBW09-S-3.H-KIDOU-ID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":UPDATE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-UPDATE-SQL処理正常（UPDATE)"
      *-----------------------------------------------------------------
               MOVE  CNS-ON             TO  FLG-TKMZBW09-S10-UPDATE     @SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW09-S10-UPDATE =["
      D            FLG-TKMZBW09-S10-UPDATE"]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":TKMZBW09-UPDATE-SQL処理 NOTFOUND（UPDATE)"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息計算データINSERT処理
               MOVE  CNS-ON              TO  FLG-TKMZBW09-S10-UPDATE    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW09-S10-UPDATE =["
      D            FLG-TKMZBW09-S10-UPDATE"]"
      *-----------------------------------------------------------------
               MOVE  CNS-POS-043         TO  WK-ERR-POS1
               MOVE  CNS-POS-044         TO  WK-ERR-POS2
               MOVE  CNS-POS-045         TO  WK-ERR-POS3
               PERFORM  TKMZBW09-INSERT2-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-UPDATE-SQL処理エラー（UPDATE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-046
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-10       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  債券過去経過利息データUPDATE処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *        3.2.3. 債券過去経過利息の基準日計算の処理
      ******************************************************************
       KJN-YMD-CALC-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  債券過去経過利息の基準日計算"
      D             "の処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":***  基準日判断処理 START ***"
      D    DISPLAY  CNS-PGM-ID":利払日数             =["
      D             WK-KEKA-NISU         OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  1）基準日判断処理
           IF  WK-KEKA-NISU              OF  WK-DATA-IN  = ZERO
      *----------  ARG1.利払日数＝0の場合
           THEN
              INITIALIZE  PARM-SMZC3251-INOUT
                          PARM-RTNPKG
                          WK-SMZC3251-PARM
      *----------  ワークSMZC3251の入力年月日←ARG1.銘柄別断面情報.基準日
              MOVE  WK-KJN-YMD              OF  WK-DATA-IN
                TO  WK-IN-YMD               OF  WK-SMZC3251-PARM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークSMZC3251の入力年月日=["
      D             WK-IN-YMD            OF  WK-SMZC3251-PARM"]"
      *-----------------------------------------------------------------
      *----------  経過利息利払日計算ルーチンをコールする
              PERFORM  SMZC3251-RTN
      *----------  ワーク前回利払日種類2
              MOVE  ZENKAI-RB-YMD-SYURUI      OF  PARM-SMZC3251-ARG2
                TO  WK-ZENKAI-RB-YMD-SYURUI-2 OF  WK-RTN-CD-2
      *----------  ワーク次回利払日種類2
              MOVE  JIKAI-RB-YMD-SYURUI       OF  PARM-SMZC3251-ARG2
                TO  WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2
      *----------  ワーク前回利払日2
              MOVE  ZENKAI-RIBAR-YMD          OF  PARM-SMZC3251-ARG2
                TO  WK-ZENKAI-RIBAR-YMD-2     OF  WK-RTN-CD-2
      *----------  ワーク次回利払日2
              MOVE  JIKAI-RIBAR-YMD           OF  PARM-SMZC3251-ARG2
                TO  WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク前回利払日種類2=["
      D             WK-ZENKAI-RB-YMD-SYURUI-2 OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類2=["
      D             WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク前回利払日2=["
      D             WK-ZENKAI-RIBAR-YMD-2     OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日2=["
      D             WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ARG1.利払日数<>0の場合
              INITIALIZE  PARM-SMZC3254-INOUT
                          PARM-RTNPKG
                          WK-SMZC3254-PARM
      *----------  ワークSMZC3254の入力年月日←ARG1.銘柄別断面情報.基準日
              MOVE  WK-KJN-YMD              OF  WK-DATA-IN
                TO  WK-IN-YMD               OF  WK-SMZC3254-PARM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークSMZC3254の入力年月日=["
      D             WK-IN-YMD            OF  WK-SMZC3254-PARM"]"
      *-----------------------------------------------------------------
      *----------  経過日数固定の経過利息利払日計算ルーチンをコールする
              PERFORM  SMZC3254-RTN
      *----------  ワーク前回利払日種類2
              MOVE  ZENKAI-RIBAR-SHRU         OF  PARM-SMZC3254-ARG2
                TO  WK-ZENKAI-RB-YMD-SYURUI-2 OF  WK-RTN-CD-2
      *----------  ワーク次回利払日種類2
              MOVE  JIKAI-RIBAR-SHRU          OF  PARM-SMZC3254-ARG2
                TO  WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2
      *----------  ワーク前回利払日2
              MOVE  ZENKAI-RIBAR-YMD          OF  PARM-SMZC3254-ARG2
                TO  WK-ZENKAI-RIBAR-YMD-2     OF  WK-RTN-CD-2
      *----------  ワーク次回利払日2
              MOVE  JIKAI-RIBAR-YMD           OF  PARM-SMZC3254-ARG2
                TO  WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク前回利払日種類2=["
      D             WK-ZENKAI-RB-YMD-SYURUI-2 OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類2=["
      D             WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク前回利払日2=["
      D             WK-ZENKAI-RIBAR-YMD-2     OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日2=["
      D             WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":***  基準日判断処理 END ***"
      *-----------------------------------------------------------------
           END-IF
      *----------  2)ワーク基準日計算パッケージ編集処理
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***ワーク基準日計算パッケージ編集"
      D             "処理 START***"
      D    DISPLAY  CNS-PGM-ID":ワーク前回利払日種類2=["
      D             WK-ZENKAI-RB-YMD-SYURUI-2 OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日2    =["
      D             WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.基準日=["
      D             WK-KJN-YMD                OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類2=["
      D             WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2"]"
      *-----------------------------------------------------------------
           EVALUATE  (WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2)
             WHEN  CNS-JIKAI-RBY-SYRU-1
      *----------  計算方法
               MOVE  CNS-CALC-HOHO-1
                 TO  WK-CALC-HOHO        OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
               MOVE  CNS-ZZEN-RBY-FLG-0
                 TO  WK-ZZEN-RIBAR-YMD-FLG
                 OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":***ワーク基準日計算パッケージ編集"
      D             "処理 END***"
      *-----------------------------------------------------------------
             WHEN  CNS-JIKAI-RBY-SYRU-2
      *----------  計算方法
               MOVE  CNS-CALC-HOHO-2
                 TO  WK-CALC-HOHO        OF  WK-KJY-CALC-PKG
      *----------  前回利払日
               MOVE  WK-SHOKI-RIBAR-KS-YMD
                 OF  WK-DATA-IN
                 TO  WK-ZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
               MOVE  CNS-ZZEN-RBY-FLG-0
                 TO  WK-ZZEN-RIBAR-YMD-FLG
                 OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
             WHEN  CNS-JIKAI-RBY-SYRU-3
               IF  WK-JIKAI-RIBAR-YMD-2  OF  WK-RTN-CD-2  NOT  =
                   WK-KJN-YMD            OF  WK-DATA-IN
               THEN
      *----------  計算方法
                 MOVE  CNS-CALC-HOHO-2
                   TO  WK-CALC-HOHO      OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                 MOVE  WK-SHOKI-RIBAR-KS-YMD
                   OF  WK-DATA-IN
                   TO  WK-ZEN-RIBAR-YMD  OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                 MOVE  CNS-ZZEN-RBY-FLG-0
                   TO  WK-ZZEN-RIBAR-YMD-FLG
                   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
               ELSE
      *----------  計算方法
                 MOVE  CNS-CALC-HOHO-4
                   TO  WK-CALC-HOHO      OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                 MOVE  WK-SHOKI-RIBAR-YMD
                   OF  WK-DATA-IN
                   TO  WK-ZEN-RIBAR-YMD  OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                 MOVE  CNS-ZZEN-RBY-FLG-0
                   TO  WK-ZZEN-RIBAR-YMD-FLG
                   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
               END-IF
             WHEN  CNS-JIKAI-RBY-SYRU-4
               EVALUATE  (WK-ZENKAI-RB-YMD-SYURUI-2 OF  WK-RTN-CD-2)
                 WHEN  CNS-ZENKAI-RB-YMD-SYURUI-3
                   IF  WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2  NOT  =
                       WK-KJN-YMD                OF  WK-DATA-IN
                   THEN
      *----------  計算方法
                     MOVE  CNS-CALC-HOHO-2
                       TO  WK-CALC-HOHO  OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                     MOVE  WK-SHOKI-RIBAR-YMD
                       OF  WK-DATA-IN
                       TO  WK-ZEN-RIBAR-YMD
                       OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                     MOVE  CNS-ZZEN-RBY-FLG-0
                       TO  WK-ZZEN-RIBAR-YMD-FLG
                       OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                 WHEN  CNS-ZENKAI-RB-YMD-SYURUI-4
                   IF  WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2  NOT  =
                       WK-KJN-YMD                OF  WK-DATA-IN
                   THEN
      *----------  計算方法
                     MOVE  CNS-CALC-HOHO-2
                       TO  WK-CALC-HOHO  OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                     MOVE  WK-ZENKAI-RIBAR-YMD-2
                       OF  WK-RTN-CD-2
                       TO  WK-ZEN-RIBAR-YMD
                       OF  WK-KJY-CALC-PKG
      *----------  前々回利払日
                     MOVE  WK-ZENKAI-RIBAR-YMD-2
                       OF  WK-RTN-CD-2
                       TO  WK-ZZEN-RIBAR-YMD
                       OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                     MOVE  CNS-ZZEN-RBY-FLG-1
                       TO  WK-ZZEN-RIBAR-YMD-FLG
                       OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日計算パッケージ.前々回利払日        =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
                   ELSE
      *----------  計算方法
                     MOVE  CNS-CALC-HOHO-4
                       TO  WK-CALC-HOHO  OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                     MOVE  WK-ZENKAI-RIBAR-YMD-2
                       OF  WK-RTN-CD-2
                       TO  WK-ZEN-RIBAR-YMD
                       OF  WK-KJY-CALC-PKG
      *----------  前々回利払日
                     MOVE  WK-ZENKAI-RIBAR-YMD-2
                       OF  WK-RTN-CD-2
                       TO  WK-ZZEN-RIBAR-YMD
                       OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                     MOVE  CNS-ZZEN-RBY-FLG-1
                       TO  WK-ZZEN-RIBAR-YMD-FLG
                       OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日計算パッケージ.前々回利払日        =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
                   END-IF
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             WHEN  CNS-JIKAI-RBY-SYRU-5
               IF  WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2  NOT  =
                   WK-KJN-YMD            OF  WK-DATA-IN
               THEN
      *----------  計算方法
                 MOVE  CNS-CALC-HOHO-2
                   TO  WK-CALC-HOHO      OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                 MOVE  WK-ZENKAI-RIBAR-YMD-2     
                                         OF  WK-RTN-CD-2
                   TO  WK-ZEN-RIBAR-YMD  OF  WK-KJY-CALC-PKG
      *----------  前々回利払日
                 MOVE  WK-ZENKAI-RIBAR-YMD-2     
                                         OF  WK-RTN-CD-2
                   TO  WK-ZZEN-RIBAR-YMD
                   OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                 MOVE  CNS-ZZEN-RBY-FLG-1
                   TO  WK-ZZEN-RIBAR-YMD-FLG
                   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日計算パッケージ.前々回利払日        =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
               ELSE
      *----------  計算方法
                 MOVE  CNS-CALC-HOHO-4
                   TO  WK-CALC-HOHO      OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                 MOVE  WK-ZENKAI-RIBAR-YMD-2     
                                         OF  WK-RTN-CD-2
                   TO  WK-ZEN-RIBAR-YMD  OF  WK-KJY-CALC-PKG
      *----------  前々回利払日
                 MOVE  WK-ZENKAI-RIBAR-YMD-2     
                                         OF  WK-RTN-CD-2
                   TO  WK-ZZEN-RIBAR-YMD
                   OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                 MOVE  CNS-ZZEN-RBY-FLG-1
                   TO  WK-ZZEN-RIBAR-YMD-FLG
                   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日計算パッケージ.前々回利払日        =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
               END-IF
             WHEN  CNS-JIKAI-RBY-SYRU-6
               IF  WK-JIKAI-RIBAR-YMD-2  OF  WK-RTN-CD-2  NOT  =
                   WK-KJN-YMD            OF  WK-DATA-IN
               THEN
      *----------  計算方法
                 MOVE  CNS-CALC-HOHO-2
                   TO  WK-CALC-HOHO      OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                 MOVE  WK-LAST-RIBAR-KISAN-YMD
                   OF  WK-DATA-IN
                   TO  WK-ZEN-RIBAR-YMD
                   OF  WK-KJY-CALC-PKG
      *----------  前々回利払日
                 MOVE  WK-LAST-RIBAR-KISAN-YMD
                   OF  WK-DATA-IN
                   TO  WK-ZZEN-RIBAR-YMD
                   OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                 MOVE  CNS-ZZEN-RBY-FLG-1
                   TO  WK-ZZEN-RIBAR-YMD-FLG
                   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日計算パッケージ.前々回利払日        =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
               ELSE
      *----------  計算方法
                 MOVE  CNS-CALC-HOHO-4
                   TO  WK-CALC-HOHO      OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                 MOVE  WK-SHUKI-RIBAR-YMD
                   OF  WK-DATA-IN
                   TO  WK-ZEN-RIBAR-YMD  OF  WK-KJY-CALC-PKG
      *----------  前々回利払日
                 MOVE  WK-LAST-RIBAR-KISAN-YMD
                   OF  WK-DATA-IN
                   TO  WK-ZZEN-RIBAR-YMD
                   OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                 MOVE  CNS-ZZEN-RBY-FLG-0
                   TO  WK-ZZEN-RIBAR-YMD-FLG
                   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日計算パッケージ.前々回利払日        =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
               END-IF
             WHEN  CNS-JIKAI-RBY-SYRU-7
      *----------  計算方法
               MOVE  CNS-CALC-HOHO-3
                 TO  WK-CALC-HOHO        OF  WK-KJY-CALC-PKG
      *----------  前回利払日
               MOVE  WK-SHUKI-RIBAR-YMD  OF  WK-DATA-IN
                 TO  WK-ZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG
      *----------  前々回利払日
               MOVE  WK-LAST-RIBAR-KISAN-YMD
                 OF  WK-DATA-IN
                 TO  WK-ZZEN-RIBAR-YMD
                 OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
               MOVE  CNS-ZZEN-RBY-FLG-0
                 TO  WK-ZZEN-RIBAR-YMD-FLG
                 OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日計算パッケージ.前々回利払日        =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *----------  休日区分編集
           PERFORM  KYUUJITU-KBN-EDIT-RTN
      *----------  3)ワーク基準日計算パッケージ.前々回利払日計算フラグ＝'1'の場合
           IF  WK-ZZEN-RIBAR-YMD-FLG     OF  WK-KJY-CALC-PKG =
               CNS-ZZEN-RBY-FLG-1
           THEN
      *----------  ①前日取得
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":①前日取得 START"
      *-----------------------------------------------------------------
      *----------  ワーク基準年月日１←ワーク基準日計算パッケー.前々回利払日
             MOVE  WK-ZZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG
               TO  WK-IXCAL-KJN-YMD1     OF  WK-SCZY1020-PARM
      *----------  ワーク前後区分1←'2'
             MOVE  CNS-IXCAL-ZENGO-KBN-1-2
               TO  WK-IXCAL-ZENGO-KBN-1  OF  WK-SCZY1020-PARM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準年月日１=["
      D             WK-IXCAL-KJN-YMD1    OF  WK-SCZY1020-PARM"]"
      D    DISPLAY  CNS-PGM-ID":ワーク前後区分1   =["
      D             WK-IXCAL-ZENGO-KBN-1  OF  WK-SCZY1020-PARM"]"
      *-----------------------------------------------------------------
      *----------  カレンダールーチンをコールする
             PERFORM  SCZY1020-RTN
             IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
              =  CNS-RTN-000
      *----------  正常
             THEN
      *----------  ワーク基準日計算パッケー.前々回利払日 ← SCZY1020戻り値.基準年月日２
               MOVE  IXCAL-KJN-YMD-2     OF  PARM-SCZY1020-ARG1
                 TO  WK-ZZEN-RIBAR-YMD   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カレンダールーチン  正常"
      D    DISPLAY  CNS-PGM-ID":SCZY1020戻り値.基準年月日２          =["
      D             IXCAL-KJN-YMD-2      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケー.前々回利払日=["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":①前日取得 END"
      *-----------------------------------------------------------------
             ELSE
      *----------  エラー
               MOVE  PARM-RTNPKG         TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-048
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カレンダールーチン  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名=["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション=["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード=["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード=["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ=["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *----------  ②前回利払日取得
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":②前回利払日取得 START"
      D    DISPLAY  CNS-PGM-ID":利払日数             =["
      D             WK-KEKA-NISU         OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
             IF  WK-KEKA-NISU              OF  WK-DATA-IN  = ZERO
      *----------  ARG1.利払日数＝0の場合
             THEN
                INITIALIZE  PARM-SMZC3251-INOUT
                            PARM-RTNPKG
                            WK-SMZC3251-PARM
      *----------  ワークSMZC3251の入力年月日←ワーク基準日計算パッケー.前々回利払日
                MOVE  WK-ZZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG
                  TO  WK-IN-YMD             OF  WK-SMZC3251-PARM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークSMZC3251の入力年月日=["
      D             WK-IN-YMD            OF  WK-SMZC3251-PARM"]"
      *-----------------------------------------------------------------
      *----------  経過利息利払日計算ルーチンをコールする
                PERFORM  SMZC3251-RTN
      *----------  ワーク基準日計算パッケー.前々回利払日 ← SMZC3251戻り値.前回利払日
                MOVE  ZENKAI-RIBAR-YMD    OF  PARM-SMZC3251-ARG2
                  TO  WK-ZZEN-RIBAR-YMD   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":経過利息利払日計算ルーチンをコール 正常"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケー.前々回利払日=["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      *-----------------------------------------------------------------
             ELSE
      *----------  ARG1.利払日数<>0の場合
                INITIALIZE  PARM-SMZC3254-INOUT
                            PARM-RTNPKG
                            WK-SMZC3254-PARM
      *----------  ワークSMZC3254の入力年月日←ワーク基準日計算パッケー.前々回利払日
                MOVE  WK-ZZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG
                  TO  WK-IN-YMD             OF  WK-SMZC3254-PARM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークSMZC3254の入力年月日=["
      D             WK-IN-YMD            OF  WK-SMZC3254-PARM"]"
      *-----------------------------------------------------------------
      *----------  経過利息利払日計算ルーチンをコールする
                PERFORM  SMZC3254-RTN
      *----------  ワーク基準日計算パッケー.前々回利払日 ← SMZC3254戻り値.前回利払日
                MOVE  ZENKAI-RIBAR-YMD    OF  PARM-SMZC3254-ARG2
                  TO  WK-ZZEN-RIBAR-YMD   OF  WK-KJY-CALC-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":経過日数固定の経過利息利払日計算"
      D                         "ルーチンをコール 正常"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケー.前々回利払日=["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      *-----------------------------------------------------------------
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":②前回利払日取得 END"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  WK-CALC-HOHO              OF  WK-KJY-CALC-PKG =
               CNS-CALC-HOHO-1
           THEN
      *----------  ワーク基準日計算パッケージ.計算方法＝'1'の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法"
      D             "＝'1'の場合"
      *-----------------------------------------------------------------
      *----------  市場通貨経過利息
             MOVE  ZERO
               TO  SJTK-KEKA-RSK         OF  PARM-SMZJ2120-ARG2
      *----------  運用通貨経過利息
             MOVE  ZERO
               TO  UYTK-KEKA-RSK         OF  PARM-SMZJ2120-ARG2
      *----------  市場通貨源泉税
             MOVE  ZERO
               TO  SJTK-GENSEN-TAX       OF  PARM-SMZJ2120-ARG2
      *----------  運用通貨源泉税
             MOVE  ZERO
               TO  UYTK-GENSEN-TAX       OF  PARM-SMZJ2120-ARG2
      *----------  評価為替レート
             MOVE  ZERO
               TO  HYK-KWS               OF  PARM-SMZJ2120-ARG2
      *----------  源泉税評価為替レート
             MOVE  ZERO
               TO  GENS-TAX-HYK-KWS      OF  PARM-SMZJ2120-ARG2
      *----------  ファクター・連動係数
             MOVE  WK-FACTOR-RENDOU-KESU    OF  WK-DATA-IN
               TO  FACTOR-RENDOU-KESU    OF  PARM-SMZJ2120-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息=["
      D             SJTK-KEKA-RSK        OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨経過利息=["
      D             UYTK-KEKA-RSK        OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税=["
      D             SJTK-GENSEN-TAX      OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨源泉税=["
      D             UYTK-GENSEN-TAX      OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価為替レート=["
      D             HYK-KWS              OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":源泉税評価為替レート=["
      D             GENS-TAX-HYK-KWS     OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数=["
      D             FACTOR-RENDOU-KESU   OF  PARM-SMZJ2120-ARG2"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  WK-CALC-HOHO  OF  WK-KJY-CALC-PKG = CNS-CALC-HOHO-2 OR
               WK-CALC-HOHO  OF  WK-KJY-CALC-PKG = CNS-CALC-HOHO-3 OR
               WK-CALC-HOHO  OF  WK-KJY-CALC-PKG = CNS-CALC-HOHO-4
           THEN
      *----------  ワーク基準日計算パッケージ.計算方法＝'2' or '3'の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法=["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      *-----------------------------------------------------------------
               PERFORM  TKMZKR00-1-GET-RTN
           ELSE
             CONTINUE
           END-IF
           IF  WK-JI-KEISAN-FLG = CNS-JI-KEISAN-FLG-1
      *----------  ワーク自計算フラグ＝'1'の場合
           THEN
             IF  WK-CALC-HOHO  OF  WK-KJY-CALC-PKG = CNS-CALC-HOHO-2 OR
                 WK-CALC-HOHO  OF  WK-KJY-CALC-PKG = CNS-CALC-HOHO-3
             THEN
      *----------  ワーク基準日計算パッケージ.計算方法＝'2' or '3'の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク自計算フラグ                 =["
      D             WK-JI-KEISAN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法=["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":①利払日～基準日経過利息計算 START"
      *-----------------------------------------------------------------
      *----------  ①利払日～基準日経過利息計算
      *----------  残高異動計算データから利付き数量を取得する
               PERFORM  TKMZBW06-GET1-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY           OF  WK-KJY-CALC-PKG"]"
      *-----------------------------------------------------------------
               IF  WK-RIT-SRY            OF  WK-KJY-CALC-PKG >= ZERO
               THEN
      *----------  経過利息を取得する
                 INITIALIZE  WK-SMZC3250-PARM
      *----------  ワーク基準日
                 MOVE  WK-KJN-YMD        OF  WK-DATA-IN
                   TO  WK-KJN-YMD        OF  WK-SMZC3250-PARM
      *----------  ワーク利払日From
                 MOVE  ZERO
                   TO  WK-RIB-YMD-FROM   OF  WK-SMZC3250-PARM
      *----------  ワーク利払日To
                 MOVE  ZERO
                   TO  WK-RIB-YMD-TO     OF  WK-SMZC3250-PARM
      *----------  ワーク銘柄コード
                 MOVE  WK-MEG-CD         OF  WK-DATA-IN
                   TO  WK-MEG-CD         OF  WK-SMZC3250-PARM
      *----------  ワーク証券種別コード
                 MOVE  WK-SEC-SBT-CD     OF  WK-DATA-IN
                   TO  WK-SEC-SBT-CD     OF  WK-SMZC3250-PARM
      *----------  ワーク利用会社コード
                 MOVE  WK-RIYO-CMP-CD    OF  WK-DATA-IN
                   TO  WK-RIYO-CMP-CD    OF  WK-SMZC3250-PARM
      *----------  ワーク計算区分
                 MOVE  CNS-CALC-KBN-2
                   TO  WK-CALC-KBN       OF  WK-SMZC3250-PARM
      *----------  ワーク額面数量
                 MOVE  WK-RIT-SRY        OF  WK-KJY-CALC-PKG
                   TO  WK-FACE           OF  WK-SMZC3250-PARM
      *----------  ワークエラーポジション
                 MOVE  CNS-POS-050       TO  WK-ERR-POS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク基準日    = ["
      D             WK-KJN-YMD           OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク利払日From= ["
      D             WK-RIB-YMD-FROM      OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク利払日To  = ["
      D             WK-RIB-YMD-TO        OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク銘柄コード= ["
      D             WK-MEG-CD            OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク証券種別コード= ["
      D             WK-SEC-SBT-CD        OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク利用会社コード= ["
      D             WK-RIYO-CMP-CD       OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク計算区分  = ["
      D             WK-CALC-KBN          OF  WK-SMZC3250-PARM"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク額面数量  = ["
      D             WK-FACE              OF  WK-SMZC3250-PARM"]"
      *-----------------------------------------------------------------
                 PERFORM  SMZC3250-RTN
      *----------  経過利息、源泉税編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 経過利息、源泉税編集 START ***"
      D    DISPLAY  CNS-PGM-ID":SMZC3250戻り値.ファクター・連動係数=["
      D             FACTOR-RENDOU-KESU   OF  PARM-SMZC3250-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ワークモーケージ債フラグ =["
      D             WK-MORTGAGE-FLG"]"
      *-----------------------------------------------------------------
      *----------  ①SMZC3250戻り値.ファクター・連動係数＝0場合
                 IF  FACTOR-RENDOU-KESU  OF  PARM-SMZC3250-ARG2 = ZERO
                 OR  WK-MORTGAGE-FLG = CNS-FLG-1
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D               ":SMZC3250戻り値.ファクター・連動係数 ＝0 "
      D               "OR ワークモーケージ債フラグ＝1の場合"
      *-----------------------------------------------------------------
      *----------  ワーク利払日～基準日結果パッケージ.市場通貨経過利息←SMZC3250戻り値.経過利息
                   MOVE  KEKA-RSK        OF  PARM-SMZC3250-ARG2
                     TO  WK-SJTK-KEKA-RSK  OF  WK-RBY-KJY-PKG
      *----------  ワーク利払日～基準日結果パッケージ.市場通貨源泉税←SMZC3250戻り値.源泉税
                   MOVE  GENSEN-TAX      OF  PARM-SMZC3250-ARG2
                     TO  WK-SJTK-GENSEN-TAX  OF  WK-RBY-KJY-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利払日～基準日結果パッケージ."
      D               "市場通貨経過利息= ["
      D             WK-SJTK-KEKA-RSK     OF  WK-RBY-KJY-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利払日～基準日結果パッケージ."
      D               "市場通貨源泉税  = ["
      D             WK-SJTK-GENSEN-TAX   OF  WK-RBY-KJY-PKG"]"
      *-----------------------------------------------------------------
                 ELSE
      *----------  ワーク利払日～基準日結果パッケージ.市場通貨経過利息(中間)
                   COMPUTE  WK-SJTK-KEKA-RSK-CHUKAN
                            OF  WK-RBY-KJY-PKG
                         =  KEKA-RSK     OF  PARM-SMZC3250-ARG2 *
                            FACTOR-RENDOU-KESU
                            OF  PARM-SMZC3250-ARG2
      *----------  ワーク利払日～基準日結果パッケージ.市場通貨源泉税(中間)
                   COMPUTE  WK-SJTK-GENSEN-TAX-CHUKAN
                            OF  WK-RBY-KJY-PKG
                         =  GENSEN-TAX   OF  PARM-SMZC3250-ARG2 *
                            FACTOR-RENDOU-KESU
                            OF  PARM-SMZC3250-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":計算後ワーク利払日～基準日結果"
      D               "パッケージ.市場通貨経過利息(中間)= ["
      D      WK-SJTK-KEKA-RSK-CHUKAN     OF  WK-RBY-KJY-PKG"]"
      D    DISPLAY  CNS-PGM-ID":計算後ワーク利払日～基準日結果"
      D               "パッケージ.市場通貨源泉税(中間)  = ["
      D      WK-SJTK-GENSEN-TAX-CHUKAN   OF  WK-RBY-KJY-PKG"]"
      *-----------------------------------------------------------------
                   INITIALIZE  PARM-SMZC1501-INOUT
                               PARM-RTNPKG
      *----------  入力データ ← ワーク利払日～基準日結果パッケージ.市場通貨源泉税(中間)
                   MOVE  WK-SJTK-GENSEN-TAX-CHUKAN
                     OF  WK-RBY-KJY-PKG
                     TO  IN-SUTI         OF  PARM-SMZC1501-INOUT
      *----------  エラーポジション
                   MOVE  CNS-POS-051     TO  WK-ERR-POS
                   PERFORM  GENSEN-TAX-RTN
      *----------  端数処理後源泉税
                   MOVE  OUT-SUTI        OF  PARM-SMZC1501-INOUT
                     TO  WK-SJTK-GENSEN-TAX  OF  WK-RBY-KJY-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":端数処理後源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-RBY-KJY-PKG"]"
      D    DISPLAY  CNS-PGM-ID ":***  源泉税の端数処理  END  ***"
      *-----------------------------------------------------------------
                   INITIALIZE  PARM-SMZC1501-INOUT
                             PARM-RTNPKG
      *----------  入力データ ← ワーク利払日～基準日結果パッケージ.市場通貨経過利息(中間)
                   MOVE  WK-SJTK-KEKA-RSK-CHUKAN
                     OF  WK-RBY-KJY-PKG
                     TO  IN-SUTI         OF  PARM-SMZC1501-INOUT
      *----------  エラーポジション
                   MOVE  CNS-POS-052     TO  WK-ERR-POS
                   PERFORM  KEKA-RSK-RTN
      *----------  端数処理後経過利息
                   MOVE  OUT-SUTI        OF  PARM-SMZC1501-INOUT
                     TO  WK-SJTK-KEKA-RSK  OF  WK-RBY-KJY-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":端数処理後経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-RBY-KJY-PKG"]"
      D    DISPLAY  CNS-PGM-ID ":***  経過利息の端数処理  END  ***"
      D    DISPLAY  CNS-PGM-ID ":***  経過利息、源泉税編集  END  ***"
      *-----------------------------------------------------------------
                 END-IF
               ELSE
      *----------  ワーク利払日～基準日結果パッケージ.市場通貨経過利息← 0
                 MOVE  ZERO
                   TO  WK-SJTK-KEKA-RSK  OF  WK-RBY-KJY-PKG
      *----------  ワーク利払日～基準日結果パッケージ.市場通貨源泉税← 0
                 MOVE  ZERO
                   TO  WK-SJTK-GENSEN-TAX  OF  WK-RBY-KJY-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利払日～基準日結果パッケージ."
      D             "市場通貨経過利息= ["
      D             WK-SJTK-KEKA-RSK     OF  WK-RBY-KJY-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利払日～基準日結果パッケージ."
      D             "市場通貨源泉税  = ["
      D             WK-SJTK-GENSEN-TAX   OF  WK-RBY-KJY-PKG"]"
      *-----------------------------------------------------------------
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":①利払日～基準日経過利息計算 END"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":①利払日～基準日経過利息計算 処理しない"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
      *----------  ②前回利払日経過利息取得
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":②前回利払日経過利息取得 START"
      *-----------------------------------------------------------------
      *----------  1）債券過去経過利息計算データから取得する
      *----------  エラーポジション
             MOVE  CNS-POS-053           TO  WK-ERR-POS1
             MOVE  CNS-POS-054           TO  WK-ERR-POS2
             MOVE  CNS-POS-055           TO  WK-ERR-POS3
             MOVE  CNS-POS-056           TO  WK-ERR-POS4
             PERFORM  TKMZBW09-1-GET1-RTN
      *----------  ワーク前回利払日結果パッケージ.中間データフラグ
             MOVE  WK-CHKN-DATA-FLG-CHUKAN
               TO  WK-CHKN-DATA-FLG      OF  WK-ZNKAI-RBY-KEKKA-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク前回利払日結果パッケージ.中間データフラグ=["
      D             WK-CHKN-DATA-FLG     OF  WK-ZNKAI-RBY-KEKKA-PKG"]"
      *-----------------------------------------------------------------
      *----------  2）債券過去経過利息から取得する
      *----------  エラーポジション
             MOVE  CNS-POS-057           TO  WK-ERR-POS1
             MOVE  CNS-POS-058           TO  WK-ERR-POS2
             MOVE  CNS-POS-059           TO  WK-ERR-POS3
             MOVE  CNS-POS-060           TO  WK-ERR-POS4
             PERFORM  TKMZKR00-2-GET1-RTN
      *----------  ワーク前回利払日結果パッケージ.業務データフラグ
             MOVE  WK-GYOMU-DATA-FLG-CHUKAN
               TO  WK-GYOMU-DATA-FLG     OF  WK-ZNKAI-RBY-KEKKA-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク前回利払日結果パッケージ.業務データフラグ=["
      D             WK-GYOMU-DATA-FLG    OF  WK-ZNKAI-RBY-KEKKA-PKG"]"
      *-----------------------------------------------------------------
      *----------  3)採用データルート判定
             PERFORM  SAYO-DATA-ROOT-RTN
      *----------  ワーク前回利払日結果パッケージ.採用データルート
             MOVE  WK-SAYO-DATA-ROOT-CHUKAN
               TO  WK-SAYO-DATA-ROOT     OF  WK-ZNKAI-RBY-KEKKA-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク前回利払日結果パッケージ.採用データルート=["
      D             WK-SAYO-DATA-ROOT    OF  WK-ZNKAI-RBY-KEKKA-PKG"]"
      *-----------------------------------------------------------------
      *----------  4)ワーク前回利払日結果パッケージデータ編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ワーク前回利払日結果パッケージ"
      D             "データ編集  START ***"
      *-----------------------------------------------------------------
             PERFORM  HENSHYU-RTN
      *----------  ワーク前回利払日結果パッケージ.市場通貨経過利息
             MOVE  WK-SJTK-KEKA-RSK-HENSYUGO
               TO  WK-SJTK-KEKA-RSK      OF  WK-ZNKAI-RBY-KEKKA-PKG
      *----------  ワーク前回利払日結果パッケージ.市場通貨源泉税
             MOVE  WK-SJTK-GENSEN-TAX-HENSYUGO
               TO  WK-SJTK-GENSEN-TAX    OF  WK-ZNKAI-RBY-KEKKA-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク前回利払日結果パッケージ.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-ZNKAI-RBY-KEKKA-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク前回利払日結果パッケージ.市場通貨源泉税  =["
      D             WK-SJTK-GENSEN-TAX   OF  WK-ZNKAI-RBY-KEKKA-PKG"]"
      D    DISPLAY  CNS-PGM-ID ":*** ワーク前回利払日結果パッケージ"
      D             "データ編集  END ***"
      D    DISPLAY  CNS-PGM-ID":②前回利払日経過利息取得 END"
      D           ":ワーク基準日計算パッケージ.前々回利払日          =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      *-----------------------------------------------------------------
      *----------  ③前々回利払日経過利息取得処理
             IF  WK-ZZEN-RIBAR-YMD       OF  WK-KJY-CALC-PKG  NOT = ZERO
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":③前々回利払日経過利息取得処理 START"
      *-----------------------------------------------------------------
      *----------  1）債券過去経過利息計算データから取得する
      *----------  エラーポジション
               MOVE  CNS-POS-061           TO  WK-ERR-POS1
               MOVE  CNS-POS-062           TO  WK-ERR-POS2
               MOVE  CNS-POS-063           TO  WK-ERR-POS3
               MOVE  CNS-POS-064           TO  WK-ERR-POS4
               PERFORM  TKMZBW09-1-GET2-RTN
      *----------  ワーク前々回利払日結果パッケージ.中間データフラグ
               MOVE  WK-CHKN-DATA-FLG-CHUKAN
                 TO  WK-CHKN-DATA-FLG      OF  WK-ZZNKAI-RBY-KEKKA-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク前々回利払日結果パッケージ.中間データフラグ=["
      D             WK-CHKN-DATA-FLG     OF  WK-ZZNKAI-RBY-KEKKA-PKG"]"
      *-----------------------------------------------------------------
      *----------  2）債券過去経過利息から取得する
      *----------  エラーポジション
               MOVE  CNS-POS-065           TO  WK-ERR-POS1
               MOVE  CNS-POS-066           TO  WK-ERR-POS2
               MOVE  CNS-POS-067           TO  WK-ERR-POS3
               MOVE  CNS-POS-068           TO  WK-ERR-POS4
               PERFORM  TKMZKR00-2-GET2-RTN
      *----------  ワーク前々回利払日結果パッケージ.業務データフラグ
               MOVE  WK-GYOMU-DATA-FLG-CHUKAN
                 TO  WK-GYOMU-DATA-FLG     OF  WK-ZZNKAI-RBY-KEKKA-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク前々回利払日結果パッケージ.業務データフラグ=["
      D             WK-GYOMU-DATA-FLG    OF  WK-ZZNKAI-RBY-KEKKA-PKG"]"
      *-----------------------------------------------------------------
      *----------  3)採用データルート判定
               PERFORM  SAYO-DATA-ROOT-RTN
      *----------  ワーク前々回利払日結果パッケージ.採用データルート
               MOVE  WK-SAYO-DATA-ROOT-CHUKAN
                 TO  WK-SAYO-DATA-ROOT     OF  WK-ZZNKAI-RBY-KEKKA-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク前々回利払日結果パッケージ.採用データルート=["
      D             WK-SAYO-DATA-ROOT    OF  WK-ZZNKAI-RBY-KEKKA-PKG"]"
      *-----------------------------------------------------------------
      *----------  4)ワーク前々回利払日結果パッケージデータ編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ワーク前々回利払日結果パッケージ"
      D             "データ編集  START ***"
      *-----------------------------------------------------------------
               PERFORM  HENSHYU-RTN
      *----------  ワーク前々回利払日結果パッケージ.市場通貨経過利息
               MOVE  WK-SJTK-KEKA-RSK-HENSYUGO
                 TO  WK-SJTK-KEKA-RSK      OF  WK-ZZNKAI-RBY-KEKKA-PKG
      *----------  ワーク前々回利払日結果パッケージ.市場通貨源泉税
               MOVE  WK-SJTK-GENSEN-TAX-HENSYUGO
                 TO  WK-SJTK-GENSEN-TAX    OF  WK-ZZNKAI-RBY-KEKKA-PKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク前々回利払日結果パッケージ.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-ZZNKAI-RBY-KEKKA-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク前々回利払日結果パッケージ.市場通貨源泉税  =["
      D             WK-SJTK-GENSEN-TAX   OF  WK-ZZNKAI-RBY-KEKKA-PKG"]"
      D    DISPLAY  CNS-PGM-ID ":*** ワーク前々回利払日結果パッケージ"
      D             "データ編集  END ***"
      D    DISPLAY  CNS-PGM-ID":③前々回利払日経過利息取得処理 END"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *----------  ④ARG2項目編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":④ARG2項目編集 START"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨経過利息和
             COMPUTE  WK-SJTK-KEKA-RSK-WA
                   =  WK-SJTK-KEKA-RSK   OF  WK-RBY-KJY-PKG +
                      WK-SJTK-KEKA-RSK   OF  WK-ZNKAI-RBY-KEKKA-PKG +
                      WK-SJTK-KEKA-RSK   OF  WK-ZZNKAI-RBY-KEKKA-PKG
      *----------  ワーク市場通貨源泉税和
             COMPUTE  WK-SJTK-GENSEN-TAX-WA
                   =  WK-SJTK-GENSEN-TAX
                      OF  WK-RBY-KJY-PKG +
                      WK-SJTK-GENSEN-TAX
                      OF  WK-ZNKAI-RBY-KEKKA-PKG +
                      WK-SJTK-GENSEN-TAX
                      OF  WK-ZZNKAI-RBY-KEKKA-PKG
      *----------  市場通貨経過利息
             MOVE  WK-SJTK-KEKA-RSK-WA
               TO  SJTK-KEKA-RSK         OF  PARM-SMZJ2120-ARG2
      *----------  市場通貨源泉税
             MOVE  WK-SJTK-GENSEN-TAX-WA
               TO  SJTK-GENSEN-TAX       OF  PARM-SMZJ2120-ARG2
      *----------  運用通貨経過利息
             MOVE  CNS-ALL9
               TO  UYTK-KEKA-RSK         OF  PARM-SMZJ2120-ARG2
      *----------  運用通貨源泉税
             MOVE  CNS-ALL9
               TO  UYTK-GENSEN-TAX       OF  PARM-SMZJ2120-ARG2
      *----------  評価為替レート
             MOVE  CNS-ALL9
               TO  HYK-KWS               OF  PARM-SMZJ2120-ARG2
      *----------  源泉税評価為替レート
             MOVE  CNS-ALL9
               TO  GENS-TAX-HYK-KWS      OF  PARM-SMZJ2120-ARG2
      *----------  ファクター・連動係数
             MOVE  WK-FACTOR-RENDOU-KESU
               OF  WK-DATA-IN
               TO  FACTOR-RENDOU-KESU    OF  PARM-SMZJ2120-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息=["
      D             SJTK-KEKA-RSK        OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税=["
      D             SJTK-GENSEN-TAX      OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨経過利息=["
      D             UYTK-KEKA-RSK        OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨源泉税=["
      D             UYTK-GENSEN-TAX      OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価為替レート=["
      D             HYK-KWS              OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":源泉税評価為替レート=["
      D             GENS-TAX-HYK-KWS     OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数=["
      D             FACTOR-RENDOU-KESU   OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":④ARG2項目編集 END"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  債券過去経過利息の基準日計算"
      D             "の処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KJN-YMD-CALC-EXT.
           EXIT.
      ******************************************************************
      *        休日区分編集
      ******************************************************************
       KYUUJITU-KBN-EDIT-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  休日区分編集  START  ***"
      *-----------------------------------------------------------------
      *----------  ①ワーク休日区分編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類2        =["
      D             WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2"]"
      *-----------------------------------------------------------------
               EVALUATE  WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2
                 WHEN  CNS-JIKAI-RB-YMD-SYURUI-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":A)ワーク"
      D                 "次回利払日種類2＝'3':初期利払日の場合"
      *-----------------------------------------------------------------
      *----------  ワーク休日区分←ARG1.銘柄属性データ.初期利払日休日処理区分
                 MOVE  WK-SHOKI-RB-YMD-QJT-KBN
                                         OF  WK-MEG-ZOKUSEI-DATA-PARM
                   TO  WK-KYUJITU-KBN
                 WHEN  CNS-JIKAI-RB-YMD-SYURUI-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":B)ワーク"
      D                 "次回利払日種類2＝'6':終期利払日の場合"
      *-----------------------------------------------------------------
      *----------  ワーク休日区分←ARG1.銘柄属性データ.終期利払日休日処理区分
                 MOVE  WK-SHUKI-RB-YMD-QJT-KBN
                                         OF  WK-MEG-ZOKUSEI-DATA-PARM
                   TO  WK-KYUJITU-KBN
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":C)ワーク"
      D                 "次回利払日種類2は上記以外の場合"
      *-----------------------------------------------------------------
      *----------  ワーク休日区分←ARG1.銘柄属性データ.利払日休日処理区分
                 MOVE  WK-RIBAR-YMD-QJT-SR-KBN
                                         OF  WK-MEG-ZOKUSEI-DATA-PARM
                   TO  WK-KYUJITU-KBN
               END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日区分= ["
      D             WK-KYUJITU-KBN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類2  =["
      D             WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日2=["
      D             WK-JIKAI-RIBAR-YMD-2      OF  WK-RTN-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報．基準日               =["
      D             WK-KJN-YMD           OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------
               IF  WK-JIKAI-RIBAR-YMD-2       OF  WK-RTN-CD-2
                >  WK-KJN-YMD                 OF  WK-DATA-IN     AND
                   WK-KYUJITU-KBN
                =  CNS-KYUJITU-KBN-2                             AND
                   WK-JIKAI-RB-YMD-SYURUI-2   OF  WK-RTN-CD-2    NOT
                =  CNS-JIKAI-RBY-SYRU-1                          AND
                   WK-JIKAI-RB-YMD-SYURUI-2   OF  WK-RTN-CD-2    NOT
                =  CNS-JIKAI-RBY-SYRU-7
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利払日の前営業日取得処理"
      *-----------------------------------------------------------------
      *----------  利払日の前営業日取得処理
                  PERFORM  SCZY1020-4-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク休日調整後の次回利払日"
      D             "（基準日用）=["WK-KJA-KJC-RIB-YMD-K"]"
      *-----------------------------------------------------------------
      *----------  ◇ワーク休日調整後の次回利払日（基準日用）≦ ARG1.銘柄別断面情報.基準日 の場合
                 IF WK-KJA-KJC-RIB-YMD-K  <=  WK-KJN-YMD  OF  WK-DATA-IN
                 THEN
      *----------  計算方法
                   MOVE  CNS-CALC-HOHO-4
                     TO  WK-CALC-HOHO           OF  WK-KJY-CALC-PKG
      *----------  前々回利払日計算フラグ
                   MOVE  CNS-ZZEN-RBY-FLG-0
                     TO  WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG
      *----------  前々回利払日
                   MOVE  WK-ZEN-RIBAR-YMD       OF  WK-KJY-CALC-PKG
                     TO  WK-ZZEN-RIBAR-YMD      OF  WK-KJY-CALC-PKG
      *----------  前回利払日
                   MOVE  WK-JIKAI-RIBAR-YMD-2   OF  WK-RTN-CD-2
                     TO  WK-ZEN-RIBAR-YMD       OF  WK-KJY-CALC-PKG
                   IF WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2 =
                      CNS-JIKAI-RBY-SYRU-3
                   THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク次回利払日種類2=["
      D             WK-JIKAI-RB-YMD-SYURUI-2  OF  WK-RTN-CD-2"]"
      *-----------------------------------------------------------------
                     MOVE  ZERO
                       TO  WK-ZZEN-RIBAR-YMD  OF  WK-KJY-CALC-PKG
                   ELSE
                     CONTINUE
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.計算方法  =["
      D             WK-CALC-HOHO         OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.前回利払日=["
      D             WK-ZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日計算パッケージ.前々回利払日        =["
      D             WK-ZZEN-RIBAR-YMD    OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク基準日計算パッケージ.前々回利払日計算フラグ=["
      D             WK-ZZEN-RIBAR-YMD-FLG  OF  WK-KJY-CALC-PKG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***ワーク基準日計算パッケージ編集処理 END***"
      *-----------------------------------------------------------------
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  休日区分編集 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KYUUJITU-KBN-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    カレンダールーチンをコールする
      ******************************************************************
       SCZY1020-4-RTN         SECTION.
           INITIALIZE  PARM-SCZY1020-INOUT
                       PARM-RTNPKG
      *----------  基準年月日１ ← ワーク次回利払日
            MOVE  WK-JIKAI-RIBAR-YMD-2   OF  WK-RTN-CD-2
              TO  IXCAL-KJN-YMD-1        OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
            MOVE  CNS-IXCAL-COMP-BASE-2
              TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *----------  機能区分
            MOVE  CNS-IXCAL-FUNCTION-4
              TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *----------  前後区分1
            MOVE  CNS-IXCAL-ZENGO-KBN-1-2
              TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１=["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分=["
      D             IXCAL-COMP-BASE      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分=["
      D             IXCAL-FUNCTION       OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１=["
      D             IXCAL-ZENGO-KBN-1    OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":*** SCZY1020-4 "
      D             "カレンダールーチン START ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1020"              USING  PARM-SCZY1020-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SCZY1020 "
      D             "カレンダールーチン 正常 ***"
      *-----------------------------------------------------------------
      *----------  ワーク休日調整後の次回利払日（基準日用） ← SCZY1020リターンパッケージ.基準年月日２
             MOVE  IXCAL-KJN-YMD2        OF  PARM-SCZY1020-ARG1
               TO  WK-KJA-KJC-RIB-YMD-K
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日２          =["
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク休日調整後の次回利払日"
      D             "（基準日用）=["WK-KJA-KJC-RIB-YMD-K"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-069
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SCZY1020 "
      D             "カレンダールーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY1020-4 "
      D             "カレンダールーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1020-4-EXT.
           EXIT.
      ******************************************************************
      *    債券過去経過利息を取得する
      ******************************************************************
       TKMZKR00-1-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息を取得 START ***"
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息 "
      D             "CUR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT6                                         @3212SEINO@@
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMZKR00-S-1,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-11
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-DATA-IN
             TO  H-FUND-CD               OF  H-TKMZKR00-S-1,
                 WK-FUND-CD              OF  WK-MSG-1-11
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-DATA-IN
             TO  H-PTF-CD                OF  H-TKMZKR00-S-1,
                 WK-PTF-CD               OF  WK-MSG-1-11
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-DATA-IN
             TO  H-SEC-SBT-CD            OF  H-TKMZKR00-S-1,
                 WK-SEC-SBT-CD           OF  WK-MSG-1-11
      *----------  銘柄コード
           MOVE  WK-MEG-CD               OF  WK-DATA-IN
             TO  H-MEG-CD                OF  H-TKMZKR00-S-1,
                 WK-MEG-CD               OF  WK-MSG-1-11
      *----------  資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG             OF  WK-DATA-IN
             TO  H-TATE-FLG              OF  H-TKMZKR00-S-1,
                 WK-TATE-FLG             OF  WK-MSG-1-11
      *---------- 玉ID
           MOVE  WK-GYOKU-ID             OF  WK-DATA-IN
             TO  H-GYOKU-ID              OF  H-TKMZKR00-S-1,
                 WK-GYOKU-ID             OF  WK-MSG-1-11
      *---------- 適用開始日
           MOVE  WK-KJN-YMD              OF  WK-DATA-IN
             TO  H-TEKIYO-FROM           OF  H-TKMZKR00-S-1,
                 WK-TEKIYO-FROM          OF  WK-MSG-1-11
           MOVE  SQL-SELECT-1-11         TO  SQLSTMT6                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D             H-RIYO-CMP-CD        OF  H-TKMZKR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード=["
      D             H-FUND-CD            OF  H-TKMZKR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード=["
      D             H-PTF-CD             OF  H-TKMZKR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード=["
      D             H-SEC-SBT-CD         OF  H-TKMZKR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZKR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID=["
      D             H-GYOKU-ID           OF  H-TKMZKR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZKR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT6=[" SQLSTMT6 "]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZKR00-CR-OPEN =["
      D            FLG-TKMZKR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZKR00-CR-OPEN = CNS-OFF                           @SEINO@@
           THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS11第一回"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息計算データCURSOR PREPARE
           EXEC  SQL
             PREPARE  S11  FROM  :SQLSTMT6                              @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D         ":債券過去経過利息CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息CUR PREPARE 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-070
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11         DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息CUR PREPARE END ***"
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息CUR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
           EXEC  SQL
             DECLARE  TKMZKR00_CUR  CURSOR  FOR  S11
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":債券過去経過利息CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMZKR00_CUR
               USING :H-TKMZKR00-S-1.H-RIYO-CMP-CD,
                     :H-TKMZKR00-S-1.H-FUND-CD,
                     :H-TKMZKR00-S-1.H-PTF-CD,
                     :H-TKMZKR00-S-1.H-SEC-SBT-CD,
                     :H-TKMZKR00-S-1.H-MEG-CD,
                     :H-TKMZKR00-S-1.H-TATE-FLG,
                     :H-TKMZKR00-S-1.H-GYOKU-ID,
                     :H-TKMZKR00-S-1.H-TEKIYO-FROM
           END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE           TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":債券過去経過利息CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON                TO  FLG-TKMZKR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-CR-OPEN=["
      D             FLG-TKMZKR00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-071
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11         DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息CUR OPEN END ***"
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息CUR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH TKMZKR00_CUR
             INTO  :H-TKMZKR00-1.H-SJTK-KEKA-RSK-IN,
                   :H-TKMZKR00-1.H-SJTK-GENSEN-TAX-IN,
                   :H-TKMZKR00-1.H-UYTK-KEKA-RSK-IN,
                   :H-TKMZKR00-1.H-UYTK-GENSEN-TAX-IN,
                   :H-TKMZKR00-1.H-HYK-KWS-IN,
                   :H-TKMZKR00-1.H-GENS-TAX-HYK-KWS-IN,
                   :H-TKMZKR00-1.H-FACTOR-RENDOU-KESU-IN
           END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           "債券過去経過利息CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *----------  市場通貨経過利息
               MOVE  H-SJTK-KEKA-RSK-IN
                 OF  H-TKMZKR00-1
                 TO  SJTK-KEKA-RSK       OF  PARM-SMZJ2120-ARG2
      *----------  運用通貨経過利息
               MOVE  H-UYTK-KEKA-RSK-IN
                 OF  H-TKMZKR00-1
                 TO  UYTK-KEKA-RSK       OF  PARM-SMZJ2120-ARG2
      *----------  市場通貨源泉税
               MOVE  H-SJTK-GENSEN-TAX-IN
                 OF  H-TKMZKR00-1
                 TO  SJTK-GENSEN-TAX     OF  PARM-SMZJ2120-ARG2
      *----------  運用通貨源泉税
               MOVE  H-UYTK-GENSEN-TAX-IN
                 OF  H-TKMZKR00-1
                 TO  UYTK-GENSEN-TAX     OF  PARM-SMZJ2120-ARG2
      *----------  評価為替レート
               MOVE  H-HYK-KWS-IN
                 OF  H-TKMZKR00-1
                 TO  HYK-KWS             OF  PARM-SMZJ2120-ARG2
      *----------  源泉税評価為替レート
               MOVE  H-GENS-TAX-HYK-KWS-IN
                 OF  H-TKMZKR00-1
                 TO  GENS-TAX-HYK-KWS    OF  PARM-SMZJ2120-ARG2
      *----------  ファクター・連動係数
               MOVE  H-FACTOR-RENDOU-KESU-IN
                 OF  H-TKMZKR00-1
                 TO  FACTOR-RENDOU-KESU  OF  PARM-SMZJ2120-ARG2
      *----------  ワーク自計算フラグ
               MOVE  CNS-JI-KEISAN-FLG-0
                 TO  WK-JI-KEISAN-FLG
      *----------  ユーザ入力データあるフラグ
               MOVE  CNS-1               TO  USER-IN-FLG
                                         OF  PARM-SMZJ2120-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息=["
      D             SJTK-KEKA-RSK        OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨経過利息=["
      D             UYTK-KEKA-RSK        OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税=["
      D             SJTK-GENSEN-TAX      OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨源泉税=["
      D             UYTK-GENSEN-TAX      OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価為替レート=["
      D             HYK-KWS              OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":源泉税評価為替レート=["
      D             GENS-TAX-HYK-KWS     OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数=["
      D             FACTOR-RENDOU-KESU   OF  PARM-SMZJ2120-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク自計算フラグ=["WK-JI-KEISAN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ユーザ入力データあるフラグ=["
      D                         USER-IN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------  ワーク自計算フラグ
               MOVE  CNS-JI-KEISAN-FLG-1
                 TO  WK-JI-KEISAN-FLG
      *----------  ユーザ入力データあるフラグ
               MOVE  ZERO                TO  USER-IN-FLG
                                         OF  PARM-SMZJ2120-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク自計算フラグ=["WK-JI-KEISAN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ユーザ入力データあるフラグ=["
      D                         USER-IN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-072
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-11       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息CUR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 債券過去経過利息CUR CLOSE START ***"@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-OPEN= ["               @SEINO@@
      *D*           FLG-TKMZKR00-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZKR00_CUR                                         @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"債券過去経過利息"                        @SEINO@@
      *D*           "CUR CLOSE SQLCODE=["SQLCODE"]"                     @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":債券過去経過利息CURSOR CLOSE  正常"     @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZKR00-CR-OPEN       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-OPEN =["               @SEINO@@
      *D*           FLG-TKMZKR00-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":債券過去経過利息CURSOR CLOSE  異常"     @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-073                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-11         DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":***債券過去経過利息CUR CLOSE END ***"  @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息を取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-1-GET-EXT.
           EXIT.
      ******************************************************************
      *    残高異動計算データから利付き数量を取得1
      ******************************************************************
       TKMZBW06-GET1-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高異動計算データから利付き数量"
      D             "を取得1 START ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCUR PREPARE START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT7                                       @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZBW06-S-1,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-1
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZBW06-S-1,
                   WK-FUND-CD            OF  WK-MSG-1-1
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZBW06-S-1,
                   WK-PTF-CD             OF  WK-MSG-1-1
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZBW06-S-1,
                   WK-MEG-CD             OF  WK-MSG-1-1
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZBW06-S-1,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-1
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZBW06-S-1,
                   WK-TATE-FLG           OF  WK-MSG-1-1
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZBW06-S-1,
                   WK-GYOKU-ID           OF  WK-MSG-1-1
      *----------  処理実行日
             MOVE  WK-SYORI-YMD          OF  WK-DATA-IN
               TO  H-SYORI-YMD           OF  H-TKMZBW06-S-1,
                   WK-SYORI-YMD          OF  WK-MSG-1-1
      *----------  起動ID
             MOVE  WK-KIDOU-ID           OF  WK-DATA-IN
               TO  H-KIDOU-ID            OF  H-TKMZBW06-S-1,
                   WK-KIDOU-ID           OF  WK-MSG-1-1
      *----------  =
             MOVE  CNS-EQUAL  TO  WK-EQUAL  OF  WK-MSG-1-1
             MOVE  SQL-SELECT-1-12       TO  SQLSTMT7                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":処理実行日                =["
      D             H-SYORI-YMD          OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                    =["
      D             H-KIDOU-ID           OF  H-TKMZBW06-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT7=[" SQLSTMT7 "]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW06-CR-1-OPEN =["
      D            FLG-TKMZBW06-CR-1-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
             IF  FLG-TKMZBW06-CR-1-OPEN = CNS-OFF                       @SEINO@@
             THEN                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS12第一回"
      *-----------------------------------------------------------------
      *----------  残高異動計算データCURSOR PREPARE
             EXEC  SQL
               PREPARE  S12  FROM  :SQLSTMT7
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":残高異動計算データCURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-074
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZBW06_CUR_1  CURSOR  FOR  S12
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動計算データCUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE                                                       @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             END-IF                                                     @SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZBW06_CUR_1
                 USING :H-TKMZBW06-S-1.H-RIYO-CMP-CD,
                       :H-TKMZBW06-S-1.H-FUND-CD,
                       :H-TKMZBW06-S-1.H-PTF-CD,
                       :H-TKMZBW06-S-1.H-MEG-CD,
                       :H-TKMZBW06-S-1.H-SEC-SBT-CD,
                       :H-TKMZBW06-S-1.H-TATE-FLG,
                       :H-TKMZBW06-S-1.H-GYOKU-ID,
                       :H-TKMZBW06-S-1.H-SYORI-YMD,
                       :H-TKMZBW06-S-1.H-KIDOU-ID
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動計算データCUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZBW06-CR-1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW06-CR-1-OPEN=["
      D             FLG-TKMZBW06-CR-1-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-075
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCURSOR OPEN END ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動計算データCURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZBW06_CUR_1
               INTO  :H-TKMZBW06-1.H-IDOG-SRYZN-RIT
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":残高異動計算データCUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-12.異動後数量残高（利付）=["
      D             H-IDOG-SRYZN-RIT     OF  H-TKMZBW06-1"]"
      *-----------------------------------------------------------------
      *----------  ワーク基準日計算パッケージ.利付き数量←別紙1-12 .異動後数量残高（利付）
      *----------  - ARG1.跨ぎ異動数量（利付）集計
                COMPUTE  WK-RIT-SRY         OF  WK-KJY-CALC-PKG
                      =  H-IDOG-SRYZN-RIT   OF  H-TKMZBW06-1
                      -  WK-MTGI-IDO-SURYO-SHUKE
                                            OF  WK-DATA-IN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY           OF  WK-KJY-CALC-PKG"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":IF-ELSE テースト"
      D    DISPLAY  CNS-PGM-ID":約定ベース受渡順フラグ=["
      D             WK-YKJ-UKE-JUN-FLG    OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
                 IF  WK-YKJ-UKE-JUN-FLG      OF  WK-DATA-IN
                   =  CNS-YKJ-UKE-JUN-FLG-1
                 THEN
                   PERFORM  TKMZZI00-GET2-RTN
                 ELSE
                   PERFORM  TKMZZI00-GET21-RTN
                 END-IF
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-076
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-1      DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高異動計算データCUR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 残高異動計算データ"                 @SEINO@@
      *D*           "CUR CLOSE START ***"                               @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW06-CR-1-OPEN= ["             @SEINO@@
      *D*           FLG-TKMZBW06-CR-1-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZBW06_CUR_1                                       @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"残高異動計算データ"                      @SEINO@@
      *D*           "CUR CLOSE SQLCODE=["SQLCODE"]"                     @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR CLOSE  正常"   @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZBW06-CR-1-OPEN     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW06-CR-1-OPEN =["             @SEINO@@
      *D*           FLG-TKMZBW06-CR-1-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":残高異動計算データCURSOR CLOSE  異常"   @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-077                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-1          DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":***残高異動計算データCUR CLOSE END ***"@SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 残高異動計算データから利付き数量"
      D             "を取得1 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW06-GET1-EXT.
           EXIT.
      ******************************************************************
      *    残高異動から利付き数量を取得
      ******************************************************************
       TKMZZI00-GET2-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高異動から利付き数量"
      D             "を取得  START ***"
      D    DISPLAY  CNS-PGM-ID":約定ベース受渡順フラグ= 1"
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR PREPARE  START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT8                                       @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZZI00-S2,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-15
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZZI00-S2,
                   WK-FUND-CD            OF  WK-MSG-1-15
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZZI00-S2,
                   WK-PTF-CD             OF  WK-MSG-1-15
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZZI00-S2,
                   WK-MEG-CD             OF  WK-MSG-1-15
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZZI00-S2,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-15
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZZI00-S2,
                   WK-TATE-FLG           OF  WK-MSG-1-15
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZZI00-S2,
                   WK-GYOKU-ID           OF  WK-MSG-1-15
      *----------  計上基準日
             MOVE  WK-KAISI-KJN-YMD      OF  WK-DATA-IN
               TO  H-KEIJOU-KIJUNBI1     OF  H-TKMZZI00-S2,
                   WK-KEIJOU-KIJUNBI1    OF  WK-MSG-1-15
             MOVE  WK-KJN-YMD            OF  WK-DATA-IN
               TO  H-KEIJOU-KIJUNBI      OF  H-TKMZZI00-S2,
                   WK-KEIJOU-KIJUNBI     OF  WK-MSG-1-15
             STRING  SQL-SELECT-1-15,
                     CNS-ODBY-UKE-YMD,
                     CNS-ODBY-IDO-KJN  DELIMITED  BY  SIZE
               INTO  SQLSTMT8                                           @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":計上基準日1               =["
      D             H-KEIJOU-KIJUNBI1           OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":計上基準日                =["
      D             H-KEIJOU-KIJUNBI            OF  H-TKMZZI00-S2"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT8=[" SQLSTMT8 "]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZZI00-CR-2-OPEN =["
      D            FLG-TKMZZI00-CR-2-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMZZI00-CR-2-OPEN = CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  対象取引情報(別紙1-5)CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS15第一回"
      *-----------------------------------------------------------------
      *----------  残高異動CURSOR PREPARE
             EXEC  SQL
               PREPARE  S15 FROM  :SQLSTMT8                             @3212SEINO@@
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":残高異動CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-078
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-15        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                      =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZZI00_CUR_2  CURSOR  FOR  S15
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZZI00_CUR_2
                 USING :H-TKMZZI00-S2.H-RIYO-CMP-CD,
                       :H-TKMZZI00-S2.H-FUND-CD,
                       :H-TKMZZI00-S2.H-PTF-CD,
                       :H-TKMZZI00-S2.H-MEG-CD,
                       :H-TKMZZI00-S2.H-SEC-SBT-CD,
                       :H-TKMZZI00-S2.H-TATE-FLG,
                       :H-TKMZZI00-S2.H-GYOKU-ID,
                       :H-TKMZZI00-S2.H-KEIJOU-KIJUNBI1,
                       :H-TKMZZI00-S2.H-KEIJOU-KIJUNBI
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZZI00-CR-2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR-2-OPEN=["
      D             FLG-TKMZZI00-CR-2-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-079
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-15        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR OPEN END ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZZI00_CUR_2
               INTO  :H-TKMZZI00.H-IDOG-SRYZN-RIT
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":残高異動CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-15.異動後数量残高（利付）=["
      D             H-IDOG-SRYZN-RIT     OF  H-TKMZZI00"]"
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動数量（利付）集計=["
      D             WK-MTGI-IDO-SURYO-SHUKE
      D                                   OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  ワーク基準日計算パッケージ.利付き数量←「別紙1-15 SQL説明」.異動後数量残高（利付）
      *----------  - ARG1.跨ぎ異動数量（利付）集計
                COMPUTE  WK-RIT-SRY         OF  WK-KJY-CALC-PKG
                      =  H-IDOG-SRYZN-RIT   OF  H-TKMZZI00
                      -  WK-MTGI-IDO-SURYO-SHUKE
                                            OF  WK-DATA-IN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY           OF  WK-KJY-CALC-PKG"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH NOTFOUND"
      D    DISPLAY  CNS-PGM-ID":ARG1.開始時残高数量残高（利付）=["
      D             WK-KAISIZN-SRYZN-RIT  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動数量（利付）集計=["
      D             WK-MTGI-IDO-SURYO-SHUKE
      D                                   OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  ワーク基準日計算パッケージ.利付き数量←ARG1.開始時残高数量残高（利付）
      *----------  - ARG1.跨ぎ異動数量（利付）集計
                COMPUTE  WK-RIT-SRY         OF  WK-KJY-CALC-PKG
                      =  WK-KAISIZN-SRYZN-RIT
                                            OF  WK-DATA-IN
                      -  WK-MTGI-IDO-SURYO-SHUKE
                                            OF  WK-DATA-IN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.利付き数量=["
      D             WK-RIT-SRY           OF  WK-KJY-CALC-PKG"]"
      *-----------------------------------------------------------------
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-080
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-15      DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 残高異動CURSOR FETCH END ***"
      *    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      *             ":*** 残高異動CURSOR CLOSE START ***"               @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMZZI00-CR-2-OPEN= ["             @3212SEINO@@
      *             FLG-TKMZZI00-CR-2-OPEN "]"                          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      EXEC  SQL                                                  @3212SEINO@@
      *        CLOSE TKMZZI00_CUR_2                                     @3212SEINO@@
      *      END-EXEC                                                   @3212SEINO@@
      *----------------------単体テスト專用-----------------------------@3212SEINO@@
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID"残高異動"                                @3212SEINO@@
      *             "CUR CLOSE SQLCODE=["SQLCODE"]"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      IF  SQLCODE = CNS-SQL-NORMAL                               @3212SEINO@@
      *      THEN                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":残高異動CURSOR CLOSE  正常"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *        MOVE  CNS-OFF             TO  FLG-TKMZZI00-CR-2-OPEN     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMZZI00-CR-2-OPEN =["             @3212SEINO@@
      *             FLG-TKMZZI00-CR-2-OPEN "]"                          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      ELSE                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":残高異動CURSOR CLOSE  異常"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *        MOVE  CNS-PGM-ID                                         @3212SEINO@@
      *          TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *        MOVE  CNS-POS-081                                        @3212SEINO@@
      *          TO  ERR-POS             OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *        MOVE  CNS-RTN-900                                        @3212SEINO@@
      *          TO  RTN-CD              OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *        MOVE  SQLCODE                                            @3212SEINO@@
      *          TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *        MOVE  CNS-DETAIL-1                                       @3212SEINO@@
      *          TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *        STRING  CNS-SQL-MSG-SELECT,                              @3212SEINO@@
      *                WK-MSG-1-15        DELIMITED  BY  SIZE           @3212SEINO@@
      *          INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      *             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      *             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      *             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      *             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      *             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      *             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
      *        PERFORM  ERR-RTN                                         @3212SEINO@@
      *      END-IF                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID ":***残高異動CUR CLOSE END ***"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":***残高異動から利付き数量"
      D             "を取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-GET2-EXT.
           EXIT.
      ******************************************************************
      *    債券過去経過利息計算データから取得する
      ******************************************************************
       TKMZBW09-1-GET1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息計算データから "
      D             "取得 START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT9                                       @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZBW09-S-1,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-13
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZBW09-S-1,
                   WK-FUND-CD            OF  WK-MSG-1-13
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZBW09-S-1,
                   WK-PTF-CD             OF  WK-MSG-1-13
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZBW09-S-1,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-13
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZBW09-S-1,
                   WK-MEG-CD             OF  WK-MSG-1-13
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZBW09-S-1,
                   WK-TATE-FLG           OF  WK-MSG-1-13
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZBW09-S-1,
                   WK-GYOKU-ID           OF  WK-MSG-1-13
      *----------  利払日
             MOVE  WK-ZEN-RIBAR-YMD      OF  WK-KJY-CALC-PKG
               TO  H-RIB-YMD             OF  H-TKMZBW09-S-1,
                   WK-RIB-YMD            OF  WK-MSG-1-13
      *----------  適用開始日
             MOVE  WK-KJN-YMD            OF  WK-DATA-IN
               TO  H-TEKIYO-FROM         OF  H-TKMZBW09-S-1,
                   WK-TEKIYO-FROM        OF  WK-MSG-1-13
      *----------  処理実行日
             MOVE  WK-SYORI-YMD          OF  WK-DATA-IN
               TO  H-SYORI-YMD           OF  H-TKMZBW09-S-1,
                   WK-SYORI-YMD          OF  WK-MSG-1-13
      *----------  起動ID
             MOVE  WK-KIDOU-ID           OF  WK-DATA-IN
               TO  H-KIDOU-ID            OF  H-TKMZBW09-S-1,
                   WK-KIDOU-ID           OF  WK-MSG-1-13
             MOVE  SQL-SELECT-1-13       TO  SQLSTMT9                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":利払日                    =["
      D             H-RIB-YMD            OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日                =["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":処理実行日                =["
      D             H-SYORI-YMD          OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                    =["
      D             H-KIDOU-ID           OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT9=[" SQLSTMT9 "]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR PREPARE START ***"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW09-CR-OPEN =["
      D            FLG-TKMZBW09-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
             IF  FLG-TKMZBW09-CR-OPEN = CNS-OFF                         @SEINO@@
             THEN                                                       @SEINO@@
      *----------  債券過去経過利息計算データCURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS13第一回"
      *-----------------------------------------------------------------
             EXEC  SQL
               PREPARE  S13  FROM  :SQLSTMT9
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息計算データ(別紙1-13)"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"
      D             "CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"
      D             "CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS1
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-13       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZBW09_CUR  CURSOR  FOR  S13
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13) CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE                                                       @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             END-IF                                                     @SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZBW09_CUR
                 USING :H-TKMZBW09-S-1.H-RIYO-CMP-CD,
                       :H-TKMZBW09-S-1.H-FUND-CD,
                       :H-TKMZBW09-S-1.H-PTF-CD,
                       :H-TKMZBW09-S-1.H-SEC-SBT-CD,
                       :H-TKMZBW09-S-1.H-MEG-CD,
                       :H-TKMZBW09-S-1.H-TATE-FLG,
                       :H-TKMZBW09-S-1.H-GYOKU-ID,
                       :H-TKMZBW09-S-1.H-RIB-YMD,
                       :H-TKMZBW09-S-1.H-TEKIYO-FROM,
                       :H-TKMZBW09-S-1.H-SYORI-YMD,
                       :H-TKMZBW09-S-1.H-KIDOU-ID
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE           TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZBW09-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW09-CR-OPEN=["
      D             FLG-TKMZBW09-CR-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-13       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN END ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZBW09_CUR
               INTO  :H-TKMZBW09-1.H-TEKIYO-FROM,
                      H-TKMZBW09-1.H-SJTK-KEKA-RSK,
                      H-TKMZBW09-1.H-SJTK-GENSEN-TAX
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"
      D             "CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"
      D             "CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-13.適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-1"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-13.市場通貨経過利息=["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZBW09-1"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-13.市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZBW09-1"]"
      *-----------------------------------------------------------------
      *----------  ワーク中間データフラグ(中間)←'1'
                 MOVE  CNS-CHKN-DATA-FLG-1
                   TO  WK-CHKN-DATA-FLG-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク中間データフラグ(中間)=["
      D             WK-CHKN-DATA-FLG-CHUKAN"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "CURSOR FETCH NOTFOUND"
      *-----------------------------------------------------------------
      *----------  ワーク中間データフラグ(中間)←'0'
                 MOVE  CNS-CHKN-DATA-FLG-0
                   TO  WK-CHKN-DATA-FLG-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク中間データフラグ(中間)=["
      D             WK-CHKN-DATA-FLG-CHUKAN"]"
      *-----------------------------------------------------------------
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13)CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  WK-ERR-POS3
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-13     DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"         @SEINO@@
      *D*           "(別紙1-13) CUR CLOSE START ***"                    @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW09-CR-OPEN= ["               @SEINO@@
      *D*           FLG-TKMZBW09-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZBW09_CUR                                         @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"債券過去経過利息計算データ(別紙1-13)"    @SEINO@@
      *D*           "CUR CLOSE SQLCODE=["SQLCODE"]"                     @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"   @SEINO@@
      *D*           " CURSOR CLOSE  正常"                               @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZBW09-CR-OPEN       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW09-CR-OPEN =["               @SEINO@@
      *D*           FLG-TKMZBW09-CR-OPEN "]"                            @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"   @SEINO@@
      *D*           " CURSOR CLOSE  異常"                               @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  WK-ERR-POS4                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-13         DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":***債券過去経過利息計算データ(別紙1-13)"@SEINO@@
      *D*           "CUR CLOSE END ***"                                 @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息計算データから "
      D             "取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-1-GET1-EXT.
           EXIT.
      ******************************************************************
      *    債券過去経過利息計算データから取得する
      ******************************************************************
       TKMZBW09-1-GET2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息計算データから "
      D             "取得 START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT10                                      @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZBW09-S-1,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-13
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZBW09-S-1,
                   WK-FUND-CD            OF  WK-MSG-1-13
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZBW09-S-1,
                   WK-PTF-CD             OF  WK-MSG-1-13
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZBW09-S-1,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-13
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZBW09-S-1,
                   WK-MEG-CD             OF  WK-MSG-1-13
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZBW09-S-1,
                   WK-TATE-FLG           OF  WK-MSG-1-13
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZBW09-S-1,
                   WK-GYOKU-ID           OF  WK-MSG-1-13
      *----------  利払日
             MOVE  WK-ZZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG
               TO  H-RIB-YMD             OF  H-TKMZBW09-S-1,
                   WK-RIB-YMD            OF  WK-MSG-1-13
      *----------  適用開始日
             MOVE  WK-KJN-YMD            OF  WK-DATA-IN
               TO  H-TEKIYO-FROM         OF  H-TKMZBW09-S-1,
                   WK-TEKIYO-FROM        OF  WK-MSG-1-13
      *----------  処理実行日
             MOVE  WK-SYORI-YMD          OF  WK-DATA-IN
               TO  H-SYORI-YMD           OF  H-TKMZBW09-S-1,
                   WK-SYORI-YMD          OF  WK-MSG-1-13
      *----------  起動ID
             MOVE  WK-KIDOU-ID           OF  WK-DATA-IN
               TO  H-KIDOU-ID            OF  H-TKMZBW09-S-1,
                   WK-KIDOU-ID           OF  WK-MSG-1-13
             MOVE  SQL-SELECT-1-13       TO  SQLSTMT10                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":利払日                    =["
      D             H-RIB-YMD            OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日                =["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":処理実行日                =["
      D             H-SYORI-YMD          OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                    =["
      D             H-KIDOU-ID           OF  H-TKMZBW09-S-1"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT10=[" SQLSTMT10 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW09-CR-2-OPEN =["
      D            FLG-TKMZBW09-CR-2-OPEN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR PREPARE START ***"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
             IF  FLG-TKMZBW09-CR-2-OPEN = CNS-OFF                       @SEINO@@
             THEN                                                       @SEINO@@
      *----------  債券過去経過利息計算データCURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS17第一回"
      *-----------------------------------------------------------------
             EXEC  SQL
               PREPARE  S17  FROM  :SQLSTMT10
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息計算データ(別紙1-13)"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"
      D             "CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"
      D             "CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS1
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-13       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZBW09_CUR_2  CURSOR  FOR  S17
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13) CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE                                                       @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             END-IF                                                     @SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZBW09_CUR_2
                 USING :H-TKMZBW09-S-1.H-RIYO-CMP-CD,
                       :H-TKMZBW09-S-1.H-FUND-CD,
                       :H-TKMZBW09-S-1.H-PTF-CD,
                       :H-TKMZBW09-S-1.H-SEC-SBT-CD,
                       :H-TKMZBW09-S-1.H-MEG-CD,
                       :H-TKMZBW09-S-1.H-TATE-FLG,
                       :H-TKMZBW09-S-1.H-GYOKU-ID,
                       :H-TKMZBW09-S-1.H-RIB-YMD,
                       :H-TKMZBW09-S-1.H-TEKIYO-FROM,
                       :H-TKMZBW09-S-1.H-SYORI-YMD,
                       :H-TKMZBW09-S-1.H-KIDOU-ID
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE           TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZBW09-CR-2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW09-CR-2-OPEN=["
      D             FLG-TKMZBW09-CR-2-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-13       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR OPEN END ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZBW09_CUR_2
               INTO  :H-TKMZBW09-1.H-TEKIYO-FROM,
                      H-TKMZBW09-1.H-SJTK-KEKA-RSK,
                      H-TKMZBW09-1.H-SJTK-GENSEN-TAX
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"
      D             "CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"
      D             "CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-13.適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-1"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-13.市場通貨経過利息=["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZBW09-1"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-13.市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZBW09-1"]"
      *-----------------------------------------------------------------
      *----------  ワーク中間データフラグ(中間)←'1'
                 MOVE  CNS-CHKN-DATA-FLG-1
                   TO  WK-CHKN-DATA-FLG-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク中間データフラグ(中間)=["
      D             WK-CHKN-DATA-FLG-CHUKAN"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "CURSOR FETCH NOTFOUND"
      *-----------------------------------------------------------------
      *----------  ワーク中間データフラグ(中間)←'0'
                 MOVE  CNS-CHKN-DATA-FLG-0
                   TO  WK-CHKN-DATA-FLG-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク中間データフラグ(中間)=["
      D             WK-CHKN-DATA-FLG-CHUKAN"]"
      *-----------------------------------------------------------------
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ"
      D             "(別紙1-13)CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  WK-ERR-POS3
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-13     DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"
      D             "(別紙1-13) CUR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"         @SEINO@@
      *D*           "(別紙1-13) CUR CLOSE START ***"                    @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW09-CR-2-OPEN= ["             @SEINO@@
      *D*           FLG-TKMZBW09-CR-2-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZBW09_CUR_2                                       @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"債券過去経過利息計算データ(別紙1-13)"    @SEINO@@
      *D*           "CUR CLOSE SQLCODE=["SQLCODE"]"                     @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"   @SEINO@@
      *D*           " CURSOR CLOSE  正常"                               @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZBW09-CR-2-OPEN     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW09-CR-2-OPEN =["             @SEINO@@
      *D*           FLG-TKMZBW09-CR-2-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ(別紙1-13)"   @SEINO@@
      *D*           " CURSOR CLOSE  異常"                               @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  WK-ERR-POS4                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-13         DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":***債券過去経過利息計算データ(別紙1-13)"@SEINO@@
      *D*           "CUR CLOSE END ***"                                 @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息計算データから "
      D             "取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-1-GET2-EXT.
           EXIT.
      ******************************************************************
      *    債券過去経過利息から取得する
      ******************************************************************
       TKMZKR00-2-GET1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息(別紙1-14) "
      D             "CUR PREPARE START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT11                                      @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZKR00-S-2,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-14
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZKR00-S-2,
                   WK-FUND-CD            OF  WK-MSG-1-14
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZKR00-S-2,
                   WK-PTF-CD             OF  WK-MSG-1-14
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZKR00-S-2,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-14
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZKR00-S-2,
                   WK-MEG-CD             OF  WK-MSG-1-14
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZKR00-S-2,
                   WK-TATE-FLG           OF  WK-MSG-1-14
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZKR00-S-2,
                   WK-GYOKU-ID           OF  WK-MSG-1-14
      *----------  利払日
             MOVE  WK-ZEN-RIBAR-YMD      OF  WK-KJY-CALC-PKG
               TO  H-RIB-YMD             OF  H-TKMZKR00-S-2,
                   WK-RIB-YMD            OF  WK-MSG-1-14
      *----------  適用開始日
             MOVE  WK-KJN-YMD            OF  WK-DATA-IN
               TO  H-TEKIYO-FROM         OF  H-TKMZKR00-S-2,
                   WK-TEKIYO-FROM        OF  WK-MSG-1-14
             MOVE  SQL-SELECT-1-14       TO  SQLSTMT11                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":利払日                    =["
      D             H-RIB-YMD            OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日                =["
      D             H-TEKIYO-FROM        OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT11=[" SQLSTMT11 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZKR00-CR-1-OPEN =["
      D            FLG-TKMZKR00-CR-1-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
             IF  FLG-TKMZKR00-CR-1-OPEN = CNS-OFF                       @SEINO@@
             THEN                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS14第一回"
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息(別紙1-14) "
      D             "CUR PREPARE START ***"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息CURSOR PREPARE
             EXEC  SQL
               PREPARE  S14  FROM  :SQLSTMT11                           @3212SEINO@@
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息(別紙1-14)"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息(別紙1-14)"
      D             "CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息(別紙1-14)"
      D             "CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS1
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-14       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 債券過去経過利息(別紙1-14)CUR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZKR00_CUR_1  CURSOR  FOR  S14
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":債券過去経過利息(別紙1-14)CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE                                                       @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             END-IF                                                     @SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZKR00_CUR_1
                 USING :H-TKMZKR00-S-2.H-RIYO-CMP-CD,
                       :H-TKMZKR00-S-2.H-FUND-CD,
                       :H-TKMZKR00-S-2.H-PTF-CD,
                       :H-TKMZKR00-S-2.H-SEC-SBT-CD,
                       :H-TKMZKR00-S-2.H-MEG-CD,
                       :H-TKMZKR00-S-2.H-TATE-FLG,
                       :H-TKMZKR00-S-2.H-GYOKU-ID,
                       :H-TKMZKR00-S-2.H-RIB-YMD,
                       :H-TKMZKR00-S-2.H-TEKIYO-FROM
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE           TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":債券過去経過利息(別紙1-14)CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZKR00-CR-1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息(別紙1-14)CUR OPEN 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-CR-1-OPEN=["
      D             FLG-TKMZKR00-CR-1-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息(別紙1-14)CUR OPEN 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-14       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 債券過去経過利息(別紙1-14)CUR OPEN END ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 債券過去経過利息(別紙1-14)CUR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZKR00_CUR_1
               INTO  :H-TKMZKR00-2.H-TEKIYO-FROM,
                      H-TKMZKR00-2.H-SJTK-KEKA-RSK,
                      H-TKMZKR00-2.H-SJTK-GENSEN-TAX,
                      H-TKMZKR00-2.H-SJTK-KEKA-RSK-IN,
                      H-TKMZKR00-2.H-SJTK-GENSEN-TAX-IN
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":債券過去経過利息(別紙1-14)CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息 CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZKR00-2"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.市場通貨経過利息=["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZKR00-2"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZKR00-2"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.市場通貨経過利息(入力値)=["
      D             H-SJTK-KEKA-RSK-IN   OF  H-TKMZKR00-2"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.市場通貨源泉税(入力値)=["
      D             H-SJTK-GENSEN-TAX-IN  OF  H-TKMZKR00-2"]"
      *-----------------------------------------------------------------
      *----------  ワーク業務データフラグ(中間)←'1'
                 MOVE  CNS-GYOMU-DATA-FLG-1
                   TO  WK-GYOMU-DATA-FLG-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク業務データフラグ(中間)=["
      D             WK-GYOMU-DATA-FLG-CHUKAN"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
      *----------  ワーク業務データフラグ(中間)←'0'
                 MOVE  CNS-GYOMU-DATA-FLG-0
                   TO  WK-GYOMU-DATA-FLG-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク業務データフラグ(中間)=["
      D             WK-GYOMU-DATA-FLG-CHUKAN"]"
      *-----------------------------------------------------------------
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":債券過去経過利息(別紙1-14)CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  WK-ERR-POS3
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-14     DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 債券過去経過利息(別紙1-14)CUR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 債券過去経過利息"                   @SEINO@@
      *D*           "CUR CLOSE START ***"                               @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-1-OPEN= ["             @SEINO@@
      *D*           FLG-TKMZKR00-CR-1-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZKR00_CUR_1                                       @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"債券過去経過利息(別紙1-14)"              @SEINO@@
      *D*           "CUR CLOSE SQLCODE=["SQLCODE"]"                     @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":債券過去経過利息(別紙1-14)CURSOR CLOSE  正常"     @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZKR00-CR-1-OPEN     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-1-OPEN =["             @SEINO@@
      *D*           FLG-TKMZKR00-CR-1-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":債券過去経過利息(別紙1-14)CURSOR CLOSE  異常"     @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  WK-ERR-POS4                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-14         DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":***債券過去経過利息(別紙1-14)CUR CLOSE END ***"   @SEINO@@
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-2-GET1-EXT.
           EXIT.
      ******************************************************************
      *    債券過去経過利息から取得する
      ******************************************************************
       TKMZKR00-2-GET2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息(別紙1-14) "
      D             "CUR PREPARE START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT12                                      @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZKR00-S-2,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-14
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZKR00-S-2,
                   WK-FUND-CD            OF  WK-MSG-1-14
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZKR00-S-2,
                   WK-PTF-CD             OF  WK-MSG-1-14
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZKR00-S-2,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-14
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZKR00-S-2,
                   WK-MEG-CD             OF  WK-MSG-1-14
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZKR00-S-2,
                   WK-TATE-FLG           OF  WK-MSG-1-14
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZKR00-S-2,
                   WK-GYOKU-ID           OF  WK-MSG-1-14
      *----------  利払日
             MOVE  WK-ZZEN-RIBAR-YMD     OF  WK-KJY-CALC-PKG
               TO  H-RIB-YMD             OF  H-TKMZKR00-S-2,
                   WK-RIB-YMD            OF  WK-MSG-1-14
      *----------  適用開始日
             MOVE  WK-KJN-YMD            OF  WK-DATA-IN
               TO  H-TEKIYO-FROM         OF  H-TKMZKR00-S-2,
                   WK-TEKIYO-FROM        OF  WK-MSG-1-14
             MOVE  SQL-SELECT-1-14       TO  SQLSTMT12                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":利払日                    =["
      D             H-RIB-YMD            OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日                =["
      D             H-TEKIYO-FROM        OF  H-TKMZKR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT12=[" SQLSTMT12 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZKR00-CR-4-OPEN =["
      D            FLG-TKMZKR00-CR-4-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
             IF  FLG-TKMZKR00-CR-4-OPEN = CNS-OFF                       @SEINO@@
             THEN                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS18第一回"
      D    DISPLAY  CNS-PGM-ID ":*** 債券過去経過利息(別紙1-14) "
      D             "CUR PREPARE START ***"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息CURSOR PREPARE
             EXEC  SQL
               PREPARE  S18  FROM  :SQLSTMT12
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息(別紙1-14)"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息(別紙1-14)"
      D             "CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息(別紙1-14)"
      D             "CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS1
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-14       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 債券過去経過利息(別紙1-14)CUR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZKR00_CUR_4  CURSOR  FOR  S18
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":債券過去経過利息(別紙1-14)CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE                                                       @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             END-IF                                                     @SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZKR00_CUR_4
                 USING :H-TKMZKR00-S-2.H-RIYO-CMP-CD,
                       :H-TKMZKR00-S-2.H-FUND-CD,
                       :H-TKMZKR00-S-2.H-PTF-CD,
                       :H-TKMZKR00-S-2.H-SEC-SBT-CD,
                       :H-TKMZKR00-S-2.H-MEG-CD,
                       :H-TKMZKR00-S-2.H-TATE-FLG,
                       :H-TKMZKR00-S-2.H-GYOKU-ID,
                       :H-TKMZKR00-S-2.H-RIB-YMD,
                       :H-TKMZKR00-S-2.H-TEKIYO-FROM
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE           TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":債券過去経過利息(別紙1-14)CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZKR00-CR-4-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息(別紙1-14)CUR OPEN 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-CR-4-OPEN=["
      D             FLG-TKMZKR00-CR-4-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息(別紙1-14)CUR OPEN 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-14       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 債券過去経過利息(別紙1-14)CUR OPEN END ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 債券過去経過利息(別紙1-14)CUR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZKR00_CUR_4
               INTO  :H-TKMZKR00-2.H-TEKIYO-FROM,
                      H-TKMZKR00-2.H-SJTK-KEKA-RSK,
                      H-TKMZKR00-2.H-SJTK-GENSEN-TAX,
                      H-TKMZKR00-2.H-SJTK-KEKA-RSK-IN,
                      H-TKMZKR00-2.H-SJTK-GENSEN-TAX-IN
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":債券過去経過利息(別紙1-14)CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息 CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZKR00-2"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.市場通貨経過利息=["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZKR00-2"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZKR00-2"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.市場通貨経過利息(入力値)=["
      D             H-SJTK-KEKA-RSK-IN   OF  H-TKMZKR00-2"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-14.市場通貨源泉税(入力値)=["
      D             H-SJTK-GENSEN-TAX-IN  OF  H-TKMZKR00-2"]"
      *-----------------------------------------------------------------
      *----------  ワーク業務データフラグ(中間)←'1'
                 MOVE  CNS-GYOMU-DATA-FLG-1
                   TO  WK-GYOMU-DATA-FLG-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク業務データフラグ(中間)=["
      D             WK-GYOMU-DATA-FLG-CHUKAN"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
      *----------  ワーク業務データフラグ(中間)←'0'
                 MOVE  CNS-GYOMU-DATA-FLG-0
                   TO  WK-GYOMU-DATA-FLG-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク業務データフラグ(中間)=["
      D             WK-GYOMU-DATA-FLG-CHUKAN"]"
      *-----------------------------------------------------------------
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":債券過去経過利息(別紙1-14)CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  WK-ERR-POS3
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-14     DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 債券過去経過利息(別紙1-14)CUR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 債券過去経過利息"                   @SEINO@@
      *D*           "CUR CLOSE START ***"                               @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-4-OPEN= ["             @SEINO@@
      *D*           FLG-TKMZKR00-CR-4-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZKR00_CUR_4                                       @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"債券過去経過利息(別紙1-14)"              @SEINO@@
      *D*           "CUR CLOSE SQLCODE=["SQLCODE"]"                     @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":債券過去経過利息(別紙1-14)CURSOR CLOSE  正常"     @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZKR00-CR-4-OPEN     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-4-OPEN =["             @SEINO@@
      *D*           FLG-TKMZKR00-CR-4-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":債券過去経過利息(別紙1-14)CURSOR CLOSE  異常"     @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  WK-ERR-POS4                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-14         DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":***債券過去経過利息(別紙1-14)CUR CLOSE END ***"   @SEINO@@
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-2-GET2-EXT.
           EXIT.
      ******************************************************************
      *    採用データルート判定
      ******************************************************************
       SAYO-DATA-ROOT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 採用データルート判定  START ***"
      *-----------------------------------------------------------------
           EVALUATE  WK-CHKN-DATA-FLG-CHUKAN
             WHEN  CNS-CHKN-DATA-FLG-1
               EVALUATE  WK-GYOMU-DATA-FLG-CHUKAN
                 WHEN  CNS-GYOMU-DATA-FLG-0
      *----------  ワーク採用データルート(中間)
                   MOVE  CNS-SAYO-DATA-ROOT-1
                     TO  WK-SAYO-DATA-ROOT-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク採用データルート(中間)=["
      D             WK-SAYO-DATA-ROOT-CHUKAN"]"
      *-----------------------------------------------------------------
                 WHEN  CNS-GYOMU-DATA-FLG-1
                   IF  H-TEKIYO-FROM     OF  H-TKMZBW09-1 >
                       H-TEKIYO-FROM     OF  H-TKMZKR00-2
                   THEN
      *----------  ワーク採用データルート(中間)
                     MOVE  CNS-SAYO-DATA-ROOT-1
                       TO  WK-SAYO-DATA-ROOT-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク採用データルート(中間)=["
      D             WK-SAYO-DATA-ROOT-CHUKAN"]"
      *-----------------------------------------------------------------
                   ELSE
                     IF  H-TEKIYO-FROM   OF  H-TKMZBW09-1 <
                         H-TEKIYO-FROM   OF  H-TKMZKR00-2
                     THEN
      *----------  ワーク採用データルート(中間)
                       MOVE  CNS-SAYO-DATA-ROOT-3
                         TO  WK-SAYO-DATA-ROOT-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク採用データルート(中間)=["
      D             WK-SAYO-DATA-ROOT-CHUKAN"]"
      *-----------------------------------------------------------------
                     ELSE
      *----------  ワーク採用データルート(中間)
                       MOVE  CNS-SAYO-DATA-ROOT-2
                         TO  WK-SAYO-DATA-ROOT-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク採用データルート(中間)=["
      D             WK-SAYO-DATA-ROOT-CHUKAN"]"
      *-----------------------------------------------------------------
                     END-IF
                   END-IF
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             WHEN  CNS-CHKN-DATA-FLG-0
               EVALUATE  WK-GYOMU-DATA-FLG-CHUKAN
                 WHEN  CNS-GYOMU-DATA-FLG-0
      *----------  ワーク採用データルート(中間)
                   MOVE  CNS-SAYO-DATA-ROOT-9
                     TO  WK-SAYO-DATA-ROOT-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク採用データルート(中間)=["
      D             WK-SAYO-DATA-ROOT-CHUKAN"]"
      *-----------------------------------------------------------------
                 WHEN  CNS-GYOMU-DATA-FLG-1
      *----------  ワーク採用データルート(中間)
                   MOVE  CNS-SAYO-DATA-ROOT-3
                     TO  WK-SAYO-DATA-ROOT-CHUKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク採用データルート(中間)=["
      D             WK-SAYO-DATA-ROOT-CHUKAN"]"
      *-----------------------------------------------------------------
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  採用データルート判定  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SAYO-DATA-ROOT-EXT.
           EXIT.
      ******************************************************************
      *    ワーク前回利払日結果パッケージデータ編集
      ******************************************************************
       HENSHYU-RTN            SECTION.
           EVALUATE  WK-SAYO-DATA-ROOT-CHUKAN
             WHEN  CNS-SAYO-DATA-ROOT-1
      *----------  ワーク市場通貨経過利息(編集後)
               MOVE  H-SJTK-KEKA-RSK     OF  H-TKMZBW09-1
                 TO  WK-SJTK-KEKA-RSK-HENSYUGO
      *----------  ワーク市場通貨源泉税(編集後)
               MOVE  H-SJTK-GENSEN-TAX   OF  H-TKMZBW09-1
                 TO  WK-SJTK-GENSEN-TAX-HENSYUGO
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨経過利息(編集後)=["
      D             WK-SJTK-KEKA-RSK-HENSYUGO"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税(編集後) =["
      D             WK-SJTK-GENSEN-TAX-HENSYUGO"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SAYO-DATA-ROOT-2
               IF  H-SJTK-KEKA-RSK-IN  OF  H-TKMZKR00-2
                =  CNS-SJTK-KEKA-RSK-9
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取得市場通貨経過利息（入力値）は全部9の場合"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨経過利息(編集後)
                 MOVE  H-SJTK-KEKA-RSK   OF  H-TKMZBW09-1
                   TO  WK-SJTK-KEKA-RSK-HENSYUGO
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":取得市場通貨経過利息（入力値）は全部9じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨経過利息(編集後)
                 MOVE  H-SJTK-KEKA-RSK-IN
                   OF  H-TKMZKR00-2
                   TO  WK-SJTK-KEKA-RSK-HENSYUGO
               END-IF
               IF  H-SJTK-GENSEN-TAX-IN  OF  H-TKMZKR00-2
                =  CNS-SJTK-GENSEN-TAX-9
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取得市場通貨源泉税（入力値）は全部9の場合"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨源泉税(編集後)
                 MOVE  H-SJTK-GENSEN-TAX
                   OF  H-TKMZBW09-1
                   TO  WK-SJTK-GENSEN-TAX-HENSYUGO
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取得市場通貨源泉税（入力値）は全部9じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨源泉税(編集後)
                 MOVE  H-SJTK-GENSEN-TAX-IN
                   OF  H-TKMZKR00-2
                   TO  WK-SJTK-GENSEN-TAX-HENSYUGO
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨経過利息(編集後)=["
      D             WK-SJTK-KEKA-RSK-HENSYUGO"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税(編集後) =["
      D             WK-SJTK-GENSEN-TAX-HENSYUGO"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SAYO-DATA-ROOT-3
               IF  H-SJTK-KEKA-RSK-IN  OF  H-TKMZKR00-2
                =  CNS-SJTK-KEKA-RSK-9
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取得市場通貨経過利息（入力値）は全部9の場合"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨経過利息(編集後)
                 MOVE  H-SJTK-KEKA-RSK   OF  H-TKMZKR00-2
                   TO  WK-SJTK-KEKA-RSK-HENSYUGO
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":取得市場通貨経過利息（入力値）は全部9じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨経過利息(編集後)
                 MOVE  H-SJTK-KEKA-RSK-IN
                   OF  H-TKMZKR00-2
                   TO  WK-SJTK-KEKA-RSK-HENSYUGO
               END-IF
               IF  H-SJTK-GENSEN-TAX-IN  OF  H-TKMZKR00-2
                =  CNS-SJTK-GENSEN-TAX-9
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取得市場通貨源泉税（入力値）は全部9の場合"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨源泉税(編集後)
                 MOVE  H-SJTK-GENSEN-TAX
                   OF  H-TKMZKR00-2
                   TO  WK-SJTK-GENSEN-TAX-HENSYUGO
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取得市場通貨源泉税（入力値）は全部9じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク市場通貨源泉税(編集後)
                 MOVE  H-SJTK-GENSEN-TAX-IN
                   OF  H-TKMZKR00-2
                   TO  WK-SJTK-GENSEN-TAX-HENSYUGO
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨経過利息(編集後)=["
      D             WK-SJTK-KEKA-RSK-HENSYUGO"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税(編集後) =["
      D             WK-SJTK-GENSEN-TAX-HENSYUGO"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SAYO-DATA-ROOT-9
      *----------  ワーク市場通貨経過利息(編集後)
               MOVE  ZERO
                 TO  WK-SJTK-KEKA-RSK-HENSYUGO
      *----------  ワーク市場通貨源泉税(編集後)
               MOVE  ZERO
                 TO  WK-SJTK-GENSEN-TAX-HENSYUGO
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨経過利息(編集後)=["
      D             WK-SJTK-KEKA-RSK-HENSYUGO"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税(編集後) =["
      D             WK-SJTK-GENSEN-TAX-HENSYUGO"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
           CONTINUE.
       HENSHYU-EXT.
           EXIT.
      ******************************************************************
      *                 3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   後処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2120-ARG1=["
      D             PARM-SMZJ2120-ARG1   OF PARM-SMZJ2120-INOUT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
           CALL  "SCZY1170"              USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO  PARM-SMZJ2120-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ2120-ARG3     = ["
      D      PARM-SMZJ2120-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ2120-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ2120-ARG3(COUNTER  OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ2120-ARG3(COUNTER  OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ2120-ARG3(COUNTER  OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ2120-ARG3(COUNTER  OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ2120-ARG3(COUNTER  OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ2120-ARG3(COUNTER  OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *                 3.5 直前の債券過去経過利息情報取得処理
      ******************************************************************
       KEKA-RSK-JOHO-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":***  直前の債券過去経過利息情報取得処理  START  ***"
      *-----------------------------------------------------------------
      *----------  1）直前の債券過去経過利息計算データを取得する
           PERFORM  TKMZBW09-GET-RTN
      *----------  2）直前の債券過去経過利息を取得する
           PERFORM  TKMZKR00-GET-RTN
      *----------  3）直前の債券過去経過利息情報を確定処理
           IF  WK-CHZN-TKMZBW09-FLG = ZERO AND
               WK-CHZN-TKMZKR00-FLG = ZERO
           THEN
      *----------  債券過去経過利息データなしフラグ←1
             MOVE  CNS-FLG-1             TO  WK-TKMZBW09-NO-DATA-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息データなしフラグ=["
      D             WK-TKMZBW09-NO-DATA-FLG"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息計算データフラグ=["
      D             WK-CHZN-TKMZBW09-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息フラグ=["
      D             WK-CHZN-TKMZKR00-FLG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息計算データ.適用開始日=["
      D             WK-TEKIYO-FROM       OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.適用開始日=["
      D             WK-TEKIYO-FROM       OF  WK-CHZN-TKMZKR00"]"
      *-----------------------------------------------------------------
           IF  (WK-CHZN-TKMZBW09-FLG = CNS-CHZN-TKMZBW09-FLG-1 AND
               WK-CHZN-TKMZKR00-FLG = ZERO) OR (
               (WK-CHZN-TKMZBW09-FLG = CNS-CHZN-TKMZBW09-FLG-1 AND
               WK-CHZN-TKMZKR00-FLG = CNS-CHZN-TKMZKR00-FLG-1) AND
               WK-TEKIYO-FROM  OF  WK-CHZN-TKMZBW09 > WK-TEKIYO-FROM
               OF  WK-CHZN-TKMZKR00)
           THEN
      *----------  ワーク直前債券過去経過利息確定.利払日
              MOVE  WK-RIB-YMD           OF  WK-CHZN-TKMZBW09
                TO  WK-RIB-YMD           OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.市場通貨コード
              MOVE  WK-SIJO-TUKA-CD      OF  WK-CHZN-TKMZBW09
                TO  WK-SIJO-TUKA-CD      OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.利払対象額面
              MOVE  WK-RIB-TSHO-FACE     OF  WK-CHZN-TKMZBW09
                TO  WK-RIB-TSHO-FACE     OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.市場通貨経過利息
              MOVE  WK-SJTK-KEKA-RSK     OF  WK-CHZN-TKMZBW09
                TO  WK-SJTK-KEKA-RSK     OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.市場通貨源泉税
              MOVE  WK-SJTK-GENSEN-TAX   OF  WK-CHZN-TKMZBW09
                TO  WK-SJTK-GENSEN-TAX   OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.ファクター・連動係数
              MOVE  WK-FACTOR-RENDOU-KESU
                OF  WK-CHZN-TKMZBW09
                TO  WK-FACTOR-RENDOU-KESU
                OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.未入金対象額面残高
              MOVE  WK-MNK-TSHO-FACE-ZAN
                OF  WK-CHZN-TKMZBW09
                TO  WK-MNK-TSHO-FACE-ZAN
                OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.利払日=["
      D             WK-RIB-YMD           OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨コード=["
      D             WK-SIJO-TUKA-CD      OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.利払対象額面=["
      D             WK-RIB-TSHO-FACE     OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D         ":ワーク直前債券過去経過利息確定.ファクター・連動係数=["
      D             WK-FACTOR-RENDOU-KESU  OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク直前債券過去経過利息確定.未入金対象額面残高=["
      D             WK-MNK-TSHO-FACE-ZAN  OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  WK-CHZN-TKMZBW09-FLG = CNS-CHZN-TKMZBW09-FLG-1 AND
               WK-CHZN-TKMZKR00-FLG = CNS-CHZN-TKMZKR00-FLG-1 AND
               WK-TEKIYO-FROM  OF  WK-CHZN-TKMZBW09 = WK-TEKIYO-FROM
               OF  WK-CHZN-TKMZKR00
           THEN
      *----------  ワーク直前債券過去経過利息確定.利払日
              MOVE  WK-RIB-YMD           OF  WK-CHZN-TKMZBW09
                TO  WK-RIB-YMD           OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.市場通貨コード
              MOVE  WK-SIJO-TUKA-CD      OF  WK-CHZN-TKMZBW09
                TO  WK-SIJO-TUKA-CD      OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.利払対象額面
              MOVE  WK-RIB-TSHO-FACE     OF  WK-CHZN-TKMZBW09
                TO  WK-RIB-TSHO-FACE     OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.利払日=["
      D             WK-RIB-YMD           OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨コード=["
      D             WK-SIJO-TUKA-CD      OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.利払対象額面=["
      D             WK-RIB-TSHO-FACE     OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              IF  WK-SJTK-KEKA-RSK-IN    OF  WK-CHZN-TKMZKR00
               =  CNS-SJTK-KEKA-RSK-9
              THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨経過"
      D             "利息（入力値）は初期値（全部9）の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.市場通貨経過利息
                MOVE  WK-SJTK-KEKA-RSK   OF  WK-CHZN-TKMZBW09
                  TO  WK-SJTK-KEKA-RSK   OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨経過"
      D             "利息（入力値）は初期値（全部9）じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.市場通貨経過利息
                MOVE  WK-SJTK-KEKA-RSK-IN
                  OF  WK-CHZN-TKMZKR00
                  TO  WK-SJTK-KEKA-RSK   OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              END-IF
              IF  WK-SJTK-GENSEN-TAX-IN  OF  WK-CHZN-TKMZKR00
               =  CNS-SJTK-GENSEN-TAX-9
              THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨"
      D             "源泉税（入力値）は初期値（全部9）の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.市場通貨源泉税
                MOVE  WK-SJTK-GENSEN-TAX
                  OF  WK-CHZN-TKMZBW09
                  TO  WK-SJTK-GENSEN-TAX
                  OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨"
      D             "源泉税（入力値）は初期値（全部9）じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.市場通貨源泉税
                MOVE  WK-SJTK-GENSEN-TAX-IN
                  OF  WK-CHZN-TKMZKR00
                  TO  WK-SJTK-GENSEN-TAX
                  OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              END-IF
              IF  WK-MNK-TSHO-FACE-ZAN-IN  OF  WK-CHZN-TKMZKR00
               =  CNS-MNK-TSHO-FACE-ZAN-9
              THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.未入金対象額"
      D             "面残高（入力値）は初期値（全部9）の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.未入金対象額面残高
                MOVE  WK-MNK-TSHO-FACE-ZAN
                  OF  WK-CHZN-TKMZBW09
                  TO  WK-MNK-TSHO-FACE-ZAN
                  OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク直前債券過去経過利息確定.未入金対象額面残高=["
      D             WK-MNK-TSHO-FACE-ZAN  OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨"
      D             "源泉税（入力値）は初期値（全部9）じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.未入金対象額面残高
                MOVE  WK-MNK-TSHO-FACE-ZAN-IN
                  OF  WK-CHZN-TKMZKR00
                  TO  WK-MNK-TSHO-FACE-ZAN
                  OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク直前債券過去経過利息確定.未入金対象額面残高=["
      D             WK-MNK-TSHO-FACE-ZAN  OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              END-IF
              IF  WK-FACTOR-RENDOU-KESU-IN      OF  WK-CHZN-TKMZKR00
               =  CNS-FACTOR-RENDOU-KESU-9
              THEN
                MOVE  WK-FACTOR-RENDOU-KESU     OF  WK-CHZN-TKMZBW09
                  TO  WK-FACTOR-RENDOU-KESU     OF  WK-CHZN-SAI-KAKUNIN
              ELSE
                MOVE  WK-FACTOR-RENDOU-KESU-IN  OF  WK-CHZN-TKMZKR00
                  TO  WK-FACTOR-RENDOU-KESU     OF  WK-CHZN-SAI-KAKUNIN
              END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息確定.ファク"
      D             "ター・連動係数  =["
      D             WK-FACTOR-RENDOU-KESU     OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  (WK-CHZN-TKMZBW09-FLG = ZERO AND WK-CHZN-TKMZKR00-FLG =
                CNS-CHZN-TKMZBW09-FLG-1) OR ( (WK-CHZN-TKMZBW09-FLG
               = CNS-CHZN-TKMZBW09-FLG-1 AND  WK-CHZN-TKMZKR00-FLG
               =  CNS-CHZN-TKMZKR00-FLG-1) AND WK-TEKIYO-FROM
               OF  WK-CHZN-TKMZBW09 < WK-TEKIYO-FROM
               OF  WK-CHZN-TKMZKR00)
           THEN
      *----------  ワーク直前債券過去経過利息確定.利払日
              MOVE  WK-RIB-YMD           OF  WK-CHZN-TKMZKR00
                TO  WK-RIB-YMD           OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.市場通貨コード
              MOVE  WK-SIJO-TUKA-CD      OF  WK-CHZN-TKMZKR00
                TO  WK-SIJO-TUKA-CD      OF  WK-CHZN-SAI-KAKUNIN
      *----------  ワーク直前債券過去経過利息確定.利払対象額面
              MOVE  WK-RIB-TSHO-FACE     OF  WK-CHZN-TKMZKR00
                TO  WK-RIB-TSHO-FACE     OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.利払日=["
      D             WK-RIB-YMD           OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D         ":ワーク直前債券過去経過利息確定.市場通貨コード=["
      D             WK-SIJO-TUKA-CD      OF  WK-CHZN-SAI-KAKUNIN"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク直前債券過去経過利息確定.利払対象額面=["
      D             WK-RIB-TSHO-FACE     OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              IF  WK-SJTK-KEKA-RSK-IN    OF  WK-CHZN-TKMZKR00
               =  CNS-SJTK-KEKA-RSK-9
              THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨経過"
      D             "利息（入力値）は初期値（全部9）の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.市場通貨経過利息
                MOVE  WK-SJTK-KEKA-RSK   OF  WK-CHZN-TKMZKR00
                  TO  WK-SJTK-KEKA-RSK   OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨経過"
      D             "利息（入力値）は初期値（全部9）じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.市場通貨経過利息
                MOVE  WK-SJTK-KEKA-RSK-IN
                  OF  WK-CHZN-TKMZKR00
                  TO  WK-SJTK-KEKA-RSK   OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              END-IF
              IF  WK-SJTK-GENSEN-TAX-IN  OF  WK-CHZN-TKMZKR00
               =  CNS-SJTK-GENSEN-TAX-9
              THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨"
      D             "源泉税（入力値）は初期値（全部9）の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.市場通貨源泉税
                MOVE  WK-SJTK-GENSEN-TAX
                  OF  WK-CHZN-TKMZKR00
                  TO  WK-SJTK-GENSEN-TAX
                  OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.市場通貨"
      D             "源泉税（入力値）は初期値（全部9）じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.市場通貨源泉税
                MOVE  WK-SJTK-GENSEN-TAX-IN
                  OF  WK-CHZN-TKMZKR00
                  TO  WK-SJTK-GENSEN-TAX
                  OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息確定.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              END-IF
              IF  WK-MNK-TSHO-FACE-ZAN-IN  OF  WK-CHZN-TKMZKR00
               =  CNS-MNK-TSHO-FACE-ZAN-9
              THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.未入金対象額"
      D             "面残高（入力値）は初期値（全部9）の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.未入金対象額面残高
                MOVE  WK-MNK-TSHO-FACE-ZAN
                  OF  WK-CHZN-TKMZKR00
                  TO  WK-MNK-TSHO-FACE-ZAN
                  OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク直前債券過去経過利息確定.未入金対象額面残高=["
      D             WK-MNK-TSHO-FACE-ZAN  OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息.未入金対象額"
      D             "面残高（入力値）は初期値（全部9）じゃないの場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息確定.未入金対象額面残高
                MOVE  WK-MNK-TSHO-FACE-ZAN-IN
                  OF  WK-CHZN-TKMZKR00
                  TO  WK-MNK-TSHO-FACE-ZAN
                  OF  WK-CHZN-SAI-KAKUNIN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク直前債券過去経過利息確定.未入金対象額面残高=["
      D             WK-MNK-TSHO-FACE-ZAN  OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
              END-IF
              IF  WK-FACTOR-RENDOU-KESU-IN      OF  WK-CHZN-TKMZKR00
               =  CNS-FACTOR-RENDOU-KESU-9
              THEN
                MOVE  WK-FACTOR-RENDOU-KESU     OF  WK-CHZN-TKMZKR00
                  TO  WK-FACTOR-RENDOU-KESU     OF  WK-CHZN-SAI-KAKUNIN
              ELSE
                MOVE  WK-FACTOR-RENDOU-KESU-IN  OF  WK-CHZN-TKMZKR00
                  TO  WK-FACTOR-RENDOU-KESU     OF  WK-CHZN-SAI-KAKUNIN
              END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息確定.ファ"
      D             "クター・連動係数  =["
      D             WK-FACTOR-RENDOU-KESU     OF  WK-CHZN-SAI-KAKUNIN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  直前の債券過去経過利息情報取得処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KEKA-RSK-JOHO-EXT.
           EXIT.
      ******************************************************************
      *    直前の債券過去経過利息計算データから取得する
      ******************************************************************
       TKMZBW09-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の債券過去経過利息計算から取得 START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT13                                      @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZBW09-S,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-6
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZBW09-S,
                   WK-FUND-CD            OF  WK-MSG-1-6
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZBW09-S,
                   WK-PTF-CD             OF  WK-MSG-1-6
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZBW09-S,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-6
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZBW09-S,
                   WK-MEG-CD             OF  WK-MSG-1-6
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZBW09-S,
                   WK-TATE-FLG           OF  WK-MSG-1-6
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZBW09-S,
                   WK-GYOKU-ID           OF  WK-MSG-1-6
      *----------  利払日
             MOVE  WK-RIBAR-YMD          OF  WK-NKY-CALC-PKG
               TO  H-RIB-YMD             OF  H-TKMZBW09-S,
                   WK-RIB-YMD            OF  WK-MSG-1-6
      *----------  適用開始日
             MOVE  WK-TEKIYO-FROM        OF  WK-NKY-CALC-PKG
               TO  H-TEKIYO-FROM         OF  H-TKMZBW09-S,
                   WK-TEKIYO-FROM        OF  WK-MSG-1-6
      *----------  処理実行日
             MOVE  WK-SYORI-YMD          OF  WK-DATA-IN
               TO  H-SYORI-YMD           OF  H-TKMZBW09-S,
                   WK-SYORI-YMD          OF  WK-MSG-1-6
      *----------  起動ID
             MOVE  WK-KIDOU-ID           OF  WK-DATA-IN
               TO  H-KIDOU-ID            OF  H-TKMZBW09-S,
                   WK-KIDOU-ID           OF  WK-MSG-1-6
             MOVE  SQL-SELECT-1-6        TO  SQLSTMT13                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":利払日                    =["
      D             H-RIB-YMD            OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日                =["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":処理実行日                =["
      D             H-SYORI-YMD          OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                    =["
      D             H-KIDOU-ID           OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT13=[" SQLSTMT13 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW09-CR-1-OPEN =["
      D            FLG-TKMZBW09-CR-1-OPEN"]"
      *-----------------------------------------------------------------@SEINO@@
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
             IF  FLG-TKMZBW09-CR-1-OPEN = CNS-OFF                       @SEINO@@
             THEN                                                       @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID"カーソルS6第一回"
      D    DISPLAY  CNS-PGM-ID
      D    ":*** 直前の債券過去経過利息計算データCUR PREPARE START ***"
      *-----------------------------------------------------------------
      *----------  直前の債券過去経過利息計算データCURSOR PREPARE
             EXEC  SQL
               PREPARE  S6  FROM  :SQLSTMT13                            @3212SEINO@@
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直前の債券過去経過利息計算データ"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":直前の債券過去経過利息計算データCUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":直前の債券過去経過利息計算データCUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-082
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-6        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D        ":*** 直前の債券過去経過利息計算データCUR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZBW09_CUR_1  CURSOR  FOR  S6
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直前の債券過去経過利息計算データ"
      D             "CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE                                                       @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             END-IF                                                     @SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZBW09_CUR_1
                 USING :H-TKMZBW09-S.H-RIYO-CMP-CD,
                       :H-TKMZBW09-S.H-FUND-CD,
                       :H-TKMZBW09-S.H-PTF-CD,
                       :H-TKMZBW09-S.H-SEC-SBT-CD,
                       :H-TKMZBW09-S.H-MEG-CD,
                       :H-TKMZBW09-S.H-TATE-FLG,
                       :H-TKMZBW09-S.H-GYOKU-ID,
                       :H-TKMZBW09-S.H-RIB-YMD,
                       :H-TKMZBW09-S.H-TEKIYO-FROM,
                       :H-TKMZBW09-S.H-SYORI-YMD,
                       :H-TKMZBW09-S.H-KIDOU-ID
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE           TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直前の債券過去経過利息計算データ"
      D             "CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZBW09-CR-1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":直前の債券過去経過利息計算データCUR OPEN 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW09-CR-1-OPEN=["
      D             FLG-TKMZBW09-CR-1-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":直前の債券過去経過利息計算データCUR OPEN 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-083
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-6        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D         ":*** 直前の債券過去経過利息計算データCUR OPEN END ***"
      D    DISPLAY  CNS-PGM-ID
      D      ":***直前の債券過去経過利息計算データCUR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZBW09_CUR_1
               INTO  :H-TKMZBW09
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直前の債券過去経過利息計算データ"
      D             "CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":債券過去経過利息計算データCURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-6.適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-6.利払日=["
      D             H-RIB-YMD            OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-6.市場通貨コード=["
      D             H-SIJO-TUKA-CD       OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-6.利払対象額面=["
      D             H-RIB-TSHO-FACE      OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-6.市場通貨経過利息=["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-6.市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-6.ファクター・連動係数=["
      D             H-FACTOR-RENDOU-KESU  OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-6.未入金対象額面残高=["
      D             H-MNK-TSHO-FACE-ZAN  OF  H-TKMZBW09"]"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息計算データ.適用開始日
                MOVE  H-TEKIYO-FROM      OF  H-TKMZBW09
                  TO  WK-TEKIYO-FROM     OF  WK-CHZN-TKMZBW09
      *----------  ワーク直前債券過去経過利息計算データ.利払日
                MOVE  H-RIB-YMD          OF  H-TKMZBW09
                  TO  WK-RIB-YMD         OF  WK-CHZN-TKMZBW09
      *----------  ワーク直前債券過去経過利息計算データ.市場通貨コード
                MOVE  H-SIJO-TUKA-CD     OF  H-TKMZBW09
                  TO  WK-SIJO-TUKA-CD    OF  WK-CHZN-TKMZBW09
      *----------  ワーク直前債券過去経過利息計算データ.利払対象額面
                MOVE  H-RIB-TSHO-FACE    OF  H-TKMZBW09
                  TO  WK-RIB-TSHO-FACE   OF  WK-CHZN-TKMZBW09
      *----------  ワーク直前債券過去経過利息計算データ.市場通貨経過利息
                MOVE  H-SJTK-KEKA-RSK    OF  H-TKMZBW09
                  TO  WK-SJTK-KEKA-RSK   OF  WK-CHZN-TKMZBW09
      *----------  ワーク直前債券過去経過利息計算データ.市場通貨源泉税
                MOVE  H-SJTK-GENSEN-TAX  OF  H-TKMZBW09
                  TO  WK-SJTK-GENSEN-TAX
                  OF  WK-CHZN-TKMZBW09
      *----------  ワーク直前債券過去経過利息計算データ.ファクター・連動係数
                MOVE  H-FACTOR-RENDOU-KESU
                  OF  H-TKMZBW09
                  TO  WK-FACTOR-RENDOU-KESU
                  OF  WK-CHZN-TKMZBW09
      *----------  ワーク直前債券過去経過利息計算データ.未入金対象額面残高
                MOVE  H-MNK-TSHO-FACE-ZAN
                  OF  H-TKMZBW09
                  TO  WK-MNK-TSHO-FACE-ZAN
                  OF  WK-CHZN-TKMZBW09
      *----------  ワーク直前債券過去経過利息計算データフラグ
                MOVE  CNS-CHZN-TKMZBW09-FLG-1
                  TO  WK-CHZN-TKMZBW09-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息計算データ.適用開始日=["
      D             WK-TEKIYO-FROM       OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息計算データ.利払日    =["
      D             WK-RIB-YMD           OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID
      D         ":ワーク直前債券過去経過利息計算データ.市場通貨コード=["
      D             WK-SIJO-TUKA-CD      OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":ワーク直前債券過去経過利息計算データ.利払対象額面=["
      D             WK-RIB-TSHO-FACE     OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID
      D       ":ワーク直前債券過去経過利息計算データ.市場通貨経過利息=["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID
      D         ":ワーク直前債券過去経過利息計算データ.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前債券過去経過利息"
      D             "計算データ.ファクター・連動係数                 =["
      D             WK-FACTOR-RENDOU-KESU  OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID
      D     ":ワーク直前債券過去経過利息計算データ.未入金対象額面残高=["
      D             WK-MNK-TSHO-FACE-ZAN   OF  WK-CHZN-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息計算データフラグ     =["
      D             WK-CHZN-TKMZBW09-FLG"]"
      *-----------------------------------------------------------------
              WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直前の債券過去経過利息計算データ"
      D             "CURSOR FETCH NOTFOUND"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息計算データフラグ
                MOVE  CNS-CHZN-TKMZBW09-FLG-0
                  TO  WK-CHZN-TKMZBW09-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息計算データフラグ=["
      D             WK-CHZN-TKMZBW09-FLG"]"
      *-----------------------------------------------------------------
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":直前の債券過去経過利息計算データCURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-084
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-6      DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D         ":*** 直前の債券過去経過利息計算データCUR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":*** 債券過去経過利息計算データ"         @SEINO@@
      *D*           "CUR CLOSE START ***"                               @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW09-CR-1-OPEN= ["             @SEINO@@
      *D*           FLG-TKMZBW09-CR-1-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZBW09_CUR_1                                       @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID"直前の債券過去経過利息計算データ"        @SEINO@@
      *D*           "CUR CLOSE SQLCODE=["SQLCODE"]"                     @SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*        ":直前の債券過去経過利息計算データCURSOR CLOSE  正常"  @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZBW09-CR-1-OPEN     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZBW09-CR-1-OPEN =["             @SEINO@@
      *D*           FLG-TKMZBW09-CR-1-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*         ":直前の債券過去経過利息計算データCURSOR CLOSE  異常" @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-085                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-6          DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*        ":***直前の債券過去経過利息計算データCUR CLOSE END ***"@SEINO@@
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-GET-EXT.
           EXIT.
      ******************************************************************
      *    直前の債券過去経過利息から取得する
      ******************************************************************
       TKMZKR00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の債券過去経過利息から取得  START ***"
      *-----------------------------------------------------------------
             INITIALIZE  SQLSTMT14                                      @3212SEINO@@
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN
               TO  H-RIYO-CMP-CD         OF  H-TKMZKR00-S,
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-7
      *----------  ファンドコード
             MOVE  WK-FUND-CD            OF  WK-DATA-IN
               TO  H-FUND-CD             OF  H-TKMZKR00-S,
                   WK-FUND-CD            OF  WK-MSG-1-7
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD             OF  WK-DATA-IN
               TO  H-PTF-CD              OF  H-TKMZKR00-S,
                   WK-PTF-CD             OF  WK-MSG-1-7
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN
               TO  H-SEC-SBT-CD          OF  H-TKMZKR00-S,
                   WK-SEC-SBT-CD         OF  WK-MSG-1-7
      *----------  銘柄コード
             MOVE  WK-MEG-CD             OF  WK-DATA-IN
               TO  H-MEG-CD              OF  H-TKMZKR00-S,
                   WK-MEG-CD             OF  WK-MSG-1-7
      *----------  資産/負債・買建/売建フラグ
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN
               TO  H-TATE-FLG            OF  H-TKMZKR00-S,
                   WK-TATE-FLG           OF  WK-MSG-1-7
      *----------  玉ID
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN
               TO  H-GYOKU-ID            OF  H-TKMZKR00-S,
                   WK-GYOKU-ID           OF  WK-MSG-1-7
      *----------  利払日
             MOVE  WK-RIBAR-YMD          OF  WK-NKY-CALC-PKG
               TO  H-RIB-YMD             OF  H-TKMZKR00-S,
                   WK-RIB-YMD            OF  WK-MSG-1-7
      *----------  適用開始日
             MOVE  WK-TEKIYO-FROM        OF  WK-NKY-CALC-PKG
               TO  H-TEKIYO-FROM         OF  H-TKMZKR00-S,
                   WK-TEKIYO-FROM        OF  WK-MSG-1-7
             MOVE  SQL-SELECT-1-7        TO  SQLSTMT14                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["
      D             H-RIYO-CMP-CD        OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["
      D             H-FUND-CD            OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["
      D             H-PTF-CD             OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["
      D             H-SEC-SBT-CD         OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["
      D             H-MEG-CD             OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG           OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["
      D             H-GYOKU-ID           OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":利払日                    =["
      D             H-RIB-YMD            OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日                =["
      D             H-TEKIYO-FROM        OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT14=[" SQLSTMT14 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZKR00-CR-2-OPEN =["
      D            FLG-TKMZKR00-CR-2-OPEN"]"
      *-----------------------------------------------------------------@SEINO@@
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
             IF  FLG-TKMZKR00-CR-2-OPEN = CNS-OFF                       @SEINO@@
             THEN                                                       @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID"カーソルS7第一回"
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の債券過去経過利息 CUR PREPARE START ***"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息CURSOR PREPARE
             EXEC  SQL
               PREPARE  S7  FROM  :SQLSTMT14
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直前の債券過去経過利息"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":直前の債券過去経過利息CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":直前の債券過去経過利息CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-086
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-7        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の債券過去経過利息CUR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZKR00_CUR_2  CURSOR  FOR  S7
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D         ":直前の債券過去経過利息CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE                                                       @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             END-IF                                                     @SEINO@@
      *----------  OPEN CURSOR
             EXEC  SQL
               OPEN  TKMZKR00_CUR_2
                 USING :H-TKMZKR00-S.H-RIYO-CMP-CD,
                       :H-TKMZKR00-S.H-FUND-CD,
                       :H-TKMZKR00-S.H-PTF-CD,
                       :H-TKMZKR00-S.H-SEC-SBT-CD,
                       :H-TKMZKR00-S.H-MEG-CD,
                       :H-TKMZKR00-S.H-TATE-FLG,
                       :H-TKMZKR00-S.H-GYOKU-ID,
                       :H-TKMZKR00-S.H-RIB-YMD,
                       :H-TKMZKR00-S.H-TEKIYO-FROM
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D            ":直前の債券過去経過利息CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON              TO  FLG-TKMZKR00-CR-2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直前の債券過去経過利息CUR OPEN 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-CR-2-OPEN=["
      D             FLG-TKMZKR00-CR-2-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直前の債券過去経過利息CUR OPEN 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-087
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-7        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の債券過去経過利息CUR OPEN END ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の債券過去経過利息CUR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
             EXEC SQL
               FETCH TKMZKR00_CUR_2
               INTO  :H-TKMZKR00
             END-EXEC
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":直前の債券過去経過利息CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
      *----------  正常
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直前の債券過去経過利息 CUR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.適用開始日=["
      D             H-TEKIYO-FROM        OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.利払日=["
      D             H-RIB-YMD            OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.市場通貨コード=["
      D             H-SIJO-TUKA-CD       OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.利払対象額面=["
      D             H-RIB-TSHO-FACE      OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.市場通貨経過利息=["
      D             H-SJTK-KEKA-RSK      OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.市場通貨経過利息（入力値）=["
      D             H-SJTK-KEKA-RSK-IN   OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX    OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.市場通貨源泉税（入力値）=["
      D             H-SJTK-GENSEN-TAX-IN  OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.ファクター・連動係数=["
      D             H-FACTOR-RENDOU-KESU  OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.ファクター・連動係数（入力値）"
      D             "=["H-FACTOR-RENDOU-KESU-IN  OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.未入金対象額面残高=["
      D             H-MNK-TSHO-FACE-ZAN  OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-7.未入金対象額面残高（入力値）=["
      D             H-MNK-TSHO-FACE-ZAN-IN  OF  H-TKMZKR00"]"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息.適用開始日
                MOVE  H-TEKIYO-FROM      OF  H-TKMZKR00
                  TO  WK-TEKIYO-FROM     OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.利払日
                MOVE  H-RIB-YMD          OF  H-TKMZKR00
                  TO  WK-RIB-YMD         OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.市場通貨コード
                MOVE  H-SIJO-TUKA-CD     OF  H-TKMZKR00
                  TO  WK-SIJO-TUKA-CD    OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.利払対象額面
                MOVE  H-RIB-TSHO-FACE    OF  H-TKMZKR00
                  TO  WK-RIB-TSHO-FACE   OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.市場通貨経過利息
                MOVE  H-SJTK-KEKA-RSK    OF  H-TKMZKR00
                  TO  WK-SJTK-KEKA-RSK   OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.市場通貨経過利息（入力値）
                MOVE  H-SJTK-KEKA-RSK-IN
                  OF  H-TKMZKR00
                  TO  WK-SJTK-KEKA-RSK-IN
                  OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.市場通貨源泉税
                MOVE  H-SJTK-GENSEN-TAX  OF  H-TKMZKR00
                  TO  WK-SJTK-GENSEN-TAX
                  OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.市場通貨源泉税（入力値）
                MOVE  H-SJTK-GENSEN-TAX-IN
                  OF  H-TKMZKR00
                  TO  WK-SJTK-GENSEN-TAX-IN
                  OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.ファクター・連動係数
                MOVE  H-FACTOR-RENDOU-KESU
                  OF  H-TKMZKR00
                  TO  WK-FACTOR-RENDOU-KESU
                  OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.ファクター・連動係数（入力値）
                MOVE  H-FACTOR-RENDOU-KESU-IN
                  OF  H-TKMZKR00
                  TO  WK-FACTOR-RENDOU-KESU-IN
                  OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.未入金対象額面残高
                MOVE  H-MNK-TSHO-FACE-ZAN
                  OF  H-TKMZKR00
                  TO  WK-MNK-TSHO-FACE-ZAN
                  OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息.未入金対象額面残高（入力値）
                MOVE  H-MNK-TSHO-FACE-ZAN-IN
                  OF  H-TKMZKR00
                  TO  WK-MNK-TSHO-FACE-ZAN-IN
                  OF  WK-CHZN-TKMZKR00
      *----------  ワーク直前債券過去経過利息フラグ
                MOVE  CNS-CHZN-TKMZKR00-FLG-1
                  TO  WK-CHZN-TKMZKR00-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息.適用開始日          =["
      D             WK-TEKIYO-FROM       OF  WK-CHZN-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息.利払日              =["
      D             WK-RIB-YMD           OF  WK-CHZN-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息.市場通貨コード      =["
      D             WK-SIJO-TUKA-CD      OF  WK-CHZN-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息.利払対象額面        =["
      D             WK-RIB-TSHO-FACE     OF  WK-CHZN-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息.市場通貨経過利息    =["
      D             WK-SJTK-KEKA-RSK     OF  WK-CHZN-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息.市場通貨源泉税      =["
      D             WK-SJTK-GENSEN-TAX   OF  WK-CHZN-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息.ファクター・連動係数=["
      D             WK-FACTOR-RENDOU-KESU  OF  WK-CHZN-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息.未入金対象額面残高  =["
      D             WK-MNK-TSHO-FACE-ZAN  OF  WK-CHZN-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息フラグ               =["
      D             WK-CHZN-TKMZKR00-FLG"]"
      *-----------------------------------------------------------------
              WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":債券過去経過利息CURSOR FETCH NOTFOUND"
      *-----------------------------------------------------------------
      *----------  ワーク直前債券過去経過利息フラグ
                MOVE  CNS-CHZN-TKMZKR00-FLG-0
                  TO  WK-CHZN-TKMZKR00-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前債券過去経過利息フラグ=["
      D             WK-CHZN-TKMZKR00-FLG"]"
      *-----------------------------------------------------------------
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":債券過去経過利息CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-088
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-7      DELIMITED  BY  SIZE
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の債券過去経過利息CUR FETCH END ***"
      *-----------------------------------------------------------------@SEINO@@
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":*** 直前の債券過去経過利息CUR CLOSE START ***"    @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-2-OPEN= ["             @SEINO@@
      *D*           FLG-TKMZKR00-CR-2-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***    CLOSE TKMZKR00_CUR_2                                       @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------------------単体テスト專用-----------------------------
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*          "直前の債券過去経過利息CUR CLOSE SQLCODE=["SQLCODE"]"@SEINO@@
      *-----------------------------------------------------------------
      ***  IF  SQLCODE = CNS-SQL-NORMAL                                 @SEINO@@
      ***  THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":直前の債券過去経過利息CURSOR CLOSE  正常"         @SEINO@@
      *-----------------------------------------------------------------
      ***    MOVE  CNS-OFF               TO  FLG-TKMZKR00-CR-2-OPEN     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID ":FLG-TKMZKR00-CR-2-OPEN =["             @SEINO@@
      *D*           FLG-TKMZKR00-CR-2-OPEN "]"                          @SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":直前の債券過去経過利息CURSOR CLOSE  異常"         @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @SEINO@@
      ***      TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-089                                          @SEINO@@
      ***      TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @SEINO@@
      ***      TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @SEINO@@
      ***      TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @SEINO@@
      ***            WK-MSG-1-7          DELIMITED  BY  SIZE            @SEINO@@
      ***      INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @SEINO@@
      *D*           ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @SEINO@@
      *D*           ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @SEINO@@
      *D*           RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @SEINO@@
      *D*           DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @SEINO@@
      *D*           DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @SEINO@@
      *D*           FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @SEINO@@
      ***  END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID                                          @SEINO@@
      *D*           ":***直前の債券過去経過利息CUR CLOSE END ***"       @SEINO@@
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-GET-EXT.
           EXIT.
      ******************************************************************@3212SEINO@@
      *    残高異動から利付き数量を取得                                 @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMZZI00-GET21-RTN     SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 残高異動から利付き数量"             @3212SEINO@@
      D             "を取得  START ***"                                 @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":約定ベース受渡順フラグ NOT = 1"         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR PREPARE  START ***"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             INITIALIZE  SQLSTMT19                                      @3212SEINO@@
      *----------  利用会社コード                                       @3212SEINO@@
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-RIYO-CMP-CD         OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-15                @3212SEINO@@
      *----------  ファンドコード                                       @3212SEINO@@
             MOVE  WK-FUND-CD            OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-FUND-CD             OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-FUND-CD            OF  WK-MSG-1-15                @3212SEINO@@
      *----------  ポートフォリオコード                                 @3212SEINO@@
             MOVE  WK-PTF-CD             OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-PTF-CD              OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-PTF-CD             OF  WK-MSG-1-15                @3212SEINO@@
      *----------  銘柄コード                                           @3212SEINO@@
             MOVE  WK-MEG-CD             OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-MEG-CD              OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-MEG-CD             OF  WK-MSG-1-15                @3212SEINO@@
      *----------  証券種別コード                                       @3212SEINO@@
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-SEC-SBT-CD          OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-SEC-SBT-CD         OF  WK-MSG-1-15                @3212SEINO@@
      *----------  資産/負債・買建/売建フラグ                           @3212SEINO@@
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-TATE-FLG            OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-TATE-FLG           OF  WK-MSG-1-15                @3212SEINO@@
      *----------  玉ID                                                 @3212SEINO@@
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-GYOKU-ID            OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-GYOKU-ID           OF  WK-MSG-1-15                @3212SEINO@@
      *----------  計上基準日                                           @3212SEINO@@
             MOVE  WK-KAISI-KJN-YMD      OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-KEIJOU-KIJUNBI1     OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-KEIJOU-KIJUNBI1    OF  WK-MSG-1-15                @3212SEINO@@
             MOVE  WK-KJN-YMD            OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-KEIJOU-KIJUNBI      OF  H-TKMZZI00-S2,             @3212SEINO@@
                   WK-KEIJOU-KIJUNBI     OF  WK-MSG-1-15                @3212SEINO@@
             STRING  SQL-SELECT-1-15,                                   @3212SEINO@@
                     CNS-ODBY-KJO-KJB,                                  @3212SEINO@@
                     CNS-ODBY-IDO-KJN  DELIMITED  BY  SIZE              @3212SEINO@@
               INTO  SQLSTMT19                                          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["          @3212SEINO@@
      D             H-RIYO-CMP-CD        OF  H-TKMZZI00-S2"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["          @3212SEINO@@
      D             H-FUND-CD            OF  H-TKMZZI00-S2"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["          @3212SEINO@@
      D             H-PTF-CD             OF  H-TKMZZI00-S2"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["          @3212SEINO@@
      D             H-MEG-CD             OF  H-TKMZZI00-S2"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["          @3212SEINO@@
      D             H-SEC-SBT-CD         OF  H-TKMZZI00-S2"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["          @3212SEINO@@
      D             H-TATE-FLG           OF  H-TKMZZI00-S2"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["          @3212SEINO@@
      D             H-GYOKU-ID           OF  H-TKMZZI00-S2"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":計上基準日1               =["          @3212SEINO@@
      D             H-KEIJOU-KIJUNBI1           OF  H-TKMZZI00-S2"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":計上基準日                =["          @3212SEINO@@
      D             H-KEIJOU-KIJUNBI            OF  H-TKMZZI00-S2"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT19=[" SQLSTMT19 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"                             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"FLG-TKMZZI00-CR-3-OPEN =["                @3212SEINO@@
      D            FLG-TKMZZI00-CR-3-OPEN"]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMZZI00-CR-3-OPEN = CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  対象取引情報(別紙1-5)CURSOR PREPARE                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"カーソルS15-1第一回"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  残高異動CURSOR PREPARE                               @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
               PREPARE  S151 FROM  :SQLSTMT19                           @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D       ":残高異動CURSOR PREPARE SQLCODE =[" SQLCODE "]"          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             IF  SQLCODE = CNS-SQL-NORMAL                               @3212SEINO@@
             THEN                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CUR PREPARE 正常"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             ELSE                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CUR PREPARE 異常"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
               MOVE  CNS-PGM-ID                                         @3212SEINO@@
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
               MOVE  CNS-POS-090                                        @3212SEINO@@
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
               MOVE  CNS-RTN-900                                        @3212SEINO@@
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
               MOVE  SQLCODE                                            @3212SEINO@@
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
               MOVE  CNS-DETAIL-1                                       @3212SEINO@@
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
               STRING  CNS-SQL-MSG-SELECT,                              @3212SEINO@@
                       WK-MSG-1-15        DELIMITED  BY  SIZE           @3212SEINO@@
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-POS                      =["        @3212SEINO@@
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
               PERFORM  ERR-RTN                                         @3212SEINO@@
             END-IF                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR OPEN START ***"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  DECLARE CURSOR                                       @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
               DECLARE  TKMZZI00_CUR_3  CURSOR  FOR  S151               @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":残高異動CUR DECLARE SQLCODE=["SQLCODE"]"          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  OPEN CURSOR                                          @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
               OPEN  TKMZZI00_CUR_3                                     @3212SEINO@@
                 USING :H-TKMZZI00-S2.H-RIYO-CMP-CD,                    @3212SEINO@@
                       :H-TKMZZI00-S2.H-FUND-CD,                        @3212SEINO@@
                       :H-TKMZZI00-S2.H-PTF-CD,                         @3212SEINO@@
                       :H-TKMZZI00-S2.H-MEG-CD,                         @3212SEINO@@
                       :H-TKMZZI00-S2.H-SEC-SBT-CD,                     @3212SEINO@@
                       :H-TKMZZI00-S2.H-TATE-FLG,                       @3212SEINO@@
                       :H-TKMZZI00-S2.H-GYOKU-ID,                       @3212SEINO@@
                       :H-TKMZZI00-S2.H-KEIJOU-KIJUNBI1,                @3212SEINO@@
                       :H-TKMZZI00-S2.H-KEIJOU-KIJUNBI                  @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *----------------------単体テスト專用-----------------------------@3212SEINO@@
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":残高異動CUR OPEN SQLCODE=["SQLCODE"]"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             IF  SQLCODE  =  CNS-SQL-NORMAL                             @3212SEINO@@
             THEN                                                       @3212SEINO@@
               MOVE  CNS-ON              TO  FLG-TKMZZI00-CR-3-OPEN     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR OPEN  正常"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR-3-OPEN=["               @3212SEINO@@
      D             FLG-TKMZZI00-CR-3-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             ELSE                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR OPEN  異常"              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
               MOVE  CNS-PGM-ID                                         @3212SEINO@@
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
               MOVE  CNS-POS-091                                        @3212SEINO@@
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
               MOVE  CNS-RTN-900                                        @3212SEINO@@
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
               MOVE  SQLCODE                                            @3212SEINO@@
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
               MOVE  CNS-DETAIL-1                                       @3212SEINO@@
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
               STRING  CNS-SQL-MSG-SELECT,                              @3212SEINO@@
                       WK-MSG-1-15        DELIMITED  BY  SIZE           @3212SEINO@@
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
               PERFORM  ERR-RTN                                         @3212SEINO@@
             END-IF                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR OPEN END ***"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR FETCH START ***"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  CURSOR FETCH                                         @3212SEINO@@
             EXEC SQL                                                   @3212SEINO@@
               FETCH TKMZZI00_CUR_3                                     @3212SEINO@@
               INTO  :H-TKMZZI00.H-IDOG-SRYZN-RIT                       @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *----------------------単体テスト專用-----------------------------@3212SEINO@@
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":残高異動CUR FETCH SQLCODE=["SQLCODE"]"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             EVALUATE  SQLCODE                                          @3212SEINO@@
      *----------  正常                                                 @3212SEINO@@
               WHEN  CNS-SQL-NORMAL                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH  正常"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":別紙1-15.異動後数量残高（利付）=["      @3212SEINO@@
      D             H-IDOG-SRYZN-RIT     OF  H-TKMZZI00"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動数量（利付）集計=["             @3212SEINO@@
      D             WK-MTGI-IDO-SURYO-SHUKE                             @3212SEINO@@
      D                                   OF  WK-DATA-IN"]"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  ワーク基準日計算パッケージ.利付き数量←「別紙1-15 SQL説明」.異動後数量残高（利付）
      *----------  - ARG1.跨ぎ異動数量（利付）集計                      @3212SEINO@@
                COMPUTE  WK-RIT-SRY         OF  WK-KJY-CALC-PKG         @3212SEINO@@
                      =  H-IDOG-SRYZN-RIT   OF  H-TKMZZI00              @3212SEINO@@
                      -  WK-MTGI-IDO-SURYO-SHUKE                        @3212SEINO@@
                                            OF  WK-DATA-IN              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.利付き数量=["@3212SEINO@@
      D             WK-RIT-SRY           OF  WK-KJY-CALC-PKG"]"         @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               WHEN  CNS-SQL-NOTFOUND                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH NOTFOUND"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ARG1.開始時残高数量残高（利付）=["      @3212SEINO@@
      D             WK-KAISIZN-SRYZN-RIT  OF  WK-DATA-IN"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動数量（利付）集計=["             @3212SEINO@@
      D             WK-MTGI-IDO-SURYO-SHUKE                             @3212SEINO@@
      D                                   OF  WK-DATA-IN"]"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  ワーク基準日計算パッケージ.利付き数量←ARG1.開始時残高数量残高（利付）
      *----------  - ARG1.跨ぎ異動数量（利付）集計                      @3212SEINO@@
                COMPUTE  WK-RIT-SRY         OF  WK-KJY-CALC-PKG         @3212SEINO@@
                      =  WK-KAISIZN-SRYZN-RIT                           @3212SEINO@@
                                            OF  WK-DATA-IN              @3212SEINO@@
                      -  WK-MTGI-IDO-SURYO-SHUKE                        @3212SEINO@@
                                            OF  WK-DATA-IN              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ワーク基準日計算パッケージ.利付き数量=["@3212SEINO@@
      D             WK-RIT-SRY           OF  WK-KJY-CALC-PKG"]"         @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               WHEN  OTHER                                              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH  異常"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                 MOVE  CNS-PGM-ID                                       @3212SEINO@@
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                 MOVE  CNS-POS-092                                      @3212SEINO@@
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                 MOVE  CNS-RTN-900                                      @3212SEINO@@
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                 MOVE  SQLCODE                                          @3212SEINO@@
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                 MOVE  CNS-DETAIL-1                                     @3212SEINO@@
                   TO  DETAIL-RTN-CD-FLG                                @3212SEINO@@
                   OF  PARM-SCZY1170-ARG1                               @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
                 STRING  CNS-SQL-MSG-SELECT,                            @3212SEINO@@
                         WK-MSG-1-15      DELIMITED  BY  SIZE           @3212SEINO@@
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                 PERFORM  ERR-RTN                                       @3212SEINO@@
             END-EVALUATE                                               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR FETCH END ***"                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":***残高異動から利付き数量"             @3212SEINO@@
      D             "を取得 END ***"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMZZI00-GET21-EXT.                                              @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *    残高異動から利付き数量を取得                                 @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMZZI00-GET1-RTN      SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 残高異動から利付き数量"             @3212SEINO@@
      D             "を取得  START ***"                                 @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":約定ベース受渡順フラグ NOT = 1 "        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR PREPARE  START ***"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             INITIALIZE  SQLSTMT18                                      @3212SEINO@@
      *----------  利用会社コード                                       @3212SEINO@@
             MOVE  WK-RIYO-CMP-CD        OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-RIYO-CMP-CD         OF  H-TKMZZI00-S,              @3212SEINO@@
                   WK-RIYO-CMP-CD        OF  WK-MSG-1-2                 @3212SEINO@@
      *----------  ファンドコード                                       @3212SEINO@@
             MOVE  WK-FUND-CD            OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-FUND-CD             OF  H-TKMZZI00-S,              @3212SEINO@@
                   WK-FUND-CD            OF  WK-MSG-1-2                 @3212SEINO@@
      *----------  ポートフォリオコード                                 @3212SEINO@@
             MOVE  WK-PTF-CD             OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-PTF-CD              OF  H-TKMZZI00-S,              @3212SEINO@@
                   WK-PTF-CD             OF  WK-MSG-1-2                 @3212SEINO@@
      *----------  銘柄コード                                           @3212SEINO@@
             MOVE  WK-MEG-CD             OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-MEG-CD              OF  H-TKMZZI00-S,              @3212SEINO@@
                   WK-MEG-CD             OF  WK-MSG-1-2                 @3212SEINO@@
      *----------  証券種別コード                                       @3212SEINO@@
             MOVE  WK-SEC-SBT-CD         OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-SEC-SBT-CD          OF  H-TKMZZI00-S,              @3212SEINO@@
                   WK-SEC-SBT-CD         OF  WK-MSG-1-2                 @3212SEINO@@
      *----------  資産/負債・買建/売建フラグ                           @3212SEINO@@
             MOVE  WK-TATE-FLG           OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-TATE-FLG            OF  H-TKMZZI00-S,              @3212SEINO@@
                   WK-TATE-FLG           OF  WK-MSG-1-2                 @3212SEINO@@
      *----------  玉ID                                                 @3212SEINO@@
             MOVE  WK-GYOKU-ID           OF  WK-DATA-IN                 @3212SEINO@@
               TO  H-GYOKU-ID            OF  H-TKMZZI00-S,              @3212SEINO@@
                   WK-GYOKU-ID           OF  WK-MSG-1-2                 @3212SEINO@@
      *----------  受渡日                                               @3212SEINO@@
             MOVE  WK-JIKAI-RIBAR-YMD-1  OF  WK-RTN-CD-1                @3212SEINO@@
               TO  H-UKE-YMD             OF  H-TKMZZI00-S,              @3212SEINO@@
                   WK-UKE-YMD            OF  WK-MSG-1-2                 @3212SEINO@@
             STRING  SQL-SELECT-1-2,                                    @3212SEINO@@
                     CNS-ODBY-KJO-KJB,                                  @3212SEINO@@
                     CNS-ODBY-IDO-KJN  DELIMITED  BY  SIZE              @3212SEINO@@
               INTO  SQLSTMT18                                          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":利用会社コード            =["          @3212SEINO@@
      D             H-RIYO-CMP-CD        OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":ファンドコード            =["          @3212SEINO@@
      D             H-FUND-CD            OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード      =["          @3212SEINO@@
      D             H-PTF-CD             OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                =["          @3212SEINO@@
      D             H-MEG-CD             OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":証券種別コード            =["          @3212SEINO@@
      D             H-SEC-SBT-CD         OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":資産/負債・買建/売建フラグ=["          @3212SEINO@@
      D             H-TATE-FLG           OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":玉ID                      =["          @3212SEINO@@
      D             H-GYOKU-ID           OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":受渡日                    =["          @3212SEINO@@
      D             H-UKE-YMD            OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT18=[" SQLSTMT18 "]"             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"カーソル検査"                             @3212SEINO@@
      D    DISPLAY CNS-PGM-ID"FLG-TKMZZI00-CR1-OPEN =["                 @3212SEINO@@
      D            FLG-TKMZZI00-CR1-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMZZI00-CR1-OPEN = CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  対象取引情報(別紙1-5)CURSOR PREPARE                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"カーソルS2-1第一回"                      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  残高異動CURSOR PREPARE                               @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
               PREPARE  S21  FROM  :SQLSTMT18                           @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D       ":残高異動CURSOR PREPARE SQLCODE =[" SQLCODE "]"          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             IF  SQLCODE = CNS-SQL-NORMAL                               @3212SEINO@@
             THEN                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CUR PREPARE 正常"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
             ELSE                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CUR PREPARE 異常"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
               MOVE  CNS-PGM-ID                                         @3212SEINO@@
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
               MOVE  CNS-POS-094                                        @3212SEINO@@
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
               MOVE  CNS-RTN-900                                        @3212SEINO@@
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
               MOVE  SQLCODE                                            @3212SEINO@@
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
               MOVE  CNS-DETAIL-1                                       @3212SEINO@@
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
               STRING  CNS-SQL-MSG-SELECT,                              @3212SEINO@@
                       WK-MSG-1-2        DELIMITED  BY  SIZE            @3212SEINO@@
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-POS                      =["        @3212SEINO@@
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
               PERFORM  ERR-RTN                                         @3212SEINO@@
             END-IF                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR OPEN START ***"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  DECLARE CURSOR                                       @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
               DECLARE  TKMZZI00_CUR_1  CURSOR  FOR  S21                @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":残高異動CUR DECLARE SQLCODE=["SQLCODE"]"          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  OPEN CURSOR                                          @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
               OPEN  TKMZZI00_CUR_1                                     @3212SEINO@@
                 USING :H-TKMZZI00-S.H-RIYO-CMP-CD,                     @3212SEINO@@
                       :H-TKMZZI00-S.H-FUND-CD,                         @3212SEINO@@
                       :H-TKMZZI00-S.H-PTF-CD,                          @3212SEINO@@
                       :H-TKMZZI00-S.H-MEG-CD,                          @3212SEINO@@
                       :H-TKMZZI00-S.H-SEC-SBT-CD,                      @3212SEINO@@
                       :H-TKMZZI00-S.H-TATE-FLG,                        @3212SEINO@@
                       :H-TKMZZI00-S.H-GYOKU-ID,                        @3212SEINO@@
                       :H-TKMZZI00-S.H-UKE-YMD                          @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *----------------------単体テスト專用-----------------------------@3212SEINO@@
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":残高異動CUR OPEN SQLCODE=["SQLCODE"]"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             IF  SQLCODE  =  CNS-SQL-NORMAL                             @3212SEINO@@
             THEN                                                       @3212SEINO@@
               MOVE  CNS-ON              TO  FLG-TKMZZI00-CR1-OPEN      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR OPEN  正常"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR1-OPEN=["                @3212SEINO@@
      D             FLG-TKMZZI00-CR1-OPEN"]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             ELSE                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR OPEN  異常"              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
               MOVE  CNS-PGM-ID                                         @3212SEINO@@
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
               MOVE  CNS-POS-095                                        @3212SEINO@@
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
               MOVE  CNS-RTN-900                                        @3212SEINO@@
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
               MOVE  SQLCODE                                            @3212SEINO@@
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
               MOVE  CNS-DETAIL-1                                       @3212SEINO@@
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
               STRING  CNS-SQL-MSG-SELECT,                              @3212SEINO@@
                       WK-MSG-1-2        DELIMITED  BY  SIZE            @3212SEINO@@
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
               PERFORM  ERR-RTN                                         @3212SEINO@@
             END-IF                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR OPEN END ***"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR FETCH START ***"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  CURSOR FETCH                                         @3212SEINO@@
             EXEC SQL                                                   @3212SEINO@@
               FETCH TKMZZI00_CUR_1                                     @3212SEINO@@
               INTO  :H-TKMZZI00.H-IDOG-SRYZN-RIT,                      @3212SEINO@@
                     :H-TKMZZI00.H-SIJO-TUKA-CD                         @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *----------------------単体テスト專用-----------------------------@3212SEINO@@
      *    MOVE  CNS-SQL-UNIQUE          TO  SQLCODE                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":残高異動CUR FETCH SQLCODE=["SQLCODE"]"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             EVALUATE  SQLCODE                                          @3212SEINO@@
      *----------  正常                                                 @3212SEINO@@
               WHEN  CNS-SQL-NORMAL                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH  正常"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":別紙1-2.異動後数量残高（利付）=["       @3212SEINO@@
      D             H-IDOG-SRYZN-RIT     OF  H-TKMZZI00"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":別紙1-2.市場通貨コード=["               @3212SEINO@@
      D             H-SIJO-TUKA-CD       OF  H-TKMZZI00"]"              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  ワーク利払日計算パッケージ.利付き数量                @3212SEINO@@
                 MOVE  H-IDOG-SRYZN-RIT  OF  H-TKMZZI00                 @3212SEINO@@
                   TO  WK-RIT-SRY        OF  WK-RIBAR-YMD-CALC-PKG      @3212SEINO@@
      *----------  ワーク利払日計算パッケージ.市場通貨コード            @3212SEINO@@
                 MOVE  H-SIJO-TUKA-CD    OF  H-TKMZZI00                 @3212SEINO@@
                   TO  WK-SIJO-TUKA-CD   OF  WK-RIBAR-YMD-CALC-PKG      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ワーク利払日計算パッケージ.利付き数量=["@3212SEINO@@
      D             WK-RIT-SRY           OF  WK-RIBAR-YMD-CALC-PKG"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":ワーク利払日計算パッケージ.市場通貨コード      =["@3212SEINO@@
      D             WK-SIJO-TUKA-CD      OF  WK-RIBAR-YMD-CALC-PKG"]"   @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               WHEN  CNS-SQL-NOTFOUND                                   @3212SEINO@@
      *---------- 銘柄別断面情報.開始基準日の残高履歴を取得する         @3212SEINO@@
      *----------  (別紙1-16)                                           @3212SEINO@@
                PERFORM  TKMZZR00-GET-RTN                               @3212SEINO@@
               WHEN  OTHER                                              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動CURSOR FETCH  異常"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                 MOVE  CNS-PGM-ID                                       @3212SEINO@@
                   TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                 MOVE  CNS-POS-096                                      @3212SEINO@@
                   TO  ERR-POS           OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                 MOVE  CNS-RTN-900                                      @3212SEINO@@
                   TO  RTN-CD            OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                 MOVE  SQLCODE                                          @3212SEINO@@
                   TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                 MOVE  CNS-DETAIL-1                                     @3212SEINO@@
                   TO  DETAIL-RTN-CD-FLG                                @3212SEINO@@
                   OF  PARM-SCZY1170-ARG1                               @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
                 STRING  CNS-SQL-MSG-SELECT,                            @3212SEINO@@
                         WK-MSG-1-2      DELIMITED  BY  SIZE            @3212SEINO@@
                   INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                 PERFORM  ERR-RTN                                       @3212SEINO@@
             END-EVALUATE                                               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      D             ":*** 残高異動CURSOR FETCH END ***"                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":***残高異動から利付き数量"             @3212SEINO@@
      D             "を取得 END ***"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMZZI00-GET1-EXT.                                               @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *                 3.4.1 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ2120-ARG2    OF PARM-SMZJ2120-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2120-ARG2=["
      D             PARM-SMZJ2120-ARG2  OF PARM-SMZJ2120-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ= ["FLG-TKMZKR00-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ1= ["FLG-TKMZKR00-CR-1-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ2= ["FLG-TKMZKR00-CR-2-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ3= ["FLG-TKMZKR00-CR-3-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ4= ["FLG-TKMZKR00-CR-4-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":取引カーソルオープン"
      D             "フラグ= ["FLG-TKMXTR00-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":対象取引情報カーソルオープン"
      D             "フラグ= ["FLG-TKMZBW04-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":残高異動カーソルオープン"
      D             "フラグ= ["FLG-TKMZZI00-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":残高異動計算データカーソルオープン"
      D             "フラグ= ["FLG-TKMZBW06-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":残高異動カーソルオープン"
      D             "フラグ= ["FLG-TKMZZI00-CR-2-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":残高異動計算データカーソルオープン"
      D             "フラグ1= ["FLG-TKMZBW06-CR-1-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息計算データカーソル"
      D             "オープンフラグ= ["FLG-TKMZBW09-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息計算データカーソル"
      D             "オープンフラグ1= ["FLG-TKMZBW09-CR-1-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息計算データカーソル"
      D             "オープンフラグ2= ["FLG-TKMZBW09-CR-2-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":残高履歴カーソルオープンフラグ= ["
      D             FLG-TKMZZR00-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":残高異動カーソルオープン"
      D             "フラグTKMZZI00-CR1= ["FLG-TKMZZI00-CR1-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":残高異動カーソルオープン"
      D             "フラグTKMZZI00-CR-3= ["FLG-TKMZZI00-CR-3-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":残高履歴カーソルINSERTフラグ"
      D             "フラグ= ["FLG-TKMZBW09-S3-INSERT"]"
      D    DISPLAY  CNS-PGM-ID ":残高履歴カーソルUPDATEフラグ"
      D             "フラグ= ["FLG-TKMZBW09-S10-UPDATE"]"
      D    DISPLAY  CNS-PGM-ID ":処理START"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                TO  FLG-TKMZBW09-S3-INSERT      @SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW09-S10-UPDATE     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":残高履歴カーソルINSERTフラグ"
      D             "フラグ= ["FLG-TKMZBW09-S3-INSERT"]"
      D    DISPLAY  CNS-PGM-ID ":残高履歴カーソルUPDATEフラグ"
      D             "フラグ= ["FLG-TKMZBW09-S10-UPDATE"]"
      *-----------------------------------------------------------------
      *----------  残高異動カーソルをクローズする
           IF  FLG-TKMZZI00-CR1-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00_CUR_1 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":残高異動カーソルオープン"
      D             "フラグTKMZZI00-CR1= ["FLG-TKMZZI00-CR1-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZZI00_CUR_1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00_CUR_1 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  残高異動カーソルをクローズする
           IF  FLG-TKMZZI00-CR-3-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00_CUR_3 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR-3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":残高異動カーソルオープン"
      D             "フラグTKMZZI00-CR-3= ["FLG-TKMZZI00-CR-3-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZZI00_CUR_3
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00_CUR_3 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  残高履歴カーソルをクローズ
           IF  FLG-TKMZZR00-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZZR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":残高履歴カーソルオープンフラグ= ["
      D             FLG-TKMZZR00-CR-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZZR00_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  債券過去経過利息カーソルをクローズする
           IF  FLG-TKMZKR00-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZKR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ= ["FLG-TKMZKR00-CR-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZKR00_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-TKMZKR00-CR-1-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR_1 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZKR00-CR-1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ1= ["FLG-TKMZKR00-CR-1-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZKR00_CUR_1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR_1 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-TKMZKR00-CR-2-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR_2 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZKR00-CR-2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ2= ["FLG-TKMZKR00-CR-2-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZKR00_CUR_2
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR_2 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-TKMZKR00-CR-3-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR_3 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZKR00-CR-3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ3= ["FLG-TKMZKR00-CR-3-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZKR00_CUR_3
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR_3 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-TKMZKR00-CR-4-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR_4 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZKR00-CR-4-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息カーソルオープン"
      D             "フラグ4= ["FLG-TKMZKR00-CR-4-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZKR00_CUR_4
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR_4 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  取引カーソルをクローズする
           IF  FLG-TKMXTR00-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMXTR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引カーソルオープンフラグ= ["
      D             FLG-TKMXTR00-CR-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMXTR00_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  対象取引情報カーソルをクローズする
           IF  FLG-TKMZBW04-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW04_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZBW04-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":対象取引情報カーソルオープンフラグ= ["
      D             FLG-TKMZBW04-CR-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW04_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW04_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  残高異動カーソルをクローズする
           IF  FLG-TKMZZI00-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":残高異動カーソルオープン"
      D             "フラグ= ["FLG-TKMZZI00-CR-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZZI00_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  残高異動計算データカーソルをクローズする
           IF  FLG-TKMZBW06-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW06_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZBW06-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":残高異動計算データカーソルオープン"
      D             "フラグ= ["FLG-TKMZBW06-CR-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW06_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW06_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  残高異動カーソルをクローズする
           IF  FLG-TKMZZI00-CR-2-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00_CUR_2 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR-2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":残高異動カーソルオープン"
      D             "フラグ= ["FLG-TKMZZI00-CR-2-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZZI00_CUR_2
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00_CUR_2 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-TKMZBW06-CR-1-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW06_CUR_1 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZBW06-CR-1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":残高異動計算データカーソルオープン"
      D             "フラグ1= ["FLG-TKMZBW06-CR-1-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW06_CUR_1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW06_CUR_1 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  債券過去経過利息計算データカーソルをクローズする
           IF  FLG-TKMZBW09-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZBW09-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息計算データカーソル"
      D             "オープンフラグ= ["FLG-TKMZBW09-CR-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW09_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-TKMZBW09-CR-1-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR_1 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZBW09-CR-1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息計算データカーソル"
      D             "オープンフラグ1= ["FLG-TKMZBW09-CR-1-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW09_CUR_1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR_1 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-TKMZBW09-CR-2-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR_2 CLOSE処理を行く"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZBW09-CR-2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":債券過去経過利息計算データカーソル"
      D             "オープンフラグ2= ["FLG-TKMZBW09-CR-2-OPEN"]"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW09_CUR_2
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR_2 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"              USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO  PARM-SMZJ2120-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ2120-ARG3     = ["
      D      PARM-SMZJ2120-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ2120-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ2120-ARG3(COUNTER   OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ2120-ARG3(COUNTER   OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ2120-ARG3(COUNTER   OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ2120-ARG3(COUNTER   OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ2120-ARG3(COUNTER   OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ2120-ARG3(COUNTER   OF PARM-SMZJ2120-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ2120処理  異常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
