      ******************************************************************
      *$Header: $
      ******************************************************************
      *
      *     システムＩＤ   : T-STAR
      *     システム名称   : 次期TSTARシステム
      *     プログラム名称 : 実行状況管理ＩＮＳルーチン
      *     処理概要       : 実行状況管理ＩＮＳルーチン
      *     参照ＤＢ       : 起動ID管理(TKDYAA30)
      *                    : タスクスケジュール中間(TKDYAA24)
      *                    : その他条件所属タスクスケジュール中間(TKDYAA25)
      *                    : 電文保持所属タスクスケジュール中間(TKDYAA26
      *                    : その他条件所属実行状況管理(TKDYAA37)
      *                    : 実行状況管理(TKDYAA31)
      *                    : 電文保持(TKDYAA32)
      *     引数           : IN  ARG1.処理実行日
      *                    : IN  ARG1.ログインユーザ会社コード
      *                    : IN  ARG1.利用会社コード
      *                    : IN  ARG2.起動経路
      *                    : IN  ARG2.起動処理分類
      *                    : IN  ARG3.タスクスケジュールID
      *                    : IN  ARG3.タスクスケジュールユニークコード
      *                    : IN  ARG3.業務タスクID
      *                    : IN  ARG3.帳票作成単位
      *                    : IN  ARG3.ファイル種別
      *                    : IN  ARG3.プリンタID
      *                    : IN  ARG3.入力電文
      *                    : OUT RTNパッケージ
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20080130   新規  SCS        沈焔    新規作成
      *     20080508   修正  SCS        帰勇
      *     20081209   修正  SCS        王瑞娟
      *     20090210   修正  SCS        王瑞娟
      *     20090217   修正  SCS        王瑞娟
      *     20090311   修正  SCS        王瑞娟  連結障害0001488対応
      *     20090316   修正  SCS        王瑞娟  仕様変更00116対応
      *     20090428   修正  SCS        王瑞娟  業務タスクが'TZ006DY'の
      *                                         場合、帳票作成単位、電子
      *                                         帳票形式、紙出力区分を
      *                                         固定値にする。
      *     20090519   修正  SCS        王瑞娟  集信レコードの
      *                                         タスクスケジュール明細ID
      *                                         は900に固定しないように
      *                                         修正する。
      *     20090828   修正  SCS        王瑞娟  700->701
      *     20091120   修正  SCS        王瑞娟  テーマ2059.
      *                                         利用権限エラー対応
      *     20100204   修正  SCS        呉聞傑  テーマ2004対応.
      *     20100524   修正  SCS        顧敏イ　テーマ2691対応．
      *     20100608   修正  SCS        顧敏イ　テーマ2689対応．
      *     20100816   修正  SCS        陳春霞　テーマ1607-3対応．
      *     20111011   修正  SCS        陳　佳　テーマ3215対応．
      *     20130807   修正  SCS        陳　佳　テーマ3495-2対応．
      ******************************************************************
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SCZY1150.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-01-30.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       SPECIAL-NAMES.
       ENVIRONMENT-NAME       ENV-NAME
       ENVIRONMENT-VALUE      ENV-VALUE.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id: $".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
      *----------  プログラムＩＤ
         05  CNS-PGM-ID            PIC  X(08)  VALUE "SCZY1150".
      *----------  起動ID管理
         05  CNS-TBL-TKDYAA24      PIC  X(08)  VALUE "TKDYAA24".
         05  CNS-TBL-TKDYAA25      PIC  X(08)  VALUE "TKDYAA25".
         05  CNS-TBL-TKDYAA26      PIC  X(08)  VALUE "TKDYAA26".
         05  CNS-TBL-TKDYAA30      PIC  X(08)  VALUE "TKDYAA30".
         05  CNS-TBL-TKDYAA37      PIC  X(08)  VALUE "TKDYAA37".
         05  CNS-TBL-TKDYAA38      PIC  X(08)  VALUE "TKDYAA38".
         05  CNS-TBL-TOC0DA21      PIC  X(08)  VALUE "TOC0DA21".
         05  CNS-TBL-TOC0DA23      PIC  X(08)  VALUE "TOC0DA23".
         05  CNS-TBL-TKDYAA14      PIC  X(08)  VALUE "TKDYAA14".
         05  CNS-TBL-TKDYAA20      PIC  X(08)  VALUE "TKDYAA20".
         05  CNS-TBL-TKDYAA29      PIC  X(08)  VALUE "TKDYAA29".
      *----------  リターンコード: 正常終了
         05  CNS-RET-CD-NORMAL     PIC  X(03)  VALUE "000".
      *----------  リターンコード: データなし
         05  CNS-RTN-NO-DATA       PIC  X(03)  VALUE "110".
      *----------  リターンコード: 権限なし
         05  CNS-RET-CD-NOKENG     PIC  X(03)  VALUE "130".
      *----------  リターンコード: システムエラー（Oracle）
         05  CNS-RET-CD-ORAERR     PIC  X(03)  VALUE "900".
      *----------  リターンコード: システムエラー（Oracle以外）
         05  CNS-RET-CD-SYSERR     PIC  X(03)  VALUE "901".
      *----------  リターンコード: 並行稼動禁止
         05  CNS-RET-CD-BINXIN     PIC  X(03)  VALUE "340".
      *----------  リターンコード: パラメータエラー
         05  CNS-RET-CD-PARMET     PIC  X(03)  VALUE "800".
      *----------  リターンコード: 一意制約
         05  CNS-RET-CD-SEYAKU     PIC  X(03)  VALUE "300".
      *----------  リターンコード: システムエラー（環境変数）
         05  CNS-RET-CD-ENVERR     PIC  X(03)  VALUE "910".
      *----------  SQLCODE 正常終了
         05  CNS-SQL-NORMAL        PIC  S9(04)  COMP-3 VALUE +0000.
      *----------  SQLCODE = 1403(データなし)
         05  CNS-SQL-NOTFOUND      PIC  S9(04)  COMP-3 VALUE +1403.
      *----------  SQLCODE = 1405(ヌル)
         05  CNS-SQL-FETCHNULL     PIC  S9(04)  COMP-3 VALUE -1405.
      *----------  CLOSE FLG
         05  CNS-1                 PIC  X(01)  VALUE  "1".
      *----------  詳細リターンコードデコードフラグ:0
         05  CNS-RTN-FLG-0         PIC  X(01)  VALUE "0".
      *----------  詳細リターンコードデコードフラグ:1
         05  CNS-RTN-FLG-1         PIC  X(01)  VALUE "1".
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FLAG-AREA.
      *----------  カーンルデータ終了フラグ
         05  FLG-FETCH-END1        PIC  X(01).
         05  FLG-FETCH-END3        PIC  X(01).
         05  FLG-FETCH-END4        PIC  X(01).
         05  FLG-FETCH-END5        PIC  X(01).
      ******************************************************************
      *                ワ－クエリア
      ******************************************************************
       01  WK-AREA.
      *---------- 処理実行日保存用ワーク
         05  WK-SYORI-JIKOU-YMD    PIC  X(08).
      *---------- 業務タスクID保存用ワーク
         05  WK-GYOMU-TASK-ID      PIC  X(07).
      *---------- 待機有効区分
         05  WK-TAIKI-HANYO-KBN    PIC  X(01).
      *----------  起動ID
         05  WK-KIDOU-ID           PIC  9(04).
      *----------  タスクスケジュール起動ID
         05  WK-TSK-SCHE-KIDOU-ID  PIC  9(04).
      *---------- マシン日付時刻
         05  WK-MAC-DATE-TIME      PIC  X(14).
      *---------- 連続起動集約区分
         05  WK-YMD-KBN            PIC  X(01).
         05  WK-POS-KBN            PIC  X(01).
         05  WK-START-POS          PIC  9(08).
         05  WK-WHERE-TMP          PIC  X(50).
      *---------- 基準日FROM保存用ワーク
         05  WK-KJN-FROM           PIC  X(08).
      *---------- 基準日TO保存用ワーク
         05  WK-KJN-TO             PIC  X(08).
      *---------- 電文情報保存用ワーク
         05  WK-DENBUN-INFO.
           10  WK-AIFA-HEADER      PIC  X(700).
           10  WK-DENBUN-OTHER     PIC  X(40260).
      *---------- 連続起動集約区分保存用ワーク
         05  WK-SYUUYAKU-KBN       PIC  9(03).
      *---------- 帳票作成単位保存用ワーク
         05  WK-REP-CREATE-TANI    PIC  X(01).
      *---------- 帳票区分保存用ワーク
         05  WK-TYU-HYO-KBN        PIC  X(01).
      *---------- 紙出力区分保存用ワーク
         05  WK-KAMI-OUT-KBN       PIC  X(01).
      *---------- プリンタID保存用ワーク
         05  WK-PRINTER-ID         PIC  X(20).
         05  WK-IXCAL-KJN-YMD      PIC  X(08).
         05  WK-JOB-USER-ID        PIC  X(08).
         05  WK-IN-HOST-NAME       PIC  X(32).
         05  WK-UPD-LOGIN-CD       PIC  X(04).
         05  WK-UPD-USER-ID        PIC  X(20).
         05  WK-OYA-KIDOU-ID       PIC  9(04).
      *---------- 汎用パラメータ明細ID保存用ワーク
         05  WK-PARA-MS-ID         PIC  9(03).
      *---------- 利用権限なし業務タスク保存用ワーク
         05  WK-GYOMU-GROUP.
           10  WK-GYOMU-KENGAN-NASI  OCCURS  50  PIC  X(07).
      *---------- 利用権限なし業務タスク件数保存用ワーク
         05  WK-GYOMU-COUNT        PIC  9(02).
      *---------- 項目開始位置保存用ワーク
         05  WK-KOUMO-POS          PIC  9(05).
      *---------- アップロードファイル件数保存用ワーク
         05  WK-UPLOAD-COUNT       PIC  9(02).
         05  WK-KENGAN-KBN         PIC  X(01).
      *---------- 明細ID保存用ワーク
         05  WK-MS-ID              PIC  9(03).
      *---------- 条件項目NO保存用ワーク
         05  WK-JOUKEN-NO          PIC  9(04).
         05  WK-SYORI-KJN-YMD      PIC  X(08).
      *---------- ワーク子業務タスクフラグ
         05  WK-KO-GYOMU-TASK-FLG  PIC  X(01).
      *---------- ワ－クポインター
         05  WK-SQL-POINTER1       PIC  9(09)  COMP.
         05  WK-SQL-POINTER2       PIC  9(09)  COMP.
         05  WK-SQL-POINTER3       PIC  9(09)  COMP.
         05  WK-SQL-POINTER4       PIC  9(09)  COMP.
         05  WK-SQL-POINTER5       PIC  9(09)  COMP.
         05  WK-SQL-POINTER6       PIC  9(09)  COMP.
         05  WK-SQL-POINTER7       PIC  9(09)  COMP.
         05  WK-SQL-POINTER8       PIC  9(09)  COMP.
         05  WK-SQL-POINTER9       PIC  9(09)  COMP.
         05  WK-SQL-WHERE          PIC  X(60).
      *---------- ワ－ク汎用パラメータ件数
         05  WK-PARA-COUNT         PIC  9(04).
      *---------- ワ－クCOUNT
         05  WK-COUNT-X1           PIC  9(04).
      *---------- ワ－クエラーID
         05  WK-ERR-ID             PIC  X(03).
      *---------- ワ－ク詳細リターンコード
         05  WK-DETAIL-RTN-CD      PIC  S9(09).
      *---------- ワ－クポジション
         05  WK-ERR-POS            PIC  X(04).
      *---------- ワ－クフリーメッセージ
         05  WK-FREE-MSG           PIC  X(2000).
         05  WK-FREE-MSG1          PIC  X(2000).
         05  WK-FREE-MSG2          PIC  X(2000).
         05  WK-FREE-MSG3          PIC  X(2000).
      *----------  ワークSQL文長さ
         05  WK-SQL-LEN            PIC  9(07).
      *---------- 日数保存用ワーク
         05  WK-NITSUU             PIC  9(06).
         05  WK-TIDYAA31-STS       PIC  X(01).
         05  WK-SYUSIN-MAX-NUM     PIC  9(04).
         05  WK-SQLCODE-FLG        PIC  X(01).
      *----------  ログインユーザ会社コード
         05  WK-LOGIN-CMP-CD       PIC  X(04).
         05  WK-OYA-GYOMU-TASK-ID  PIC  X(07).
         05  WK-CR-OPEN-FLG1       PIC  X(01).
         05  WK-CR-OPEN-FLG3       PIC  X(01).
         05  WK-CR-OPEN-FLG4       PIC  X(01).
         05  WK-CR-OPEN-FLG5       PIC  X(01).
         05  WK-CR-OPEN-FLG6       PIC  X(01).
         05  WK-CR-OPEN-FLG8       PIC  X(01).
         05  WK-CR-OPEN-FLG9       PIC  X(01).
      *----------  処理実行日
         05  WK-SYORI-YMD          PIC  9(08).
         05  WK-SYORI-YMD-X        REDEFINES  WK-SYORI-YMD PIC  X(08).
       01  WK-AREA2.
      *----------  評価系列コード保存用ワーク
         05  WK-HYK-KRTU-CD        OCCURS  10   PIC  X(04).
      *----------  ポートフォリオグループコード保存用ワーク
         05  WK-PTF-GRP-CD         OCCURS  10   PIC  X(08).
      *----------  ファンドコードFROM保存用ワーク
         05  WK-FUND-CD-FROM       OCCURS  11   PIC  X(12).
      *----------  ファンドコードTO保存用ワーク
         05  WK-FUND-CD-TO         OCCURS  11   PIC  X(12).
      *----------  ポートフォリオFROM保存用ワーク
         05  WK-PTF-CD-FROM        OCCURS  11   PIC  X(04).
      *----------  ポートフォリオTO保存用ワーク
         05  WK-PTF-CD-TO          OCCURS  11   PIC  X(04).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  タスクスケジュール保存用ワーク
       01  WK-TSK-SCHEDULE.
      *----------  タスクスケジュール中間保存用ワーク
         05  WK-TASK-SCHEDULE.
      *----------  タスクスケジュール中間テーブルコピー句
           COPY "TKDYAA24.cpy".
      *----------  タスクスケジュールNo保存用ワーク
         05  WK-TSK-SCHE-NO        PIC  9(02).
      *----------  先行タスクスケジュールNo保存用ワーク
         05  WK-SK-TSK-SCHE-NO     OCCURS  10  PIC  9(02).
      *
      *----------  TKDYAA31_INS 実行状況管理INSERT
       01  PARM-TKDYAA31-INS-ARG.
         05  PARM-TKDYAA31-INS-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-TKDYAA31-INS-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
           COPY  "TKDYAA31.cpy".
       01  PARM-TKDYAA31-RTNPKG.
         05  PARM-TKDYAA31-INS-ARG3.
      *----------  RTNパッケージ
           10  RTN-PAKEG.
           COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  TKDYAA32 電文保持INSERT
       01  PARM-TKDYAA32-INS-ARG.
         05  PARM-TKDYAA32-INS-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-TKDYAA32-INS-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
           COPY  "TKDYAA32.cpy".
       01  PARM-TKDYAA32-RTNPKG.
         05  PARM-TKDYAA32-INS-ARG3.
      *----------  RTNパッケージ
           10  RTN-PAKEG.
           COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  TKDYAA35
       01  PARM-TKDYAA35-INS-ARG.
         05  PARM-TKDYAA35-INS-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-TKDYAA35-INS-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
           COPY  "TKDYAA35.cpy".
       01  PARM-TKDYAA35-RTNPKG.
         05  PARM-TKDYAA35-INS-ARG3.
      *----------  RTNパッケージ
           10  RTN-PAKEG.
           COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  TKDYAA26
       01  PARM-TKDYAA26-INS-ARG.
         05  PARM-TKDYAA26-INS-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
      *----------  入力データ
           10  SEL-IN-DATA.
      *----------  ログインユーザ会社コード
             15  LOGIN-CMP-CD-I    PIC  X(04).
      *----------  利用会社コード
             15  RIYO-CMP-CD-I     PIC  X(04).
      *----------  タスクスケジュールID
             15  TSK-SCHE-ID-I     PIC  X(07).
      *----------  タスクスケジュールユニークコード
             15  TSK-SCHE-UNIQUE-CD-I          PIC  X(10).
      *----------  タスクスケジュール明細ID
             15  TSK-SCHE-MS-ID-I  PIC  9(03).
      *----------  更新日時
             15  UPD-DATE-I        PIC  X(14).
      *----------  ロック区分
             15  LOCK-KBN-I        PIC  X(01).
         05  PARM-TKDYAA26-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
           COPY  "TKDYAA26.cpy".
       01  PARM-TKDYAA26-RTNPKG.
         05  PARM-TKDYAA26-INS-ARG3.
      *----------  RTNパッケージ
           10  RTN-PAKEG.
           COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
      *----------  テーブルID取得ルーチンコピー句
           COPY "SCZY1160.cpy".
       01  PARM-SCZY1160-RTNPKG.
         05  PARM-SCZY1160-ARG3.
      *----------  RTNパッケージ
           COPY "CZRTNPACKAGE.cpy".
      *
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-INOUT.
      *----------  リターンパッケージセットルーチンコピー句
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  SCZY1130 利用権限チェックルーチン
       01  PARM-SCZY1130-INOUT.
      *----------  ルーチンコピー句
           COPY "SCZY1130.cpy".
       01  PARM-SCZY1130-RTNPKG.
         05  PARM-SCZY1130-ARG3.
      *----------  RTNパッケージ
           COPY "CZRTNPACKAGE.cpy".
      *----------  SCZY5080 汎用パラメータ取得ルーチン
       01  PARM-SCZY5080-INOUT.
      *----------  ルーチンコピー句
           COPY "SCZY5080.cpy".
       01  PARM-SCZY5080-RTNPKG.
         05  PARM-SCZY5080-ARG4.
      *----------  RTNパッケージ
           COPY "CZRTNPACKAGE.cpy".
      *----------  SCZY1060
       01  PARM-SCZY1060-INOUT.
      *----------  日付置換ルーチン
           COPY "SCZY1060.cpy".
       01  PARM-SCZY1060-RTNPKG.
         05  PARM-SCZY1060-ARG3.
      *----------  RTNパッケージ
           COPY "CZRTNPACKAGE.cpy".
      *
      *----------  入力電文
       01  PARM-DENBUN-ARG.
         05  PARM-DENBUN-ARG1.
      *----------  AIFA
           COPY  "WOMCMAIFA.CPY".
         05  PARM-DENBUN-ARG2.
      *----------  共通ヘッダ
           COPY  "CZCOMMONHEADER.cpy".
         05  PARM-DENBUN-ARG3.
      *----------  電文
           10  DENBUN-LEN          PIC  X(40260).
      *----------  TSC0DA21 業務タスクマスタSELECTルーチン
       01  PARM-TSC0DA21-INOUT.
         05  PARM-TSC0DA21-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
      *----------  SELECT条件
           10  SEL-WHERE           PIC  X(1000).
         05  PARM-TSC0DA21-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
             COPY  "TOC0DA21.cpy".
       01  PARM-TSC0DA21-RTNPKG.
         05  PARM-TSC0DA21-ARG3.
      *----------  RTNパッケージ
           10  TBL-RTNPKG.
             COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  TSC0SE15 システム属性SELECTルーチン
       01  PARM-TSC0SE15-INOUT.
         05  PARM-TSC0SE15-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-TSC0SE15-ARG2.
      *----------  SELECT条件
           10  SEL-WHERE           PIC  X(1000).
         05  PARM-TSC0SE15-ARG3.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
             COPY  "TOC0SE15.cpy".
       01  PARM-TSC0SE15-RTNPKG.
         05  PARM-TSC0SE15-ARG4.
      *----------  RTNパッケージ
           10  TBL-RTNPKG.
             COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  SCZY1100 監査ログＩＮＳルーチン
       01  PARM-SCZY1100-AIFA-H.
      *----------  AIFA
         05  PARM-SCZY1100-AIFA.
           COPY  "WOMCMAIFA.CPY".
      *---------- 共通ヘッダ項目
         05  PARM-SCZY1100-HEADER.
           COPY  "CZCOMMONHEADER.cpy".
       01  PARM-SCZY1100-INOUT.
           COPY  "SCZY1100.cpy".
       01  PARM-SCZY1100-RTNPKG.
         05  PARM-SCZY1100-ARG3.
      *----------  RTNパッケージ
           COPY "CZRTNPACKAGE.cpy".
      *----------  TKDYAA37_INS その他条件所属実行状況管理
       01  PARM-TKDYAA37-INS-ARG.
         05  PARM-TKDYAA37-INS-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-TKDYAA37-INS-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
           COPY  "TKDYAA37.cpy".
       01  PARM-TKDYAA37-RTNPKG.
         05  PARM-TKDYAA37-INS-ARG3.
      *----------  RTNパッケージ
           10  RTN-PAKEG.
           COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  TSC0SE16 ユーザー会社属性SELECTルーチン
       01  PARM-TSC0SE16-INOUT.
         05  PARM-TSC0SE16-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-TSC0SE16-ARG2.
      *----------  SELECT条件
           10  SEL-WHERE           PIC  X(1000).
         05  PARM-TSC0SE16-ARG3.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
             COPY  "TOC0SE16.cpy".
       01  PARM-TSC0SE16-RTNPKG.
         05  PARM-TSC0SE16-ARG4.
      *----------  RTNパッケージ
           10  TBL-RTNPKG.
             COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                ＳＱＬ通信領域
      ******************************************************************
           EXEC  SQL  INCLUDE  SQLCA  END-EXEC.
           EXEC  SQL  BEGIN    DECLARE  SECTION  END-EXEC.
       01  ORA-WORKING-AREA.
      *----------  SQL条件ワーク
         05  SQLSTMT1              PIC  X(500).
         05  SQLSTMT2              PIC  X(500).
         05  SQLSTMT3              PIC  X(1500).
         05  SQLSTMT4              PIC  X(500).
         05  SQLSTMT5              PIC  X(500).
         05  SQLSTMT6              PIC  X(500).
         05  SQLSTMT7              PIC  X(1500).
         05  SQLSTMT8              PIC  X(500).
         05  SQLSTMT9              PIC  X(500).
      *----------  起動ID
         05  HST-KIDOU-ID          PIC  9(04).
      *----------  タスクスケジュール起動ID
         05  HST-TSK-SCHE-KIDOU-ID PIC  9(04).
         05  HST-START-POS         PIC  9(08).
      *----------  先行業務タスクID
         05  HST-SK-GYOMU-TASK-ID  PIC  X(07).
      *----------  MAX(タスクスケジュール明細ID)
         05  HST-MAX-MS-ID         PIC  9(03).
      *----------  子業務タスクの親業務タスク
         05  HST-OYA-GYOMU-TASK-ID PIC  X(07).
         05  H-OYA-GYOMU-TASK-ID   PIC  X(07).
      *----------  子業務タスク数
         05  HST-COUNT             PIC  9(03).
       01  ORA-WORKING2-AREA.
      *----------  ログインユーザ会社コード
         05  HST-LOGIN-CMP-CD      PIC  X(04).
      *----------  利用会社コード
         05  HST-RIYO-CMP-CD       PIC  X(04).
      *----------  タスクスケジュールID
         05  HST-TSK-SCHE-ID       PIC  X(07).
      *----------  タスクスケジュールユニークコード
         05  HST-TSK-SCHE-UNIQUE-CD     PIC  X(10).
      *----------  タスクスケジュール明細ID
         05  HST-TSK-SCHE-MS-ID    PIC  9(03).
      *----------  タスクスケジュール名称
         05  HST-TSK-SCHE-MEI      PIC  X(40).
      *----------  自動運用カレンダーID
         05  HST-AUTO-CAL-ID       PIC  X(08).
      *----------  自動運用開始日
         05  HST-AUTO-START-YMD    PIC  9(08).
      *----------  自動運用終了日
         05  HST-AUTO-END-YMD      PIC  9(08).
      *----------  業務タスクID
         05  HST-GYOMU-TASK-ID     PIC  X(07).
      *----------  先行タスクスケジュール明細ID1
         05  HST-SK-TSK-SCHE-MS-ID1     PIC  9(03).
      *----------  先行タスクスケジュール明細ID2
         05  HST-SK-TSK-SCHE-MS-ID2     PIC  9(03).
      *----------  先行タスクスケジュール明細ID3
         05  HST-SK-TSK-SCHE-MS-ID3     PIC  9(03).
      *----------  先行タスクスケジュール明細ID4
         05  HST-SK-TSK-SCHE-MS-ID4     PIC  9(03).
      *----------  先行タスクスケジュール明細ID5
         05  HST-SK-TSK-SCHE-MS-ID5     PIC  9(03).
      *----------  先行タスクスケジュール明細ID6
         05  HST-SK-TSK-SCHE-MS-ID6     PIC  9(03).
      *----------  先行タスクスケジュール明細ID7
         05  HST-SK-TSK-SCHE-MS-ID7     PIC  9(03).
      *----------  先行タスクスケジュール明細ID8
         05  HST-SK-TSK-SCHE-MS-ID8     PIC  9(03).
      *----------  先行タスクスケジュール明細ID9
         05  HST-SK-TSK-SCHE-MS-ID9     PIC  9(03).
      *----------  先行タスクスケジュール明細ID10
         05  HST-SK-TSK-SCHE-MS-ID10    PIC  9(03).
      *----------  起動時刻
         05  HST-KIDOU-TIME        PIC  X(06).
      *----------  待機ファイル有効区分
         05  HST-TAIKI-FILE-KBN    PIC  X(01).
      *----------  タイムアウト時間（分）
         05  HST-TIMEOUT-MINUTES   PIC  9(04).
      *----------  取得先区分
         05  HST-SYUTOKUSAKI-KBN   PIC  X(01).
      *----------  取得方式
         05  HST-SYUTOKU-HOUSIKI   PIC  X(01).
      *----------  取得ファイル区分
         05  HST-SYUTOKU-FILE-KBN  PIC  X(01).
      *----------  連続起動集約区分
         05  HST-SYUUYAKU-KBN      PIC  X(01).
      *----------  表示番号
         05  HST-DISPLAY-NUM       PIC  9(03).
      *----------  汎用パラメータ設定フラグ
         05  HST-PARA-FLG          PIC  X(01).
      *----------  更新日時
         05  HST-UPD-DATE          PIC  X(14).
      *----------  更新ログインユーザ会社コード
         05  HST-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザID
         05  HST-UPD-SID           PIC  X(20).
      *----------  更新プログラムID
         05  HST-UPD-PGMID         PIC  X(16).
      *----------  タスクスケジュールNo
         05  HST-TSK-SCHE-NO       PIC  9(02).
      *----------  先行タスクスケジュールNo１
         05  HST-SK-TSK-SCHE-NO1   PIC  9(02).
      *----------  先行タスクスケジュールNo２
         05  HST-SK-TSK-SCHE-NO2   PIC  9(02).
      *----------  先行タスクスケジュールNo３
         05  HST-SK-TSK-SCHE-NO3   PIC  9(02).
      *----------  先行タスクスケジュールNo４
         05  HST-SK-TSK-SCHE-NO4   PIC  9(02).
      *----------  先行タスクスケジュールNo５
         05  HST-SK-TSK-SCHE-NO5   PIC  9(02).
      *----------  先行タスクスケジュールNo６
         05  HST-SK-TSK-SCHE-NO6   PIC  9(02).
      *----------  先行タスクスケジュールNo７
         05  HST-SK-TSK-SCHE-NO7   PIC  9(02).
      *----------  先行タスクスケジュールNo８
         05  HST-SK-TSK-SCHE-NO8   PIC  9(02).
      *----------  先行タスクスケジュールNo９
         05  HST-SK-TSK-SCHE-NO9   PIC  9(02).
      *----------  先行タスクスケジュールNo１０
         05  HST-SK-TSK-SCHE-NO10  PIC  9(02).
      *----------  where
       01  H-WHERE.
      *----------  利用会社コード
         05  H-RIYO-CMP-CD-W       PIC  X(04).
      *----------  LOGIN会社コード
         05  H-LOGIN-CMP-CD-W      PIC  X(04).
      *---------- 処理実行日
         05  H-SYORI-JIKOU-YMD-W   PIC  X(08).
      *----------  タスクスケジュールID
         05  H-TASK-SCHEDULE-ID-W  PIC  X(07).
      *----------  タスクスケジュールユニークコード
         05  H-TASK-SCHEDULE-UN-CD-W    PIC  X(10).
         05  H-TSK-SCHE-MS-ID-W    PIC  9(03).
      *----------  業務タスクID
         05  H-GYOMU-TASK-ID-W     PIC  X(07).
      *----------  電文項目ID
         05  H-DENBUN-KOMOKU-ID    PIC  X(40).
      *----------  項目長
         05  H-KOMOKU-LEN          PIC  9(07).
      *----------  先行タスクスケジュール明細ID1
         05  H-SK-TSK-SCHE-MS-ID1-W    PIC  9(03).
      *----------  先行タスクスケジュール明細ID2
         05  H-SK-TSK-SCHE-MS-ID2-W    PIC  9(03).
      *----------  先行タスクスケジュール明細ID3
         05  H-SK-TSK-SCHE-MS-ID3-W     PIC  9(03).
      *----------  先行タスクスケジュール明細ID4
         05  H-SK-TSK-SCHE-MS-ID4-W     PIC  9(03).
      *----------  先行タスクスケジュール明細ID5
         05  H-SK-TSK-SCHE-MS-ID5-W     PIC  9(03).
      *----------  先行タスクスケジュール明細ID6
         05  H-SK-TSK-SCHE-MS-ID6-W     PIC  9(03).
      *----------  先行タスクスケジュール明細ID7
         05  H-SK-TSK-SCHE-MS-ID7-W     PIC  9(03).
      *----------  先行タスクスケジュール明細ID8
         05  H-SK-TSK-SCHE-MS-ID8-W     PIC  9(03).
      *----------  先行タスクスケジュール明細ID9
         05  H-SK-TSK-SCHE-MS-ID9-W     PIC  9(03).
      *----------  先行タスクスケジュール明細ID10
         05  H-SK-TSK-SCHE-MS-ID10-W    PIC  9(03).
           EXEC  SQL  END      DECLARE  SECTION  END-EXEC.
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SCZY1150-INOUT.
      *----------  実行状況管理ＩＮＳルーチンコピー句
           COPY  "SCZY1150.cpy".
       01  PARM-SCZY1150-RTNPKG.
      *----------  RTNパッケージ
         05  PARM-SCZY1150-ARG5.
           COPY "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *        PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SCZY1150-INOUT
                  PARM-SCZY1150-RTNPKG.
      ******************************************************************
      *                 SELECT処理
      ******************************************************************
       BASE-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY1150処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期処理
           PERFORM  INIT-RTN
      *----------  メイン処理
           PERFORM  MAIN-RTN
      *----------  終了処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY1150処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *                 初期処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     WK-AREA
                          WK-AREA2
                          FLAG-AREA
                          ORA-WORKING-AREA
                          ORA-WORKING2-AREA
                          H-WHERE
                          PARM-SCZY1060-INOUT
                          PARM-SCZY1060-RTNPKG
                          PARM-SCZY5080-INOUT
                          PARM-SCZY5080-RTNPKG
                          PARM-SCZY1160-INOUT
                          PARM-SCZY1160-RTNPKG
                          PARM-SCZY1170-INOUT
                          PARM-SCZY1170-RTNPKG
                          PARM-SCZY1130-INOUT
                          PARM-SCZY1130-RTNPKG
                          PARM-TKDYAA31-INS-ARG
                          PARM-TKDYAA31-RTNPKG
                          PARM-TKDYAA32-INS-ARG
                          PARM-TKDYAA32-RTNPKG
                          PARM-TKDYAA35-INS-ARG
                          PARM-TKDYAA35-RTNPKG
                          PARM-TKDYAA26-INS-ARG
                          PARM-TKDYAA26-RTNPKG
                          PARM-TKDYAA37-INS-ARG
                          PARM-TKDYAA37-RTNPKG
                          PARM-SCZY1150-RTNPKG
                          PARM-TSC0DA21-INOUT
                          PARM-TSC0DA21-RTNPKG
                          PARM-TSC0SE15-INOUT
                          PARM-TSC0SE15-RTNPKG
                          PARM-TSC0SE16-INOUT
                          PARM-TSC0SE16-RTNPKG
                          PARM-SCZY1100-AIFA-H
                          PARM-SCZY1100-INOUT
                          PARM-SCZY1100-RTNPKG
                          PARM-DENBUN-ARG
                          WK-TSK-SCHEDULE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-TASK-SCHEDULE=["WK-TASK-SCHEDULE"]"
      D    DISPLAY  "WK-MS-ID =["WK-MS-ID "]"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  SYORI-JIKOU-YMD   OF  PARM-SCZY1150-INOUT
             TO  WK-SYORI-JIKOU-YMD
      *----------  入力電文
           MOVE  INPUT-DENBUN      OF  PARM-SCZY1150-INOUT
             TO  PARM-DENBUN-ARG
      *----------  端末利用者の業務ユーザＩＤ
           MOVE  JOB-USER-ID       OF  PARM-DENBUN-ARG1
             TO  WK-JOB-USER-ID
      *----------  入力端末のコンピュータ名称
           MOVE  IN-HOST-NAME      OF  PARM-DENBUN-ARG1
             TO  WK-IN-HOST-NAME
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  "WK-IN-HOST-NAME =["WK-IN-HOST-NAME"]"
      *D    DISPLAY  "WK-AREA            =["  WK-AREA             "]"
      *D    DISPLAY  "FLAG-AREA          =["  FLAG-AREA           "]"
      *D    DISPLAY  "ORA-WORKING-AREA   =["  ORA-WORKING-AREA    "]"
      *D    DISPLAY  "ORA-WORKING2-AREA   =["  ORA-WORKING2-AREA    "]"
      *D    DISPLAY  "PARM-SCZY1160-INOUT = [" PARM-SCZY1160-INOUT "]"
      *D    DISPLAY  "PARM-SCZY1160-RTNPKG= [" PARM-SCZY1160-RTNPKG "]"
      *D    DISPLAY  "PARM-SCZY1170-INOUT = [" PARM-SCZY1170-INOUT "]"
      *D    DISPLAY  "PARM-SCZY1170-RTNPKG= [" PARM-SCZY1170-RTNPKG "]"
      *D    DISPLAY  "PARM-SCZY1130-INOUT = [" PARM-SCZY1130-INOUT  "]"
      *D    DISPLAY  "PARM-SCZY1130-RTNPKG= [" PARM-SCZY1130-RTNPKG "]"
      *D    DISPLAY  "PARM-TKDYAA31-INS-ARG= ["PARM-TKDYAA31-INS-ARG"]"
      *D    DISPLAY  "PARM-TKDYAA31-RTNPKG= ["PARM-TKDYAA31-RTNPKG"]"
      *D    DISPLAY  "PARM-TKDYAA32-INS-ARG= ["PARM-TKDYAA32-INS-ARG"]"
      *D    DISPLAY  "PARM-TKDYAA32-RTNPKG= [" PARM-TKDYAA32-RTNPKG "]"
      *D    DISPLAY  "PARM-TKDYAA26-INS-ARG= ["PARM-TKDYAA26-INS-ARG"]"
      *D    DISPLAY  "PARM-TKDYAA26-RTNPKG= ["PARM-TKDYAA26-RTNPKG"]"
      *D    DISPLAY  "PARM-SCZY1150-RTNPKG= [" PARM-SCZY1150-RTNPKG"]"
      D    DISPLAY  "処理実行日=["SYORI-JIKOU-YMD
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "ログインユーザ会社コード=["LOGIN-CMP-CD
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "利用会社コード=["RIYO-CMP-CD
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "起動経路=["KIDOU-KIRO   OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "起動処理分類=["KIDOU-SYORI-KBN
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "タスクスケジュールID=["TASK-SCHEDULE-ID
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "タスクスケジュールユニークCD=["TASK-SCHEDULE-UN-CD
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "業務タスクID=["GYOMU-TASK-ID
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "帳票作成単位=["REP-CREATE-TANI
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "ファイル種別=["REP-OUT-KBN
      D                                      OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "プリンタID=["PRINTER-ID OF  PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "GYOUMU-GROUP-CODE=["
      D                    GYOUMU-GROUP-CODE OF  PARM-DENBUN-ARG2"]"
      D    DISPLAY  "JOB-USER-ID=["
      D                    JOB-USER-ID       OF  PARM-DENBUN-ARG1"]"
      D    DISPLAY  "PARM-DENBUN-ARG=["
      D                    PARM-DENBUN-ARG"]"
      D    DISPLAY  "WK-DENBUN-INFO=["
      D                    WK-DENBUN-INFO"]"
      *D    DISPLAY  "入力電文=["INPUT-DENBUN OF  PARM-SCZY1150-INOUT"]"
      *D    DISPLAY  "***  INIT-RTN  END  ***"
      *-----------------------------------------------------------------
      *----------  20080604 修正
      *----------   ARG2.起動処理分類 ≠ B(DYから起動する一括処理)
           IF  ( KIDOU-SYORI-KBN
                             OF  PARM-SCZY1150-INOUT  NOT = "B"  AND
      *----------  且つ ≠ U(アップロード)
                 KIDOU-SYORI-KBN
                             OF  PARM-SCZY1150-INOUT  NOT = "U"  AND
      *----------  且つ ≠D(ダウンロード)
                 KIDOU-SYORI-KBN
                             OF  PARM-SCZY1150-INOUT  NOT = "D"  AND
      *----------   且つ ≠R(帳票リクエスト)
                 KIDOU-SYORI-KBN
                             OF  PARM-SCZY1150-INOUT  NOT = "R"  AND
      *----------   且つ ≠K(データ更新)
                 KIDOU-SYORI-KBN
                             OF  PARM-SCZY1150-INOUT  NOT = "K"  AND
      *----------  且つ ≠ A(外部送受信)の場合
                 KIDOU-SYORI-KBN
                             OF  PARM-SCZY1150-INOUT  NOT = "A"  )       20080619
           THEN
             MOVE  CNS-RET-CD-PARMET   TO  RTN-CD
                                       OF  PARM-SCZY1170-ARG1
             MOVE  "0001"              TO  ERR-POS
                                       OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                       OF  PARM-SCZY1170-ARG1
             MOVE  0                   TO  DETAIL-RTN-CD
                                       OF  PARM-SCZY1170-ARG1
             PERFORM  ERR-RTN
           END-IF
      *----------  テーブルID取得ルーチンをコールする
           PERFORM  GET-TABLE-ID-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    SCZY1160 テーブルID取得ルーチン
      ******************************************************************
       GET-TABLE-ID-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  GET-TABLE-ID-RTN   START  *****"
      *-----------------------------------------------------------------
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD            OF  PARM-SCZY1150-INOUT
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-INOUT
      *----------  テーブルID
           MOVE  CNS-TBL-TKDYAA24
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
           MOVE  CNS-TBL-TKDYAA25
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
           MOVE  CNS-TBL-TKDYAA26
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
           MOVE  CNS-TBL-TKDYAA30
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
           MOVE  CNS-TBL-TKDYAA37
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
           MOVE  CNS-TBL-TKDYAA38
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(6)
           MOVE  CNS-TBL-TOC0DA21
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(7)
           MOVE  CNS-TBL-TOC0DA23
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(8)
           MOVE  CNS-TBL-TKDYAA14
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(9)
           MOVE  CNS-TBL-TKDYAA20
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(10)
           MOVE  CNS-TBL-TKDYAA29
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(11)
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-SCZY1160-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "テーブルID取得ルーチンSCZY1160終了"
      D    DISPLAY  "RTN-CD("  COUNTER  OF  PARM-SCZY1160-ARG3
      D      ") OF SCZY1160=["  RTN-CD  OF
      D      PARM-SCZY1160-ARG3(COUNTER  OF  PARM-SCZY1160-ARG3)  "]"
      *-----------------------------------------------------------------
           IF  RTN-CD
               OF  PARM-SCZY1160-ARG3(COUNTER  OF  PARM-SCZY1160-ARG3)
                                             NOT =  CNS-RET-CD-NORMAL
           THEN
               MOVE  "0002"             TO  ERR-POS
                                        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-SYSERR  TO  RTN-CD
                                        OF  PARM-SCZY1170-ARG1
               MOVE  0                  TO  DETAIL-RTN-CD
                                        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-FLG-0      TO  DETAIL-RTN-CD-FLG
                                        OF  PARM-SCZY1170-ARG1
               MOVE  PARM-SCZY1160-ARG3 TO  PARM-SCZY1170-ARG2
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  GET-TABLE-ID-RTN    END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-TABLE-ID-EXT.
           EXIT.
      ******************************************************************
      *                 メイン処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  メイン処理  START  *****"
      *-----------------------------------------------------------------
           IF  LOGIN-CMP-CD OF PARM-SCZY1150-INOUT = "4999"
           THEN
               MOVE  RIYO-CMP-CD   OF PARM-SCZY1150-INOUT
                 TO  WK-LOGIN-CMP-CD
           ELSE
               MOVE  LOGIN-CMP-CD  OF PARM-SCZY1150-INOUT
                 TO  WK-LOGIN-CMP-CD
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "ログインユーザ会社コード保存用ワーク  =["
      D             WK-LOGIN-CMP-CD"]"
      *-----------------------------------------------------------------
      *----------  起動ID取得
           PERFORM  GET-KIDOU-ID-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "ﾀｽｸｽｹｼﾞｭｰﾙﾕﾆｰｸｺｰﾄﾞ  =["
      D             TASK-SCHEDULE-UN-CD OF PARM-SCZY1150-INOUT"]"
      *-----------------------------------------------------------------
      *----------  タスクスケジュールユニークコード ≠ スペースの場合
           IF  TASK-SCHEDULE-UN-CD  OF PARM-SCZY1150-INOUT NOT = SPACE
           THEN
             PERFORM  CHECK-2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SYUUYAKU-KBN    =["WK-SYUUYAKU-KBN"]"
      *-----------------------------------------------------------------
      *----------  連続起動集約区分保存用ワーク ＞ 0の場合
             IF  WK-SYUUYAKU-KBN  >  0  THEN
               IF  WK-MS-ID  = ZERO
               THEN
                   PERFORM GET-MAX-MS-ID-RTN
               END-IF
               COMPUTE  WK-MS-ID = WK-MS-ID + 1
               PERFORM  JIKOU-STS-INSERT-RTN
      *----------  起動ID保存用ワークカウントアップ
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KIDOU-ID=["WK-KIDOU-ID"]"
      *-----------------------------------------------------------------
                 COMPUTE  WK-KIDOU-ID   =  WK-KIDOU-ID  +  1
             END-IF
           ELSE
             PERFORM  CHECK-1-RTN
           END-IF
      *----------  起動ID更新
           PERFORM  UPDATE-KIDOUID-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-GYOMU-COUNT=["WK-GYOMU-COUNT"]"
      D    DISPLAY  "WK-GYOMU-GROUP=["WK-GYOMU-GROUP"]"
      *-----------------------------------------------------------------
           IF  WK-GYOMU-COUNT > 0 THEN
               COMPUTE  WK-KIDOU-ID   =  WK-KIDOU-ID  +  1
               MOVE  CNS-RET-CD-NOKENG   TO  RTN-CD
                                         OF  PARM-SCZY1170-ARG1
               MOVE  "0040"              TO  ERR-POS
                                         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                         OF  PARM-SCZY1170-ARG1
               MOVE  0                   TO  DETAIL-RTN-CD
                                         OF  PARM-SCZY1170-ARG1
               MOVE  WK-GYOMU-GROUP
                 TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
               MOVE  PARM-SCZY1130-ARG3  TO  PARM-SCZY1170-ARG2
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  メイン処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    起動ID取得
      ******************************************************************
       GET-KIDOU-ID-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  GET-KIDOU-ID-RTN  START*****"
      *-----------------------------------------------------------------
           INITIALIZE    SQLSTMT1
                         H-WHERE
                         WK-SQL-LEN
                         WK-CR-OPEN-FLG1
           MOVE  1                      TO  WK-SQL-POINTER1
           STRING  "SELECT ",
                   " KIDOU_ID,",
                   " TSK_SCHE_KIDOU_ID FROM ",
                    HENSYUGO-TBL-ID     OF  PARM-SCZY1160-ARG2(4),
                   " WHERE ",
      *---------- 利用会社コード
                   " RIYO_CMP_CD = :V1 ",
      *---------- 処理実行日
                   " AND SYORI_YMD = :V2 ",
                   " FOR UPDATE"
                   DELIMITED  BY  SIZE
                   INTO  SQLSTMT1
                   WITH POINTER  WK-SQL-POINTER1
      *----------  動的SQL文長さ
           COMPUTE   WK-SQL-LEN = WK-SQL-POINTER1 - 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT1-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT1        =["SQLSTMT1(1:WK-SQL-LEN)"]"
      *-----------------------------------------------------------------
      *---------- 利用会社コード = ARG1.利用会社コード
           MOVE  RIYO-CMP-CD                OF PARM-SCZY1150-INOUT
             TO  H-RIYO-CMP-CD-W            OF H-WHERE
      *---------- 処理実行日 = ARG1.処理実行日
           MOVE  SYORI-JIKOU-YMD            OF PARM-SCZY1150-INOUT
             TO  H-SYORI-JIKOU-YMD-W        OF H-WHERE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "[V1:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
      D             "[V2:"H-SYORI-JIKOU-YMD-W       OF H-WHERE"]"
      D    DISPLAY  "ＳＱＬ文 [起動ID管理]編集終了"
      *-----------------------------------------------------------------
           INITIALIZE  WK-FREE-MSG
           STRING  SQLSTMT1(1:WK-SQL-LEN)
                   "[V1:"H-RIYO-CMP-CD-W          OF H-WHERE"]"
                   "[V2:"H-SYORI-JIKOU-YMD-W      OF H-WHERE"]"
             INTO  WK-FREE-MSG
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S01  FROM :SQLSTMT1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0003"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR01 CURSOR  FOR S01
           END-EXEC
      *----------  カーソル OPEN
           EXEC SQL
               OPEN  CR01 USING
                  :H-RIYO-CMP-CD-W,
                  :H-SYORI-JIKOU-YMD-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)      =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0004"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "1"                     TO  WK-CR-OPEN-FLG1
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-FETCH-END      =["FLG-FETCH-END1"]"
      *-----------------------------------------------------------------
           PERFORM  UNTIL  FLG-FETCH-END1     <>  SPACE
      *----------  カーソル FETCH
             EXEC SQL
                 FETCH  CR01
                  INTO :HST-KIDOU-ID,
                       :HST-TSK-SCHE-KIDOU-ID
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH1) =["SQLCODE"]"
      D    DISPLAY  "HST-KIDOU-ID    =["HST-KIDOU-ID"]"
      D    DISPLAY  "HST-TSK-SCHE-KIDOU-ID=["HST-TSK-SCHE-KIDOU-ID"]"
      *-----------------------------------------------------------------
             IF  SQLCODE         = CNS-SQL-NORMAL    THEN
               MOVE  HST-KIDOU-ID       TO  WK-KIDOU-ID
               MOVE  HST-TSK-SCHE-KIDOU-ID
                                        TO  WK-TSK-SCHE-KIDOU-ID
               MOVE  "1"                TO  FLG-FETCH-END1
             ELSE
               MOVE  "1"                TO  FLG-FETCH-END1
               MOVE  "0005"             TO  ERR-POS
                                        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR  TO  RTN-CD
                                        OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG        TO  FREE-MSG
                                        OF  PARM-SCZY1170-ARG1
               MOVE  "1"                TO  DETAIL-RTN-CD-FLG
                                        OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO  DETAIL-RTN-CD
                                        OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
             END-IF
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-FETCH-END      =["FLG-FETCH-END1"]"
      *-----------------------------------------------------------------
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR01
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE)     =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0006"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "0"                     TO  WK-CR-OPEN-FLG1
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  GET-KIDOU-ID-RTN  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-KIDOU-ID-EXT.
          EXIT.
      ******************************************************************
      *    CHECK-1-RTN
      ******************************************************************
       CHECK-1-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CHECK-1-RTN   START  *****"
      *-----------------------------------------------------------------
      *----------   電文情報保存用ワーク←ARG4．入力電文
           MOVE  INPUT-DENBUN      OF  PARM-SCZY1150-INOUT
             TO  WK-DENBUN-INFO
      *----------  電文情報保存用ワーク．AIFAの項目（入力通番）←'00'
           MOVE  00                TO  WK-AIFA-HEADER(229:2)
      *----------  業務タスク保存用ワーク ← ARG4.業務タスクID
           MOVE  GYOMU-TASK-ID  OF  PARM-SCZY1150-INOUT
             TO  WK-GYOMU-TASK-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "電文情報保存用ワーク  =[" WK-DENBUN-INFO"]"
      D    DISPLAY  "電文情報保存用ワーク．AIFAの項目（入力通番）=["
      D             WK-AIFA-HEADER(229:2) "]"
      D    DISPLAY  " 業務タスク保存用ワーク =[" WK-GYOMU-TASK-ID "]"
      *-----------------------------------------------------------------
      *----------  SCZY5080をコールして、汎用パラメータを取得する
           PERFORM  CALL-SCZY5080-RTN
      *----------  利用権限チェックルーチン
           PERFORM  CALL-SCZY1130-RTN
      *----------  ARG4.業務タスクIDの先頭1桁='T'(業務タスク)の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "業務タスク保存用ワーク  =["WK-GYOMU-TASK-ID "]"
      *-----------------------------------------------------------------
           IF  WK-GYOMU-TASK-ID(1:1) = "T"
           THEN
      *----------  TSC0DA21 業務タスクマスタSELECTルーチン
               PERFORM  CALL-TSC0DA21-RTN
           END-IF
      *----------  実行状況管理INSERT
           PERFORM  JIKOU-STS-INSERT-RTN
      *----------  電文保持TBL INSERT
           PERFORM  DENBUN-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KIDOU-ID=["WK-KIDOU-ID"]"
      *-----------------------------------------------------------------
           PERFORM  CALL-TKDYAA14-RTN
      *----------  起動ID保存用ワークカウントアップ
           COMPUTE  WK-KIDOU-ID   =  WK-KIDOU-ID  +  1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CHECK-1-RTN    END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CHECK-1-EXT.
           EXIT.
      ******************************************************************
      *    親業務タスクID利用権限チェックルーチン
      ******************************************************************
       KENGAN-CHECK-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***** 親業務タスクID利用権限チェック START  *****"
      *-----------------------------------------------------------------
      *----------  業務グループコード
           MOVE  WK-AIFA-HEADER(483:10)
             TO  GYOMU-GRP-CD                OF  PARM-SCZY1130-ARG1
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD                 OF  PARM-SCZY1150-ARG1
             TO  RIYO-CMP-CD                 OF  PARM-SCZY1130-ARG1
      *----------  ログインユーザー会社コード
           MOVE  LOGIN-CMP-CD                OF  PARM-SCZY1150-ARG1
             TO  LOGIN-CMP-CD                OF  PARM-SCZY1130-ARG1
      *----------  実行処理ID
           MOVE  WK-OYA-GYOMU-TASK-ID
             TO  JIKOU-SYORI-ID              OF  PARM-SCZY1130-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "業務グループコード="GYOMU-GRP-CD
      D                                        OF PARM-SCZY1130-ARG1
      D    DISPLAY  "利用会社コード="RIYO-CMP-CD  OF  PARM-SCZY1130-ARG1
      D    DISPLAY  "ログインユーザー会社コード="LOGIN-CMP-CD
      D                                         OF PARM-SCZY1130-ARG1
      D    DISPLAY  "実行処理ID="JIKOU-SYORI-ID OF PARM-SCZY1130-ARG1
      D    DISPLAY  "メニューID="MENU-ID        OF PARM-SCZY1130-ARG1
      D    DISPLAY  "ファンドコード="FUND-CD    OF PARM-SCZY1130-ARG1
      D    DISPLAY  "ポートフォリオコード="PTF-CD  OF PARM-SCZY1130-ARG1
      D    DISPLAY  "予備="YOBI                 OF PARM-SCZY1130-ARG1
      *-----------------------------------------------------------------
           CALL  "SCZY1130"             USING    PARM-SCZY1130-INOUT
                                                 PARM-SCZY1130-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD                  OF  PARM-SCZY1130-ARG3=["
      D              RTN-CD                  OF  PARM-SCZY1130-ARG3
      D              (COUNTER                OF  PARM-SCZY1130-ARG3)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD                  OF  PARM-SCZY1130-ARG3
                         (COUNTER            OF  PARM-SCZY1130-ARG3)
                 WHEN  CNS-RET-CD-NORMAL
                   CONTINUE
                 WHEN  CNS-RET-CD-NOKENG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（権限なし）の場合"
      *-----------------------------------------------------------------
                   COMPUTE  WK-GYOMU-COUNT = WK-GYOMU-COUNT + 1
                   MOVE  WK-GYOMU-TASK-ID
                     TO  WK-GYOMU-KENGAN-NASI(WK-GYOMU-COUNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-GYOMU-COUNT = ["WK-GYOMU-COUNT "]"
      D    DISPLAY  "WK-GYOMU-KENGAN-NASI("WK-GYOMU-COUNT") = ["
      D              WK-GYOMU-KENGAN-NASI(WK-GYOMU-COUNT) "]"
      *-----------------------------------------------------------------
      *----------  SCZY1100 監査ログＩＮＳルーチン
                   PERFORM  CALL-SCZY1100-RTN
                   IF  TASK-SCHEDULE-UN-CD  OF PARM-SCZY1150-INOUT
                     NOT = SPACE
                   THEN
                       MOVE  "1"                 TO  WK-KENGAN-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KENGAN-KBN = ["WK-KENGAN-KBN "]"
      *-----------------------------------------------------------------
                   ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-GYOMU-GROUP = ["WK-GYOMU-GROUP "]"
      *-----------------------------------------------------------------
                       MOVE  CNS-RET-CD-NOKENG   TO  RTN-CD
                                                 OF  PARM-SCZY1170-ARG1
                       MOVE  "0007"              TO  ERR-POS
                                                 OF  PARM-SCZY1170-ARG1
                       MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                                 OF  PARM-SCZY1170-ARG1
                       MOVE  0                   TO  DETAIL-RTN-CD
                                                 OF  PARM-SCZY1170-ARG1
                       MOVE  WK-GYOMU-GROUP
                         TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
                       MOVE  PARM-SCZY1130-ARG3  TO  PARM-SCZY1170-ARG2
                       PERFORM  ERR-RTN
                   END-IF
                 WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（システムエラー（Oracle））の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0008"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-SCZY1130-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0009"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-SCZY1130-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***** 親業務タスクID利用権限チェック END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       KENGAN-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    CHECK-2-RTN
      ******************************************************************
       CHECK-2-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CHECK-2-RTN   START  *****"
      *-----------------------------------------------------------------
           INITIALIZE    SQLSTMT3
                         H-WHERE
                         WK-SQL-LEN
                         WK-CR-OPEN-FLG3
           MOVE  1                          TO  WK-SQL-POINTER3
           STRING  "SELECT ",
                   "A.LOGIN_CMP_CD,",
                   "A.RIYO_CMP_CD,",
                   "A.TSK_SCHE_ID,",
                   "A.TSK_SCHE_UNIQUE_CD,",
                   "A.TSK_SCHE_MS_ID,",
                   "A.TSK_SCHE_MEI,",
                   "A.AUTO_CAL_ID,",
                   "A.AUTO_START_YMD,",
                   "A.AUTO_END_YMD,",
                   "A.GYOMU_TASK_ID,",
                   "A.SK_TSK_SCHE_MS_ID1,",
                   "A.SK_TSK_SCHE_MS_ID2,",
                   "A.SK_TSK_SCHE_MS_ID3,",
                   "A.SK_TSK_SCHE_MS_ID4,",
                   "A.SK_TSK_SCHE_MS_ID5,",
                   "A.SK_TSK_SCHE_MS_ID6,",
                   "A.SK_TSK_SCHE_MS_ID7,",
                   "A.SK_TSK_SCHE_MS_ID8,",
                   "A.SK_TSK_SCHE_MS_ID9,",
                   "A.SK_TSK_SCHE_MS_ID10,",
                   "A.KIDOU_TIME,",
                   "A.TAIKI_FILE_KBN,",
                   "A.TIMEOUT_MINUTES,",
                   "A.SYUTOKUSAKI_KBN,",
                   "A.SYUTOKU_HOUSIKI,",
                   "A.SYUTOKU_FILE_KBN,",
                   "A.SYUUYAKU_KBN,",
                   "A.DISPLAY_NUM,",
                   "A.PARA_FLG,",
                   "A.UPD_DATE,",
                   "A.UPD_LOGIN_CMP_CD,",
                   "A.UPD_SID,",
                   "A.UPD_PGMID,",
                   "NVL(B.TSK_SCHE_NO,0),",
                   "NVL(B.SK_TSK_SCHE_NO1,0),",
                   "NVL(B.SK_TSK_SCHE_NO2,0),",
                   "NVL(B.SK_TSK_SCHE_NO3,0),",
                   "NVL(B.SK_TSK_SCHE_NO4,0),",
                   "NVL(B.SK_TSK_SCHE_NO5,0),",
                   "NVL(B.SK_TSK_SCHE_NO6,0),",
                   "NVL(B.SK_TSK_SCHE_NO7,0),",
                   "NVL(B.SK_TSK_SCHE_NO8,0),",
                   "NVL(B.SK_TSK_SCHE_NO9,0),",
                   "NVL(B.SK_TSK_SCHE_NO10,0) FROM ",
                   HENSYUGO-TBL-ID   OF  PARM-SCZY1160-ARG2(1)  " A,",
                   HENSYUGO-TBL-ID   OF  PARM-SCZY1160-ARG2(11) " B",
                   " WHERE "
      *---------- A.ログインユーザ会社コード = ARG2.ログインユーザ会社コード
                   "A.LOGIN_CMP_CD = :V1 ",
      *---------- A.利用会社コード = ARG2.利用会社コード
                  " AND A.RIYO_CMP_CD = :V2 ",
      *---------- A.タスクスケジュールID = ARG2.タスクスケジュールID
                  " AND A.TSK_SCHE_ID = :V3 ",
      *---------- A.ジュールユニークコード = スケジュールユニークコード
                  " AND A.TSK_SCHE_UNIQUE_CD = :V4 ",
      *---------- A.ログインユーザ会社コード = B.ログインユーザ会社コード
                  " AND A.LOGIN_CMP_CD = B.LOGIN_CMP_CD(+) ",
      *---------- A.利用会社コード = B.利用会社コード
                  " AND A.RIYO_CMP_CD = B.RIYO_CMP_CD(+) ",
      *---------- A.タスクスケジュールID = B.タスクスケジュールID
                  " AND A.TSK_SCHE_ID = B.TSK_SCHE_ID(+) ",
                  " ORDER BY A.DISPLAY_NUM"
                   DELIMITED  BY  SIZE
                   INTO  SQLSTMT3
                   WITH  POINTER  WK-SQL-POINTER3
      *----------  動的SQL文長さ
                   COMPUTE   WK-SQL-LEN = WK-SQL-POINTER3 - 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT3-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT3        =["SQLSTMT3(1:WK-SQL-LEN)"]"
      *-----------------------------------------------------------------
      *---------- ログインユーザ会社コード
           MOVE  WK-LOGIN-CMP-CD
             TO  H-LOGIN-CMP-CD-W           OF H-WHERE
      *---------- ARG1.利用会社コード
           MOVE  RIYO-CMP-CD                OF PARM-SCZY1150-INOUT
             TO  H-RIYO-CMP-CD-W            OF H-WHERE
      *---------- ARG2.タスクスケジュールID
           MOVE  TASK-SCHEDULE-ID           OF PARM-SCZY1150-INOUT
             TO  H-TASK-SCHEDULE-ID-W       OF H-WHERE
      *---------- スケジュールユニークコード
           MOVE  TASK-SCHEDULE-UN-CD        OF PARM-SCZY1150-INOUT
             TO  H-TASK-SCHEDULE-UN-CD-W    OF H-WHERE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "[V1:"H-LOGIN-CMP-CD-W          OF H-WHERE"]"
      D             "[V2:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
      D             "[V3:"H-TASK-SCHEDULE-ID-W      OF H-WHERE"]"
      D             "[V4:"H-TASK-SCHEDULE-UN-CD-W   OF H-WHERE"]"
      D    DISPLAY  "ＳＱＬ文 [タスクスケジュール中間]編集終了"
      *-----------------------------------------------------------------
           INITIALIZE  WK-FREE-MSG1
           STRING  SQLSTMT3(1:WK-SQL-LEN)
                   "[V1:"H-LOGIN-CMP-CD-W          OF H-WHERE"]"
                   "[V2:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
                   "[V3:"H-TASK-SCHEDULE-ID-W      OF H-WHERE"]"
                   "[V4:"H-TASK-SCHEDULE-UN-CD-W   OF H-WHERE"]"
             INTO  WK-FREE-MSG1
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S03  FROM :SQLSTMT3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0010"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG1            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR03 CURSOR  FOR S03
           END-EXEC
      *----------  カーソル OPEN
           EXEC SQL
               OPEN  CR03 USING
                  :H-LOGIN-CMP-CD-W,
                  :H-RIYO-CMP-CD-W,
                  :H-TASK-SCHEDULE-ID-W,
                  :H-TASK-SCHEDULE-UN-CD-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)      =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0011"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG1            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "1"                     TO  WK-CR-OPEN-FLG3
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-FETCH-END3      =["FLG-FETCH-END3"]"
      *-----------------------------------------------------------------
           PERFORM  UNTIL  FLG-FETCH-END3     <>  SPACE
             INITIALIZE  WK-KENGAN-KBN
                         WK-REP-CREATE-TANI
                         WK-TYU-HYO-KBN
                         WK-KAMI-OUT-KBN
                         WK-PRINTER-ID
                         ORA-WORKING2-AREA
      *----------  カーソル FETCH
             EXEC SQL
               FETCH  CR03
                 INTO
      *----------  全項目
                :ORA-WORKING2-AREA
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KENGAN-KBN =["WK-KENGAN-KBN "]"
      D    DISPLAY  "SQLCODE(FETCH3)    =["SQLCODE"]"
      D    DISPLAY  "ORA-WORKING2-AREA=["ORA-WORKING2-AREA"]"
      D    DISPLAY  "DISPLAY_NUM    =["HST-DISPLAY-NUM  OF
      D              ORA-WORKING2-AREA"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *----------  タスクスケジュール保存用ワーク ←フェッチされたデータ
                 MOVE  ORA-WORKING2-AREA      TO  WK-TASK-SCHEDULE
                 MOVE  HST-TSK-SCHE-NO        TO  WK-TSK-SCHE-NO
                 MOVE  HST-SK-TSK-SCHE-NO1    TO  WK-SK-TSK-SCHE-NO(1)
                 MOVE  HST-SK-TSK-SCHE-NO2    TO  WK-SK-TSK-SCHE-NO(2)
                 MOVE  HST-SK-TSK-SCHE-NO3    TO  WK-SK-TSK-SCHE-NO(3)
                 MOVE  HST-SK-TSK-SCHE-NO4    TO  WK-SK-TSK-SCHE-NO(4)
                 MOVE  HST-SK-TSK-SCHE-NO5    TO  WK-SK-TSK-SCHE-NO(5)
                 MOVE  HST-SK-TSK-SCHE-NO6    TO  WK-SK-TSK-SCHE-NO(6)
                 MOVE  HST-SK-TSK-SCHE-NO7    TO  WK-SK-TSK-SCHE-NO(7)
                 MOVE  HST-SK-TSK-SCHE-NO8    TO  WK-SK-TSK-SCHE-NO(8)
                 MOVE  HST-SK-TSK-SCHE-NO9    TO  WK-SK-TSK-SCHE-NO(9)
                 MOVE  HST-SK-TSK-SCHE-NO10   TO  WK-SK-TSK-SCHE-NO(10)
      *----------  業務タスク保存用ワーク ←
      *----------  タスクスケジュール保存用ワーク.業務タスクID
                 MOVE  GYOMU-TASK-ID  OF  WK-TASK-SCHEDULE
                   TO  WK-GYOMU-TASK-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-TASK-SCHEDULE   =["WK-TASK-SCHEDULE"]"
      D    DISPLAY  "WK-TSK-SCHE-NO        =["WK-TSK-SCHE-NO"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(1)  =["WK-SK-TSK-SCHE-NO(1)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(2)  =["WK-SK-TSK-SCHE-NO(2)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(3)  =["WK-SK-TSK-SCHE-NO(3)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(4)  =["WK-SK-TSK-SCHE-NO(4)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(5)  =["WK-SK-TSK-SCHE-NO(5)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(6)  =["WK-SK-TSK-SCHE-NO(6)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(7)  =["WK-SK-TSK-SCHE-NO(7)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(8)  =["WK-SK-TSK-SCHE-NO(8)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(9)  =["WK-SK-TSK-SCHE-NO(9)"]"
      D    DISPLAY  "WK-SK-TSK-SCHE-NO(10) =["WK-SK-TSK-SCHE-NO(10)"]"
      D    DISPLAY   "業務タスク保存用ワーク =[" WK-GYOMU-TASK-ID"]"
      *-----------------------------------------------------------------
      *----------  電文保持所属タスクスケジュール中間SELECTルーチン
                 PERFORM  CALL-TSDYAA26-RTN
      *----------  20080508 修正 START
      *----------  SCZY5080をコールして、汎用パラメータを取得する
                 PERFORM  CALL-SCZY5080-RTN
                 PERFORM  CALL-SCZY1130-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KENGAN-KBN =["WK-KENGAN-KBN "]"
      *-----------------------------------------------------------------
                 IF  WK-KENGAN-KBN  NOT = "1"
                 THEN
                     IF  WK-GYOMU-TASK-ID = "TZ006DY"
                     THEN
      *----------  帳票作成単位保存用ワーク
                         MOVE  "1"  TO  WK-REP-CREATE-TANI
      *----------  帳票区分保存用ワーク
                         PERFORM CALL-TSC0SE16-RTN
                         MOVE  RX-REP-FMT OF PARM-TSC0SE16-ARG3
                           TO  WK-TYU-HYO-KBN
      *----------  紙出力区分保存用ワーク
                         MOVE  "1"  TO  WK-KAMI-OUT-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク帳票作成単位 =[" WK-REP-CREATE-TANI "]"
      D    DISPLAY  "ワーク帳票区分     =[" WK-TYU-HYO-KBN "]"
      D    DISPLAY  "ワーク紙出力区分   =[" WK-KAMI-OUT-KBN "]"
      *-----------------------------------------------------------------
                     END-IF
                     IF  WK-GYOMU-TASK-ID = "TZ009DY"
                     THEN
      *----------  帳票作成単位保存用ワーク
                         MOVE  "1"  TO  WK-REP-CREATE-TANI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク帳票作成単位 =[" WK-REP-CREATE-TANI "]"
      *-----------------------------------------------------------------
                     END-IF
      *----------  SCZY5080で取得した汎用パラメータの件数分をループして、下記処理を行う
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "汎用パラメータ件数 =["
      D              PARA-COUNT  OF PARM-SCZY5080-INOUT "]"
      *-----------------------------------------------------------------
                   MOVE  1                TO  WK-PARA-COUNT
                   PERFORM  UNTIL  WK-PARA-COUNT
                         >  PARA-COUNT    OF  PARM-SCZY5080-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*汎用パラメータ [" WK-PARA-COUNT "]:"
      D    DISPLAY  " 汎用パラメータID  =["
      D              PARA-ID  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT) "]"
      D    DISPLAY  " 電文項目名        =["
      D    DENBUN-KOMOKU-MEI  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT) "]"
      D    DISPLAY  " 電文項目長        =["
      D    DENBUN-KOMOKU-LEN  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT) "]"
      D    DISPLAY  " 小数項目長        =["
      D     SHOSU-KOMOKU-LEN  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT) "]"
      D    DISPLAY  " チェック属性タイプ=["
      D             CHK-TYPE  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT) "]"
      D    DISPLAY  " 入力必須区分      =["
      D             HISU-KBN  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT) "]"
      D    DISPLAY  " 開始位置          =["
      D            BEGIN-POS  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT) "]"
      D    DISPLAY  " 汎用パラメータ値  =["
      D           PARA-VALUE  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT) "]"
      *-----------------------------------------------------------------
      *----------  チェック属性・タイプ ＝ 8(日付(置換文字あり))の場合
                     IF  CHK-TYPE  OF PARM-SCZY5080-INOUT(WK-PARA-COUNT)
                       = "8"  THEN
      *----------  SCZY1060 日付置換ルーチン
                       INITIALIZE     WK-START-POS
                                      PARM-SCZY1060-INOUT
                                      PARM-SCZY1060-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG3.タスクスケジュールID =["
      D              TASK-SCHEDULE-ID   OF PARM-SCZY1150-INOUT"]"
      D    DISPLAY  "ARG4.入力電文の先頭8桁 =["
      D              INPUT-DENBUN       OF PARM-SCZY1150-INOUT(1:8)"]"
      D    DISPLAY  "ARG1.処理実行日 =["
      D              SYORI-JIKOU-YMD    OF PARM-SCZY1150-INOUT"]"
      *-----------------------------------------------------------------
                       IF  TASK-SCHEDULE-ID     OF PARM-SCZY1150-INOUT
                         = SPACE  THEN
      *----------  基準日
                         MOVE  SYORI-JIKOU-YMD  OF PARM-SCZY1150-INOUT
                           TO  KJN-YMD          OF PARM-SCZY1060-INOUT
                       ELSE
                         MOVE  INPUT-DENBUN  OF PARM-SCZY1150-INOUT(1:8)
                           TO  WK-SYORI-YMD-X
                         MOVE  WK-SYORI-YMD
                           TO  KJN-YMD          OF PARM-SCZY1060-INOUT
                       END-IF
      *----------  基準日日付置換文字列
                       MOVE  PARA-VALUE
                         OF  PARM-SCZY5080-INOUT(WK-PARA-COUNT)(1:8)
                         TO  HIDUKE-TIKAN-MOZI  OF  PARM-SCZY1060-INOUT
                       MOVE  BEGIN-POS
                         OF  PARM-SCZY5080-INOUT(WK-PARA-COUNT)
                         TO  WK-START-POS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "基準日開始位置     =[" WK-START-POS "]"
      *-----------------------------------------------------------------
                       PERFORM  CALL-SCZY1060-RTN
      *----------  日付区分 ≠ 0(日付)の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "日付[SCZY1060] =["
      D              TIKANG-HIDUKE  OF PARM-SCZY1060-INOUT "]"
      D    DISPLAY  "置換した基準日     =["
      D              WK-DENBUN-OTHER(WK-START-POS:8) "]"
      *-----------------------------------------------------------------
                     END-IF
      *----------  汎用パラメータID
                     EVALUATE  PARA-ID
                           OF  PARM-SCZY5080-INOUT(WK-PARA-COUNT)
                       WHEN  "tyouhyou_tani       "
      *----------  帳票作成単位保存用ワーク
                         INITIALIZE  WK-REP-CREATE-TANI
                         MOVE  PARA-VALUE
                           OF  PARM-SCZY5080-INOUT(WK-PARA-COUNT)
                           TO  WK-REP-CREATE-TANI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク帳票作成単位 =[" WK-REP-CREATE-TANI "]"
      *-----------------------------------------------------------------
                       WHEN  "tyouhyou_fmt        "
      *----------  帳票区分保存用ワーク
                         INITIALIZE  WK-TYU-HYO-KBN
                         MOVE  PARA-VALUE
                           OF  PARM-SCZY5080-INOUT(WK-PARA-COUNT)
                           TO  WK-TYU-HYO-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク帳票区分     =[" WK-TYU-HYO-KBN "]"
      *-----------------------------------------------------------------
                       WHEN  "out_kbn             "
      *----------  紙出力区分保存用ワーク
                         INITIALIZE  WK-KAMI-OUT-KBN
                         MOVE  PARA-VALUE
                           OF  PARM-SCZY5080-INOUT(WK-PARA-COUNT)
                           TO  WK-KAMI-OUT-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク紙出力区分   =[" WK-KAMI-OUT-KBN "]"
      *-----------------------------------------------------------------
                       WHEN  "out_saki            "
      *----------  プリンタID保存用ワーク
                         INITIALIZE  WK-PRINTER-ID
                         MOVE  PARA-VALUE
                           OF  PARM-SCZY5080-INOUT(WK-PARA-COUNT)
                           TO  WK-PRINTER-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワークプリンタID   =[" WK-PRINTER-ID "]"
      *-----------------------------------------------------------------
                       WHEN  OTHER
                         CONTINUE
                     END-EVALUATE
                     COMPUTE  WK-PARA-COUNT = WK-PARA-COUNT + 1
                   END-PERFORM
      *----------  20080604 修正
      *----------  取得した業務タスクIDの先頭1桁='T'(業務タスク)の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得の業務タスクID =["
      D              GYOMU-TASK-ID  OF  WK-TASK-SCHEDULE "]"
      *-----------------------------------------------------------------
                   IF  GYOMU-TASK-ID  OF  WK-TASK-SCHEDULE(1:1) = "T"
                   THEN
                       MOVE  GYOMU-TASK-ID  OF  WK-TASK-SCHEDULE
                         TO  WK-GYOMU-TASK-ID
      *----------  TSC0DA21 業務タスクマスタSELECTルーチン
                       PERFORM  CALL-TSC0DA21-RTN
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "別紙3で取得したログインユーザ会社コード =["
      D              HST-LOGIN-CMP-CD       OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した利用会社コード =["
      D              HST-RIYO-CMP-CD        OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得したタスクスケジュールID =["
      D              HST-TSK-SCHE-ID        OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得したタスクスケジュールユニークコード =["
      D              HST-TSK-SCHE-UNIQUE-CD OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID１ =["
      D              HST-SK-TSK-SCHE-MS-ID1 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID２ =["
      D              HST-SK-TSK-SCHE-MS-ID2 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID３ =["
      D              HST-SK-TSK-SCHE-MS-ID3 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID４ =["
      D              HST-SK-TSK-SCHE-MS-ID4 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID５ =["
      D              HST-SK-TSK-SCHE-MS-ID5 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID６ =["
      D              HST-SK-TSK-SCHE-MS-ID6 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID７ =["
      D              HST-SK-TSK-SCHE-MS-ID7 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID８ =["
      D              HST-SK-TSK-SCHE-MS-ID8 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID９ =["
      D              HST-SK-TSK-SCHE-MS-ID9 OF ORA-WORKING2-AREA "]"
      D    DISPLAY  "別紙3で取得した先行タスクスケジュール明細ID１０ =["
      D              HST-SK-TSK-SCHE-MS-ID10 OF ORA-WORKING2-AREA "]"
      *-----------------------------------------------------------------
                   IF  (HST-SK-TSK-SCHE-MS-ID1
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID2
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID3
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID4
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID5
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID6
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID7
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID8
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID9
                                      OF ORA-WORKING2-AREA = ZERO AND
                       HST-SK-TSK-SCHE-MS-ID10
                                      OF ORA-WORKING2-AREA= ZERO )
                   THEN
                       MOVE '0' TO WK-KO-GYOMU-TASK-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク子業務タスクフラグ=["WK-KO-GYOMU-TASK-FLG "]"
      *-----------------------------------------------------------------
                   ELSE
      *----------- 子業務タスクを取得
                       PERFORM  KO-GYOMU-TASK-CHK-RTN
                   END-IF
      *
      *----------  TSDYAA20 実行順序制御マスタ
      *----------  集信業務タスクIDを取得
                   PERFORM  CALL-TSDYAA20-RTN
      *----------   TIDYAA32をコールして
                   PERFORM  DENBUN-INSERT-RTN
      *----------   タスクスケジュールデータ.連続起動集約区分 = 1の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SYUUYAKU-KBN=["SYUUYAKU-KBN OF WK-TASK-SCHEDULE"]"
      D    DISPLAY  "WK-SYUUYAKU-KBN=["WK-SYUUYAKU-KBN"]"
      *-----------------------------------------------------------------
                   IF  SYUUYAKU-KBN  OF  WK-TASK-SCHEDULE  =  "1"  THEN
                     COMPUTE  WK-SYUUYAKU-KBN  =  WK-SYUUYAKU-KBN   +  1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SYUUYAKU-KBN=["WK-SYUUYAKU-KBN"]"
      *-----------------------------------------------------------------
                   END-IF
      *----------  起動ID保存用ワークカウントアップ
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KIDOU-ID=["WK-KIDOU-ID"]"
      *-----------------------------------------------------------------
                   COMPUTE  WK-KIDOU-ID   =  WK-KIDOU-ID  +  1
                 END-IF
               WHEN  CNS-SQL-NOTFOUND
                 MOVE  "1"                TO  FLG-FETCH-END3
               WHEN  OTHER
                 MOVE  "1"                TO  FLG-FETCH-END3
                 MOVE  "0012"             TO  ERR-POS
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-CD-ORAERR  TO  RTN-CD
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  WK-FREE-MSG1       TO  FREE-MSG
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  "1"                TO  DETAIL-RTN-CD-FLG
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE            TO  DETAIL-RTN-CD
                                          OF  PARM-SCZY1170-ARG1
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-PERFORM
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR03
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE3)     =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0013"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG1            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "0"                     TO  WK-CR-OPEN-FLG3
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CHECK-2-RTN    END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CHECK-2-EXT.
           EXIT.
      ******************************************************************
      *    TSDYAA26 電文保持所属タスクスケジュール中間SELECTルーチン
      ******************************************************************
       CALL-TSDYAA26-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CALL-TSDYAA26-RTN  START  *****"
      *-----------------------------------------------------------------
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD        OF  PARM-SCZY1150-INOUT
             TO  RIYO-CMP-CD        OF  PARM-TKDYAA26-INS-ARG1
           MOVE  RIYO-CMP-CD        OF  PARM-SCZY1150-INOUT
             TO  RIYO-CMP-CD-I      OF  PARM-TKDYAA26-INS-ARG1
      *----------  ログインユーザ会社コード
           MOVE  WK-LOGIN-CMP-CD
             TO  LOGIN-CMP-CD-I     OF  PARM-TKDYAA26-INS-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ログインユーザ会社コード =["
      D      LOGIN-CMP-CD-I     OF  PARM-TKDYAA26-INS-ARG1"]"
      *-----------------------------------------------------------------
      *----------  タスクスケジュールID
           MOVE  TASK-SCHEDULE-ID   OF  PARM-SCZY1150-INOUT
             TO  TSK-SCHE-ID-I      OF  PARM-TKDYAA26-INS-ARG1
      *----------  タスクスケジュールユニークコード
           MOVE  TASK-SCHEDULE-UN-CD  OF  PARM-SCZY1150-INOUT
             TO  TSK-SCHE-UNIQUE-CD-I   OF  PARM-TKDYAA26-INS-ARG1
      *----------  タスクスケジュール明細ID
           MOVE  HST-TSK-SCHE-MS-ID
             TO  TSK-SCHE-MS-ID-I   OF  PARM-TKDYAA26-INS-ARG1
      *
           CALL  "TSDYAA26"          USING  PARM-TKDYAA26-INS-ARG
                                            PARM-TKDYAA26-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD("       COUNTER  OF PARM-TKDYAA26-RTNPKG
      D       ") OF TKDYAA26-INS=["  RTN-CD  OF PARM-TKDYAA26-RTNPKG
      D                            (COUNTER  OF PARM-TKDYAA26-RTNPKG)"]"
      *-----------------------------------------------------------------
             EVALUATE  RTN-CD                OF  PARM-TKDYAA26-RTNPKG
                         (COUNTER  OF PARM-TKDYAA26-RTNPKG)
                 WHEN  CNS-RET-CD-NORMAL
                   MOVE  DENBUN-INFO  OF  PARM-TKDYAA26-ARG2
                     TO  WK-DENBUN-INFO
                   MOVE  00           TO  WK-AIFA-HEADER(229:2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-DENBUN-INFO=["WK-DENBUN-INFO(1:800)"]"
      D    DISPLAY  "電文情報保存用ワーク．AIFAの項目（入力通番） =["
      D              WK-AIFA-HEADER(229:2) "]"
      D    DISPLAY  "PARM-DENBUN-ARG=[" PARM-DENBUN-ARG(1:800)"]"
      *-----------------------------------------------------------------
                 WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（システムエラー（Oracle））の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0014"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TKDYAA26-INS-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0015"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TKDYAA26-INS-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CALL-TSDYAA26-RTN  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-TSDYAA26-EXT.
           EXIT.
      ******************************************************************
      *    SCZY5080 汎用パラメータ取得ルーチン
      ******************************************************************
       CALL-SCZY5080-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CALL-SCZY5080-RTN   START  *****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY5080-INOUT
                       PARM-SCZY5080-RTNPKG
      *----------  業務タスクID ← 業務タスクID保存用ワーク
           MOVE  WK-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SCZY5080-INOUT
      *----------  入力電文
           MOVE  WK-DENBUN-OTHER
             TO  INPUT-DENBUN           OF  PARM-SCZY5080-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "GYOMU-TASK-ID  OF  PARM-SCZY5080-INOUT =["
      D              GYOMU-TASK-ID  OF  PARM-SCZY5080-INOUT "]"
      D    DISPLAY  "INPUT-DENBUN       =["
      D              INPUT-DENBUN  OF  PARM-SCZY5080-INOUT(1:400) "]"
      *-----------------------------------------------------------------
           CALL  "SCZY5080"             USING  PARM-SCZY5080-INOUT
                                               PARM-SCZY5080-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD("       COUNTER  OF PARM-SCZY5080-RTNPKG
      D       ") OF SCZY5080   =["  RTN-CD  OF PARM-SCZY5080-RTNPKG
      D                            (COUNTER  OF PARM-SCZY5080-RTNPKG)"]"
      D    DISPLAY  "MENU-ID=[ "MENU-ID OF PARM-SCZY5080-INOUT "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD  OF  PARM-SCZY5080-RTNPKG
                         (COUNTER  OF PARM-SCZY5080-RTNPKG)
             WHEN  CNS-RET-CD-NORMAL
                 CONTINUE
             WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（システムエラー（Oracle））の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                           OF  PARM-SCZY1170-ARG1
                 MOVE  "0016"              TO  ERR-POS
                                           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                           OF  PARM-SCZY1170-ARG1
                 MOVE  0                   TO  DETAIL-RTN-CD
                                           OF  PARM-SCZY1170-ARG1
                 MOVE  PARM-SCZY5080-ARG4  TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ERR-PGM-ID           OF  PARM-SCZY1170-ARG1  =["
      D             ERR-PGM-ID             OF  PARM-SCZY1170-ARG1  "]"
      D    DISPLAY  CNS-PGM-ID ":ERR-POS   OF  PARM-SCZY1170-ARG1  =["
      D             ERR-POS                OF  PARM-SCZY1170-ARG1  "]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD    OF  PARM-SCZY1170-ARG1  =["
      D             RTN-CD                 OF  PARM-SCZY1170-ARG1  "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1  =["
      D             DETAIL-RTN-CD-FLG      OF  PARM-SCZY1170-ARG1  "]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                           OF  PARM-SCZY1170-ARG1
                 MOVE  "0017"              TO  ERR-POS
                                           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                           OF  PARM-SCZY1170-ARG1
                 MOVE  0                   TO  DETAIL-RTN-CD
                                           OF  PARM-SCZY1170-ARG1
                 MOVE  PARM-SCZY5080-ARG4  TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ERR-PGM-ID           OF  PARM-SCZY1170-ARG1  =["
      D             ERR-PGM-ID             OF  PARM-SCZY1170-ARG1  "]"
      D    DISPLAY  CNS-PGM-ID ":ERR-POS   OF  PARM-SCZY1170-ARG1  =["
      D             ERR-POS                OF  PARM-SCZY1170-ARG1  "]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD    OF  PARM-SCZY1170-ARG1  =["
      D             RTN-CD                 OF  PARM-SCZY1170-ARG1  "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1  =["
      D             DETAIL-RTN-CD-FLG      OF  PARM-SCZY1170-ARG1  "]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CALL-SCZY5080-RTN    END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY5080-EXT.
           EXIT.
      ******************************************************************
      *                   SCZY1060 日付置換ルーチン
      ******************************************************************
       CALL-SCZY1060-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  SCZY1060 日付置換ルーチン  START  *****"
      D    DISPLAY  "基準日=["KJN-YMD  OF PARM-SCZY1060-INOUT"]"
      D    DISPLAY  "日付置換文字列=["
      D              HIDUKE-TIKAN-MOZI  OF PARM-SCZY1060-INOUT"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1060"             USING  PARM-SCZY1060-INOUT
                                               PARM-SCZY1060-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD("  COUNTER    OF  PARM-SCZY1060-ARG3
      D      ") OF SCZY1060=["RTN-CD      OF
      D      PARM-SCZY1060-ARG3(COUNTER   OF  PARM-SCZY1060-ARG3) "]"
      *-----------------------------------------------------------------
           IF RTN-CD  OF PARM-SCZY1060-ARG3
              (COUNTER   OF  PARM-SCZY1060-ARG3) = CNS-RET-CD-NORMAL
           THEN
               MOVE  TIKANG-HIDUKE  OF PARM-SCZY1060-INOUT
                 TO  WK-DENBUN-OTHER(WK-START-POS:8)
           ELSE
               MOVE  "0060"             TO  ERR-POS
                                        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-SYSERR  TO  RTN-CD
                                        OF  PARM-SCZY1170-ARG1
               MOVE  0                  TO  DETAIL-RTN-CD
                                        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-FLG-0      TO  DETAIL-RTN-CD-FLG
                                        OF  PARM-SCZY1170-ARG1
               MOVE  PARM-SCZY1060-ARG3 TO  PARM-SCZY1170-ARG2
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  SCZY1060 日付置換ルーチン    END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY1060-EXT.
           EXIT.
      ******************************************************************
      *    実行状況管理編集処理
      ******************************************************************
       JIKOU-STS-EDIT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  JIKOU-STS-EDIT-RTN  START  *****"
           INITIALIZE    PARM-TKDYAA31-INS-ARG
      *-----------------------------------------------------------------
           MOVE  FUNCTION CURRENT-DATE(1:14) TO  WK-MAC-DATE-TIME
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-MAC-DATE-TIME =["WK-MAC-DATE-TIME"]"
      D    DISPLAY  "WK-TIDYAA31-STS  =["WK-TIDYAA31-STS "]"
      *-----------------------------------------------------------------
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD       OF  PARM-SCZY1150-ARG1
             TO  RIYO-CMP-CD       OF  PARM-TKDYAA31-INS-ARG1
           MOVE  RIYO-CMP-CD       OF  PARM-SCZY1150-ARG1
             TO  RIYO-CMP-CD       OF  PARM-TKDYAA31-INS-ARG2
      *----------  処理実行日
           MOVE  SYORI-JIKOU-YMD   OF  PARM-SCZY1150-INOUT
             TO  SYORI-YMD         OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID       TO  KIDOU-ID
                                   OF  PARM-TKDYAA31-INS-ARG2
      *----------  アクセス日時
           MOVE  WK-MAC-DATE-TIME
             TO  ACC-TIME          OF  PARM-TKDYAA31-INS-ARG2
      *----------  アクセスIPアドレス
           MOVE  WK-AIFA-HEADER(231:32)
             TO  ACC-IP            OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動ログインユーザ会社コード
           MOVE  WK-AIFA-HEADER(263:4)
             TO  KIDOU-LOGIN-CMP-CD  OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動ユーザーID
           MOVE  WK-AIFA-HEADER(309:8)
             TO  KIDOU-SID         OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動業務グループコード
           MOVE  WK-AIFA-HEADER(483:10)
             TO  KIDOU-GYOMU-GRP-CD  OF  PARM-TKDYAA31-INS-ARG2
      *----------  タスクスケジュール起動ID
      *----------  タスクスケジュールID
           MOVE  TASK-SCHEDULE-ID  OF  PARM-SCZY1150-INOUT
             TO  TSK-SCHE-ID       OF  PARM-TKDYAA31-INS-ARG2
      *----------  タスクスケジュール明細ID
      *----------  業務タスクID
      *----------  先行タスクスケジュール明細ID１
      *----------  先行タスクスケジュール明細ID２
      *----------  先行タスクスケジュール明細ID３
      *----------  先行タスクスケジュール明細ID４
      *----------  先行タスクスケジュール明細ID５
      *----------  先行タスクスケジュール明細ID６
      *----------  先行タスクスケジュール明細ID７
      *----------  先行タスクスケジュール明細ID８
      *----------  先行タスクスケジュール明細ID９
      *----------  先行タスクスケジュール明細ID１０
      *----------  起動時刻
      *----------  起動経路
           MOVE  KIDOU-KIRO        OF  PARM-SCZY1150-INOUT
             TO  KIDOU-KEIRO       OF  PARM-TKDYAA31-INS-ARG2
      *----------  待機ファイル有効区分
      *----------  タイムアウト時間（分）
      *----------  集信区分
           MOVE  "0"
             TO   SYUSIN-KBN       OF  PARM-TKDYAA31-INS-ARG2
      *----------  取得先区分
      *----------  取得方式
      *----------  取得ファイル区分
      *----------  起動処理分類
           MOVE  KIDOU-SYORI-KBN     OF  PARM-SCZY1150-INOUT
             TO  KIDOU-SYORI-BUNRUI  OF  PARM-TKDYAA31-INS-ARG2
      *----------  実行ステータス
           MOVE  "650"
             TO  JIKOU-STS         OF  PARM-TKDYAA31-INS-ARG2
      *----------  集信ステータス
      *----------  集信リトライ数
      *----------  集信MAX回数
      *----------  集信終了日時
      *----------  一時停止区分
           MOVE  "0"
             TO  ITIJI-TEISHI-KBN  OF  PARM-TKDYAA31-INS-ARG2
      *----------  実行開始日時
      *----------  実行終了日時
      *----------  作表シェル終了日時
      *----------  ダウンロードファイル名
      *----------  ダウンロード出力区分
      *----------  AQ投入ステータス
           MOVE  "0"
             TO  AQ-TOUNYU-STS     OF  PARM-TKDYAA31-INS-ARG2
      *----------  AQメッセージ
      *----------  アップロードファイル総件数
           MOVE  0
             TO  UPLOAD-FILE-KENSU OF  PARM-TKDYAA31-INS-ARG2
      *----------  アップロードエラー件数
           MOVE  0
             TO  UPLOAD-ERR-KENSU  OF  PARM-TKDYAA31-INS-ARG2
      *----------  帳票作成単位
      *----------  ファイル種別
      *----------  プリンタID
      *----------  親起動ID
      *----------  連続起動集約区分
      *----------  削除区分
           MOVE  "0"
             TO  DEL-KBN           OF  PARM-TKDYAA31-INS-ARG2
      *----------  更新日時
           MOVE  FUNCTION CURRENT-DATE(1:14)
             TO  UPD-DATE          OF  PARM-TKDYAA31-INS-ARG2
      *----------  更新ログインユーザ会社コード
           MOVE  WK-AIFA-HEADER(263:4)
             TO  UPD-LOGIN-CMP-CD  OF  PARM-TKDYAA31-INS-ARG2
      *----------  更新ユーザID
           MOVE  WK-AIFA-HEADER(309:8)
             TO  UPD-SID           OF  PARM-TKDYAA31-INS-ARG2
      *----------  更新プログラムID
           MOVE  CNS-PGM-ID
             TO  UPD-PGMID         OF  PARM-TKDYAA31-INS-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ﾀｽｸｽｹｼﾞｭｰﾙﾕﾆｰｸｺｰﾄﾞ=["
      D              TASK-SCHEDULE-UN-CD OF  PARM-SCZY1150-INOUT "]"
      D    DISPLAY  "帳票リクエスト区分=["
      D              REP-REQ-KBN         OF  PARM-TSC0DA21-INOUT "]"
      *-----------------------------------------------------------------
      *---------  ARG2.タスクスケジュールユニークコード ≠ スペース
           IF  TASK-SCHEDULE-UN-CD  OF PARM-SCZY1150-INOUT NOT = SPACE
           THEN
      *----------  タスクスケジュール起動ID
             MOVE  WK-TSK-SCHE-KIDOU-ID
               TO  TSK-SCHE-KIDOU-ID OF  PARM-TKDYAA31-INS-ARG2
      *----------  タスクスケジュールID
             MOVE  TASK-SCHEDULE-ID  OF  PARM-SCZY1150-INOUT
               TO  TSK-SCHE-ID       OF  PARM-TKDYAA31-INS-ARG2
      *----------  タスクスケジュール明細ID
             MOVE  TSK-SCHE-MS-ID    OF  WK-TASK-SCHEDULE
               TO  TSK-SCHE-MS-ID    OF  PARM-TKDYAA31-INS-ARG2
      *----------  業務タスクID
             MOVE  GYOMU-TASK-ID     OF  WK-TASK-SCHEDULE
               TO  GYOMU-TASK-ID     OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID１
             MOVE  HST-SK-TSK-SCHE-MS-ID1
               TO  SK-TSK-SCHE-MS-ID1  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID２
             MOVE  HST-SK-TSK-SCHE-MS-ID2
               TO  SK-TSK-SCHE-MS-ID2  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID３
             MOVE  HST-SK-TSK-SCHE-MS-ID3
               TO  SK-TSK-SCHE-MS-ID3  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID４
             MOVE  HST-SK-TSK-SCHE-MS-ID4
               TO  SK-TSK-SCHE-MS-ID4  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID５
             MOVE  HST-SK-TSK-SCHE-MS-ID5
               TO  SK-TSK-SCHE-MS-ID5  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID６
             MOVE  HST-SK-TSK-SCHE-MS-ID6
               TO  SK-TSK-SCHE-MS-ID6  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID７
             MOVE  HST-SK-TSK-SCHE-MS-ID7
               TO  SK-TSK-SCHE-MS-ID7  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID８
             MOVE  HST-SK-TSK-SCHE-MS-ID8
               TO  SK-TSK-SCHE-MS-ID8  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID９
             MOVE  HST-SK-TSK-SCHE-MS-ID9
               TO  SK-TSK-SCHE-MS-ID9  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID１０
             MOVE  HST-SK-TSK-SCHE-MS-ID10
               TO  SK-TSK-SCHE-MS-ID10  OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動時刻
             MOVE  HST-KIDOU-TIME
               TO  KIDOU-TIME          OF  PARM-TKDYAA31-INS-ARG2
      *----------  待機ファイル有効区分
             MOVE  HST-TAIKI-FILE-KBN
               TO  TAIKI-FILE-KBN      OF  PARM-TKDYAA31-INS-ARG2
      *----------  タイムアウト時間（分）
             MOVE  HST-TIMEOUT-MINUTES
               TO  TIMEOUT-MINUTES     OF  PARM-TKDYAA31-INS-ARG2
      *----------  ダウンロードファイル名
             INITIALIZE DL-FILE-NAME   OF  PARM-TKDYAA31-INS-ARG2
             IF  REP-REQ-KBN  OF  PARM-TSC0DA21-INOUT = "2" THEN
               STRING  RIYO-CMP-CD     OF  PARM-SCZY1150-ARG1,
                     "_",
                     SYORI-JIKOU-YMD   OF  PARM-SCZY1150-INOUT,
                     "_",
                     WK-KIDOU-ID,
                     "_",
                     GYOMU-TASK-ID     OF  WK-TASK-SCHEDULE,
                     ".tsv"
                     DELIMITED  BY  SIZE
                       INTO  DL-FILE-NAME  OF  PARM-TKDYAA31-INS-ARG2
             ELSE
               STRING  RIYO-CMP-CD     OF  PARM-SCZY1150-ARG1,
                     "_",
                     SYORI-JIKOU-YMD   OF  PARM-SCZY1150-INOUT,
                     "_",
                     WK-KIDOU-ID,
                     ".zip"
                     DELIMITED  BY  SIZE
                       INTO  DL-FILE-NAME  OF  PARM-TKDYAA31-INS-ARG2
             END-IF
      *----------  帳票作成単位
             MOVE  WK-REP-CREATE-TANI
               TO  REP-CREATE-TANI     OF  PARM-TKDYAA31-INS-ARG2
      *----------  ファイル種別
             EVALUATE  WK-TYU-HYO-KBN
               WHEN  "1"
                 IF  WK-KAMI-OUT-KBN = "1"  THEN
                   MOVE  "3"
                     TO  REP-OUT-KBN    OF  PARM-TKDYAA31-INS-ARG2
                 ELSE
                   MOVE  "1"
                     TO  REP-OUT-KBN    OF  PARM-TKDYAA31-INS-ARG2
                 END-IF
               WHEN  "2"
                 IF  WK-KAMI-OUT-KBN = "1"  THEN
                   MOVE  "4"
                     TO  REP-OUT-KBN    OF  PARM-TKDYAA31-INS-ARG2
                 ELSE
                   MOVE  "2"
                     TO  REP-OUT-KBN    OF  PARM-TKDYAA31-INS-ARG2
                 END-IF
               WHEN  OTHER
                 MOVE  SPACE
                   TO  REP-OUT-KBN      OF  PARM-TKDYAA31-INS-ARG2
             END-EVALUATE
      *----------  プリンタID
             MOVE  WK-PRINTER-ID
               TO  PRINTER-ID          OF  PARM-TKDYAA31-INS-ARG2
      *----------  連続起動集約区分
             MOVE  SYUUYAKU-KBN        OF  WK-TASK-SCHEDULE
               TO  SYUUYAKU-KBN        OF  PARM-TKDYAA31-INS-ARG2
      *---------  端末利用者の業務ユーザＩＤ = 'NRISYS'
             IF  WK-AIFA-HEADER(309:8)     =   "NRISYS  "
             THEN
      *----------  自動運用カレンダーID
                 MOVE   AUTO-CAL-ID        OF  WK-TASK-SCHEDULE
                   TO   AUTO-CAL-ID        OF  PARM-TKDYAA31-INS-ARG2
      *----------  タスクスケジュールNo
                 MOVE   WK-TSK-SCHE-NO
                   TO   TSK-SCHE-NO        OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo１
                 MOVE   WK-SK-TSK-SCHE-NO(1)
                   TO   SK-TSK-SCHE-NO1    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo２
                 MOVE   WK-SK-TSK-SCHE-NO(2)
                   TO   SK-TSK-SCHE-NO2    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo３
                 MOVE   WK-SK-TSK-SCHE-NO(3)
                   TO   SK-TSK-SCHE-NO3    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo４
                 MOVE   WK-SK-TSK-SCHE-NO(4)
                   TO   SK-TSK-SCHE-NO4    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo５
                 MOVE   WK-SK-TSK-SCHE-NO(5)
                   TO   SK-TSK-SCHE-NO5    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo６
                 MOVE   WK-SK-TSK-SCHE-NO(6)
                   TO   SK-TSK-SCHE-NO6    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo７
                 MOVE   WK-SK-TSK-SCHE-NO(7)
                   TO   SK-TSK-SCHE-NO7    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo８
                 MOVE   WK-SK-TSK-SCHE-NO(8)
                   TO   SK-TSK-SCHE-NO8    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo９
                 MOVE   WK-SK-TSK-SCHE-NO(9)
                   TO   SK-TSK-SCHE-NO9    OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュールNo１０
                 MOVE   WK-SK-TSK-SCHE-NO(10)
                   TO   SK-TSK-SCHE-NO10   OF  PARM-TKDYAA31-INS-ARG2
      *----------  AQ投入日時
                 MOVE   SPACE
                   TO   AQ-TOUNYU-TIME     OF  PARM-TKDYAA31-INS-ARG2
      *----------  AQ再投入日時
                 MOVE   SPACE
                   TO   AQ-SAITOUNYU-TIME  OF  PARM-TKDYAA31-INS-ARG2
      *----------  実行再開日時
                 MOVE   SPACE
                   TO   JIKOU-RESTART-TIME OF  PARM-TKDYAA31-INS-ARG2
      *----------  停止受付日時
                 MOVE   SPACE
                   TO   TEISHI-UKETSUKE-TIME OF  PARM-TKDYAA31-INS-ARG2
      *----------  停止完了日時
                 MOVE   SPACE
                   TO   TEISHI-KANRYOU-TIME OF  PARM-TKDYAA31-INS-ARG2
             ELSE
                   CONTINUE
             END-IF
      *----------  親タスク終了日時
             IF  WK-KO-GYOMU-TASK-FLG = '1'
             THEN
               MOVE   SPACE
                 TO   OYA-TSK-END-TIME    OF  PARM-TKDYAA31-INS-ARG2
             ELSE
               MOVE   '99999999999999'
                 TO   OYA-TSK-END-TIME    OF  PARM-TKDYAA31-INS-ARG2
             END-IF
      *----------  連続起動集約区分保存用ワーク ＞ 0の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY "ワク連続起動集約区分=[" WK-SYUUYAKU-KBN "]"
      D    DISPLAY "FLG-FETCH-END3      =[" FLG-FETCH-END3 "]"
      *-----------------------------------------------------------------
               IF  WK-TIDYAA31-STS = "1"
               THEN
      *----------  タスクスケジュール明細ID
                   MOVE  WK-MS-ID
                     TO  TSK-SCHE-MS-ID    OF  PARM-TKDYAA31-INS-ARG2
      *----------  業務タスクID
                   MOVE  HST-SK-GYOMU-TASK-ID
                     TO  GYOMU-TASK-ID     OF  PARM-TKDYAA31-INS-ARG2
      *----------  タイムアウト時間（分）
                   IF  HST-TIMEOUT-MINUTES = ZERO
                   THEN
                       MOVE  SYUSIN-KANSI-JIKAN-RX
                                           OF  PARM-TSC0SE15-ARG3
                         TO  TIMEOUT-MINUTES
                                           OF  PARM-TKDYAA31-INS-ARG2
                   ELSE
                       CONTINUE
                   END-IF
                   DIVIDE  TIMEOUT-MINUTES  OF  PARM-TKDYAA31-INS-ARG2
                     BY SYUSIN-KANSI-KKK-RX  OF  PARM-TSC0SE15-ARG3
                   GIVING  WK-SYUSIN-MAX-NUM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SYUSIN-MAX-NUM =  ["  WK-SYUSIN-MAX-NUM "]"
      *-----------------------------------------------------------------
      *----------  集信区分
                   MOVE  "1"
                     TO   SYUSIN-KBN       OF  PARM-TKDYAA31-INS-ARG2
      *----------  取得先区分
                   MOVE  HST-SYUTOKUSAKI-KBN
                     TO  SYUTOKUSAKI-KBN   OF  PARM-TKDYAA31-INS-ARG2
      *----------  取得方式
                   MOVE  HST-SYUTOKU-HOUSIKI
                     TO  SYUTOKU-HOUSIKI   OF  PARM-TKDYAA31-INS-ARG2
      *----------  取得ファイル区分
                   MOVE  HST-SYUTOKU-FILE-KBN
                     TO  SYUTOKU-FILE-KBN  OF  PARM-TKDYAA31-INS-ARG2
      *----------  集信MAX回数
                   MOVE  WK-SYUSIN-MAX-NUM
                     TO  SYUSIN-MAX-NUM    OF  PARM-TKDYAA31-INS-ARG2
      *----------  ダウンロードファイル名
                   MOVE  SPACE
                     TO  DL-FILE-NAME      OF  PARM-TKDYAA31-INS-ARG2
      *----------  帳票作成単位
                   MOVE  SPACE
                     TO  REP-CREATE-TANI   OF  PARM-TKDYAA31-INS-ARG2
      *----------  ファイル種別
                   MOVE  SPACE
                     TO  REP-OUT-KBN       OF  PARM-TKDYAA31-INS-ARG2
      *----------  プリンタID
                   MOVE  SPACE
                     TO  PRINTER-ID        OF  PARM-TKDYAA31-INS-ARG2
      *----------  親起動ID
                   COMPUTE  WK-OYA-KIDOU-ID  = WK-KIDOU-ID + 1
                   MOVE  WK-OYA-KIDOU-ID
                     TO  OYA-KIDOU-ID      OF  PARM-TKDYAA31-INS-ARG2
      *----------  連続起動集約区分
                   MOVE  SPACE
                     TO  SYUUYAKU-KBN      OF  PARM-TKDYAA31-INS-ARG2
      *----------  親タスク終了日時
                   IF  WK-KO-GYOMU-TASK-FLG = '1'
                   THEN
                     MOVE   SPACE
                       TO   OYA-TSK-END-TIME  OF  PARM-TKDYAA31-INS-ARG2
                   ELSE
                     MOVE   '99999999999999'
                       TO   OYA-TSK-END-TIME  OF  PARM-TKDYAA31-INS-ARG2
                   END-IF
               END-IF
               IF  WK-TIDYAA31-STS = "2"
               THEN
      *----------  先行タスクスケジュール明細ID１
                   MOVE  WK-MS-ID
                     TO  SK-TSK-SCHE-MS-ID1  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID２
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID2  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID３
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID3  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID４
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID4  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID５
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID5  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID６
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID6  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID７
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID7  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID８
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID8  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID９
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID9  OF  PARM-TKDYAA31-INS-ARG2
      *----------  先行タスクスケジュール明細ID１０
                   MOVE  ZERO
                     TO  SK-TSK-SCHE-MS-ID10  OF  PARM-TKDYAA31-INS-ARG2
      *----------  待機ファイル有効区分
                   MOVE  "0"
                     TO  TAIKI-FILE-KBN      OF  PARM-TKDYAA31-INS-ARG2
      *----------  親タスク終了日時
                   MOVE   '99999999999999'
                     TO   OYA-TSK-END-TIME   OF  PARM-TKDYAA31-INS-ARG2
               END-IF
               IF  WK-SYUUYAKU-KBN > 0 AND FLG-FETCH-END3 = "1"
                   AND  WK-TIDYAA31-STS = SPACE
               THEN
      *----------  タスクスケジュール明細ID
                 MOVE  WK-MS-ID
                   TO  TSK-SCHE-MS-ID      OF  PARM-TKDYAA31-INS-ARG2
      *----------  業務タスクID
                 MOVE  "TZ001DY"                                         20080617
                   TO  GYOMU-TASK-ID       OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動時刻
                 MOVE  SPACE
                   TO  KIDOU-TIME          OF  PARM-TKDYAA31-INS-ARG2
      *----------  待機ファイル有効区分
                 MOVE  "0"
                   TO  TAIKI-FILE-KBN      OF  PARM-TKDYAA31-INS-ARG2
      *----------  タイムアウト時間（分）
                 MOVE  30
                   TO  TIMEOUT-MINUTES     OF  PARM-TKDYAA31-INS-ARG2
      *----------  集信区分
                 MOVE  SPACE
                   TO  SYUSIN-KBN          OF  PARM-TKDYAA31-INS-ARG2
      *----------  ダウンロードファイル名
                 INITIALIZE DL-FILE-NAME   OF  PARM-TKDYAA31-INS-ARG2
                 STRING
                   RIYO-CMP-CD       OF  PARM-SCZY1150-ARG1,
                   "_",
                   SYORI-JIKOU-YMD   OF  PARM-SCZY1150-INOUT,
                   "_",
                   WK-KIDOU-ID,
                   ".zip"
                   DELIMITED  BY  SIZE
                     INTO  DL-FILE-NAME    OF  PARM-TKDYAA31-INS-ARG2
      *----------  帳票作成単位
                 MOVE  SPACE
                   TO  REP-CREATE-TANI     OF  PARM-TKDYAA31-INS-ARG2
      *----------  ファイル種別
                 MOVE  SPACE
                   TO  REP-OUT-KBN         OF  PARM-TKDYAA31-INS-ARG2
      *----------  プリンタID
                 MOVE  SPACE
                   TO  PRINTER-ID          OF  PARM-TKDYAA31-INS-ARG2
      *----------  連続起動集約区分
                 MOVE  "0"
                   TO  SYUUYAKU-KBN        OF  PARM-TKDYAA31-INS-ARG2
      *----------  親タスク終了日時
                 MOVE   SPACE
                   TO   OYA-TSK-END-TIME   OF  PARM-TKDYAA31-INS-ARG2
               END-IF
           ELSE
      *----------  アクセスIPアドレス
             MOVE  WK-IN-HOST-NAME   TO  ACC-IP
                                     OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動ログインユーザ会社コード
             MOVE  COMPANY-CODE        OF  PARM-DENBUN-ARG1
               TO  KIDOU-LOGIN-CMP-CD  OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動ユーザーID
             MOVE  JOB-USER-ID       OF  PARM-DENBUN-ARG1
               TO  KIDOU-SID         OF  PARM-TKDYAA31-INS-ARG2
      *----------  起動業務グループコード
             MOVE  GYOUMU-GROUP-CODE   OF  PARM-DENBUN-ARG2
               TO  KIDOU-GYOMU-GRP-CD  OF  PARM-TKDYAA31-INS-ARG2
      *----------  タスクスケジュール明細ID
             MOVE  1
               TO  TSK-SCHE-MS-ID    OF  PARM-TKDYAA31-INS-ARG2          20080619
      *----------  業務タスクID
             MOVE  GYOMU-TASK-ID     OF  PARM-SCZY1150-INOUT
               TO  GYOMU-TASK-ID     OF  PARM-TKDYAA31-INS-ARG2
      *----------  待機ファイル有効区分
             MOVE  "0"
               TO  TAIKI-FILE-KBN      OF  PARM-TKDYAA31-INS-ARG2
      *----------  タイムアウト時間（分）
             MOVE  0
               TO  TIMEOUT-MINUTES     OF  PARM-TKDYAA31-INS-ARG2
      *----------  ダウンロードファイル名
             INITIALIZE DL-FILE-NAME   OF  PARM-TKDYAA31-INS-ARG2
             IF  REP-REQ-KBN  OF  PARM-TSC0DA21-INOUT = "2" THEN
               STRING  RIYO-CMP-CD     OF  PARM-SCZY1150-ARG1,
                     "_",
                     SYORI-JIKOU-YMD   OF  PARM-SCZY1150-INOUT,
                     "_",
                     WK-KIDOU-ID,
                     "_",
                     GYOMU-TASK-ID     OF  PARM-SCZY1150-INOUT,
                     ".tsv"
                     DELIMITED  BY  SIZE
                       INTO  DL-FILE-NAME  OF  PARM-TKDYAA31-INS-ARG2
             ELSE
               STRING  RIYO-CMP-CD     OF  PARM-SCZY1150-ARG1,
                     "_",
                     SYORI-JIKOU-YMD   OF  PARM-SCZY1150-INOUT,
                     "_",
                     WK-KIDOU-ID,
                     ".zip"
                     DELIMITED  BY  SIZE
                       INTO  DL-FILE-NAME  OF  PARM-TKDYAA31-INS-ARG2
             END-IF
      *----------  帳票作成単位
             MOVE  REP-CREATE-TANI     OF  PARM-SCZY1150-INOUT
               TO  REP-CREATE-TANI     OF  PARM-TKDYAA31-INS-ARG2
      *----------  ファイル種別
             MOVE  REP-OUT-KBN         OF  PARM-SCZY1150-INOUT
               TO  REP-OUT-KBN         OF  PARM-TKDYAA31-INS-ARG2
      *----------  プリンタID
             MOVE  PRINTER-ID          OF  PARM-SCZY1150-INOUT
               TO  PRINTER-ID          OF  PARM-TKDYAA31-INS-ARG2
      *----------  連続起動集約区分
             MOVE  "0"
               TO  SYUUYAKU-KBN        OF  PARM-TKDYAA31-INS-ARG2
      *----------  更新ログインユーザ会社コード
             MOVE  COMPANY-CODE        OF  PARM-DENBUN-ARG1
               TO  UPD-LOGIN-CMP-CD    OF  PARM-TKDYAA31-INS-ARG2
      *----------  更新ユーザID
             MOVE  JOB-USER-ID         OF  PARM-DENBUN-ARG1
               TO  UPD-SID             OF  PARM-TKDYAA31-INS-ARG2
      *----------  親タスク終了日時
             MOVE   SPACE
               TO   OYA-TSK-END-TIME    OF  PARM-TKDYAA31-INS-ARG2
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード=["
      D             RIYO-CMP-CD OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "処理実行日=["SYORI-YMD OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "起動ID=["KIDOU-ID OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY "アクセス日時=["ACC-TIME OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "アクセスIPアドレス=["
      D             ACC-IP OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "起動ログインユーザ会社コード=["
      D             KIDOU-LOGIN-CMP-CD OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "起動ユーザーID=["
      D                       KIDOU-SID OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "起動業務グループコード=["
      D             KIDOU-GYOMU-GRP-CD OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "タスクスケジュール起動ID=["
      D             TSK-SCHE-KIDOU-ID OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "タスクスケジュールID=["
      D             TSK-SCHE-ID OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "タスクスケジュール明細ID=["
      D             TSK-SCHE-MS-ID OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "業務タスクID=["
      D             GYOMU-TASK-ID OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID１=["
      D             SK-TSK-SCHE-MS-ID1 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID２=["
      D             SK-TSK-SCHE-MS-ID2 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID３=["
      D             SK-TSK-SCHE-MS-ID3 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID４=["
      D             SK-TSK-SCHE-MS-ID4 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID５=["
      D             SK-TSK-SCHE-MS-ID5 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID６=["
      D             SK-TSK-SCHE-MS-ID6 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID７=["
      D             SK-TSK-SCHE-MS-ID7 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID８=["
      D             SK-TSK-SCHE-MS-ID8 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID９=["
      D             SK-TSK-SCHE-MS-ID9 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行業務タスクID１０=["
      D             SK-TSK-SCHE-MS-ID10 OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "起動時刻=["KIDOU-TIME OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "起動経路=["KIDOU-KEIRO OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "待機ファイル名有効区分=["
      D             TAIKI-FILE-KBN     OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "タイムアウト時間（分）=["
      D             TIMEOUT-MINUTES    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "集信区分=["
      D             SYUSIN-KBN         OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "取得先区分=["
      D             SYUTOKUSAKI-KBN    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "取得方式=["
      D             SYUTOKU-HOUSIKI    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "取得ファイル区分 =["
      D             SYUTOKU-FILE-KBN   OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "起動処理分類=["
      D             KIDOU-SYORI-BUNRUI OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "実行ステータス=["
      D             JIKOU-STS          OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "集信ステータス=["
      D             SYUSIN-STS         OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  " 集信リトライ数=["
      D             SYUSIN-RETRY-NUM   OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "集信MAX回数=["
      D             SYUSIN-MAX-NUM     OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "集信終了日時=["
      D             SYUSIN-END-TIME    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "一時停止区分=["
      D             ITIJI-TEISHI-KBN   OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "実行開始日時=["
      D             JIKOU-START-TIME   OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "実行終了日時=["
      D             JIKOU-END-TIME     OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "作表シェル終了日時=["
      D             SHELL-END-TIME     OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "ダウンロードファイル名=["
      D             DL-FILE-NAME       OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "ダウンロード出力区分=["
      D             DL-FILE-KBN        OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "AQ投入ステータス=["
      D             AQ-TOUNYU-STS      OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "AQメッセージ=["AQ-MSG OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "アップロードファイル総件数=["
      D             UPLOAD-FILE-KENSU  OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "アップロードエラー件数=["
      D             UPLOAD-ERR-KENSU   OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "帳票作成単位=["
      D             REP-CREATE-TANI    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "ファイル種別=["
      D             REP-OUT-KBN        OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "プリンタID=["
      D             PRINTER-ID         OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "連続起動集約区分=["
      D             SYUUYAKU-KBN       OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "親起動ID=["
      D              OYA-KIDOU-ID      OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "削除区分=["
      D             DEL-KBN  OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "更新日時=["UPD-DATE OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "更新ログインユーザ会社コード=["
      D             UPD-LOGIN-CMP-CD   OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "更新ユーザID=["UPD-SID OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "更新プログラムID=["
      D             UPD-PGMID          OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "自動運用カレンダーID=["
      D             AUTO-CAL-ID        OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "タスクスケジュールNo=["
      D             TSK-SCHE-NO        OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo１=["
      D             SK-TSK-SCHE-NO1    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo２=["
      D             SK-TSK-SCHE-NO2    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo３=["
      D             SK-TSK-SCHE-NO3    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo４=["
      D             SK-TSK-SCHE-NO4    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo５=["
      D             SK-TSK-SCHE-NO5    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo６=["
      D             SK-TSK-SCHE-NO6    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo７=["
      D             SK-TSK-SCHE-NO7    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo８=["
      D             SK-TSK-SCHE-NO8    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo９=["
      D             SK-TSK-SCHE-NO9    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "先行タスクスケジュールNo１０=["
      D             SK-TSK-SCHE-NO10   OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "AQ投入日時=["
      D             AQ-TOUNYU-TIME     OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "AQ再投入日時=["
      D             AQ-SAITOUNYU-TIME  OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "実行再開日時=["
      D             JIKOU-RESTART-TIME OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "停止受付日時=["
      D             TEISHI-UKETSUKE-TIME  OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "停止完了日時=["
      D             TEISHI-KANRYOU-TIME OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "親タスク終了日時=["
      D             OYA-TSK-END-TIME    OF PARM-TKDYAA31-INS-ARG2"]"
      D    DISPLAY  "*****  JIKOU-STS-EDIT-RTN  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       JIKOU-STS-EDIT-EXT.
          EXIT.
      ******************************************************************
      *    実行状況管理INSERT
      ******************************************************************
       JIKOU-STS-INSERT-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  JIKOU-STS-INSERT-RTN   START  *****"
      *-----------------------------------------------------------------
      *----------  実行状況管理編集
           PERFORM  JIKOU-STS-EDIT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "****** TIDYAA31 START ****"
      *-----------------------------------------------------------------
           CALL  "TIDYAA31"  USING  PARM-TKDYAA31-INS-ARG
                                    PARM-TKDYAA31-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD("       COUNTER  OF PARM-TKDYAA31-RTNPKG
      D       ") OF TIDYAA31-INS=["  RTN-CD  OF PARM-TKDYAA31-RTNPKG
      D                           (COUNTER  OF PARM-TKDYAA31-RTNPKG)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD                  OF  PARM-TKDYAA31-RTNPKG
                         (COUNTER  OF PARM-TKDYAA31-RTNPKG)
                 WHEN  CNS-RET-CD-NORMAL
                   CONTINUE
                 WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（システムエラー（Oracle））の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0020"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TKDYAA31-INS-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 WHEN  CNS-RET-CD-SEYAKU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（一意制約）の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0021"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TKDYAA31-INS-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0022"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TKDYAA31-INS-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***** TIDYAA31 END *****"
      D    DISPLAY  "***** JIKOU-STS-INSERT-RTN    END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       JIKOU-STS-INSERT-EXT.
           EXIT.
      ******************************************************************
      *               TKDYAA37-INSERT-RTN
      ******************************************************************
       TKDYAA37-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  TKDYAA37-INSERT-RTN  START  *****"
      *-----------------------------------------------------------------
           INITIALIZE   SQLSTMT7
                        H-WHERE
                        WK-SQL-LEN
               MOVE  1                           TO  WK-SQL-POINTER7
      *---------- 汎用パラメータ所属実行状況管理
               STRING  "INSERT INTO ",
                   HENSYUGO-TBL-ID    OF  PARM-SCZY1160-ARG2(5),
                   " A SELECT '",
      *----------  利用会社コード
                   RIYO-CMP-CD        OF  PARM-SCZY1150-INOUT,
                   "','",
      *----------  処理実行日
                   SYORI-JIKOU-YMD    OF  PARM-SCZY1150-INOUT,
                   "','",
      *----------  起動ID
                   WK-KIDOU-ID,
      *----------  条件種類
                   "','1',",
      *----------  条件項目No
                   "JYOKEN_NO,",
      *----------  条件値
                   "JYOKENTI,",
      *----------  更新日時
                   "SYSDATE,'",
      *----------  更新ログインユーザ会社コード
                   WK-AIFA-HEADER(263:4),
      *----------  更新ユーザID
                   "','",
                   WK-AIFA-HEADER(309:8),
      *----------  更新プログラムID
                   "','",
                   CNS-PGM-ID,
                   "' FROM  ",
                   HENSYUGO-TBL-ID   OF  PARM-SCZY1160-ARG2(2),
                   " B ",
      *----------  B.ログインユーザ会社コード = ログインユーザ会社コード
                   "WHERE B.LOGIN_CMP_CD = :V1 ",
                   " AND B.RIYO_CMP_CD = :V2 ",
                   " AND B.TSK_SCHE_ID = :V3 ",
                   " AND B.TSK_SCHE_UNIQUE_CD = :V4 ",
                   " AND B.TSK_SCHE_MS_ID = :V5 ",
                   " AND B.JYOKEN_SYURUI = '1' "
                   DELIMITED  BY  SIZE
                     INTO  SQLSTMT7
                     WITH  POINTER  WK-SQL-POINTER7
      *----------  動的SQL文長さ
                   COMPUTE   WK-SQL-LEN = WK-SQL-POINTER7 - 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT7-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT7        =["SQLSTMT7(1:WK-SQL-LEN)"]"
      *-----------------------------------------------------------------
           MOVE  WK-LOGIN-CMP-CD
             TO  H-LOGIN-CMP-CD-W      OF  H-WHERE
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY1150-INOUT
             TO  H-RIYO-CMP-CD-W       OF  H-WHERE
           MOVE  TASK-SCHEDULE-ID      OF  PARM-SCZY1150-INOUT
             TO  H-TASK-SCHEDULE-ID-W  OF  H-WHERE
           MOVE  TASK-SCHEDULE-UN-CD   OF  PARM-SCZY1150-INOUT
             TO  H-TASK-SCHEDULE-UN-CD-W  OF  H-WHERE
           MOVE  TSK-SCHE-MS-ID        OF  WK-TASK-SCHEDULE
             TO  H-TSK-SCHE-MS-ID-W    OF  H-WHERE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "[V1:"H-LOGIN-CMP-CD-W          OF H-WHERE"]"
      D             "[V2:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
      D             "[V3:"H-TASK-SCHEDULE-ID-W      OF H-WHERE"]"
      D             "[V4:"H-TASK-SCHEDULE-UN-CD-W   OF H-WHERE"]"
      D             "[V5:"H-TSK-SCHE-MS-ID-W        OF H-WHERE"]"
      D    DISPLAY  "ＳＱＬ文 [TKDYAA37]編集終了"
      *-----------------------------------------------------------------
           INITIALIZE  WK-FREE-MSG
           STRING  SQLSTMT7(1:WK-SQL-LEN)
                   "[V1:"H-LOGIN-CMP-CD-W          OF H-WHERE"]"
                   "[V2:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
                   "[V3:"H-TASK-SCHEDULE-ID-W      OF H-WHERE"]"
                   "[V4:"H-TASK-SCHEDULE-UN-CD-W   OF H-WHERE"]"
                   "[V5:"H-TSK-SCHE-MS-ID-W        OF H-WHERE"]"
             INTO  WK-FREE-MSG
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S02  FROM :SQLSTMT7
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)S02=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0023"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S02
               USING :H-LOGIN-CMP-CD-W,
                     :H-RIYO-CMP-CD-W,
                     :H-TASK-SCHEDULE-ID-W,
                     :H-TASK-SCHEDULE-UN-CD-W,
                     :H-TSK-SCHE-MS-ID-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DYAA37-INS)=[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE NOT =  ZERO  THEN
             MOVE  "0024"                  TO  ERR-POS
                                           OF PARM-SCZY1170-ARG1
             MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                           OF PARM-SCZY1170-ARG1
             MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                           OF PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-FLG-1           TO  DETAIL-RTN-CD-FLG
                                           OF PARM-SCZY1170-ARG1
             MOVE  WK-FREE-MSG             TO  FREE-MSG
                                           OF PARM-SCZY1170-ARG1
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  TKDYAA37-INSERT  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKDYAA37-INSERT-EXT.
           EXIT.
      ******************************************************************
      *    電文保持INSERT
      ******************************************************************
       DENBUN-INSERT-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  DENBUN-INSERT-RTN   START  *****"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
               MOVE  RIYO-CMP-CD      OF  PARM-SCZY1150-INOUT
                 TO  RIYO-CMP-CD      OF  PARM-TKDYAA32-INS-ARG1
               MOVE  RIYO-CMP-CD      OF  PARM-SCZY1150-INOUT
                 TO  RIYO-CMP-CD      OF  PARM-TKDYAA32-INS-ARG2
      *----------  処理実行日
               MOVE  SYORI-JIKOU-YMD  OF  PARM-SCZY1150-INOUT
                 TO  SYORI-YMD        OF  PARM-TKDYAA32-INS-ARG2
      *---------- 起動ID
               MOVE  WK-KIDOU-ID      TO  KIDOU-ID
                                      OF  PARM-TKDYAA32-INS-ARG2
      *---------- 電文情報
               MOVE  WK-DENBUN-INFO
                   TO  DENBUN-INFO      OF  PARM-TKDYAA32-INS-ARG2
               IF  TASK-SCHEDULE-UN-CD OF PARM-SCZY1150-INOUT
                      NOT = SPACE      THEN
      *---------- 電文情報保存用ワーク
      *---------- 更新ログインユーザー会社コード
                 MOVE  WK-AIFA-HEADER(263:4)
                   TO  UPD-LOGIN-CMP-CD OF  PARM-TKDYAA32-INS-ARG2
      *---------- 更新ユーザーID
                 MOVE  WK-AIFA-HEADER(309:8)
                   TO  UPD-SID          OF  PARM-TKDYAA32-INS-ARG2
               ELSE
      *---------- 更新ログインユーザー会社コード
                 MOVE  COMPANY-CODE     OF  PARM-DENBUN-ARG1
                   TO  UPD-LOGIN-CMP-CD OF  PARM-TKDYAA32-INS-ARG2
      *---------- 更新ユーザーID
                 MOVE  JOB-USER-ID      OF  PARM-DENBUN-ARG1
                   TO  UPD-SID          OF  PARM-TKDYAA32-INS-ARG2
               END-IF
      *---------- 更新日時
      *---------- 更新プログラムID
               MOVE  CNS-PGM-ID       TO  UPD-PGMID
                                      OF  PARM-TKDYAA32-INS-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD="RIYO-CMP-CD OF PARM-TKDYAA32-INS-ARG2
      D    DISPLAY  "SYORI-YMD="SYORI-YMD     OF PARM-TKDYAA32-INS-ARG2
      D    DISPLAY  "KIDOU-ID="KIDOU-ID       OF PARM-TKDYAA32-INS-ARG2
      D    DISPLAY  "DENBUN-INFO=["
      D              DENBUN-INFO  OF PARM-TKDYAA32-INS-ARG2(1:800)"]"
      D    DISPLAY  "UPD-DATE="UPD-DATE       OF PARM-TKDYAA32-INS-ARG2
      D    DISPLAY  "UPD-LOGIN-CMP-CD="UPD-LOGIN-CMP-CD
      D                                       OF PARM-TKDYAA32-INS-ARG2
      D    DISPLAY  "UPD-SID="UPD-SID         OF PARM-TKDYAA32-INS-ARG2
      D    DISPLAY  "UPD-PGMID="UPD-PGMID     OF PARM-TKDYAA32-INS-ARG2
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "****** TKDYAA32_INS START ****"
      *-----------------------------------------------------------------
               CALL  "TIDYAA32"     USING  PARM-TKDYAA32-INS-ARG
                                           PARM-TKDYAA32-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD("       COUNTER  OF PARM-TKDYAA32-RTNPKG
      D       ") OF TKDYAA32-INS=["  RTN-CD  OF PARM-TKDYAA32-RTNPKG
      D                           (COUNTER  OF PARM-TKDYAA32-RTNPKG)"]"
      D    DISPLAY  "****** TKDYAA32_INS END ****"
      *-----------------------------------------------------------------
             EVALUATE  RTN-CD                OF  PARM-TKDYAA32-RTNPKG
                         (COUNTER  OF PARM-TKDYAA32-RTNPKG)
                 WHEN  CNS-RET-CD-NORMAL
                   CONTINUE
                 WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（システムエラー（Oracle））の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0025"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TKDYAA32-INS-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 WHEN  CNS-RET-CD-SEYAKU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（一意制約）の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0026"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TKDYAA32-INS-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0027"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TKDYAA32-INS-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
             END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  DENBUN-INSERT-RTN    END   *****".
      *-----------------------------------------------------------------
       DENBUN-INSERT-EXT.
           EXIT.
      ******************************************************************
      *    起動ID更新
      ******************************************************************
       UPDATE-KIDOUID-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  起動ID更新  START  *****"
      D    DISPLAY  "WK-KIDOU-ID=["WK-KIDOU-ID"]"
      *-----------------------------------------------------------------
           INITIALIZE   SQLSTMT2
                        H-WHERE
                        WK-SQL-LEN
           MOVE  1                      TO  WK-SQL-POINTER2
           COMPUTE  WK-TSK-SCHE-KIDOU-ID = WK-TSK-SCHE-KIDOU-ID + 1
      *---------  ARG2.タスクスケジュールユニークコード ≠ スペース
           IF  TASK-SCHEDULE-UN-CD  OF PARM-SCZY1150-INOUT NOT = SPACE
           THEN
      *----------  更新ログインユーザー会社コード
               STRING  " UPD_LOGIN_CMP_CD = '",
                       WK-AIFA-HEADER(263:4),
      *----------  更新ユーザーID
                       "', UPD_SID = '",
                       WK-AIFA-HEADER(309:8)
                       "',"
                     DELIMITED  BY  SIZE
                       INTO  WK-SQL-WHERE
           ELSE
      *----------  更新ログインユーザー会社コード
               STRING  " UPD_LOGIN_CMP_CD = '",
                       COMPANY-CODE     OF  PARM-DENBUN-ARG1,
      *----------  更新ユーザーID
                       "', UPD_SID = '",
                       JOB-USER-ID      OF  PARM-DENBUN-ARG1
                       "',"
                     DELIMITED  BY  SIZE
                       INTO  WK-SQL-WHERE
           END-IF
           STRING  "UPDATE ",
                   HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4),
      *----------  起動ID
                   " SET  KIDOU_ID = '",
                   WK-KIDOU-ID
      *----------  タスクスケジュール起動ID
                   "', TSK_SCHE_KIDOU_ID = '",
                   WK-TSK-SCHE-KIDOU-ID,
      *----------  更新日時
                   "', UPD_DATE= SYSDATE,",
                   WK-SQL-WHERE
      *----------  更新プログラムID
                   " UPD_PGMID = '",
                   CNS-PGM-ID,
                   "' WHERE  RIYO_CMP_CD = :V1 ",
                   " AND SYORI_YMD = :V2"
                   DELIMITED  BY  SIZE
                     INTO  SQLSTMT2
                     WITH  POINTER  WK-SQL-POINTER2
      *----------  動的SQL文長さ
                   COMPUTE   WK-SQL-LEN = WK-SQL-POINTER2 - 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT2-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT2        =["SQLSTMT2(1:WK-SQL-LEN)"]"
      *-----------------------------------------------------------------
      *---------- 利用会社コード = ARG1.利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY1150-INOUT
             TO  H-RIYO-CMP-CD-W       OF  H-WHERE
      *---------- 処理実行日 = ARG1.処理実行日
           MOVE  SYORI-JIKOU-YMD       OF  PARM-SCZY1150-INOUT
             TO  H-SYORI-JIKOU-YMD-W   OF  H-WHERE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "[V1:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
      D             "[V2:"H-SYORI-JIKOU-YMD-W       OF H-WHERE"]"
      D    DISPLAY  "ＳＱＬ文 [起動ID更新]編集終了"
      *-----------------------------------------------------------------
           INITIALIZE  WK-FREE-MSG
           STRING  SQLSTMT2(1:WK-SQL-LEN)
                   "[V1:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
                   "[V2:"H-SYORI-JIKOU-YMD-W       OF H-WHERE"]"
             INTO  WK-FREE-MSG
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S01  FROM :SQLSTMT2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0028"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S01
               USING :H-RIYO-CMP-CD-W,
                     :H-SYORI-JIKOU-YMD-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE = [" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE NOT =  ZERO  THEN
               MOVE  "0029"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-FLG-1           TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  起動ID更新   END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       UPDATE-KIDOUID-EXT.
           EXIT.
      ******************************************************************
      *    TSC0DA21 業務タスクマスタSELECTルーチン
      ******************************************************************
       CALL-TSC0DA21-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  帳票リクエスト区分取得開始  ***"
      *-----------------------------------------------------------------
      *----------  帳票リクエスト区分取得処理
           INITIALIZE                      PARM-TSC0DA21-INOUT
                                           PARM-TSC0DA21-RTNPKG
      *----------  ARG1.利用会社コード
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1150-INOUT
             TO  RIYO-CMP-CD            OF PARM-TSC0DA21-INOUT
      *----------  SELECT 条件
           STRING   "WHERE GYOMU_TASK_ID = '",
                    WK-GYOMU-TASK-ID,
                    "'"
              INTO  SEL-WHERE           OF PARM-TSC0DA21-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード     =["
      D              RIYO-CMP-CD        OF  PARM-SCZY1150-INOUT "]"
      D    DISPLAY  "業務タスクID       =[" WK-GYOMU-TASK-ID    "]"
      D    DISPLAY  "  CALL TSC0DA21 ......"
      *-----------------------------------------------------------------
           CALL   "TSC0DA21"
           USING  PARM-TSC0DA21-INOUT
                  PARM-TSC0DA21-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD OF TSC0DA21 =[" RTN-CD  OF
      D    PARM-TSC0DA21-RTNPKG(COUNTER  OF PARM-TSC0DA21-RTNPKG) "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD
             OF PARM-TSC0DA21-RTNPKG(COUNTER  OF PARM-TSC0DA21-RTNPKG)
      *----------  正常
               WHEN  CNS-RET-CD-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "帳票リクエスト区分取得正常"
      *-----------------------------------------------------------------
                     CONTINUE
               WHEN  CNS-RTN-NO-DATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "該当データなし"
      *-----------------------------------------------------------------
                     CONTINUE
               WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle）"
      *-----------------------------------------------------------------
                   MOVE  "0030"
                     TO  ERR-POS        OF PARM-SCZY1170-ARG1
                   MOVE  CNS-RET-CD-ORAERR
                     TO  RTN-CD         OF PARM-SCZY1170-ARG1
                   MOVE  ZERO
                     TO  DETAIL-RTN-CD  OF PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
                   MOVE  SPACE
                     TO  FREE-MSG       OF PARM-SCZY1170-ARG1
      *----------  リターンパツセージ
                   MOVE  PARM-TSC0DA21-ARG3  OF PARM-TSC0DA21-RTNPKG
                     TO  PARM-SCZY1170-RTNPKG
                   PERFORM  ERR-RTN
               WHEN  OTHER
      *----------  上記以外
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "エラー（その他）"
      *-----------------------------------------------------------------
                   MOVE  "0031"
                     TO  ERR-POS        OF PARM-SCZY1170-ARG1
                   MOVE  CNS-RET-CD-SYSERR
                     TO  RTN-CD         OF PARM-SCZY1170-ARG1
                   MOVE  ZERO
                     TO  DETAIL-RTN-CD  OF PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
                   MOVE  SPACE
                     TO  FREE-MSG       OF PARM-SCZY1170-ARG1
      *----------  リターンパツセージ
                   MOVE  PARM-TSC0DA21-ARG3  OF PARM-TSC0DA21-RTNPKG
                     TO  PARM-SCZY1170-RTNPKG
                   PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  帳票リクエスト区分取得終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-TSC0DA21-EXT.
           EXIT.
      ******************************************************************
      *            子業務タスクを取得
      ******************************************************************
       KO-GYOMU-TASK-CHK-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  子業務タスクを取得 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    SQLSTMT9
                         H-WHERE
                         WK-SQL-LEN
                         WK-FREE-MSG
                         WK-CR-OPEN-FLG9
           MOVE  1                          TO  WK-SQL-POINTER9
           STRING  "SELECT ",
                   "COUNT(1) ",
                   " FROM ",
                   HENSYUGO-TBL-ID   OF  PARM-SCZY1160-ARG2(10),
                   " A ,",
                   " ( SELECT T1.GYOMU_TASK_ID",
                   " FROM ",
                   HENSYUGO-TBL-ID   OF  PARM-SCZY1160-ARG2(1),
                   " T1 ",
                   " WHERE ",
      *---------- T1.ログインユーザ会社コード＝別紙3で取得したログインユーザ会社コード
                   "T1.LOGIN_CMP_CD = :V1 ",
      *---------- T1.利用会社コード＝別紙3で取得した利用会社コード
                  " AND T1.RIYO_CMP_CD = :V2 ",
      *---------- T1.タスクスケジュールID＝別紙3で取得したタスクスケジュールID
                  " AND T1.TSK_SCHE_ID = :V3 ",
      *---------- T1.タスクスケジュールユニークコード＝別紙3で取得したタスクスケジュールユニークコード
                  " AND T1.TSK_SCHE_UNIQUE_CD = :V4 ",
      *---------- T1.タスクスケジュール明細ID　IN
                  " AND T1.TSK_SCHE_MS_ID IN ",
                  " ( :V5, :V6, :V7, :V8, :V9, :V10, :V11, :V12, ",
                  " :V13, :V14 )",
                  " ) B "
                  " WHERE ",
      *---------- A.業務タスクID＝B.業務タスクID
                  "A.GYOMU_TASK_ID = B.GYOMU_TASK_ID ",
      *---------- A.業務タスク稼動制御区分 ＝ '4'（子業務タスク）
                  " AND A.GYOMU_TASK_KBN = '4' "
                   DELIMITED  BY  SIZE
                   INTO  SQLSTMT9
                   WITH  POINTER  WK-SQL-POINTER9
      *----------  動的SQL文長さ
                   COMPUTE   WK-SQL-LEN = WK-SQL-POINTER9 - 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT9-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT9        =["SQLSTMT9(1:WK-SQL-LEN)"]"
      *-----------------------------------------------------------------
      *---------- 別紙3で取得したログインユーザ会社コード
           MOVE  HST-LOGIN-CMP-CD           OF ORA-WORKING2-AREA
             TO  H-LOGIN-CMP-CD-W           OF H-WHERE
      *---------- 別紙3で取得した利用会社コード
           MOVE  HST-RIYO-CMP-CD            OF ORA-WORKING2-AREA
             TO  H-RIYO-CMP-CD-W            OF H-WHERE
      *---------- 別紙3で取得したタスクスケジュールID
           MOVE  HST-TSK-SCHE-ID            OF ORA-WORKING2-AREA
             TO  H-TASK-SCHEDULE-ID-W       OF H-WHERE
      *---------- 別紙3で取得したタスクスケジュールユニークコード
           MOVE  HST-TSK-SCHE-UNIQUE-CD     OF ORA-WORKING2-AREA
             TO  H-TASK-SCHEDULE-UN-CD-W    OF H-WHERE
      *---------- 別紙3で取得した先行タスクスケジュール明細ID１～１０
           MOVE  HST-SK-TSK-SCHE-MS-ID1     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID1-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID2     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID2-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID3     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID3-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID4     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID4-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID5     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID5-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID6     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID6-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID7     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID7-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID8     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID8-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID9     OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID9-W     OF H-WHERE
           MOVE  HST-SK-TSK-SCHE-MS-ID10    OF ORA-WORKING2-AREA
             TO  H-SK-TSK-SCHE-MS-ID10-W    OF H-WHERE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "[V1:"H-LOGIN-CMP-CD-W          OF H-WHERE"]"
      D             "[V2:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
      D             "[V3:"H-TASK-SCHEDULE-ID-W      OF H-WHERE"]"
      D             "[V4:"H-TASK-SCHEDULE-UN-CD-W   OF H-WHERE"]"
      D             "[V5:"H-SK-TSK-SCHE-MS-ID1-W    OF H-WHERE"]"
      D             "[V6:"H-SK-TSK-SCHE-MS-ID2-W    OF H-WHERE"]"
      D             "[V7:"H-SK-TSK-SCHE-MS-ID3-W    OF H-WHERE"]"
      D             "[V8:"H-SK-TSK-SCHE-MS-ID4-W    OF H-WHERE"]"
      D             "[V9:"H-SK-TSK-SCHE-MS-ID5-W    OF H-WHERE"]"
      D             "[V10:"H-SK-TSK-SCHE-MS-ID6-W   OF H-WHERE"]"
      D             "[V11:"H-SK-TSK-SCHE-MS-ID7-W   OF H-WHERE"]"
      D             "[V12:"H-SK-TSK-SCHE-MS-ID8-W   OF H-WHERE"]"
      D             "[V13:"H-SK-TSK-SCHE-MS-ID9-W   OF H-WHERE"]"
      D             "[V14:"H-SK-TSK-SCHE-MS-ID10-W  OF H-WHERE"]"
      D    DISPLAY  "ＳＱＬ文 [子業務タスク取得]編集終了"
      *-----------------------------------------------------------------
           INITIALIZE  WK-FREE-MSG
           STRING  SQLSTMT9(1:WK-SQL-LEN)
                   "[V1:"H-LOGIN-CMP-CD-W          OF H-WHERE"]"
                   "[V2:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
                   "[V3:"H-TASK-SCHEDULE-ID-W      OF H-WHERE"]"
                   "[V4:"H-TASK-SCHEDULE-UN-CD-W   OF H-WHERE"]"
                   "[V5:"H-SK-TSK-SCHE-MS-ID1-W    OF H-WHERE"]"
                   "[V6:"H-SK-TSK-SCHE-MS-ID2-W    OF H-WHERE"]"
                   "[V7:"H-SK-TSK-SCHE-MS-ID3-W    OF H-WHERE"]"
                   "[V8:"H-SK-TSK-SCHE-MS-ID4-W    OF H-WHERE"]"
                   "[V9:"H-SK-TSK-SCHE-MS-ID5-W    OF H-WHERE"]"
                   "[V10:"H-SK-TSK-SCHE-MS-ID6-W   OF H-WHERE"]"
                   "[V11:"H-SK-TSK-SCHE-MS-ID7-W   OF H-WHERE"]"
                   "[V12:"H-SK-TSK-SCHE-MS-ID8-W   OF H-WHERE"]"
                   "[V13:"H-SK-TSK-SCHE-MS-ID9-W   OF H-WHERE"]"
                   "[V14:"H-SK-TSK-SCHE-MS-ID10-W  OF H-WHERE"]"
             INTO  WK-FREE-MSG
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S09  FROM :SQLSTMT9
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0064"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR09 CURSOR  FOR S09
           END-EXEC
      *----------  カーソル OPEN
           EXEC SQL
               OPEN  CR09 USING
                  :H-LOGIN-CMP-CD-W,
                  :H-RIYO-CMP-CD-W,
                  :H-TASK-SCHEDULE-ID-W,
                  :H-TASK-SCHEDULE-UN-CD-W,
                  :H-SK-TSK-SCHE-MS-ID1-W,
                  :H-SK-TSK-SCHE-MS-ID2-W,
                  :H-SK-TSK-SCHE-MS-ID3-W,
                  :H-SK-TSK-SCHE-MS-ID4-W,
                  :H-SK-TSK-SCHE-MS-ID5-W,
                  :H-SK-TSK-SCHE-MS-ID6-W,
                  :H-SK-TSK-SCHE-MS-ID7-W,
                  :H-SK-TSK-SCHE-MS-ID8-W,
                  :H-SK-TSK-SCHE-MS-ID9-W,
                  :H-SK-TSK-SCHE-MS-ID10-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)      =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0061"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "1"                     TO  WK-CR-OPEN-FLG9
           END-IF
      *----------  カーソル FETCH
           EXEC SQL
               FETCH  CR09
                 INTO :HST-COUNT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH9)    =["SQLCODE"]"
      D    DISPLAY  "子業務タスク数(HST-COUNT) =["HST-COUNT "]"
      *-----------------------------------------------------------------
           IF  SQLCODE  = CNS-SQL-NORMAL
           THEN
               IF  HST-COUNT > 0
               THEN
                 MOVE  '1' TO WK-KO-GYOMU-TASK-FLG
               ELSE
                 MOVE  '0' TO WK-KO-GYOMU-TASK-FLG
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク子業務タスクフラグ=["WK-KO-GYOMU-TASK-FLG "]"
      *-----------------------------------------------------------------
           ELSE
               MOVE  "0062"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR09
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE9)     =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0063"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "0"                     TO  WK-CR-OPEN-FLG9
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  子業務タスクを取得 END  ***".
      *-----------------------------------------------------------------
       KO-GYOMU-TASK-CHK-EXT.
           EXIT.
      ******************************************************************
      *    集信業務タスクIDを取得
      ******************************************************************
       CALL-TSDYAA20-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  集信業務タスクIDを取得 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    SQLSTMT4
                         H-WHERE
                         WK-SQL-LEN
                         WK-FREE-MSG
                         WK-CR-OPEN-FLG4
           MOVE  1                 TO  WK-SQL-POINTER4
           STRING  "SELECT SK_GYOMU_TASK_ID "
                   " FROM "
                   HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(10)
                   " A WHERE "
                   " A.GYOMU_TASK_ID = :V1"
                   " AND A.GYOMU_TASK_KBN = '2' "
           DELIMITED  BY  SIZE
           INTO  SQLSTMT4
           WITH POINTER  WK-SQL-POINTER4
      *----------  動的SQL文長さ
           COMPUTE   WK-SQL-LEN = WK-SQL-POINTER4 - 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT4-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT4        =["SQLSTMT4(1:WK-SQL-LEN)"]"
      *-----------------------------------------------------------------
           MOVE  GYOMU-TASK-ID        OF  WK-TASK-SCHEDULE
             TO  H-GYOMU-TASK-ID-W    OF  H-WHERE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "H-GYOMU-TASK-ID-W =["
      D                              H-GYOMU-TASK-ID-W    OF  H-WHERE"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT4(1:WK-SQL-LEN)
                   "[ V1 = "H-GYOMU-TASK-ID-W    OF  H-WHERE"]"
             INTO  WK-FREE-MSG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-FREE-MSG =["  WK-FREE-MSG  "]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S04  FROM :SQLSTMT4
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0034"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR04 CURSOR  FOR S04
           END-EXEC
      *----------  カーソル OPEN
           EXEC SQL
               OPEN  CR04 USING
                  :H-GYOMU-TASK-ID-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)      =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0035"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "1"                     TO  WK-CR-OPEN-FLG4
           END-IF
      *----------  カーソル FETCH
             EXEC SQL
                 FETCH  CR04
                  INTO :HST-SK-GYOMU-TASK-ID
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH1) =["SQLCODE"]"
      D    DISPLAY  "HST-SK-GYOMU-TASK-ID=["HST-SK-GYOMU-TASK-ID"]"
      *-----------------------------------------------------------------
               EVALUATE  SQLCODE
                 WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-MS-ID=["WK-MS-ID"]"
      *-----------------------------------------------------------------
                   IF  WK-MS-ID  = ZERO
                   THEN
                       PERFORM GET-MAX-MS-ID-RTN
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-MS-ID=["WK-MS-ID"]"
      *-----------------------------------------------------------------
      *----------   TSC0SE15システム属性SELECTルーチン
                   PERFORM  CALL-TSC0SE15-RTN
                   COMPUTE  WK-MS-ID  = WK-MS-ID + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-MS-ID=["WK-MS-ID"]"
      *-----------------------------------------------------------------
      *----------   集信業務タスクを実行状況管理にINSERTする
                   MOVE  1         TO  WK-TIDYAA31-STS
                   PERFORM  JIKOU-STS-INSERT-RTN
                   PERFORM  TKDYAA37-INSERT-RTN
      *----------  起動ID保存用ワークカウントアップ
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KIDOU-ID=["WK-KIDOU-ID"]"
      *-----------------------------------------------------------------
                   COMPUTE  WK-KIDOU-ID   =  WK-KIDOU-ID  +  1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KIDOU-ID=["WK-KIDOU-ID"]"
      *-----------------------------------------------------------------
      *----------   業務タスクを実行状況管理にINSERTする
                   MOVE  2         TO  WK-TIDYAA31-STS
                   PERFORM  JIKOU-STS-INSERT-RTN
                   MOVE  SPACE     TO  WK-TIDYAA31-STS
                 WHEN  CNS-SQL-NOTFOUND
      *----------   実行状況管理INSERT
                   PERFORM  JIKOU-STS-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "待機ファイル有効区分=["
      D                        TAIKI-FILE-KBN  OF  WK-TASK-SCHEDULE"]"
      *-----------------------------------------------------------------
      *----------   保存用ワーク.待機ファイル有効区分 = 1(有効)
                   IF  TAIKI-FILE-KBN  OF  WK-TASK-SCHEDULE = "1"
                   THEN
                     PERFORM  TKDYAA37-INSERT-RTN
                   END-IF
                 WHEN OTHER
                   MOVE  "0036"             TO  ERR-POS
                                            OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RET-CD-ORAERR  TO  RTN-CD
                                            OF  PARM-SCZY1170-ARG1
                   MOVE  WK-FREE-MSG        TO  FREE-MSG
                                            OF  PARM-SCZY1170-ARG1
                   MOVE  "1"                TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-ARG1
                   MOVE  SQLCODE            TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-ARG1
                   PERFORM  ERR-RTN
               END-EVALUATE
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR04
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE)     =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0037"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "0"                     TO  WK-CR-OPEN-FLG4
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  集信業務タスクIDを取得 END  ***".
      *-----------------------------------------------------------------
       CALL-TSDYAA20-EXT.
           EXIT.
      ******************************************************************
      *    システム属性SELECTルーチン
      ******************************************************************
       CALL-TSC0SE15-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  システム属性SELECTルーチン START  ***"
      *-----------------------------------------------------------------
      *----------  ARG1.利用会社コード
           MOVE  RIYO-CMP-CD       OF PARM-SCZY1150-INOUT
             TO  RIYO-CMP-CD       OF PARM-TSC0SE15-ARG1
           CALL  "TSC0SE15"        USING  PARM-TSC0SE15-INOUT
                                          PARM-TSC0SE15-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD("       COUNTER  OF PARM-TSC0SE15-RTNPKG
      D       ") OF TSC0SE15-INS=["  RTN-CD  OF PARM-TSC0SE15-RTNPKG
      D                           (COUNTER  OF PARM-TSC0SE15-RTNPKG)"]"
      D    DISPLAY  "集信監視時間_RX = ["
      D               SYUSIN-KANSI-JIKAN-RX  OF  PARM-TSC0SE15-ARG3  "]"
      D    DISPLAY  "集信監視間隔_RX = ["
      D                 SYUSIN-KANSI-KKK-RX  OF  PARM-TSC0SE15-ARG3  "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD                  OF  PARM-TSC0SE15-RTNPKG
                         (COUNTER  OF PARM-TSC0SE15-RTNPKG)
                 WHEN  CNS-RET-CD-NORMAL
                 WHEN  CNS-RTN-NO-DATA
                   CONTINUE
                 WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（システムエラー（Oracle））の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0038"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TSC0SE15-RTNPKG  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0039"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-TSC0SE15-RTNPKG  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  システム属性SELECTルーチン END  ***".
      *-----------------------------------------------------------------
       CALL-TSC0SE15-EXT.
           EXIT.
      ******************************************************************
      *    監査ログＩＮＳルーチン
      ******************************************************************
       CALL-SCZY1100-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  監査ログＩＮＳルーチン開始  ***"
      *-----------------------------------------------------------------
           INITIALIZE                      PARM-SCZY1100-AIFA-H
                                           PARM-SCZY1100-INOUT
                                           PARM-SCZY1100-RTNPKG
      *----------  AIFA・共通ヘッダ項目
           MOVE  WK-AIFA-HEADER(1:400)
             TO  PARM-SCZY1100-AIFA     OF PARM-SCZY1100-AIFA-H
           MOVE  WK-AIFA-HEADER(401:300)
             TO  PARM-SCZY1100-HEADER   OF PARM-SCZY1100-AIFA-H
      *----------  システム処理ID←SCZY5080で取得した呼出先メニューID値
           MOVE  MENU-ID                OF PARM-SCZY5080-INOUT
             TO  SYS-SYORI-ID           OF PARM-SCZY1100-INOUT
      *----------  起動ID
           MOVE  SPACE
             TO  KIDOU-ID               OF PARM-SCZY1100-INOUT
      *----------  画面アクション区分
      *----------  5:帳票リクエスト
           IF  KIDOU-SYORI-KBN  OF  PARM-SCZY1150-INOUT = "R"
           THEN
             MOVE  "5"
               TO  GAMEN-ACT-KBN        OF PARM-SCZY1100-INOUT
           END-IF
      *----------  6:一括起動
           IF  KIDOU-SYORI-KBN  OF  PARM-SCZY1150-INOUT = "B"
           THEN
             MOVE  "6"
               TO  GAMEN-ACT-KBN        OF PARM-SCZY1100-INOUT
           END-IF
      *----------  7:ダウンロード
           IF  KIDOU-SYORI-KBN  OF  PARM-SCZY1150-INOUT = "D"
           THEN
             MOVE  "7"
               TO  GAMEN-ACT-KBN        OF PARM-SCZY1100-INOUT
           END-IF
      *----------  8:アップロード
           IF  KIDOU-SYORI-KBN  OF  PARM-SCZY1150-INOUT = "U"
           THEN
             MOVE  "8"
               TO  GAMEN-ACT-KBN        OF PARM-SCZY1100-INOUT
           END-IF
      *----------  9:データ更新
           IF  KIDOU-SYORI-KBN  OF  PARM-SCZY1150-INOUT = "K"
           THEN
             MOVE  "9"
               TO  GAMEN-ACT-KBN        OF PARM-SCZY1100-INOUT
           END-IF
      *----------  A (外部送受信)
           IF  KIDOU-SYORI-KBN  OF  PARM-SCZY1150-INOUT = "A"            20080619
           THEN
             MOVE  "A"
               TO  GAMEN-ACT-KBN        OF PARM-SCZY1100-INOUT
           END-IF
      *----------  正常エラーフラグ
           IF  KIDOU-SYORI-KBN  OF  PARM-SCZY1150-INOUT = "U"
               AND WK-GYOMU-TASK-ID(1:1) = "U"
           THEN
               MOVE  "04"
                 TO  NML-ERR-KBN        OF PARM-SCZY1100-INOUT
           ELSE
               MOVE  "03"
                 TO  NML-ERR-KBN        OF PARM-SCZY1100-INOUT
           END-IF
      *----------  課金用検索区分
           IF  KIDOU-SYORI-KBN  OF  PARM-SCZY1150-INOUT = "U"
           THEN
               MOVE  SPACE
                 TO  EE-SEARCH-KBN      OF PARM-SCZY1100-INOUT
           ELSE
               MOVE  "0"
                 TO  EE-SEARCH-KBN      OF PARM-SCZY1100-INOUT
           END-IF
      *----------  基準年月日1
           MOVE  SPACE
             TO  KIJUN-YMD1             OF PARM-SCZY1100-INOUT
      *----------  基準年月日2
           MOVE  SPACE
             TO  KIJUN-YMD2             OF PARM-SCZY1100-INOUT
      *----------  委託会社コード
           MOVE  SPACE
             TO  ITK-CMP-CD             OF PARM-SCZY1100-INOUT
      *----------  ファンドコード
           MOVE  SPACE
             TO  FND-CD                 OF PARM-SCZY1100-INOUT
      *----------  銘柄コード
           MOVE  TASK-SCHEDULE-ID       OF PARM-SCZY1150-INOUT
             TO  MEG-CD                 OF PARM-SCZY1100-INOUT
      *----------  データ特定用ID
           MOVE  WK-GYOMU-TASK-ID
             TO  DATA-ID                OF PARM-SCZY1100-INOUT
      *---------- TXRX利用区分 ← 電文情報保存用ワーク.AIFA.TXRX利用区分
           MOVE  WK-AIFA-HEADER(667:1)
             TO  TXRX-KBN               OF PARM-SCZY1100-INOUT
      *----------  RXファンドコード
           MOVE  SPACE
             TO  FUND-CD                OF PARM-SCZY1100-INOUT
      *----------  RXポートフォリオコード
           MOVE  SPACE
             TO  PTF-CD                 OF PARM-SCZY1100-INOUT
      *----------  電文ID
           MOVE  SPACE
             TO  DENBUN-ID              OF PARM-SCZY1100-INOUT
      *----------  入力電文
           MOVE  SPACE
             TO  IN-DENBUN              OF PARM-SCZY1100-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システム処理ID     =["
      D              SYS-SYORI-ID       OF PARM-SCZY1100-INOUT "]"
      D    DISPLAY  "画面アクション区分 =["
      D              GAMEN-ACT-KBN      OF PARM-SCZY1100-INOUT "]"
      D    DISPLAY  "正常エラーフラグ   =["
      D              NML-ERR-KBN        OF PARM-SCZY1100-INOUT "]"
      D    DISPLAY  "課金用検索区分     =["
      D              EE-SEARCH-KBN      OF PARM-SCZY1100-INOUT "]"
      D    DISPLAY  "銘柄コード         =["
      D              MEG-CD             OF PARM-SCZY1100-INOUT "]"
      D    DISPLAY  "データ特定用ID     =["
      D              DATA-ID            OF PARM-SCZY1100-INOUT "]"
      D    DISPLAY  "TXRX利用区分       =["
      D              TXRX-KBN           OF PARM-SCZY1100-INOUT "]"
      D    DISPLAY  "  CALL  SCZY1100 ......"
      *-----------------------------------------------------------------
           CALL  "SCZY1100"
           USING  PARM-SCZY1100-AIFA-H
                  PARM-SCZY1100-INOUT
                  PARM-SCZY1100-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD FO SCZY1100 =[" RTN-CD  OF
      D    PARM-SCZY1100-RTNPKG(COUNTER  OF PARM-SCZY1100-RTNPKG) "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD  OF
               PARM-SCZY1100-RTNPKG(COUNTER  OF PARM-SCZY1100-RTNPKG)
      *----------  正常
               WHEN  CNS-RET-CD-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "監査ログＩＮＳルーチン 正常"
      *-----------------------------------------------------------------
                     CONTINUE
               WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle）"
      *-----------------------------------------------------------------
                   MOVE  "0032"
                     TO  ERR-POS        OF PARM-SCZY1170-ARG1
                   MOVE  CNS-RET-CD-ORAERR
                     TO  RTN-CD         OF PARM-SCZY1170-ARG1
                   MOVE  ZERO
                     TO  DETAIL-RTN-CD  OF PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
                   MOVE  SPACE
                     TO  FREE-MSG       OF PARM-SCZY1170-ARG1
      *----------  リターンパツセージ
                   MOVE  PARM-SCZY1100-RTNPKG  TO  PARM-SCZY1170-RTNPKG
                   PERFORM  ERR-RTN
      *----------  上記以外
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "エラー（その他）"
      *-----------------------------------------------------------------
                   MOVE  "0033"
                     TO  ERR-POS        OF PARM-SCZY1170-ARG1
                   MOVE  CNS-RET-CD-SYSERR
                     TO  RTN-CD         OF PARM-SCZY1170-ARG1
                   MOVE  ZERO
                     TO  DETAIL-RTN-CD  OF PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
                   MOVE  SPACE
                     TO  FREE-MSG       OF PARM-SCZY1170-ARG1
      *----------  リターンパツセージ
                   MOVE  PARM-SCZY1100-RTNPKG  TO  PARM-SCZY1170-RTNPKG
                   PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  監査ログＩＮＳルーチン終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY1100-EXT.
           EXIT.
      ******************************************************************
      *               電文項目マスタ取得
      ******************************************************************
       CALL-TKDYAA14-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  電文項目マスタ取得 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    SQLSTMT5
                         H-WHERE
                         WK-SQL-LEN
                         WK-FREE-MSG
                         WK-CR-OPEN-FLG5
           MOVE  1                 TO  WK-SQL-POINTER5
           STRING  "SELECT ",
                   "A.DENBUN_KOMOKU_ID, ",
                   "(A.FUGOU_LEN + A.DENBUN_KOMOKU_LEN ",
                   "+ A.SHOSU_KOMOKU_LEN) AS KOMOKU_LEN ",
                   "FROM ",
                   HENSYUGO-TBL-ID     OF  PARM-SCZY1160-ARG2(9),
                   " A WHERE A.GYOMU_TASK_ID = :V1 ",
                   " ORDER BY A.DENBUN_KOMOKU_NO "
                   DELIMITED  BY  SIZE
                   INTO  SQLSTMT5
                   WITH POINTER  WK-SQL-POINTER5
      *----------  動的SQL文長さ
           COMPUTE   WK-SQL-LEN = WK-SQL-POINTER5 - 1
           MOVE  WK-GYOMU-TASK-ID            TO  H-GYOMU-TASK-ID-W
           STRING  SQLSTMT5(1:WK-SQL-LEN)
                   "[V1:"WK-GYOMU-TASK-ID"]"
             INTO  WK-FREE-MSG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT5-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT5        =["SQLSTMT5(1:WK-SQL-LEN)"]"
      D    DISPLAY  "H-GYOMU-TASK-ID-W    =["H-GYOMU-TASK-ID-W"]"
      D    DISPLAY  "WK-FREE-MSG    =["WK-FREE-MSG"]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S05  FROM :SQLSTMT5
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0041"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR05 CURSOR  FOR S05
           END-EXEC
      *----------  カーソル OPEN
           EXEC SQL
               OPEN  CR05 USING
                  :H-GYOMU-TASK-ID-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)      =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0042"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "1"                     TO  WK-CR-OPEN-FLG5
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-FETCH-END5      =["FLG-FETCH-END5"]"
      *-----------------------------------------------------------------
           PERFORM  UNTIL  FLG-FETCH-END5     <>  SPACE
      *----------  カーソル FETCH
             EXEC SQL
                 FETCH  CR05
                  INTO :H-DENBUN-KOMOKU-ID,
                       :H-KOMOKU-LEN
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH5)    =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "H-DENBUN-KOMOKU-ID =["H-DENBUN-KOMOKU-ID "]"
      D    DISPLAY  "H-KOMOKU-LEN=["H-KOMOKU-LEN"]"
      *-----------------------------------------------------------------
                   IF  H-DENBUN-KOMOKU-ID = "clt_file_name"
                   THEN
                       COMPUTE WK-UPLOAD-COUNT = WK-UPLOAD-COUNT + 1
                       PERFORM  CALL-TIDYAA37-RTN
                   ELSE
                       CONTINUE
                   END-IF
                   COMPUTE WK-KOUMO-POS = WK-KOUMO-POS + H-KOMOKU-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-UPLOAD-COUNT      =["WK-UPLOAD-COUNT"]"
      D    DISPLAY  "WK-KOUMO-POS   =["WK-KOUMO-POS"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
                 MOVE  "1"                TO  FLG-FETCH-END5
               WHEN  OTHER
                 MOVE  "1"                TO  FLG-FETCH-END5
                 MOVE  "0043"             TO  ERR-POS
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-CD-ORAERR  TO  RTN-CD
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  WK-FREE-MSG1       TO  FREE-MSG
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  "1"                TO  DETAIL-RTN-CD-FLG
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE            TO  DETAIL-RTN-CD
                                          OF  PARM-SCZY1170-ARG1
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-PERFORM
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR05
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE)     =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0044"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG             TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "0"                     TO  WK-CR-OPEN-FLG5
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  電文項目マスタ取得 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-TKDYAA14-EXT.
           EXIT.
      ******************************************************************
      *              IDYAA37 その他条件所属実行状況INSERTルーチン
      ******************************************************************
       CALL-TIDYAA37-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*** その他条件所属実行状況INSERTルーチン START ***"
      *-----------------------------------------------------------------
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD       OF  PARM-SCZY1150-ARG1
             TO  RIYO-CMP-CD       OF  PARM-TKDYAA37-INS-ARG1
           MOVE  RIYO-CMP-CD       OF  PARM-SCZY1150-ARG1
             TO  RIYO-CMP-CD       OF  PARM-TKDYAA37-INS-ARG2
      *----------  処理実行日
           MOVE  SYORI-JIKOU-YMD   OF  PARM-SCZY1150-INOUT
             TO  SYORI-YMD         OF  PARM-TKDYAA37-INS-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID       TO  KIDOU-ID
                                   OF  PARM-TKDYAA37-INS-ARG2
      *----------  条件種類
           MOVE  "1"               TO  JYOKEN-SYURUI
                                   OF  PARM-TKDYAA37-INS-ARG2
      *----------  条件項目No
           MOVE  WK-UPLOAD-COUNT   TO  JYOKEN-NO
                                   OF  PARM-TKDYAA37-INS-ARG2
      *----------  条件値
           MOVE  WK-DENBUN-INFO(701 + WK-KOUMO-POS :H-KOMOKU-LEN)
                                   TO  JYOKENTI
                                   OF  PARM-TKDYAA37-INS-ARG2
      *----------  更新日時
           MOVE  FUNCTION CURRENT-DATE(1:14)
             TO  UPD-DATE          OF  PARM-TKDYAA37-INS-ARG2
      *----------  更新ログインユーザ会社コード
           MOVE  WK-AIFA-HEADER(263:4)
             TO  UPD-LOGIN-CMP-CD  OF  PARM-TKDYAA37-INS-ARG2
      *----------  更新ユーザID
           MOVE  WK-AIFA-HEADER(309:8)
             TO  UPD-SID           OF  PARM-TKDYAA37-INS-ARG2
      *----------  更新プログラムID
           MOVE  CNS-PGM-ID
             TO  UPD-PGMID         OF  PARM-TKDYAA37-INS-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード    OF  PARM-TKDYAA37-INS-ARG1  =["
      D              RIYO-CMP-CD       OF  PARM-TKDYAA37-INS-ARG1"]"
      D    DISPLAY  "利用会社コード    OF  PARM-TKDYAA37-INS-ARG2  =["
      D              RIYO-CMP-CD       OF  PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "処理実行日=["SYORI-YMD OF PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "起動ID  =[" KIDOU-ID  OF  PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "条件種類 = ["
      D              JYOKEN-SYURUI         OF PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "条件項目No =["
      D              JYOKEN-NO             OF PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "条件値 = ["
      D              JYOKENTI              OF PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "更新日時 =["
      D              UPD-DATE              OF PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "更新ログインユーザ会社コード =["
      D              UPD-LOGIN-CMP-CD      OF PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "更新ユーザID =["
      D              UPD-SID               OF PARM-TKDYAA37-INS-ARG2"]"
      D    DISPLAY  "更新プログラムID =["
      D              UPD-PGMID             OF PARM-TKDYAA37-INS-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "TIDYAA37"  USING  PARM-TKDYAA37-INS-ARG
                                    PARM-TKDYAA37-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD("       COUNTER  OF PARM-TKDYAA37-RTNPKG
      D       ") OF TIDYAA37-INS=["  RTN-CD  OF PARM-TKDYAA37-RTNPKG
      D                           (COUNTER  OF PARM-TKDYAA37-RTNPKG)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD                  OF  PARM-TKDYAA37-RTNPKG
                         (COUNTER  OF PARM-TKDYAA37-RTNPKG)
                WHEN  CNS-RET-CD-NORMAL
                  CONTINUE
                WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（システムエラー（Oracle））の場合"
      *-----------------------------------------------------------------
                  MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  "0045"              TO  ERR-POS
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  0                   TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  PARM-TKDYAA37-INS-ARG3  TO  PARM-SCZY1170-ARG2
                  PERFORM  ERR-RTN
                WHEN  CNS-RET-CD-SEYAKU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（一意制約）の場合"
      *-----------------------------------------------------------------
                  MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  "0046"              TO  ERR-POS
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  0                   TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  PARM-TKDYAA37-INS-ARG3  TO  PARM-SCZY1170-ARG2
                  PERFORM  ERR-RTN
                WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
                  MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  "0047"              TO  ERR-POS
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  0                   TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-ARG1
                  MOVE  PARM-TKDYAA37-INS-ARG3  TO  PARM-SCZY1170-ARG2
                  PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*** その他条件所属実行状況INSERTルーチン  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-TIDYAA37-EXT.
           EXIT.
      ******************************************************************
      *            ユーザー会社属性SELECTルーチン
      ******************************************************************
       CALL-TSC0SE16-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ユーザー会社属性SELECTルーチン START  ***"
      *-----------------------------------------------------------------
      *----------  ARG1.利用会社コード
           MOVE  RIYO-CMP-CD       OF PARM-SCZY1150-INOUT
             TO  RIYO-CMP-CD       OF PARM-TSC0SE16-ARG1
      *----------  SELECT 条件
           STRING   "WHERE LOGIN_CMP_CD = '",
                    RIYO-CMP-CD    OF PARM-SCZY1150-INOUT,
                    "'"
              INTO  SEL-WHERE      OF PARM-TSC0SE16-INOUT
           CALL  "TSC0SE16"        USING  PARM-TSC0SE16-INOUT
                                          PARM-TSC0SE16-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD("       COUNTER  OF PARM-TSC0SE16-RTNPKG
      D       ") OF TSC0SE16-INS=["  RTN-CD  OF PARM-TSC0SE16-RTNPKG
      D                           (COUNTER   OF PARM-TSC0SE16-RTNPKG)"]"
      D    DISPLAY  "RX電子帳票形式 = ["
      D              RX-REP-FMT              OF  PARM-TSC0SE16-ARG3  "]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-TSC0SE16-RTNPKG
               (COUNTER  OF PARM-TSC0SE16-RTNPKG)
               NOT = CNS-RET-CD-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                         OF  PARM-SCZY1170-ARG1
               MOVE  "0048"              TO  ERR-POS
                                         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                         OF  PARM-SCZY1170-ARG1
               MOVE  0                   TO  DETAIL-RTN-CD
                                         OF  PARM-SCZY1170-ARG1
               MOVE  PARM-TSC0SE16-RTNPKG  TO  PARM-SCZY1170-ARG2
               PERFORM  ERR-RTN
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ユーザー会社属性SELECTルーチン END  ***".
      *-----------------------------------------------------------------
       CALL-TSC0SE16-EXT.
           EXIT.
      ******************************************************************
      *            MAX明細ID取得ルーチン
      ******************************************************************
       GET-MAX-MS-ID-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  MAX明細ID取得ルーチン START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    SQLSTMT8
                         H-WHERE
                         WK-SQL-LEN
                         WK-CR-OPEN-FLG8
           MOVE  1                          TO  WK-SQL-POINTER8
           STRING  "SELECT ",
                   "MAX(TSK_SCHE_MS_ID) ",
                   " FROM ",
                   HENSYUGO-TBL-ID   OF  PARM-SCZY1160-ARG2(1),
                   " WHERE "
      *---------- ログインユーザ会社コード = ARG2.ログインユーザ会社コード
                   "LOGIN_CMP_CD = :V1 ",
      *---------- 利用会社コード = ARG2.利用会社コード
                  " AND RIYO_CMP_CD = :V2 ",
      *---------- タスクスケジュールID = ARG2.タスクスケジュールID
                  " AND TSK_SCHE_ID = :V3 ",
      *---------- ジュールユニークコード = スケジュールユニークコード
                  " AND TSK_SCHE_UNIQUE_CD = :V4 "
                   DELIMITED  BY  SIZE
                   INTO  SQLSTMT8
                   WITH  POINTER  WK-SQL-POINTER8
      *----------  動的SQL文長さ
                   COMPUTE   WK-SQL-LEN = WK-SQL-POINTER8 - 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT8-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT8        =["SQLSTMT8(1:WK-SQL-LEN)"]"
      *-----------------------------------------------------------------
      *---------- ログインユーザ会社コード
           MOVE  WK-LOGIN-CMP-CD
             TO  H-LOGIN-CMP-CD-W           OF H-WHERE
      *---------- ARG1.利用会社コード
           MOVE  RIYO-CMP-CD                OF PARM-SCZY1150-INOUT
             TO  H-RIYO-CMP-CD-W            OF H-WHERE
      *---------- ARG3.タスクスケジュールID
           MOVE  TASK-SCHEDULE-ID           OF PARM-SCZY1150-INOUT
             TO  H-TASK-SCHEDULE-ID-W       OF H-WHERE
      *---------- スケジュールユニークコード
           MOVE  TASK-SCHEDULE-UN-CD        OF PARM-SCZY1150-INOUT
             TO  H-TASK-SCHEDULE-UN-CD-W    OF H-WHERE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "[V1:"H-LOGIN-CMP-CD-W          OF H-WHERE"]"
      D             "[V2:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
      D             "[V3:"H-TASK-SCHEDULE-ID-W      OF H-WHERE"]"
      D             "[V4:"H-TASK-SCHEDULE-UN-CD-W   OF H-WHERE"]"
      D    DISPLAY  "ＳＱＬ文 [タスクスケジュール中間]編集終了"
      *-----------------------------------------------------------------
           INITIALIZE  WK-FREE-MSG2
           STRING  SQLSTMT8(1:WK-SQL-LEN)
                   "[V1:"H-LOGIN-CMP-CD-W          OF H-WHERE"]"
                   "[V2:"H-RIYO-CMP-CD-W           OF H-WHERE"]"
                   "[V3:"H-TASK-SCHEDULE-ID-W      OF H-WHERE"]"
                   "[V4:"H-TASK-SCHEDULE-UN-CD-W   OF H-WHERE"]"
             INTO  WK-FREE-MSG2
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S08  FROM :SQLSTMT8
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0049"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG2            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR08 CURSOR  FOR S08
           END-EXEC
      *----------  カーソル OPEN
           EXEC SQL
               OPEN  CR08 USING
                  :H-LOGIN-CMP-CD-W,
                  :H-RIYO-CMP-CD-W,
                  :H-TASK-SCHEDULE-ID-W,
                  :H-TASK-SCHEDULE-UN-CD-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)      =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0050"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG2            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "1"                     TO  WK-CR-OPEN-FLG8
           END-IF
      *----------  カーソル FETCH
           EXEC SQL
               FETCH  CR08
                 INTO :HST-MAX-MS-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH8)    =["SQLCODE"]"
      D    DISPLAY  "HST-MAX-MS-ID =["HST-MAX-MS-ID "]"
      *-----------------------------------------------------------------
           IF  SQLCODE  = CNS-SQL-NORMAL
           THEN
               MOVE  HST-MAX-MS-ID  TO WK-MS-ID
           ELSE
               MOVE  "0051"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG2            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR08
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE8)     =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0052"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG2            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "0"                     TO  WK-CR-OPEN-FLG8
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  MAX明細ID取得ルーチン END  ***".
      *-----------------------------------------------------------------
       GET-MAX-MS-ID-EXT.
           EXIT.
      ******************************************************************
      *    SCZY1130 利用権限チェックルーチン
      ******************************************************************
       CALL-SCZY1130-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CALL-SCZY1130-RTN  START  *****"
      *-----------------------------------------------------------------
      *----------  業務グループコード
           MOVE  WK-AIFA-HEADER(483:10)
             TO  GYOMU-GRP-CD                OF  PARM-SCZY1130-ARG1
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD                 OF  PARM-SCZY1150-ARG1
             TO  RIYO-CMP-CD                 OF  PARM-SCZY1130-ARG1
      *----------  ログインユーザー会社コード
           MOVE  LOGIN-CMP-CD                OF  PARM-SCZY1150-ARG1
             TO  LOGIN-CMP-CD                OF  PARM-SCZY1130-ARG1
      *----------  実行処理ID
           MOVE  WK-GYOMU-TASK-ID
             TO  JIKOU-SYORI-ID              OF  PARM-SCZY1130-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "業務グループコード="GYOMU-GRP-CD
      D                                        OF PARM-SCZY1130-ARG1
      D    DISPLAY  "利用会社コード="RIYO-CMP-CD  OF  PARM-SCZY1130-ARG1
      D    DISPLAY  "ログインユーザー会社コード="LOGIN-CMP-CD
      D                                         OF PARM-SCZY1130-ARG1
      D    DISPLAY  "実行処理ID="JIKOU-SYORI-ID OF PARM-SCZY1130-ARG1
      D    DISPLAY  "メニューID="MENU-ID        OF PARM-SCZY1130-ARG1
      D    DISPLAY  "ファンドコード="FUND-CD    OF PARM-SCZY1130-ARG1
      D    DISPLAY  "ポートフォリオコード="PTF-CD  OF PARM-SCZY1130-ARG1
      D    DISPLAY  "予備="YOBI                 OF PARM-SCZY1130-ARG1
      *-----------------------------------------------------------------
           CALL  "SCZY1130"             USING    PARM-SCZY1130-INOUT
                                                 PARM-SCZY1130-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD                  OF  PARM-SCZY1130-ARG3=["
      D              RTN-CD                  OF  PARM-SCZY1130-ARG3
      D              (COUNTER                OF  PARM-SCZY1130-ARG3)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD                  OF  PARM-SCZY1130-ARG3
                         (COUNTER            OF  PARM-SCZY1130-ARG3)
                 WHEN  CNS-RET-CD-NORMAL
                   CONTINUE
                 WHEN  CNS-RET-CD-NOKENG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（権限なし）の場合"
      *-----------------------------------------------------------------
                   PERFORM  OYA-GYOMU-TASK-ID-RTN
                 WHEN  CNS-RET-CD-ORAERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "（システムエラー（Oracle））の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-ORAERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0053"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-SCZY1130-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー（Oracle以外）の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-SYSERR   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0054"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-SCZY1130-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  CALL-SCZY1130-RTN  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY1130-EXT.
           EXIT.
      ******************************************************************
      *    親業務タスクIDを取得
      ******************************************************************
       OYA-GYOMU-TASK-ID-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  親業務タスクIDを取得 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    SQLSTMT6
                         HST-OYA-GYOMU-TASK-ID
                         H-OYA-GYOMU-TASK-ID
                         WK-OYA-GYOMU-TASK-ID
                         WK-CR-OPEN-FLG6
                         WK-FREE-MSG3
                         WK-SQL-LEN
           MOVE  1                 TO  WK-SQL-POINTER6
           MOVE  WK-GYOMU-TASK-ID  TO  H-OYA-GYOMU-TASK-ID
           STRING  "SELECT MAX(SK_GYOMU_TASK_ID) "
                   " FROM "
                   HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(10)
                   " A WHERE "
                   " A.GYOMU_TASK_ID = :V1"
                   " AND A.GYOMU_TASK_KBN = '5' "
           DELIMITED  BY  SIZE
           INTO  SQLSTMT6
           WITH POINTER  WK-SQL-POINTER6
      *----------  動的SQL文長さ
           COMPUTE   WK-SQL-LEN = WK-SQL-POINTER6 - 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT6-LEN    =["WK-SQL-LEN"]"
      D    DISPLAY  "SQLSTMT6        =["SQLSTMT6(1:WK-SQL-LEN)"]"
      D    DISPLAY  "H-OYA-GYOMU-TASK-ID =["
      D                              H-OYA-GYOMU-TASK-ID "]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT6(1:WK-SQL-LEN)
                   "[ V1 = "H-OYA-GYOMU-TASK-ID"]"
             INTO  WK-FREE-MSG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-FREE-MSG3 =["  WK-FREE-MSG3  "]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE S06  FROM :SQLSTMT6
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0055"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG3            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR06 CURSOR  FOR S06
           END-EXEC
      *----------  カーソル OPEN
           EXEC SQL
               OPEN  CR06 USING
                  :H-OYA-GYOMU-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)      =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0056"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG3            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "1"                     TO  WK-CR-OPEN-FLG6
           END-IF
      *----------  カーソル FETCH
           EXEC SQL
               FETCH  CR06
                INTO :HST-OYA-GYOMU-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH1) =["SQLCODE"]"
      D    DISPLAY  "HST-OYA-GYOMU-TASK-ID=["HST-OYA-GYOMU-TASK-ID"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
                 MOVE  HST-OYA-GYOMU-TASK-ID
                   TO  WK-OYA-GYOMU-TASK-ID
                 PERFORM  KENGAN-CHECK-RTN
             WHEN  CNS-SQL-FETCHNULL
                 COMPUTE  WK-GYOMU-COUNT = WK-GYOMU-COUNT + 1
                 MOVE  WK-GYOMU-TASK-ID
                   TO  WK-GYOMU-KENGAN-NASI(WK-GYOMU-COUNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-GYOMU-COUNT = ["WK-GYOMU-COUNT "]"
      D    DISPLAY  "WK-GYOMU-KENGAN-NASI("WK-GYOMU-COUNT") = ["
      D              WK-GYOMU-KENGAN-NASI(WK-GYOMU-COUNT) "]"
      *-----------------------------------------------------------------
      *----------  SCZY1100 監査ログＩＮＳルーチン
                 PERFORM  CALL-SCZY1100-RTN
                 IF  TASK-SCHEDULE-UN-CD  OF PARM-SCZY1150-INOUT
                   NOT = SPACE
                 THEN
                   MOVE  "1"                 TO  WK-KENGAN-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KENGAN-KBN = ["WK-KENGAN-KBN "]"
      *-----------------------------------------------------------------
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-GYOMU-GROUP = ["WK-GYOMU-GROUP "]"
      *-----------------------------------------------------------------
                   MOVE  CNS-RET-CD-NOKENG   TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  "0057"              TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-FLG-0       TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  0                   TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
                   MOVE  WK-GYOMU-GROUP
                     TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-SCZY1130-ARG3  TO  PARM-SCZY1170-ARG2
                   PERFORM  ERR-RTN
                 END-IF
             WHEN OTHER
                 MOVE  "0058"             TO  ERR-POS
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-CD-ORAERR  TO  RTN-CD
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  WK-FREE-MSG3       TO  FREE-MSG
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  "1"                TO  DETAIL-RTN-CD-FLG
                                          OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE            TO  DETAIL-RTN-CD
                                          OF  PARM-SCZY1170-ARG1
                 PERFORM  ERR-RTN
           END-EVALUATE
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR06
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE)     =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                       NOT = CNS-SQL-NORMAL
           THEN
               MOVE  "0059"                  TO  ERR-POS
                                             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RET-CD-ORAERR       TO  RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               MOVE  WK-FREE-MSG3            TO  FREE-MSG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  "1"                     TO  DETAIL-RTN-CD-FLG
                                             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE                 TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  "0"                     TO  WK-CR-OPEN-FLG6
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  親業務タスクIDを取得 END  ***".
      *-----------------------------------------------------------------
       OYA-GYOMU-TASK-ID-EXT.
           EXIT.
      ******************************************************************
      *                 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           MOVE  CNS-RET-CD-NORMAL
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD= [" RTN-CD  OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"          USING  PARM-SCZY1170-INOUT
                                            PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-ARG2     TO  PARM-SCZY1150-ARG5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  "PARM-SCZY1150-RTNPKG=["PARM-SCZY1150-ARG5"]"
      D    DISPLAY  "***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *                 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ERR-RTN  START  ***"
      D    DISPLAY  "WK-CR-OPEN-FLG1 =["WK-CR-OPEN-FLG1"]"
      D    DISPLAY  "WK-CR-OPEN-FLG3 =["WK-CR-OPEN-FLG3"]"
      D    DISPLAY  "WK-CR-OPEN-FLG4 =["WK-CR-OPEN-FLG4"]"
      D    DISPLAY  "WK-CR-OPEN-FLG5 =["WK-CR-OPEN-FLG5"]"
      D    DISPLAY  "WK-CR-OPEN-FLG6 =["WK-CR-OPEN-FLG6"]"
      D    DISPLAY  "WK-CR-OPEN-FLG8 =["WK-CR-OPEN-FLG8"]"
      D    DISPLAY  "WK-CR-OPEN-FLG9 =["WK-CR-OPEN-FLG9"]"
      D    DISPLAY  "カーソルをクローズ"
      *-----------------------------------------------------------------
           IF  WK-CR-OPEN-FLG1 = "1"
           THEN
      *----------  カーソル CLOSE
               EXEC SQL
                   CLOSE CR01
               END-EXEC
               IF  SQLCODE         = CNS-SQL-NORMAL
               THEN
                   MOVE  "0"           TO  WK-CR-OPEN-FLG1
               END-IF
           END-IF
           IF  WK-CR-OPEN-FLG3 = "1"
           THEN
      *----------  カーソル CLOSE
               EXEC SQL
                   CLOSE CR03
               END-EXEC
               IF  SQLCODE         = CNS-SQL-NORMAL
               THEN
                   MOVE  "0"           TO  WK-CR-OPEN-FLG3
               END-IF
           END-IF
           IF  WK-CR-OPEN-FLG4 = "1"
           THEN
      *----------  カーソル CLOSE
               EXEC SQL
                   CLOSE CR04
               END-EXEC
               IF  SQLCODE         = CNS-SQL-NORMAL
               THEN
                   MOVE  "0"           TO  WK-CR-OPEN-FLG4
               END-IF
           END-IF
           IF  WK-CR-OPEN-FLG5 = "1"
           THEN
      *----------  カーソル CLOSE
               EXEC SQL
                   CLOSE CR05
               END-EXEC
               IF  SQLCODE         = CNS-SQL-NORMAL
               THEN
                   MOVE  "0"           TO  WK-CR-OPEN-FLG5
               END-IF
           END-IF
           IF  WK-CR-OPEN-FLG6 = "1"
           THEN
      *----------  カーソル CLOSE
               EXEC SQL
                   CLOSE CR06
               END-EXEC
               IF  SQLCODE         = CNS-SQL-NORMAL
               THEN
                   MOVE  "0"           TO  WK-CR-OPEN-FLG6
               END-IF
           END-IF
           IF  WK-CR-OPEN-FLG8 = "1"
           THEN
      *----------  カーソル CLOSE
               EXEC SQL
                   CLOSE CR08
               END-EXEC
               IF  SQLCODE         = CNS-SQL-NORMAL
               THEN
                   MOVE  "0"           TO  WK-CR-OPEN-FLG8
               END-IF
           END-IF
           IF  WK-CR-OPEN-FLG9 = "1"
           THEN
      *----------  カーソル CLOSE
               EXEC SQL
                   CLOSE CR09
               END-EXEC
               IF  SQLCODE         = CNS-SQL-NORMAL
               THEN
                   MOVE  "0"           TO  WK-CR-OPEN-FLG9
               END-IF
           END-IF
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CR-OPEN-FLG1 =["WK-CR-OPEN-FLG1"]"
      D    DISPLAY  "WK-CR-OPEN-FLG3 =["WK-CR-OPEN-FLG3"]"
      D    DISPLAY  "WK-CR-OPEN-FLG4 =["WK-CR-OPEN-FLG4"]"
      D    DISPLAY  "WK-CR-OPEN-FLG5 =["WK-CR-OPEN-FLG5"]"
      D    DISPLAY  "WK-CR-OPEN-FLG6 =["WK-CR-OPEN-FLG6"]"
      D    DISPLAY  "WK-CR-OPEN-FLG8 =["WK-CR-OPEN-FLG8"]"
      D    DISPLAY  "WK-CR-OPEN-FLG9 =["WK-CR-OPEN-FLG9"]"
      D    DISPLAY  "リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           MOVE  CNS-PGM-ID
             TO  ERR-PGM-ID                  OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "エラー検知プログラム名="
      D                              ERR-PGM-ID  OF  PARM-SCZY1170-ARG1
      D    DISPLAY  "ポジション       ="ERR-POS  OF  PARM-SCZY1170-ARG1
      D    DISPLAY  "リターンコード   ="RTN-CD   OF  PARM-SCZY1170-ARG1
      D    DISPLAY  "詳細リターンコード="
      D                         DETAIL-RTN-CD    OF  PARM-SCZY1170-ARG1
      D    DISPLAY "詳細リターンコードフラグ=["DETAIL-RTN-CD-FLG
      D                                 OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY "フリーメッセージ=["FREE-MSG OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-INOUT
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-ARG2     TO  PARM-SCZY1150-ARG5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  "PARM-SCZY1150-RTNPKG=["PARM-SCZY1150-ARG5"]"
      D    DISPLAY  "***  ERR-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
