      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ1610
      * プログラム名称 : 開始時残高計算
      * 処理概要       : 銘柄別断面情報より、開始時残高情報を作成する
      * 参照ＤＢ       : 残高履歴     (TKMZZR00)
      *                : 残高異動     (TKMZZI00)
      *                : 資金残履歴   (TKMZSR00)
      *                : 資金簿価異動 (TKMZSI00)
      *                : 元本残高     (TKMZGZ00)
      *                : 前払金管理   (TKMZMB00)
      * 更新ＤＢ       : 前払金管理計算データテーブル(TKMZBW10)
      * 引数           : IN      基準日断面情報のコピー句
      *                : IN      銘柄別断面情報のコピー句
      *                : OUT     残高履歴のコピー句
      *                : OUT     残高異動のコピー句
      *                : OUT     資金残履歴のコピー句
      *                : OUT     資金簿価異動のコピー句
      *                : OUT     元本残高のコピー句
      *                : OUT     RTNパッケージ
      * VERSION  1.01
      * 改訂履歴
      * 年月日        区分     所属    担当      内容
      * ------------  ----    ------  -------  -------------
      * 20080123      新規     SCS     楊超     新規作成
      * 20080225      修正     SCS     楊超     テーマMZ-003対応
      * 20081010      修正     SCS     楊超
      * 20090106      修正     SCS     徐曉俊   連結障害0001074
      * 20090415      修正     SCS     顧建鋒   ①総合障害259
      * 20090717      修正     SCS     顧建鋒   総合障害1412
      * 20090721      修正     SCS     顧建鋒   総合障害1412-02
      * 20090812      修正     SCS     顧建鋒   連結障害2005
      * 20090820      修正     SCS     顧建鋒   総合障害1595
      * 20090820      修正     SCS     顧建鋒   テーマ1307
      * 20091027      修正     SCS     顧建鋒   テーマ1770
      * 20091116      修正     SCS     王飛     テーマ1841
      * 20100112      修正     SCS     王飛     テーマ2085
      * @SEINO@@      修正     BTH     山崎     性能改善対応
      * 20110420      修正     SCS     シャ建   性能改善対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ1610.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-01-23.
       DATE-COMPILED.
      ******************************************************************
      *
      *        環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *        デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *         コンスタント  エリア
      ******************************************************************
      *----------  共通コンスタント定義の宣言
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY  "MZCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ1610".
      *----------  残高履歴
         05  CNS-TBL-TKMZZR00      PIC  X(08)  VALUE  "TKMZZR00".
      *----------  残高異動
         05  CNS-TBL-TKMZZI00      PIC  X(08)  VALUE  "TKMZZI00".
      *----------  資金残履歴
         05  CNS-TBL-TKMZSR00      PIC  X(08)  VALUE  "TKMZSR00".
      *----------  資金簿価異動
         05  CNS-TBL-TKMZSI00      PIC  X(08)  VALUE  "TKMZSI00".
      *----------  元本残高
         05  CNS-TBL-TKMZGZ00      PIC  X(08)  VALUE  "TKMZGZ00".
      *----------  前払金管理
         05  CNS-TBL-TKMZMB00      PIC  X(08)  VALUE  "TKMZMB00".
      *----------  前払金管理計算データ
         05  CNS-TBL-TKMZBW10      PIC  X(08)  VALUE  "TKMZBW10".
      *----------  銘柄種類
         05  CNS-MEG-CD-SHRU-1     PIC  X(01)  VALUE  "1".
         05  CNS-MEG-CD-SHRU-2     PIC  X(01)  VALUE  "2".
         05  CNS-MEG-CD-SHRU-3     PIC  X(01)  VALUE  "3".
         05  CNS-C0                PIC  X(01)  VALUE  "0".
         05  CNS-C1                PIC  X(01)  VALUE  "1".
         05  CNS-C2                PIC  X(01)  VALUE  "2".
         05  CNS-C6                PIC  X(01)  VALUE  "6".
         05  CNS-1                 PIC  9(01)  VALUE  1.
      *----------  再計算区分:'2'(コピー)
         05  CNS-SAI-CALC-KBN-2    PIC  X(01)  VALUE  "2".
      *----------  銘柄種類２:債券
         05  CNS-MEG-CD-SHRU2-2    PIC  X(01)  VALUE  "2".
      *---------- 差分更新モード取得ルート区分1:残高
         05  CNS-SABUN-UPD-GET-KBN-1
                                   PIC  9(01)  VALUE  1.
      *---------- コピー元データ区分
         05  CNS-CPY-MOTO-DATA-KBN-1
                                   PIC  9(01)  VALUE  1.
      *---------- 判定対象区分
         05  CNS-HANTEI-TARGET-KBN-A
                                   PIC  X(01)  VALUE  "a".
      *---------- SQL(1-3・1-5)用
         05  CNS-LES-EQU           PIC  X(02)  VALUE  "<=".
         05  CNS-EQUAL             PIC  X(02)  VALUE  "< ".
         05  CNS-LES-EQU3          PIC  X(22)  VALUE
                                               " <= :P_KEIJOU_KIJUNBI ".
         05  CNS-EQUAL3            PIC  X(21)  VALUE
                                               " < :P_KEIJOU_KIJUNBI ".
         05  CNS-LES-EQU5          PIC  X(15)  VALUE
                                               " <= :P_IDO_YMD ".
         05  CNS-EQUAL5            PIC  X(14)  VALUE
                                               " < :P_IDO_YMD ".
      *
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-RTN-113           PIC  X(03)  VALUE  "113".
         05  CNS-UKE-YMD           PIC  X(07)  VALUE  "UKE_YMD".
         05  CNS-KEIJOU-KIJUNBI    PIC  X(14)  VALUE  "KEIJOU_KIJUNBI".
      ******************************************************************
      *                フラグ  エリア
      ******************************************************************
      *01  FLG-AREA.                                                    @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *         フラグエリア２(PREPARE,DECLAREスキップ判定用)           @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FLG-AREA2.                                                   @3212SEINO@@
      *----------  残高履歴カーソルオープンフラグ                       @3212SEINO@@
         05  FLG-TKMZZR00-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  残高異動カーソルオープンフラグA                      @3212SEINO@@
         05  FLG-TKMZZI00-CRA-OPEN  PIC  9(01).                         @3212SEINO@@
      *----------  残高異動カーソルオープンフラグB                      @3212SEINO@@
         05  FLG-TKMZZI00-CRB-OPEN  PIC  9(01).                         @3212SEINO@@
      *----------  資金残履歴カーソルオープンフラグ                     @3212SEINO@@
         05  FLG-TKMZSR00-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  資金簿価異動カーソルオープンフラグ                   @3212SEINO@@
         05  FLG-TKMZSI00-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  元本残高カーソルオープンフラグ                       @3212SEINO@@
         05  FLG-TKMZGZ00-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  直近残高異動カーソルオープンフラグA                  @3212SEINO@@
         05  FLG-TKMZZI00-CR9A-OPEN PIC  9(01).                         @3212SEINO@@
      *----------  直近残高異動カーソルオープンフラグB                  @3212SEINO@@
         05  FLG-TKMZZI00-CR9B-OPEN PIC  9(01).                         @3212SEINO@@
      *----------  前払金管理カーソルオープンフラグ                     @3212SEINO@@
         05  FLG-TKMZBW10-S2-INSERT                                     @SEINO@@
                                   PIC  9(01).                          @SEINO@@
      *----------  前払金管理カーソルオープンフラグ２                   @3212SEINO@@
         05  FLG-TKMZBW10-S4-INSERT                                     @SEINO@@
                                   PIC  9(01).                          @SEINO@@
      ******************************************************************@3212SEINO@@
      *                複数回起動チェック用スイッチ                     @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FIRST-SW                PIC  X(03)  VALUE  'YES'.            @SEINO@@
      ******************************************************************
      *                ワ－ク  エリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      *----------  ワ－クテーブル残高履歴
         05  WK-TBL-TKMZZR00       PIC  X(13).
      *----------  ワ－クテーブル残高異動
         05  WK-TBL-TKMZZI00       PIC  X(13).
      *----------  ワ－クテーブル資金残履歴
         05  WK-TBL-TKMZSR00       PIC  X(13).
      *----------  ワ－クテーブル資金簿価異動
         05  WK-TBL-TKMZSI00       PIC  X(13).
      *----------  ワ－クテーブル元本残高
         05  WK-TBL-TKMZGZ00       PIC  X(13).
      *----------  ワ－クテーブル前払金管理
         05  WK-TBL-TKMZMB00       PIC  X(13).
      *----------  ワ－クテーブル前払金管理計算データ
         05  WK-TBL-TKMZBW10       PIC  X(13).
      *---------- 銘柄別断面情報.処理実行日
         05  WK-SYORI-YMD          PIC  S9(08).
      *---------- 銘柄別断面情報.起動ID
         05  WK-KIDOU-ID           PIC  X(04).
      *---------- 銘柄別断面情報.利用会社コード
         05  WK-RIYO-CMP-CD        PIC  X(04).
      *---------- 銘柄別断面情報.ファンドコード
         05  WK-FUND-CD            PIC  X(12).
      *---------- 銘柄別断面情報.ポートフォリオコード
         05  WK-PTF-CD             PIC  X(04).
      *---------- 銘柄別断面情報.開始基準日
         05  WK-KAISI-KJN-YMD      PIC  S9(08).
      *---------- 銘柄別断面情報.基準日
         05  WK-KJN-YMD            PIC  S9(08).
      *---------- 銘柄別断面情報.銘柄コード
         05  WK-MEG-CD             PIC  X(15).
      *---------- 銘柄別断面情報.証券種別コード
         05  WK-SEC-SBT-CD         PIC  X(04).
      *---------- 銘柄別断面情報.資産負債・買建売建フラグ
         05  WK-TATE-FLG           PIC  X(01).
      *---------- 銘柄別断面情報.玉ID
         05  WK-GYOKU-ID           PIC  X(10).
      *---------- 銘柄別断面情報.差分更新From日
         05  WK-SABON-UPDATE-FROM  PIC  S9(08).
      *---------- 銘柄別断面情報.銘柄種類
         05  WK-MEG-CD-SHRU        PIC  X(01).
      *---------- 銘柄別断面情報.再計算区分
         05  WK-SAI-CALC-KBN       PIC  X(01).
      *---------- 銘柄別断面情報.銘柄種類２
         05  WK-MEG-CD-SHRU2       PIC  X(01).
      *---------- 約定ベース受渡順フラグ
         05  WK-YKJ-UKE-JUN-FLG    PIC  X(01).
      *---------- ワークリターンコード
         05  WK-RTN-CD             PIC  X(03).
      *---------- ワーク売り続く証券区別区分
         05  WK-BUY-SEC-SBT-KBN    PIC  X(01).
      *---------- ワーク売買フラグ
         05  WK-URIKAI-FLG         PIC  X(01).
      *---------- ワーク売り続く中間
         05  WK-CHUKAN-CHI.
      *---------- 取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *---------- 市場通貨払出単価
           10  WK-SJTK-H-TNK       PIC  S9(08)V9(10).
      *---------- 運用通貨払出単価
           10  WK-UYTK-H-TNK       PIC  S9(08)V9(10).
      *---------- 【SMZJ4012】取引事由判定に接続用
         05  WK-SMZJ4012-TORI-JIYU PIC  X(04).
      ******************************************************************
      *                ORACLE ホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN    DECLARE  SECTION  END-EXEC.
       01  HST-AREA.
      *---------- 残高履歴 (別紙1-2)
         05  H-TKMZZR00.
           EXEC  SQL INCLUDE  "TKMZZR00.cpy"  END-EXEC.
      *---------- 残高履歴 条件(別紙1-2)
         05  H-TKMZZR00-S.
           10  H-RIYO-CMP-CD       PIC  X(04).
           10  H-FUND-CD           PIC  X(12).
           10  H-PTF-CD            PIC  X(04).
           10  H-SEC-SBT-CD        PIC  X(04).
           10  H-MEG-CD            PIC  X(15).
           10  H-TATE-FLG          PIC  X(01).
           10  H-GYOKU-ID          PIC  X(10).
           10  H-KJN-YMD           PIC  S9(08).
      *---------- 残高異動 (別紙1-3)
         05  H-TKMZZI00.
           EXEC  SQL INCLUDE  "TKMZZI00.cpy"  END-EXEC.
      *---------- 残高異動 条件(別紙1-3)
         05  H-TKMZZI00-S.
           10  H-RIYO-CMP-CD       PIC  X(04).
           10  H-FUND-CD           PIC  X(12).
           10  H-PTF-CD            PIC  X(04).
           10  H-SEC-SBT-CD        PIC  X(04).
           10  H-MEG-CD            PIC  X(15).
           10  H-TATE-FLG          PIC  X(01).
           10  H-GYOKU-ID          PIC  X(10).
           10  H-KEIJOU-KIJUNBI-MIN
                                   PIC  S9(08).
           10  H-KEIJOU-KIJUNBI    PIC  S9(08).
      *---------- 資金残履歴 (別紙1-4)
         05  H-TKMZSR00.
           EXEC  SQL INCLUDE  "TKMZSR00.cpy"  END-EXEC.
      *---------- 資金残履歴 条件(別紙1-4)
         05  H-TKMZSR00-S.
           10  H-RIYO-CMP-CD       PIC  X(04).
           10  H-FUND-CD           PIC  X(12).
           10  H-PTF-CD            PIC  X(04).
           10  H-KS-KOZA-NO        PIC  X(15).
           10  H-KJN-YMD           PIC  S9(08).
      *---------- 資金簿価異動 (別紙1-5)
         05  H-TKMZSI00.
           EXEC  SQL INCLUDE  "TKMZSI00.cpy"  END-EXEC.
      *---------- 資金簿価異動 条件(別紙1-5)
         05  H-TKMZSI00-S.
           10  H-RIYO-CMP-CD       PIC  X(04).
           10  H-FUND-CD           PIC  X(12).
           10  H-PTF-CD            PIC  X(04).
           10  H-KS-KOZA-NO        PIC  X(15).
           10  H-IDO-YMD-MIN       PIC  S9(08).
           10  H-IDO-YMD           PIC  S9(08).
      *---------- 元本残高 (別紙1-6)
         05  H-TKMZGZ00.
           EXEC  SQL INCLUDE  "TKMZGZ00.cpy"  END-EXEC.
      *---------- 元本残高 条件(別紙1-6)
         05  H-TKMZGZ00-S.
           10  H-RIYO-CMP-CD       PIC  X(04).
           10  H-FUND-CD           PIC  X(12).
           10  H-PTF-CD            PIC  X(04).
           10  H-KJN-YMD           PIC  S9(08).
      *---------- 前払金管理 (別紙1-7)
         05  H-TKMZMB00-S7.
           10  H-RIYO-CMP-CD       PIC  X(04).
           10  H-FUND-CD           PIC  X(12).
           10  H-PTF-CD            PIC  X(04).
           10  H-SEC-SBT-CD        PIC  X(04).
           10  H-MEG-CD            PIC  X(15).
           10  H-TATE-FLG          PIC  X(01).
           10  H-GYOKU-ID          PIC  X(10).
           10  H-KAISI-KJN-YMD     PIC  S9(08).
      *---------- 前払金管理 (別紙1-8)
         05  H-TKMZMB00-S8.
           10  H-RIYO-CMP-CD       PIC  X(04).
           10  H-FUND-CD           PIC  X(12).
           10  H-PTF-CD            PIC  X(04).
           10  H-SEC-SBT-CD        PIC  X(04).
           10  H-MEG-CD            PIC  X(15).
           10  H-TATE-FLG          PIC  X(01).
           10  H-GYOKU-ID          PIC  X(10).
           10  H-KEIJOU-KIJUNBI    PIC  S9(08).
      *---------- 残高異動 (別紙1-9)
         05  H-TKMZZI00-9.
           10  H-TORI-JIYU         PIC  X(04).
           10  H-SJTK-H-TNK        PIC  S9(08)V9(10).
           10  H-UYTK-H-TNK        PIC  S9(08)V9(10).
         05  H-TKMZZI00-S9.
           10  H-RIYO-CMP-CD       PIC  X(04).
           10  H-FUND-CD           PIC  X(12).
           10  H-PTF-CD            PIC  X(04).
           10  H-SEC-SBT-CD        PIC  X(04).
           10  H-MEG-CD            PIC  X(15).
           10  H-TATE-FLG          PIC  X(01).
           10  H-GYOKU-ID          PIC  X(10).
           10  H-KAISI-KJN-YMD     PIC  S9(08).
           10  H-SABON-UPDATE-FROM PIC  S9(08).
           10  H-TORI-ID           PIC  S9(10).
      *---------- 動的SQL文をいれるバッファ
      *  05  SQLSTMT               PIC  X(7000).                        @SEINO@@
      *  05  SQLSTMT1              PIC  X(2500).                        @SEINO@@
         05  SQLSTMT1              PIC  X(1500).                        @3212SEINO@@
         05  SQLSTMT2              PIC  X(1400).                        @3212SEINO@@
         05  SQLSTMT3A             PIC  X(6300).                        @3212SEINO@@
         05  SQLSTMT3B             PIC  X(6300).                        @3212SEINO@@
         05  SQLSTMT4              PIC  X(1400).                        @3212SEINO@@
         05  SQLSTMT5              PIC  X(700).                         @3212SEINO@@
         05  SQLSTMT6              PIC  X(900).                         @3212SEINO@@
         05  SQLSTMT7              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT9A             PIC  X(600).                         @3212SEINO@@
         05  SQLSTMT9B             PIC  X(600).                         @3212SEINO@@
           EXEC  SQL  END  DECLARE      SECTION      END-EXEC.
      ******************************************************************
      *        SQL  エリア
      ******************************************************************
       01  SQL-AREA.
         05  SQL-SELECT-1-2.
      *----------  残高履歴
           10  SQL-SELECT.
      *----------  SELECT
             15  FILLER            PIC  X(07)  VALUE  "SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  基準日
             15  FILLER            PIC  X(09)  VALUE  "KJN_YMD, ".
      *----------  決算日断面区分
             15  FILLER            PIC  X(17)
                 VALUE  "KSN_YMD_DMN_KBN, ".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  数量残高
             15  FILLER            PIC  X(07)  VALUE  "SRYZN, ".
      *----------  市場通貨簿価残高
             15  FILLER            PIC  X(13)  VALUE  "SJTK_BOKAZN, ".
      *----------  運用通貨簿価残高
             15  FILLER            PIC  X(13)  VALUE  "UYTK_BOKAZN, ".
      *----------  市場通貨簿価単価
             15  FILLER            PIC  X(15)  VALUE  "SJTK_BOKA_TNK, ".
      *----------  運用通貨簿価単価
             15  FILLER            PIC  X(15)  VALUE  "UYTK_BOKA_TNK, ".
      *----------  簿価為替レート
             15  FILLER            PIC  X(10)  VALUE  "BOKA_KWS, ".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "SJTK_PPAYZN, ".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "UYTK_PPAYZN, ".
      *----------  市場通貨前受金残高
             15  FILLER            PIC  X(13)  VALUE  "SJTK_ARECZN, ".
      *----------  運用通貨前受金残高
             15  FILLER            PIC  X(13)  VALUE  "UYTK_ARECZN, ".
      *----------  市場通貨仮払金残高
             15  FILLER            PIC  X(13)  VALUE  "SJTK_SPAYZN, ".
      *----------  運用通貨仮払金残高
             15  FILLER            PIC  X(13)  VALUE  "UYTK_SPAYZN, ".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(12)  VALUE  "SJTK_H_TNK, ".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(12)  VALUE  "UYTK_H_TNK, ".
      *----------  同一コスト継続フラグ
             15  FILLER            PIC  X(19)
                 VALUE  "SAME_COST_KZK_FLG, ".
      *----------  市場通貨経過利息
             15  FILLER            PIC  X(15)  VALUE  "SJTK_KEKA_RSK, ".
      *----------  運用通貨経過利息
             15  FILLER            PIC  X(15)  VALUE  "UYTK_KEKA_RSK, ".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(15)  VALUE  "SJTK_MS_SHEKI, ".
      *----------  運用通貨未収収益
             15  FILLER            PIC  X(15)  VALUE  "UYTK_MS_SHEKI, ".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_GENSEN_TAX, ".
      *----------  運用通貨源泉税
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_GENSEN_TAX, ".
      *----------  評価為替レート
             15  FILLER            PIC  X(09)  VALUE  "HYK_KWS, ".
      *----------  源泉税評価為替レート
             15  FILLER            PIC  X(18)
                 VALUE  "GENS_TAX_HYK_KWS, ".
      *----------  ファクター・連動係数
             15  FILLER            PIC  X(20)
                 VALUE  "FACTOR_RENDOU_KESU, ".
      *----------   市場通貨未収収益計上・戻入額
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_MSSE_KJMIG, ".
      *----------  運用通貨未収収益計上・戻入額
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_MSSE_KJMIG, ".
      *----------  数量残高（利付）
             15  FILLER            PIC  X(11)  VALUE  "SRYZN_RIT, ".
      *----------  建玉単価
             15  FILLER            PIC  X(12)  VALUE  "TGYOKU_TNK, ".
      *----------  建玉為替レート
             15  FILLER            PIC  X(17)
                 VALUE  "TGYOKU_KWS_RATE, ".
      *----------  建玉ブローカー
             15  FILLER            PIC  X(12)
                 VALUE  "TGYOKU_BRK, ".
      *----------  建玉約定日
             15  FILLER            PIC  X(16)
                 VALUE  "TGYOKU_YKJ_YMD, ".
      *----------  市場通貨建玉約定金額残
             15  FILLER            PIC  X(16)
                 VALUE  "SJTK_TG_YJKNZN, ".
      *----------  運用通貨建玉約定金額残
             15  FILLER            PIC  X(16)
                 VALUE  "UYTK_TG_YJKNZN, ".
      *----------  市場通貨建玉手数料残
             15  FILLER            PIC  X(15)  VALUE  "SJTK_TG_TSRZN, ".
      *----------  運用通貨建玉手数料残
             15  FILLER            PIC  X(15)  VALUE  "UYTK_TG_TSRZN, ".
      *----------  市場通貨建玉消費税残
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_TG_S_TAXZN, ".
      *----------  運用通貨建玉消費税残
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_TG_S_TAXZN, ".
      *----------  市場通貨建玉その他費用残
             15  FILLER            PIC  X(20)
                 VALUE  "SJTK_TG_ELS_HIYOZN, ".
      *----------  運用通貨建玉その他費用残
             15  FILLER            PIC  X(20)
                 VALUE  "UYTK_TG_ELS_HIYOZN, ".
      *----------  市場通貨建玉精算金額残
             15  FILLER            PIC  X(16)
                 VALUE  "SJTK_TG_SSKGZN, ".
      *----------  運用通貨建玉精算金額残
             15  FILLER            PIC  X(16)
                 VALUE  "UYTK_TG_SSKGZN, ".
      *----------  ＯＰ資産負債・買建売建フラグ
             15  FILLER            PIC  X(13)  VALUE  "OP_TATE_FLG, ".
      *----------  市場通貨源泉税還付予定額残高
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_GSZKP_YTZN, ".
      *----------  運用通貨源泉税還付予定額残高
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_GSZKP_YTZN, ".
      *----------  決済通貨源泉税還付予定額残高
             15  FILLER            PIC  X(17)
                 VALUE  "KSTK_GSZKP_YTZN, ".
      *----------  市場通貨ノンカバー未収金残高
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_NOCV_MSKZN, ".
      *----------  運用通貨ノンカバー未収金残高
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_NOCV_MSKZN, ".
      *----------  市場通貨ノンカバー未払金残高
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_NOCV_MBKZN, ".
      *----------  運用通貨ノンカバー未払金残高
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_NOCV_MBKZN, ".
      *----------  短期スタート・エンド経過利息
             15  FILLER            PIC  X(21)
                 VALUE  "SHORT_STEN_KEKA_RSK, ".
      *----------  短期スタート日
             15  FILLER            PIC  X(17)
                 VALUE  "SHORT_START_YMD, ".
      *----------  短期エンド日
             15  FILLER            PIC  X(15)  VALUE  "SHORT_END_YMD, ".
      *----------  基本会計ベースフラグ
             15  FILLER            PIC  X(20)
                 VALUE  "KH_KAIKEI_BASE_FLG, ".
      *----------  投資対象国コード
             15  FILLER            PIC  X(10)  VALUE  "TSTSK_CD, ".
      *----------  発行国コード
             15  FILLER            PIC  X(09)  VALUE  "HAKO_CD, ".
      *----------  数量単位
             15  FILLER            PIC  X(12)  VALUE  "SURYO_TANI, ".
      *----------  市場通貨未払費用残
             15  FILLER            PIC  X(13)  VALUE  "SJTK_MBHYZN, ".
      *----------  運用通貨未払費用残
             15  FILLER            PIC  X(13)  VALUE  "UYTK_MBHYZN, ".
      *----------  市場通貨未払消費税残
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_MB_S_TAXZN, ".
      *----------  運用通貨未払消費税残
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_MB_S_TAXZN, ".
      *----------  市場通貨移管評価損益残
             15  FILLER            PIC  X(16)
                 VALUE  "SJTK_IK_HKSEZN, ".
      *----------  運用通貨移管評価損益残
             15  FILLER            PIC  X(16)
                 VALUE  "UYTK_IK_HKSEZN, ".
      *----------  市場通貨移管未収収益
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_IK_MSSHEKI, ".
      *----------  運用通貨移管未収収益
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_IK_MSSHEKI, ".
      *----------  運用通貨移管前払金評価損益残
             15  FILLER            PIC  X(16)
                 VALUE  "UYTK_IK_PPHKZN, ".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_PGMID".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-TKMZZR00  PIC  X(13).
      *----------  WHERE
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)
                 VALUE  "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)
                 VALUE  "AND FUND_CD = :P_FUND_CD ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)
                 VALUE  "AND PTF_CD = :P_PTF_CD ".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)
                 VALUE  "AND SEC_SBT_CD = :P_SEC_SBT_CD ".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)
                 VALUE  "AND MEG_CD = :P_MEG_CD ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)
                 VALUE  "AND TATE_FLG = :P_TATE_FLG ".
      *----------  玉ID
             15  FILLER            PIC  X(27)
                 VALUE  "AND GYOKU_ID = :P_GYOKU_ID ".
      *----------  基準日
             15  FILLER            PIC  X(25)
                 VALUE  "AND KJN_YMD = :P_KJN_YMD ".
      *----------  決算日断面区分
             15  FILLER            PIC  X(31)
                 VALUE  "AND KSN_YMD_DMN_KBN IN('0','2')".
      *-----------------------------------------------------------------
      *----------  残高異動
         05  SQL-SELECT-1-3.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  全項目1
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  原取引ID
           10  FILLER              PIC  X(09)  VALUE  "TORI_ID, ".
      *----------  計上基準日
           10  FILLER              PIC  X(16)
                 VALUE  "KEIJOU_KIJUNBI, ".
      *----------  赤黒区分
           10  FILLER              PIC  X(09)  VALUE  "AKA_KBN, ".
      *----------  誤計上№
           10  FILLER              PIC  X(12)  VALUE  "ERR_KJY_NO, ".
      *----------  誤計上区分
           10  FILLER              PIC  X(13)  VALUE  "ERR_KJY_KBN, ".
      *----------  取引連関ID
           10  FILLER              PIC  X(09)  VALUE  "THRK_ID, ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  取引内容
           10  FILLER              PIC  X(11)  VALUE  "TORI_NAIY, ".
      *----------  取引事由
           10  FILLER              PIC  X(11)  VALUE  "TORI_JIYU, ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  約定日
           10  FILLER              PIC  X(09)  VALUE  "YKJ_YMD, ".
      *----------  受渡日
           10  FILLER              PIC  X(09)  VALUE  "UKE_YMD, ".
      *----------  市場通貨異動簿価
           10  FILLER              PIC  X(15)  VALUE  "SJTK_IDO_BOKA, ".
      *----------  運用通貨異動簿価
           10  FILLER              PIC  X(15)  VALUE  "UYTK_IDO_BOKA, ".
      *----------  市場通貨簿価単価
           10  FILLER              PIC  X(15)  VALUE  "SJTK_BOKA_TNK, ".
      *----------  運用通貨簿価単価
           10  FILLER              PIC  X(15)  VALUE  "UYTK_BOKA_TNK, ".
      *----------  簿価為替レート
           10  FILLER              PIC  X(10)  VALUE  "BOKA_KWS, ".
      *----------  市場通貨払出簿価
           10  FILLER              PIC  X(13)  VALUE  "SJTK_H_BOKA, ".
      *----------  運用通貨払出簿価
           10  FILLER              PIC  X(13)  VALUE  "UYTK_H_BOKA, ".
      *----------  市場通貨払出単価
           10  FILLER              PIC  X(12)  VALUE  "SJTK_H_TNK, ".
      *----------  運用通貨払出単価
           10  FILLER              PIC  X(12)  VALUE  "UYTK_H_TNK, ".
      *----------  異動数量
           10  FILLER              PIC  X(11)  VALUE  "IDO_SURYO, ".
      *----------  異動数量（利付）
           10  FILLER              PIC  X(15)  VALUE  "IDO_SURYO_RIT, ".
      *----------  市場通貨異動後簿価残高
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_BOKAZN, ".
      *----------  運用通貨異動後簿価残高
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_BOKAZN, ".
      *----------  異動後数量残高
           10  FILLER              PIC  X(12)  VALUE  "IDOG_SRYZN, ".
      *----------  異動後数量残高（利付）
           10  FILLER              PIC  X(16)
                 VALUE  "IDOG_SRYZN_RIT, ".
      *----------  市場通貨前払金異動額
           10  FILLER              PIC  X(15)  VALUE  "SJTK_PPAYIDOG, ".
      *----------  運用通貨前払金異動額
           10  FILLER              PIC  X(15)  VALUE  "UYTK_PPAYIDOG, ".
      *----------  市場通貨異動後前払金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_PPAYZN, ".
      *----------  運用通貨異動後前払金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_PPAYZN, ".
      *----------  市場通貨異動後前受金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_ARECZN, ".
      *----------  運用通貨異動後前受金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_ARECZN, ".
      *----------  市場通貨異動後仮払金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_SPAYZN, ".
      *----------  運用通貨異動後仮払金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_SPAYZN, ".
      *----------  市場通貨売買損益
           10  FILLER              PIC  X(14)  VALUE  "SJTK_BBSNEKI, ".
      *----------  運用通貨売買損益
           10  FILLER              PIC  X(14)  VALUE  "UYTK_BBSNEKI, ".
      *----------  為替差損益
           10  FILLER              PIC  X(16)
                 VALUE  "UYTK_KWS_SNEKI, ".
      *----------  為替差損益（利金）
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_KWS_SNEKI_RK, ".
      *----------  為替差損益（市場）
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_KWS_SNEKI_SJ, ".
      *----------  市場通貨手数料
           10  FILLER              PIC  X(10)  VALUE  "SJTK_TSR, ".
      *----------  運用通貨手数料
           10  FILLER              PIC  X(10)  VALUE  "UYTK_TSR, ".
      *----------  市場通貨消費税
           10  FILLER              PIC  X(12)  VALUE  "SJTK_S_TAX, ".
      *----------  運用通貨消費税
           10  FILLER              PIC  X(12)  VALUE  "UYTK_S_TAX, ".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(17)
                 VALUE  "SJTK_GENSEN_TAX, ".
      *----------  運用通貨源泉税
           10  FILLER              PIC  X(17)
                 VALUE  "UYTK_GENSEN_TAX, ".
      *----------  市場通貨その他損益
           10  FILLER              PIC  X(16)
                 VALUE  "SJTK_ELS_SNEKI, ".
      *----------  運用通貨その他損益
           10  FILLER              PIC  X(16)
                 VALUE  "UYTK_ELS_SNEKI, ".
      *----------  市場通貨利金等損益勘定
           10  FILLER              PIC  X(13)  VALUE  "SJTK_RKSEKJ, ".
      *----------  運用通貨利金等損益勘定
           10  FILLER              PIC  X(13)  VALUE  "UYTK_RKSEKJ, ".
      *----------  異動計上順序
           10  FILLER              PIC  X(13)  VALUE  "IDO_KJY_JUN, ".
      *----------  建玉単価
           10  FILLER              PIC  X(12)  VALUE  "TGYOKU_TNK, ".
      *----------  建玉為替レート
           10  FILLER              PIC  X(17)
                 VALUE  "TGYOKU_KWS_RATE, ".
      *----------  建玉ブローカー
           10  FILLER              PIC  X(12)  VALUE  "TGYOKU_BRK, ".
      *----------  建玉約定日
           10  FILLER              PIC  X(16)
                 VALUE  "TGYOKU_YKJ_YMD, ".
      *----------  市場通貨異動後建玉約定金額残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_TG_YJKNZN, ".
      *----------  運用通貨異動後建玉約定金額残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_TG_YJKNZN, ".
      *----------  市場通貨建玉手数料
           10  FILLER              PIC  X(13)  VALUE  "SJTK_TG_TSR, ".
      *----------  運用通貨建玉手数料
           10  FILLER              PIC  X(13)  VALUE  "UYTK_TG_TSR, ".
      *----------  市場通貨異動後建玉手数料残
           10  FILLER              PIC  X(20)
                 VALUE  "SJTK_IDOG_TG_TSRZN, ".
      *----------  運用通貨異動後建玉手数料残
           10  FILLER              PIC  X(20)
                 VALUE  "UYTK_IDOG_TG_TSRZN, ".
      *----------  市場通貨建玉消費税
           10  FILLER              PIC  X(15)  VALUE  "SJTK_TG_S_TAX, ".
      *----------  運用通貨建玉消費税
           10  FILLER              PIC  X(15)  VALUE  "UYTK_TG_S_TAX, ".
      *----------  市場通貨異動後建玉消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_TG_S_TAXZN, ".
      *----------  運用通貨異動後建玉消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_TG_S_TAXZN, ".
      *----------  市場通貨建玉その他費用
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_TG_ELS_HIYO, ".
      *----------  運用通貨建玉その他費用
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_TG_ELS_HIYO, ".
      *----------  市場通貨異動後建玉その他費用残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_TG_ELS_HZN, ".
      *----------  運用通貨異動後建玉その他費用残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_TG_ELS_HZN, ".
      *----------  市場通貨建玉精算金額
           10  FILLER              PIC  X(14)  VALUE  "SJTK_TG_SSKG, ".
      *----------  運用通貨建玉精算金額
           10  FILLER              PIC  X(14)  VALUE  "UYTK_TG_SSKG, ".
      *----------  市場通貨異動後建玉精算金額残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_TG_SSKGZN, ".
      *----------  運用通貨異動後建玉精算金額残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_TG_SSKGZN, ".
      *----------  市場通貨引継前受・前払プレミアム
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_HT_PPAR_PMM, ".
      *----------  運用通貨引継前受・前払プレミアム
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_HT_PPAR_PMM, ".
      *----------  ＯＰ資産負債・買建売建フラグ
           10  FILLER              PIC  X(13)  VALUE  "OP_TATE_FLG, ".
      *----------  市場通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "SJTK_GSZKP_YTIDOG, ".
      *----------  運用通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_GSZKP_YTIDOG, ".
      *----------  決済通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "KSTK_GSZKP_YTIDOG, ".
      *----------  市場通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_GSZKP_YTZN, ".
      *----------  運用通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_GSZKP_YTZN, ".
      *----------  決済通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "KSTK_IDOG_GSZKP_YTZN, ".
      *----------  市場通貨異動後ノンカバー未収金残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_NOCV_MSKZN, ".
      *----------  運用通貨異動後ノンカバー未収金残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_NOCV_MSKZN, ".
      *----------  市場通貨異動後ノンカバー未払金残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_NOCV_MBKZN, ".
      *----------  運用通貨異動後ノンカバー未払金残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_NOCV_MBKZN, ".
      *----------  短期スタート・エンド経過利息
           10  FILLER              PIC  X(21)
                 VALUE  "SHORT_STEN_KEKA_RSK, ".
      *----------  短期スタート日
           10  FILLER              PIC  X(17)
                 VALUE  "SHORT_START_YMD, ".
      *----------  短期エンド日
           10  FILLER              PIC  X(15)  VALUE  "SHORT_END_YMD, ".
      *----------  投資対象国コード
           10  FILLER              PIC  X(10)  VALUE  "TSTSK_CD, ".
      *----------  発行国コード
           10  FILLER              PIC  X(09)  VALUE  "HAKO_CD, ".
      *----------  数量単位
           10  FILLER              PIC  X(12)  VALUE  "SURYO_TANI, ".
      *----------  市場通貨異動後未払費用残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_MBHYZN, ".
      *----------  運用通貨異動後未払費用残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_MBHYZN, ".
      *----------  市場通貨異動後未払消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_MB_S_TAXZN, ".
      *----------  運用通貨異動後未払消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_MB_S_TAXZN, ".
      *----------  市場通貨異動後移管評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_IK_HKSEZN, ".
      *----------  運用通貨異動後移管評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_IK_HKSEZN, ".
      *----------  市場通貨異動後移管未収収益
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_IK_MSSHEKI, ".
      *----------  運用通貨異動後移管未収収益
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_IK_MSSHEKI, ".
      *----------  運用通貨異動後移管前払金評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_IK_PPHKZN, ".
      *----------  削除区分
           10  FILLER              PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  作成フラグ
           10  FILLER              PIC  X(08)  VALUE  "SK_FLG, ".
      *----------  作成日時
           10  FILLER              PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
           10  FILLER              PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
           10  FILLER              PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
           10  FILLER              PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新フラグ
           10  FILLER              PIC  X(09)  VALUE  "UPD_FLG, ".
      *----------  更新日時
           10  FILLER              PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(09)  VALUE  "UPD_PGMID".
           10  FILLER              PIC  X(07)  VALUE  " FROM (".
      *----------  Layer01-2/2S
           10  FILLER              PIC  X(08)  VALUE  " SELECT ".
      *----------  全項目2
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  原取引ID
           10  FILLER              PIC  X(09)  VALUE  "TORI_ID, ".
      *----------  計上基準日
           10  FILLER              PIC  X(22)
                 VALUE  "T_AAA.KEIJOU_KIJUNBI, ".
      *----------  赤黒区分
           10  FILLER              PIC  X(09)  VALUE  "AKA_KBN, ".
      *----------  誤計上№
           10  FILLER              PIC  X(12)  VALUE  "ERR_KJY_NO, ".
      *----------  誤計上区分
           10  FILLER              PIC  X(13)  VALUE  "ERR_KJY_KBN, ".
      *----------  取引連関ID
           10  FILLER              PIC  X(09)  VALUE  "THRK_ID, ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  取引内容
           10  FILLER              PIC  X(11)  VALUE  "TORI_NAIY, ".
      *----------  取引事由
           10  FILLER              PIC  X(11)  VALUE  "TORI_JIYU, ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  約定日
           10  FILLER              PIC  X(09)  VALUE  "YKJ_YMD, ".
      *----------  受渡日
           10  FILLER              PIC  X(09)  VALUE  "UKE_YMD, ".
      *----------  市場通貨異動簿価
           10  FILLER              PIC  X(15)  VALUE  "SJTK_IDO_BOKA, ".
      *----------  運用通貨異動簿価
           10  FILLER              PIC  X(15)  VALUE  "UYTK_IDO_BOKA, ".
      *----------  市場通貨簿価単価
           10  FILLER              PIC  X(15)  VALUE  "SJTK_BOKA_TNK, ".
      *----------  運用通貨簿価単価
           10  FILLER              PIC  X(15)  VALUE  "UYTK_BOKA_TNK, ".
      *----------  簿価為替レート
           10  FILLER              PIC  X(10)  VALUE  "BOKA_KWS, ".
      *----------  市場通貨払出簿価
           10  FILLER              PIC  X(13)  VALUE  "SJTK_H_BOKA, ".
      *----------  運用通貨払出簿価
           10  FILLER              PIC  X(13)  VALUE  "UYTK_H_BOKA, ".
      *----------  市場通貨払出単価
           10  FILLER              PIC  X(12)  VALUE  "SJTK_H_TNK, ".
      *----------  運用通貨払出単価
           10  FILLER              PIC  X(12)  VALUE  "UYTK_H_TNK, ".
      *----------  異動数量
           10  FILLER              PIC  X(11)  VALUE  "IDO_SURYO, ".
      *----------  異動数量（利付）
           10  FILLER              PIC  X(15)  VALUE  "IDO_SURYO_RIT, ".
      *----------  市場通貨異動後簿価残高
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_BOKAZN, ".
      *----------  運用通貨異動後簿価残高
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_BOKAZN, ".
      *----------  異動後数量残高
           10  FILLER              PIC  X(12)  VALUE  "IDOG_SRYZN, ".
      *----------  異動後数量残高（利付）
           10  FILLER              PIC  X(16)
                 VALUE  "IDOG_SRYZN_RIT, ".
      *----------  市場通貨前払金異動額
           10  FILLER              PIC  X(15)  VALUE  "SJTK_PPAYIDOG, ".
      *----------  運用通貨前払金異動額
           10  FILLER              PIC  X(15)  VALUE  "UYTK_PPAYIDOG, ".
      *----------  市場通貨異動後前払金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_PPAYZN, ".
      *----------  運用通貨異動後前払金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_PPAYZN, ".
      *----------  市場通貨異動後前受金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_ARECZN, ".
      *----------  運用通貨異動後前受金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_ARECZN, ".
      *----------  市場通貨異動後仮払金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_SPAYZN, ".
      *----------  運用通貨異動後仮払金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_SPAYZN, ".
      *----------  市場通貨売買損益
           10  FILLER              PIC  X(14)  VALUE  "SJTK_BBSNEKI, ".
      *----------  運用通貨売買損益
           10  FILLER              PIC  X(14)  VALUE  "UYTK_BBSNEKI, ".
      *----------  為替差損益
           10  FILLER              PIC  X(16)
                 VALUE  "UYTK_KWS_SNEKI, ".
      *----------  為替差損益（利金）
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_KWS_SNEKI_RK, ".
      *----------  為替差損益（市場）
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_KWS_SNEKI_SJ, ".
      *----------  市場通貨手数料
           10  FILLER              PIC  X(10)  VALUE  "SJTK_TSR, ".
      *----------  運用通貨手数料
           10  FILLER              PIC  X(10)  VALUE  "UYTK_TSR, ".
      *----------  市場通貨消費税
           10  FILLER              PIC  X(12)  VALUE  "SJTK_S_TAX, ".
      *----------  運用通貨消費税
           10  FILLER              PIC  X(12)  VALUE  "UYTK_S_TAX, ".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(17)
                 VALUE  "SJTK_GENSEN_TAX, ".
      *----------  運用通貨源泉税
           10  FILLER              PIC  X(17)
                 VALUE  "UYTK_GENSEN_TAX, ".
      *----------  市場通貨その他損益
           10  FILLER              PIC  X(16)
                 VALUE  "SJTK_ELS_SNEKI, ".
      *----------  運用通貨その他損益
           10  FILLER              PIC  X(16)
                 VALUE  "UYTK_ELS_SNEKI, ".
      *----------  市場通貨利金等損益勘定
           10  FILLER              PIC  X(13)  VALUE  "SJTK_RKSEKJ, ".
      *----------  運用通貨利金等損益勘定
           10  FILLER              PIC  X(13)  VALUE  "UYTK_RKSEKJ, ".
      *----------  異動計上順序
           10  FILLER              PIC  X(13)  VALUE  "IDO_KJY_JUN, ".
      *----------  建玉単価
           10  FILLER              PIC  X(12)  VALUE  "TGYOKU_TNK, ".
      *----------  建玉為替レート
           10  FILLER              PIC  X(17)
                 VALUE  "TGYOKU_KWS_RATE, ".
      *----------  建玉ブローカー
           10  FILLER              PIC  X(12)  VALUE  "TGYOKU_BRK, ".
      *----------  建玉約定日
           10  FILLER              PIC  X(16)
                 VALUE  "TGYOKU_YKJ_YMD, ".
      *----------  市場通貨異動後建玉約定金額残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_TG_YJKNZN, ".
      *----------  運用通貨異動後建玉約定金額残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_TG_YJKNZN, ".
      *----------  市場通貨建玉手数料
           10  FILLER              PIC  X(13)  VALUE  "SJTK_TG_TSR, ".
      *----------  運用通貨建玉手数料
           10  FILLER              PIC  X(13)  VALUE  "UYTK_TG_TSR, ".
      *----------  市場通貨異動後建玉手数料残
           10  FILLER              PIC  X(20)
                 VALUE  "SJTK_IDOG_TG_TSRZN, ".
      *----------  運用通貨異動後建玉手数料残
           10  FILLER              PIC  X(20)
                 VALUE  "UYTK_IDOG_TG_TSRZN, ".
      *----------  市場通貨建玉消費税
           10  FILLER              PIC  X(15)  VALUE  "SJTK_TG_S_TAX, ".
      *----------  運用通貨建玉消費税
           10  FILLER              PIC  X(15)  VALUE  "UYTK_TG_S_TAX, ".
      *----------  市場通貨異動後建玉消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_TG_S_TAXZN, ".
      *----------  運用通貨異動後建玉消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_TG_S_TAXZN, ".
      *----------  市場通貨建玉その他費用
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_TG_ELS_HIYO, ".
      *----------  運用通貨建玉その他費用
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_TG_ELS_HIYO, ".
      *----------  市場通貨異動後建玉その他費用残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_TG_ELS_HZN, ".
      *----------  運用通貨異動後建玉その他費用残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_TG_ELS_HZN, ".
      *----------  市場通貨建玉精算金額
           10  FILLER              PIC  X(14)  VALUE  "SJTK_TG_SSKG, ".
      *----------  運用通貨建玉精算金額
           10  FILLER              PIC  X(14)  VALUE  "UYTK_TG_SSKG, ".
      *----------  市場通貨異動後建玉精算金額残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_TG_SSKGZN, ".
      *----------  運用通貨異動後建玉精算金額残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_TG_SSKGZN, ".
      *----------  市場通貨引継前受・前払プレミアム
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_HT_PPAR_PMM, ".
      *----------  運用通貨引継前受・前払プレミアム
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_HT_PPAR_PMM, ".
      *----------  ＯＰ資産負債・買建売建フラグ
           10  FILLER              PIC  X(13)  VALUE  "OP_TATE_FLG, ".
      *----------  市場通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "SJTK_GSZKP_YTIDOG, ".
      *----------  運用通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_GSZKP_YTIDOG, ".
      *----------  決済通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "KSTK_GSZKP_YTIDOG, ".
      *----------  市場通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_GSZKP_YTZN, ".
      *----------  運用通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_GSZKP_YTZN, ".
      *----------  決済通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "KSTK_IDOG_GSZKP_YTZN, ".
      *----------  市場通貨異動後ノンカバー未収金残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_NOCV_MSKZN, ".
      *----------  運用通貨異動後ノンカバー未収金残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_NOCV_MSKZN, ".
      *----------  市場通貨異動後ノンカバー未払金残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_NOCV_MBKZN, ".
      *----------  運用通貨異動後ノンカバー未払金残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_NOCV_MBKZN, ".
      *----------  短期スタート・エンド経過利息
           10  FILLER              PIC  X(21)
                 VALUE  "SHORT_STEN_KEKA_RSK, ".
      *----------  短期スタート日
           10  FILLER              PIC  X(17)
                 VALUE  "SHORT_START_YMD, ".
      *----------  短期エンド日
           10  FILLER              PIC  X(15)  VALUE  "SHORT_END_YMD, ".
      *----------  投資対象国コード
           10  FILLER              PIC  X(10)  VALUE  "TSTSK_CD, ".
      *----------  発行国コード
           10  FILLER              PIC  X(09)  VALUE  "HAKO_CD, ".
      *----------  数量単位
           10  FILLER              PIC  X(12)  VALUE  "SURYO_TANI, ".
      *----------  市場通貨異動後未払費用残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_MBHYZN, ".
      *----------  運用通貨異動後未払費用残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_MBHYZN, ".
      *----------  市場通貨異動後未払消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_MB_S_TAXZN, ".
      *----------  運用通貨異動後未払消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_MB_S_TAXZN, ".
      *----------  市場通貨異動後移管評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_IK_HKSEZN, ".
      *----------  運用通貨異動後移管評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_IK_HKSEZN, ".
      *----------  市場通貨異動後移管未収収益
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_IK_MSSHEKI, ".
      *----------  運用通貨異動後移管未収収益
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_IK_MSSHEKI, ".
      *----------  運用通貨異動後移管前払金評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_IK_PPHKZN, ".
      *----------  削除区分
           10  FILLER              PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  作成フラグ
           10  FILLER              PIC  X(08)  VALUE  "SK_FLG, ".
      *----------  作成日時
           10  FILLER              PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
           10  FILLER              PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
           10  FILLER              PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
           10  FILLER              PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新フラグ
           10  FILLER              PIC  X(09)  VALUE  "UPD_FLG, ".
      *----------  更新日時
           10  FILLER              PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(10)  VALUE  "UPD_PGMID ".
           10  FILLER              PIC  X(07)  VALUE  " FROM (".
      *----------  Layer02-1/2S
           10  FILLER              PIC  X(09)  VALUE  " (SELECT ".
      *----------  全項目3
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  原取引ID
           10  FILLER              PIC  X(09)  VALUE  "TORI_ID, ".
      *----------  計上基準日
           10  FILLER              PIC  X(16)
                 VALUE  "KEIJOU_KIJUNBI, ".
      *----------  赤黒区分
           10  FILLER              PIC  X(09)  VALUE  "AKA_KBN, ".
      *----------  誤計上№
           10  FILLER              PIC  X(12)  VALUE  "ERR_KJY_NO, ".
      *----------  誤計上区分
           10  FILLER              PIC  X(13)  VALUE  "ERR_KJY_KBN, ".
      *----------  取引連関ID
           10  FILLER              PIC  X(09)  VALUE  "THRK_ID, ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  取引内容
           10  FILLER              PIC  X(11)  VALUE  "TORI_NAIY, ".
      *----------  取引事由
           10  FILLER              PIC  X(11)  VALUE  "TORI_JIYU, ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  約定日
           10  FILLER              PIC  X(09)  VALUE  "YKJ_YMD, ".
      *----------  受渡日
           10  FILLER              PIC  X(09)  VALUE  "UKE_YMD, ".
      *----------  市場通貨異動簿価
           10  FILLER              PIC  X(15)  VALUE  "SJTK_IDO_BOKA, ".
      *----------  運用通貨異動簿価
           10  FILLER              PIC  X(15)  VALUE  "UYTK_IDO_BOKA, ".
      *----------  市場通貨簿価単価
           10  FILLER              PIC  X(15)  VALUE  "SJTK_BOKA_TNK, ".
      *----------  運用通貨簿価単価
           10  FILLER              PIC  X(15)  VALUE  "UYTK_BOKA_TNK, ".
      *----------  簿価為替レート
           10  FILLER              PIC  X(10)  VALUE  "BOKA_KWS, ".
      *----------  市場通貨払出簿価
           10  FILLER              PIC  X(13)  VALUE  "SJTK_H_BOKA, ".
      *----------  運用通貨払出簿価
           10  FILLER              PIC  X(13)  VALUE  "UYTK_H_BOKA, ".
      *----------  市場通貨払出単価
           10  FILLER              PIC  X(12)  VALUE  "SJTK_H_TNK, ".
      *----------  運用通貨払出単価
           10  FILLER              PIC  X(12)  VALUE  "UYTK_H_TNK, ".
      *----------  異動数量
           10  FILLER              PIC  X(11)  VALUE  "IDO_SURYO, ".
      *----------  異動数量（利付）
           10  FILLER              PIC  X(15)  VALUE  "IDO_SURYO_RIT, ".
      *----------  市場通貨異動後簿価残高
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_BOKAZN, ".
      *----------  運用通貨異動後簿価残高
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_BOKAZN, ".
      *----------  異動後数量残高
           10  FILLER              PIC  X(12)  VALUE  "IDOG_SRYZN, ".
      *----------  異動後数量残高（利付）
           10  FILLER              PIC  X(16)
                 VALUE  "IDOG_SRYZN_RIT, ".
      *----------  市場通貨前払金異動額
           10  FILLER              PIC  X(15)  VALUE  "SJTK_PPAYIDOG, ".
      *----------  運用通貨前払金異動額
           10  FILLER              PIC  X(15)  VALUE  "UYTK_PPAYIDOG, ".
      *----------  市場通貨異動後前払金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_PPAYZN, ".
      *----------  運用通貨異動後前払金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_PPAYZN, ".
      *----------  市場通貨異動後前受金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_ARECZN, ".
      *----------  運用通貨異動後前受金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_ARECZN, ".
      *----------  市場通貨異動後仮払金残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_SPAYZN, ".
      *----------  運用通貨異動後仮払金残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_SPAYZN, ".
      *----------  市場通貨売買損益
           10  FILLER              PIC  X(14)  VALUE  "SJTK_BBSNEKI, ".
      *----------  運用通貨売買損益
           10  FILLER              PIC  X(14)  VALUE  "UYTK_BBSNEKI, ".
      *----------  為替差損益
           10  FILLER              PIC  X(16)
                 VALUE  "UYTK_KWS_SNEKI, ".
      *----------  為替差損益（利金）
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_KWS_SNEKI_RK, ".
      *----------  為替差損益（市場）
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_KWS_SNEKI_SJ, ".
      *----------  市場通貨手数料
           10  FILLER              PIC  X(10)  VALUE  "SJTK_TSR, ".
      *----------  運用通貨手数料
           10  FILLER              PIC  X(10)  VALUE  "UYTK_TSR, ".
      *----------  市場通貨消費税
           10  FILLER              PIC  X(12)  VALUE  "SJTK_S_TAX, ".
      *----------  運用通貨消費税
           10  FILLER              PIC  X(12)  VALUE  "UYTK_S_TAX, ".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(17)
                 VALUE  "SJTK_GENSEN_TAX, ".
      *----------  運用通貨源泉税
           10  FILLER              PIC  X(17)
                 VALUE  "UYTK_GENSEN_TAX, ".
      *----------  市場通貨その他損益
           10  FILLER              PIC  X(16)
                 VALUE  "SJTK_ELS_SNEKI, ".
      *----------  運用通貨その他損益
           10  FILLER              PIC  X(16)
                 VALUE  "UYTK_ELS_SNEKI, ".
      *----------  市場通貨利金等損益勘定
           10  FILLER              PIC  X(13)  VALUE  "SJTK_RKSEKJ, ".
      *----------  運用通貨利金等損益勘定
           10  FILLER              PIC  X(13)  VALUE  "UYTK_RKSEKJ, ".
      *----------  異動計上順序
           10  FILLER              PIC  X(13)  VALUE  "IDO_KJY_JUN, ".
      *----------  建玉単価
           10  FILLER              PIC  X(12)  VALUE  "TGYOKU_TNK, ".
      *----------  建玉為替レート
           10  FILLER              PIC  X(17)
                 VALUE  "TGYOKU_KWS_RATE, ".
      *----------  建玉ブローカー
           10  FILLER              PIC  X(12)  VALUE  "TGYOKU_BRK, ".
      *----------  建玉約定日
           10  FILLER              PIC  X(16)
                 VALUE  "TGYOKU_YKJ_YMD, ".
      *----------  市場通貨異動後建玉約定金額残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_TG_YJKNZN, ".
      *----------  運用通貨異動後建玉約定金額残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_TG_YJKNZN, ".
      *----------  市場通貨建玉手数料
           10  FILLER              PIC  X(13)  VALUE  "SJTK_TG_TSR, ".
      *----------  運用通貨建玉手数料
           10  FILLER              PIC  X(13)  VALUE  "UYTK_TG_TSR, ".
      *----------  市場通貨異動後建玉手数料残
           10  FILLER              PIC  X(20)
                 VALUE  "SJTK_IDOG_TG_TSRZN, ".
      *----------  運用通貨異動後建玉手数料残
           10  FILLER              PIC  X(20)
                 VALUE  "UYTK_IDOG_TG_TSRZN, ".
      *----------  市場通貨建玉消費税
           10  FILLER              PIC  X(15)  VALUE  "SJTK_TG_S_TAX, ".
      *----------  運用通貨建玉消費税
           10  FILLER              PIC  X(15)  VALUE  "UYTK_TG_S_TAX, ".
      *----------  市場通貨異動後建玉消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_TG_S_TAXZN, ".
      *----------  運用通貨異動後建玉消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_TG_S_TAXZN, ".
      *----------  市場通貨建玉その他費用
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_TG_ELS_HIYO, ".
      *----------  運用通貨建玉その他費用
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_TG_ELS_HIYO, ".
      *----------  市場通貨異動後建玉その他費用残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_TG_ELS_HZN, ".
      *----------  運用通貨異動後建玉その他費用残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_TG_ELS_HZN, ".
      *----------  市場通貨建玉精算金額
           10  FILLER              PIC  X(14)  VALUE  "SJTK_TG_SSKG, ".
      *----------  運用通貨建玉精算金額
           10  FILLER              PIC  X(14)  VALUE  "UYTK_TG_SSKG, ".
      *----------  市場通貨異動後建玉精算金額残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_TG_SSKGZN, ".
      *----------  運用通貨異動後建玉精算金額残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_TG_SSKGZN, ".
      *----------  市場通貨引継前受・前払プレミアム
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_HT_PPAR_PMM, ".
      *----------  運用通貨引継前受・前払プレミアム
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_HT_PPAR_PMM, ".
      *----------  ＯＰ資産負債・買建売建フラグ
           10  FILLER              PIC  X(13)  VALUE  "OP_TATE_FLG, ".
      *----------  市場通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "SJTK_GSZKP_YTIDOG, ".
      *----------  運用通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "UYTK_GSZKP_YTIDOG, ".
      *----------  決済通貨源泉税還付予定異動額
           10  FILLER              PIC  X(19)
                 VALUE  "KSTK_GSZKP_YTIDOG, ".
      *----------  市場通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_GSZKP_YTZN, ".
      *----------  運用通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_GSZKP_YTZN, ".
      *----------  決済通貨異動後源泉税還付予定額残高
           10  FILLER              PIC  X(22)
                 VALUE  "KSTK_IDOG_GSZKP_YTZN, ".
      *----------  市場通貨異動後ノンカバー未収金残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_NOCV_MSKZN, ".
      *----------  運用通貨異動後ノンカバー未収金残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_NOCV_MSKZN, ".
      *----------  市場通貨異動後ノンカバー未払金残高
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_NOCV_MBKZN, ".
      *----------  運用通貨異動後ノンカバー未払金残高
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_NOCV_MBKZN, ".
      *----------  短期スタート・エンド経過利息
           10  FILLER              PIC  X(21)
                 VALUE  "SHORT_STEN_KEKA_RSK, ".
      *----------  短期スタート日
           10  FILLER              PIC  X(17)
                 VALUE  "SHORT_START_YMD, ".
      *----------  短期エンド日
           10  FILLER              PIC  X(15)  VALUE  "SHORT_END_YMD, ".
      *----------  投資対象国コード
           10  FILLER              PIC  X(10)  VALUE  "TSTSK_CD, ".
      *----------  発行国コード
           10  FILLER              PIC  X(09)  VALUE  "HAKO_CD, ".
      *----------  数量単位
           10  FILLER              PIC  X(12)  VALUE  "SURYO_TANI, ".
      *----------  市場通貨異動後未払費用残
           10  FILLER              PIC  X(18)
                 VALUE  "SJTK_IDOG_MBHYZN, ".
      *----------  運用通貨異動後未払費用残
           10  FILLER              PIC  X(18)
                 VALUE  "UYTK_IDOG_MBHYZN, ".
      *----------  市場通貨異動後未払消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_MB_S_TAXZN, ".
      *----------  運用通貨異動後未払消費税残
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_MB_S_TAXZN, ".
      *----------  市場通貨異動後移管評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "SJTK_IDOG_IK_HKSEZN, ".
      *----------  運用通貨異動後移管評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_IK_HKSEZN, ".
      *----------  市場通貨異動後移管未収収益
           10  FILLER              PIC  X(22)
                 VALUE  "SJTK_IDOG_IK_MSSHEKI, ".
      *----------  運用通貨異動後移管未収収益
           10  FILLER              PIC  X(22)
                 VALUE  "UYTK_IDOG_IK_MSSHEKI, ".
      *----------  運用通貨異動後移管前払金評価損益残
           10  FILLER              PIC  X(21)
                 VALUE  "UYTK_IDOG_IK_PPHKZN, ".
      *----------  削除区分
           10  FILLER              PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  作成フラグ
           10  FILLER              PIC  X(08)  VALUE  "SK_FLG, ".
      *----------  作成日時
           10  FILLER              PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
           10  FILLER              PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
           10  FILLER              PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
           10  FILLER              PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新フラグ
           10  FILLER              PIC  X(09)  VALUE  "UPD_FLG, ".
      *----------  更新日時
           10  FILLER              PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(09)  VALUE  "UPD_PGMID".
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
           10  SQL-TBL-TKMZZI00-1  PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_FUND_CD ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_PTF_CD ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_SEC_SBT_CD ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_MEG_CD ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_TATE_FLG ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_GYOKU_ID ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  計上基準日
           10  FILLER              PIC  X(18)  VALUE
                                                   "KEIJOU_KIJUNBI > ".
           10  FILLER              PIC  X(22)  VALUE
                                               ":P_KEIJOU_KIJUNBI_YKJC".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                                   "KEIJOU_KIJUNBI < ".
           10  FILLER              PIC  X(17)  VALUE
                                                    ":P_KEIJOU_KIJUNBI".
           10  FILLER              PIC  X(09)  VALUE  " ) T_AAA ".
      *----------  LEFT JOIN
           10  FILLER              PIC  X(11)  VALUE  " LEFT JOIN ".
           10  FILLER              PIC  X(09)  VALUE  " (SELECT ".
           10  FILLER              PIC  X(15)  VALUE  "KEIJOU_KIJUNBI,".
           10  FILLER              PIC  X(15)  VALUE  "MAX(UKE_YMD) AS".
           10  FILLER              PIC  X(19)  VALUE
               " KEIJOU_UKE_YMD" .
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
           10  SQL-TBL-TKMZZI00-2  PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(10)  VALUE  "FUND_CD = ".
           10  FILLER              PIC  X(11)  VALUE  ":P_FUND_CD ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE  "PTF_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_PTF_CD ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE  "SEC_SBT_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_SEC_SBT_CD ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE  "MEG_CD = ".
           10  FILLER              PIC  X(10)  VALUE  ":P_MEG_CD ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(11)  VALUE  "TATE_FLG = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_TATE_FLG ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE  "GYOKU_ID = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_GYOKU_ID ".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  計上基準日
           10  FILLER              PIC  X(18)  VALUE
                                                   "KEIJOU_KIJUNBI > ".
           10  FILLER              PIC  X(22)  VALUE
                                               ":P_KEIJOU_KIJUNBI_YKJC".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                                   "KEIJOU_KIJUNBI < ".
           10  FILLER              PIC  X(17)  VALUE
                                                    ":P_KEIJOU_KIJUNBI".
      *----------  GROUP BY
           10  FILLER              PIC  X(10)  VALUE  " GROUP BY ".
           10  FILLER              PIC  X(15)  VALUE  " KEIJOU_KIJUNBI".
           10  FILLER              PIC  X(07)  VALUE  ") T_BBB".
           10  FILLER              PIC  X(04)  VALUE  " ON ".
           10  FILLER              PIC  X(43)  VALUE
               "T_AAA.KEIJOU_KIJUNBI = T_BBB.KEIJOU_KIJUNBI".
           10  FILLER              PIC  X(01)  VALUE  ")".
           10  FILLER              PIC  X(01)  VALUE  ")".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  受渡日OR計上基準日  降順
           10  WK-ORDER-BY         PIC  X(14).
           10  FILLER              PIC  X(07)  VALUE  " DESC, ".
      *----------  異動計上順序  降順
           10  FILLER              PIC  X(16)  VALUE
               "IDO_KJY_JUN DESC".
      *-----------------------------------------------------------------
      *----------  資金残履歴
         05  SQL-SELECT-1-4.
           10  SQL-SELECT.
      *----------  SELECT
             15  FILLER            PIC  X(07)  VALUE  "SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE  "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE  "PTF_CD,".
      *----------  決済口座番号
             15  FILLER            PIC  X(11)  VALUE  "KS_KOZA_NO,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE  "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)
                 VALUE  "KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(14)  VALUE  "KOZA_TUKA_CD, ".
      *----------  市場通貨当日ＣＡＳＨ残高
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_TJT_CASHZN, ".
      *----------  運用通貨当日ＣＡＳＨ残高
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_TJT_CASHZN, ".
      *----------  市場通貨当日未収入金残高（内物）
             15  FILLER            PIC  X(20)
                 VALUE  "SJTK_TJT_MSNKZN_UM, ".
      *----------  運用通貨当日未収入金残高（内物）
             15  FILLER            PIC  X(20)
                 VALUE  "UYTK_TJT_MSNKZN_UM, ".
      *----------  市場通貨当日未収入金残高（外物）
             15  FILLER            PIC  X(20)
                 VALUE  "SJTK_TJT_MSNKZN_SM, ".
      *----------  運用通貨当日未収入金残高（外物）
             15  FILLER            PIC  X(20)
                 VALUE  "UYTK_TJT_MSNKZN_SM, ".
      *----------  市場通貨当日未払金残高（内物）
             15  FILLER            PIC  X(19)
                 VALUE  "SJTK_TJT_MBKZN_UM, ".
      *----------  運用通貨当日未払金残高（内物）
             15  FILLER            PIC  X(19)
                 VALUE  "UYTK_TJT_MBKZN_UM, ".
      *----------  市場通貨当日未払金残高（外物）
             15  FILLER            PIC  X(19)
                 VALUE  "SJTK_TJT_MBKZN_SM, ".
      *----------  運用通貨当日未払金残高（外物）
             15  FILLER            PIC  X(19)
                 VALUE  "UYTK_TJT_MBKZN_SM, ".
      *----------  簿価為替レート
             15  FILLER            PIC  X(10)  VALUE  "BOKA_KWS, ".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(15)  VALUE  "SJTK_MS_SHEKI, ".
      *----------  運用通貨未収収益
             15  FILLER            PIC  X(15)  VALUE  "UYTK_MS_SHEKI, ".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_GENSEN_TAX, ".
      *----------  運用通貨源泉税
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_GENSEN_TAX, ".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE  "UPD_PGMID, ".
      *----------  市場通貨未収収益計上・戻入額
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_MSSE_KJMIG,".
      *----------  運用通貨未収収益計上・戻入額
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_MSSE_KJMIG".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-TKMZSR00  PIC  X(13).
      *----------  WHERE
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)
                 VALUE  "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)
                 VALUE  "AND FUND_CD = :P_FUND_CD ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)
                 VALUE  "AND PTF_CD = :P_PTF_CD ".
      *----------  決済口座番号
             15  FILLER            PIC  X(31)
                 VALUE  "AND KS_KOZA_NO = :P_KS_KOZA_NO ".
      *----------  基準日
             15  FILLER            PIC  X(25)
                 VALUE  "AND KJN_YMD = :P_KJN_YMD ".
      *----------  決算日断面区分
             15  FILLER            PIC  X(31)
                 VALUE  "AND KSN_YMD_DMN_KBN IN('0','2')".
      *-----------------------------------------------------------------
      *----------  資金簿価異動
         05  SQL-SELECT-1-5.
           10  SQL-SELECT.
      *----------  SELECT
             15  FILLER            PIC  X(07)  VALUE  "SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  原取引ID
             15  FILLER            PIC  X(09)  VALUE  "TORI_ID, ".
      *----------  決済口座番号
             15  FILLER            PIC  X(12)  VALUE  "KS_KOZA_NO, ".
      *----------  資金種別
             15  FILLER            PIC  X(11)  VALUE  "SIKIN_SBT, ".
      *----------  異動日
             15  FILLER            PIC  X(09)  VALUE  "IDO_YMD, ".
      *----------  増減区分
             15  FILLER            PIC  X(08)  VALUE  "ZG_KBN, ".
      *----------  赤黒区分
             15  FILLER            PIC  X(09)  VALUE  "AKA_KBN, ".
      *----------  誤計上№
             15  FILLER            PIC  X(12)  VALUE  "ERR_KJY_NO, ".
      *----------  誤計上区分
             15  FILLER            PIC  X(13)  VALUE  "ERR_KJY_KBN, ".
      *----------  取引事由
             15  FILLER            PIC  X(11)  VALUE  "TORI_JIYU, ".
      *----------  取引連関ID
             15  FILLER            PIC  X(09)  VALUE  "THRK_ID, ".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(14)  VALUE  "KOZA_TUKA_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  市場通貨資金簿価異動額
             15  FILLER            PIC  X(20)
                 VALUE  "SJTK_SK_BOKA_IDOGK, ".
      *----------  運用通貨資金簿価異動額
             15  FILLER            PIC  X(20)
                 VALUE  "UYTK_SK_BOKA_IDOGK, ".
      *----------  市場通貨払出簿価
             15  FILLER            PIC  X(13)  VALUE  "SJTK_H_BOKA, ".
      *----------  運用通貨払出簿価
             15  FILLER            PIC  X(13)  VALUE  "UYTK_H_BOKA, ".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(12)  VALUE  "SJTK_H_TNK, ".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(12)  VALUE  "UYTK_H_TNK, ".
      *----------  簿価為替レート
             15  FILLER            PIC  X(10)  VALUE  "BOKA_KWS, ".
      *----------  市場通貨異動後ＣＡＳＨ残高
             15  FILLER            PIC  X(21)
                 VALUE  "SJTK_IDOG_SK_BOKAZN, ".
      *----------  運用通貨異動後ＣＡＳＨ残高
             15  FILLER            PIC  X(21)
                 VALUE  "UYTK_IDOG_SK_BOKAZN, ".
      *----------  市場通貨異動後未収入金残高（内物）
             15  FILLER            PIC  X(21)
                 VALUE  "SJTK_IDOG_MSNKZN_UM, ".
      *----------  運用通貨異動後未収入金残高（内物）
             15  FILLER            PIC  X(21)
                 VALUE  "UYTK_IDOG_MSNKZN_UM, ".
      *----------  市場通貨異動後未収入金残高（外物）
             15  FILLER            PIC  X(21)
                 VALUE  "SJTK_IDOG_MSNKZN_SM, ".
      *----------  運用通貨異動後未収入金残高（外物）
             15  FILLER            PIC  X(21)
                 VALUE  "UYTK_IDOG_MSNKZN_SM, ".
      *----------  市場通貨異動後未払金残高（内物）
             15  FILLER            PIC  X(20)
                 VALUE  "SJTK_IDOG_MBKZN_UM, ".
      *----------  運用通貨異動後未払金残高（内物）
             15  FILLER            PIC  X(20)
                 VALUE  "UYTK_IDOG_MBKZN_UM, ".
      *----------  市場通貨異動後未払金残高（外物）
             15  FILLER            PIC  X(20)
                 VALUE  "SJTK_IDOG_MBKZN_SM, ".
      *----------  運用通貨異動後未払金残高（外物）
             15  FILLER            PIC  X(20)
                 VALUE  "UYTK_IDOG_MBKZN_SM, ".
      *----------  為替差損益
             15  FILLER            PIC  X(16)
                 VALUE  "UYTK_KWS_SNEKI, ".
      *----------  市場通貨利金等損益勘定
             15  FILLER            PIC  X(13)  VALUE  "SJTK_RKSEKJ, ".
      *----------  運用通貨利金等損益勘定
             15  FILLER            PIC  X(13)  VALUE  "UYTK_RKSEKJ, ".
      *----------  異動計上順序
             15  FILLER            PIC  X(13)  VALUE  "IDO_KJY_JUN, ".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  作成フラグ
             15  FILLER            PIC  X(08)  VALUE  "SK_FLG, ".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新フラグ
             15  FILLER            PIC  X(09)  VALUE  "UPD_FLG, ".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_PGMID".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL-TKMZSI00  PIC  X(13).
      *----------  WHERE
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)
                 VALUE  "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)
                 VALUE  "AND FUND_CD = :P_FUND_CD ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)
                 VALUE  "AND PTF_CD = :P_PTF_CD ".
      *----------  決済口座番号
             15  FILLER            PIC  X(31)
                 VALUE  "AND KS_KOZA_NO = :P_KS_KOZA_NO ".
      *----------  異動日
             15  FILLER            PIC  X(29)
                 VALUE  "AND IDO_YMD > :P_IDO_YMD_MIN ".
             15  FILLER            PIC  X(12)
                 VALUE  "AND IDO_YMD ".
             15  WK-LES-EQU5       PIC  X(15).
      *      15  FILLER            PIC  X(12)
      *          " :P_IDO_YMD ".
      *---------- ORDER BY
           10  SQL-ORDERBY.
             15  FILLER            PIC  X(10)  VALUE " ORDER BY ".
      *----------  異動日  降順
             15  FILLER            PIC  X(14)  VALUE  "IDO_YMD DESC, ".
      *----------  異動計上順序  降順
             15  FILLER            PIC  X(16)
                 VALUE  "IDO_KJY_JUN DESC".
      *-----------------------------------------------------------------
      *----------  元本残高
         05  SQL-SELECT-1-6.
           10  SQL-SELECT.
      *----------  SELECT
             15  FILLER            PIC  X(07)  VALUE  "SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  基準日
             15  FILLER            PIC  X(09)  VALUE  "KJN_YMD, ".
      *----------  決算日断面区分
             15  FILLER            PIC  X(17)
                 VALUE  "KSN_YMD_DMN_KBN, ".
      *----------  元本数量残高
             15  FILLER            PIC  X(11)  VALUE  "GNP_SRYZN, ".
      *----------  元本簿価残高
             15  FILLER            PIC  X(12)  VALUE  "GNP_BOKAZN, ".
      *----------  総投入金額
             15  FILLER            PIC  X(11)  VALUE  "SO_TN_KGK, ".
      *----------  初期設定金額
             15  FILLER            PIC  X(15)  VALUE  "SHOKI_SET_KGK, ".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_PGMID".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL-TKMZGZ00  PIC  X(13).
      *----------  WHERE
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(29)
               VALUE  "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *----------  ファンドコード
           10  FILLER              PIC  X(25)
               VALUE  "AND FUND_CD = :P_FUND_CD ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(23)
               VALUE  "AND PTF_CD = :P_PTF_CD ".
      *----------  基準日
           10  FILLER              PIC  X(25)
               VALUE  "AND KJN_YMD = :P_KJN_YMD ".
      *----------  決算日断面区分
           10  FILLER              PIC  X(31)
               VALUE  "AND KSN_YMD_DMN_KBN IN('0','2')".
      *-----------------------------------------------------------------
      *---------- 前払金管理 (別紙1-7)
         05  SQL-INSERT-1-7.
           10  SQL-INSERT.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
      *---------- 前払金管理計算データTBLテーブルID
             15  SQL-TBL-TKMZBW10  PIC  X(13).
             15  FILLER            PIC  X(01)  VALUE  "(".
      *---------- 処理実行日
             15  FILLER            PIC  X(10)  VALUE  "SYORI_YMD,".
      *---------- 起動ID
             15  FILLER            PIC  X(09)  VALUE  "KIDOU_ID,".
      *---------- 利用会社コード
             15  FILLER            PIC  X(12)  VALUE  "RIYO_CMP_CD,".
      *---------- ファンドコード
             15  FILLER            PIC  X(08)  VALUE  "FUND_CD,".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE  "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  利払日
             15  FILLER            PIC  X(09)  VALUE  "RIB_YMD, ".
      *----------  積み取引ＩＤ
             15  FILLER            PIC  X(14)  VALUE  "TUMI_TORI_ID, ".
      *----------  償却取引ＩＤ
             15  FILLER            PIC  X(17)
                 VALUE  "SHOUKYK_TORI_ID, ".
      *----------  赤黒区分
             15  FILLER            PIC  X(09)  VALUE  "AKA_KBN, ".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  積み／償却フラグ
             15  FILLER            PIC  X(18)
                 VALUE  "TUMI_SHOUKYK_FLG, ".
      *----------  積み計上日
             15  FILLER            PIC  X(14)  VALUE  "TUMI_KJY_YMD, ".
      *----------  積み順番
             15  FILLER            PIC  X(13)  VALUE  "TUMI_JUNBAN, ".
      *----------  償却計上日
             15  FILLER            PIC  X(17)
                 VALUE  "SHOUKYK_KJY_YMD, ".
      *----------  償却順番
             15  FILLER            PIC  X(16)
                 VALUE  "SHOUKYK_JUNBAN, ".
      *----------  計上基準日
             15  FILLER            PIC  X(16)
                 VALUE  "KEIJOU_KIJUNBI, ".
      *----------  利払日毎順番
             15  FILLER            PIC  X(14)  VALUE  "RIBAR_JUNBAN, ".
      *----------  未償却数量
             15  FILLER            PIC  X(10)  VALUE  "MSKK_SRY, ".
      *----------  未償却数量（期間）
             15  FILLER            PIC  X(16)
                 VALUE  "MSKK_SRY_KIKAN, ".
      *----------  未償却数量（利金）
             15  FILLER            PIC  X(16)
                 VALUE  "MSKK_SRY_RIKIN, ".
      *----------  未償却数量サマリ
             15  FILLER            PIC  X(14)  VALUE  "MSKK_SRY_SUM, ".
      *----------  未償却数量サマリ（期間）
             15  FILLER            PIC  X(20)
                 VALUE  "MSKK_SRY_KIKAN_SUM, ".
      *----------  未償却数量サマリ（利金）
             15  FILLER            PIC  X(20)
                 VALUE  "MSKK_SRY_RIKIN_SUM, ".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "SJTK_PPAYZN, ".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "UYTK_PPAYZN, ".
      *----------  市場通貨前払金残高サマリ
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_PPAYZN_SUM, ".
      *----------  運用通貨前払金残高サマリ
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_PPAYZN_SUM, ".
      *----------  前払金償却方法
             15  FILLER            PIC  X(20)
                 VALUE  "MAEKIN_SHOUKYK_HOU, ".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  処理フラグ
             15  FILLER            PIC  X(10)  VALUE  "SYRI_FLG, ".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "SK_PGMID, ".
      *---------- 更新日時
             15  FILLER            PIC  X(09)  VALUE  "UPD_DATE,".
      *---------- 更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "UPD_LOGIN_CMP_CD,".
      *---------- 更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "UPD_SID,".
      *---------- 更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "UPD_PGMID)".
           10  SQL-SELECT-1-7.
      *---------- SELECT
             15  FILLER            PIC  X(08)  VALUE  "(SELECT ".
      *---------- 処理実行日
             15  WK-SYORI-YMD-S    PIC  S9(08).
             15  FILLER            PIC  X(03)  VALUE  ", '".
      *---------- 起動ID
             15  WK-KIDOU-ID-S     PIC  X(04).
             15  FILLER            PIC  X(03)  VALUE  "', ".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  利払日
             15  FILLER            PIC  X(09)  VALUE  "RIB_YMD, ".
      *----------  積み取引ＩＤ
             15  FILLER            PIC  X(14)  VALUE  "TUMI_TORI_ID, ".
      *----------  償却取引ＩＤ
             15  FILLER            PIC  X(17)
                 VALUE  "SHOUKYK_TORI_ID, ".
      *----------  赤黒区分
             15  FILLER            PIC  X(09)  VALUE  "AKA_KBN, ".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  積み／償却フラグ
             15  FILLER            PIC  X(18)
                 VALUE  "TUMI_SHOUKYK_FLG, ".
      *----------  積み計上日
             15  FILLER            PIC  X(14)  VALUE  "TUMI_KJY_YMD, ".
      *----------  積み順番
             15  FILLER            PIC  X(13)  VALUE  "TUMI_JUNBAN, ".
      *----------  償却計上日
             15  FILLER            PIC  X(17)
                 VALUE  "SHOUKYK_KJY_YMD, ".
      *----------  償却順番
             15  FILLER            PIC  X(16)
                 VALUE  "SHOUKYK_JUNBAN, ".
      *----------  計上基準日
             15  FILLER            PIC  X(16)
                 VALUE  "KEIJOU_KIJUNBI, ".
      *----------  利払日毎順番
             15  FILLER            PIC  X(14)  VALUE  "RIBAR_JUNBAN, ".
      *----------  未償却数量
             15  FILLER            PIC  X(10)  VALUE  "MSKK_SRY, ".
      *----------  未償却数量（期間）
             15  FILLER            PIC  X(16)
                 VALUE  "MSKK_SRY_KIKAN, ".
      *----------  未償却数量（利金）
             15  FILLER            PIC  X(16)
                 VALUE  "MSKK_SRY_RIKIN, ".
      *----------  未償却数量サマリ
             15  FILLER            PIC  X(14)  VALUE  "MSKK_SRY_SUM, ".
      *----------  未償却数量サマリ（期間）
             15  FILLER            PIC  X(20)
                 VALUE  "MSKK_SRY_KIKAN_SUM, ".
      *----------  未償却数量サマリ（利金）
             15  FILLER            PIC  X(20)
                 VALUE  "MSKK_SRY_RIKIN_SUM, ".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "SJTK_PPAYZN, ".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "UYTK_PPAYZN, ".
      *----------  市場通貨前払金残高サマリ
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_PPAYZN_SUM, ".
      *----------  運用通貨前払金残高サマリ
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_PPAYZN_SUM, ".
      *----------  前払金償却方法
             15  FILLER            PIC  X(20)
                 VALUE  "MAEKIN_SHOUKYK_HOU, ".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  処理フラグ
             15  FILLER            PIC  X(05)  VALUE  "' ', ".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_PGMID".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL-TKMZMB00  PIC  X(13).
      *----------  WHERE
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)
                 VALUE  "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)
                 VALUE  "AND FUND_CD = :P_FUND_CD ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)
                 VALUE  "AND PTF_CD = :P_PTF_CD ".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)
                 VALUE  "AND SEC_SBT_CD = :P_SEC_SBT_CD ".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)
                 VALUE  "AND MEG_CD = :P_MEG_CD ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)
                 VALUE  "AND TATE_FLG = :P_TATE_FLG ".
      *----------  玉ID
             15  FILLER            PIC  X(27)
                 VALUE  "AND GYOKU_ID = :P_GYOKU_ID ".
      *----------  計上基準日
             15  FILLER            PIC  X(39)
                 VALUE  "AND KEIJOU_KIJUNBI <= :P_KEIJOU_KIJUNBI".
             15  FILLER            PIC  X(02)  VALUE  " )".
      *-----------------------------------------------------------------
      *----------  前払金管理
      *----------  別紙1-8 SQL
         05  SQL-INSERT-1-8.
           10  SQL-INSERT.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
      *---------- 前払金管理計算データTBLテーブルID
             15  SQL-TBL-TKMZBW10  PIC  X(13).
             15  FILLER            PIC  X(01)  VALUE  "(".
      *---------- 処理実行日
             15  FILLER            PIC  X(10)  VALUE  "SYORI_YMD,".
      *---------- 起動ID
             15  FILLER            PIC  X(09)  VALUE  "KIDOU_ID,".
      *---------- 利用会社コード
             15  FILLER            PIC  X(12)  VALUE  "RIYO_CMP_CD,".
      *---------- ファンドコード
             15  FILLER            PIC  X(08)  VALUE  "FUND_CD,".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE  "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  利払日
             15  FILLER            PIC  X(09)  VALUE  "RIB_YMD, ".
      *----------  積み取引ＩＤ
             15  FILLER            PIC  X(14)  VALUE  "TUMI_TORI_ID, ".
      *----------  償却取引ＩＤ
             15  FILLER            PIC  X(17)
                 VALUE  "SHOUKYK_TORI_ID, ".
      *----------  赤黒区分
             15  FILLER            PIC  X(09)  VALUE  "AKA_KBN, ".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  積み／償却フラグ
             15  FILLER            PIC  X(18)
                 VALUE  "TUMI_SHOUKYK_FLG, ".
      *----------  積み計上日
             15  FILLER            PIC  X(14)  VALUE  "TUMI_KJY_YMD, ".
      *----------  積み順番
             15  FILLER            PIC  X(13)  VALUE  "TUMI_JUNBAN, ".
      *----------  償却計上日
             15  FILLER            PIC  X(17)
                 VALUE  "SHOUKYK_KJY_YMD, ".
      *----------  償却順番
             15  FILLER            PIC  X(16)
                 VALUE  "SHOUKYK_JUNBAN, ".
      *----------  計上基準日
             15  FILLER            PIC  X(16)
                 VALUE  "KEIJOU_KIJUNBI, ".
      *----------  利払日毎順番
             15  FILLER            PIC  X(14)  VALUE  "RIBAR_JUNBAN, ".
      *----------  未償却数量
             15  FILLER            PIC  X(10)  VALUE  "MSKK_SRY, ".
      *----------  未償却数量（期間）
             15  FILLER            PIC  X(16)
                 VALUE  "MSKK_SRY_KIKAN, ".
      *----------  未償却数量（利金）
             15  FILLER            PIC  X(16)
                 VALUE  "MSKK_SRY_RIKIN, ".
      *----------  未償却数量サマリ
             15  FILLER            PIC  X(14)  VALUE  "MSKK_SRY_SUM, ".
      *----------  未償却数量サマリ（期間）
             15  FILLER            PIC  X(20)
                 VALUE  "MSKK_SRY_KIKAN_SUM, ".
      *----------  未償却数量サマリ（利金）
             15  FILLER            PIC  X(20)
                 VALUE  "MSKK_SRY_RIKIN_SUM, ".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "SJTK_PPAYZN, ".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "UYTK_PPAYZN, ".
      *----------  市場通貨前払金残高サマリ
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_PPAYZN_SUM, ".
      *----------  運用通貨前払金残高サマリ
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_PPAYZN_SUM, ".
      *----------  前払金償却方法
             15  FILLER            PIC  X(20)
                 VALUE  "MAEKIN_SHOUKYK_HOU, ".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  処理フラグ
             15  FILLER            PIC  X(10)  VALUE  "SYRI_FLG, ".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "SK_PGMID, ".
      *---------- 更新日時
             15  FILLER            PIC  X(09)  VALUE  "UPD_DATE,".
      *---------- 更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "UPD_LOGIN_CMP_CD,".
      *---------- 更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "UPD_SID,".
      *---------- 更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "UPD_PGMID)".
           10  SQL-SELECT-1-8.
      *---------- SELECT
             15  FILLER            PIC  X(08)  VALUE  "(SELECT ".
      *---------- 処理実行日
             15  WK-SYORI-YMD-S    PIC  S9(08).
             15  FILLER            PIC  X(03)  VALUE  ", '".
      *---------- 起動ID
             15  WK-KIDOU-ID-S     PIC  X(04).
             15  FILLER            PIC  X(03)  VALUE  "', ".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  利払日
             15  FILLER            PIC  X(09)  VALUE  "RIB_YMD, ".
      *----------  積み取引ＩＤ
             15  FILLER            PIC  X(14)  VALUE  "TUMI_TORI_ID, ".
      *----------  償却取引ＩＤ
             15  FILLER            PIC  X(17)
                 VALUE  "SHOUKYK_TORI_ID, ".
      *----------  赤黒区分
             15  FILLER            PIC  X(09)  VALUE  "AKA_KBN, ".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE  "SIJO_TUKA_CD, ".
      *----------  積み／償却フラグ
             15  FILLER            PIC  X(18)
                 VALUE  "TUMI_SHOUKYK_FLG, ".
      *----------  積み計上日
             15  FILLER            PIC  X(14)  VALUE  "TUMI_KJY_YMD, ".
      *----------  積み順番
             15  FILLER            PIC  X(13)  VALUE  "TUMI_JUNBAN, ".
      *----------  償却計上日
             15  FILLER            PIC  X(17)
                 VALUE  "SHOUKYK_KJY_YMD, ".
      *----------  償却順番
             15  FILLER            PIC  X(16)
                 VALUE  "SHOUKYK_JUNBAN, ".
      *----------  計上基準日
             15  FILLER            PIC  X(16)
                 VALUE  "KEIJOU_KIJUNBI, ".
      *----------  利払日毎順番
             15  FILLER            PIC  X(14)  VALUE  "RIBAR_JUNBAN, ".
      *----------  未償却数量
             15  FILLER            PIC  X(10)  VALUE  "MSKK_SRY, ".
      *----------  未償却数量（期間）
             15  FILLER            PIC  X(16)
                 VALUE  "MSKK_SRY_KIKAN, ".
      *----------  未償却数量（利金）
             15  FILLER            PIC  X(16)
                 VALUE  "MSKK_SRY_RIKIN, ".
      *----------  未償却数量サマリ
             15  FILLER            PIC  X(14)  VALUE  "MSKK_SRY_SUM, ".
      *----------  未償却数量サマリ（期間）
             15  FILLER            PIC  X(20)
                 VALUE  "MSKK_SRY_KIKAN_SUM, ".
      *----------  未償却数量サマリ（利金）
             15  FILLER            PIC  X(20)
                 VALUE  "MSKK_SRY_RIKIN_SUM, ".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "SJTK_PPAYZN, ".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(13)  VALUE  "UYTK_PPAYZN, ".
      *----------  市場通貨前払金残高サマリ
             15  FILLER            PIC  X(17)
                 VALUE  "SJTK_PPAYZN_SUM, ".
      *----------  運用通貨前払金残高サマリ
             15  FILLER            PIC  X(17)
                 VALUE  "UYTK_PPAYZN_SUM, ".
      *----------  前払金償却方法
             15  FILLER            PIC  X(20)
                 VALUE  "MAEKIN_SHOUKYK_HOU, ".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE  "SAKUJO_KBN, ".
      *----------  処理フラグ
             15  FILLER            PIC  X(05)  VALUE  "' ', ".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE  "SK_DATE, ".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                 VALUE  "SK_LOGIN_CMP_CD, ".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE  "SK_SID, ".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE  "SK_PGMID, ".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE  "UPD_DATE, ".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)
                 VALUE  "UPD_LOGIN_CMP_CD, ".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_SID, ".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE  "UPD_PGMID".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-TKMZMB00  PIC  X(13).
      *----------  WHERE
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)
                 VALUE  "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)
                 VALUE  "AND FUND_CD = :P_FUND_CD ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)
                 VALUE  "AND PTF_CD = :P_PTF_CD ".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)
                 VALUE  "AND SEC_SBT_CD = :P_SEC_SBT_CD ".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)
                 VALUE  "AND MEG_CD = :P_MEG_CD ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)
                 VALUE  "AND TATE_FLG = :P_TATE_FLG ".
      *----------  玉ID
             15  FILLER            PIC  X(27)
                 VALUE  "AND GYOKU_ID = :P_GYOKU_ID ".
      *----------  計上基準日
             15  FILLER            PIC  X(38)
                 VALUE  "AND KEIJOU_KIJUNBI < :P_KEIJOU_KIJUNBI".
             15  FILLER            PIC  X(01)  VALUE  ")".
      *----------  別紙1-9 SQL
         05  SQL-SELECT-1-9.
           10  SQL-SELECT.
      *---------- SELECT
             15  FILLER            PIC  X(07)  VALUE  "SELECT ".
      *----------  取引事由
             15  FILLER            PIC  X(11)  VALUE  "TORI_JIYU, ".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(12)  VALUE  "SJTK_H_TNK, ".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(11)  VALUE  "UYTK_H_TNK ".
      *----------  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-TKMZZI00  PIC  X(13).
      *----------  WHERE
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)
                 VALUE  "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)
                 VALUE  "AND FUND_CD = :P_FUND_CD ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)
                 VALUE  "AND PTF_CD = :P_PTF_CD ".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)
                 VALUE  "AND SEC_SBT_CD = :P_SEC_SBT_CD ".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)
                 VALUE  "AND MEG_CD = :P_MEG_CD ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)
                 VALUE  "AND TATE_FLG = :P_TATE_FLG ".
      *----------  玉ID
             15  FILLER            PIC  X(27)
                 VALUE  "AND GYOKU_ID = :P_GYOKU_ID ".
      *----------  計上基準日
             15  FILLER            PIC  X(39)
                 VALUE  "AND :P_KEIJOU_KIJUNBI < KEIJOU_KIJUNBI ".
             15  FILLER            PIC  X(41)
                 VALUE  "AND KEIJOU_KIJUNBI < :P_KEIJOU_KIJUNBI_1 ".
      *----------  原取引ID
             15  FILLER            PIC  X(26)
                 VALUE  "AND TORI_ID <> :P_TORI_ID ".
      *----------  取引事由
             15  FILLER            PIC  X(22)
                 VALUE  "AND TORI_JIYU NOT IN (".
             15  FILLER            PIC  X(42)
                 VALUE  "'DMY1','DMY2','DMY3','DMY4','DMY5','DMY6',".
             15  FILLER            PIC  X(42)
                 VALUE  "'DMY7','DMY8','DMY9','TAX ','EXLC','EXLI',".
             15  FILLER            PIC  X(42)
                 VALUE  "'EXPC','EXPI','CPN ','DIVS','DVAI','INTA',".
             15  FILLER            PIC  X(21)
                 VALUE  "'INTF','RCPB','RCPS')".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)
                 VALUE  " ORDER BY ".
             15  WK-ORDER-BY       PIC  X(14).
             15  FILLER            PIC  X(07)  VALUE  " DESC, ".
      *----------  異動計上順序  降順
             15  FILLER            PIC  X(16)  VALUE
               "IDO_KJY_JUN DESC".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- 残高履歴
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZZR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)
               VALUE  " AND SEC_SBT_CD = '".
           10  WK-SEC-SBT-CD-S     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(15)
               VALUE  " AND MEG_CD = '".
           10  WK-MEG-CD-S         PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)
               VALUE  " AND TATE_FLG = '".
           10  WK-TATE-FLG-S       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)
               VALUE  " AND GYOKU_ID = '".
           10  WK-GYOKU-ID-S       PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  基準日
           10  FILLER              PIC  X(16)
               VALUE  " AND KJN_YMD = '".
           10  WK-KJN-YMD-S        PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  決算日断面区分
           10  FILLER              PIC  X(32)
               VALUE  " AND KSN_YMD_DMN_KBN IN('0','2')".
      *-----------------------------------------------------------------
      *---------- 残高異動
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZZI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)
               VALUE  " AND SEC_SBT_CD = '".
           10  WK-SEC-SBT-CD-S     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(15)
               VALUE  " AND MEG_CD = '".
           10  WK-MEG-CD-S         PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)
               VALUE  " AND TATE_FLG = '".
           10  WK-TATE-FLG-S       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)
               VALUE  " AND GYOKU_ID = '".
           10  WK-GYOKU-ID-S       PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  計上基準日
           10  FILLER              PIC  X(22)
               VALUE  " AND KEIJOU_KIJUNBI > ".
           10  WK-KAISI-KJN-YMD-MIN-S
                                   PIC  S9(08).
           10  FILLER              PIC  X(22)
               VALUE  " AND KEIJOU_KIJUNBI < ".
           10  WK-KAISI-KJN-YMD-S  PIC  S9(08).
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE " ORDER BY ".
           10  WK-ORDER-BY         PIC  X(14).
           10  FILLER              PIC  X(07)  VALUE  " DESC, ".
      *----------  異動計上順序  降順
           10  FILLER              PIC  X(16)
               VALUE  "IDO_KJY_JUN DESC".
      *-----------------------------------------------------------------
      *---------- 資金残履歴
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  決済口座番号
           10  FILLER              PIC  X(19)
               VALUE  " AND KS_KOZA_NO = '".
           10  WK-KS-KOZA-NO-S     PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  基準日
           10  FILLER              PIC  X(15)
               VALUE  " AND KJN_YMD = ".
           10  WK-KJN-YMD-S        PIC  S9(08).
      *----------  決算日断面区分
           10  FILLER              PIC  X(32)
               VALUE  " AND KSN_YMD_DMN_KBN IN('0','2')".
      *-----------------------------------------------------------------
      *---------- 資金簿価異動
         05  WK-MSG-1-5.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  決済口座番号
           10  FILLER              PIC  X(19)
               VALUE  " AND KS_KOZA_NO = '".
           10  WK-KS-KOZA-NO-S     PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  異動日
           10  FILLER              PIC  X(15)
               VALUE  " AND IDO_YMD > ".
           10  WK-IDO-YMD-MIN-S    PIC  S9(08).
           10  FILLER              PIC  X(14)
               VALUE  " AND IDO_YMD  ".
           10  WK-OPERATOR5        PIC  X(02).
           10  WK-IDO-YMD-S        PIC  S9(08).
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  異動日  降順
           10  FILLER              PIC  X(14)  VALUE  "IDO_YMD DESC, ".
      *----------  異動計上順序  降順
           10  FILLER              PIC  X(16)
               VALUE  "IDO_KJY_JUN DESC".
      *-----------------------------------------------------------------
      *---------- 元本残高
         05  WK-MSG-1-6.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZGZ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  基準日
           10  FILLER              PIC  X(15)
               VALUE  " AND KJN_YMD = ".
           10  WK-KJN-YMD-S        PIC  S9(08).
      *----------  決算日断面区分
           10  FILLER              PIC  X(32)
               VALUE  " AND KSN_YMD_DMN_KBN IN('1','2')".
      *-----------------------------------------------------------------
      *---------- 前払金管理
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMB00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)
               VALUE  " AND SEC_SBT_CD = '".
           10  WK-SEC-SBT-CD-S     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(15)
               VALUE  " AND MEG_CD = '".
           10  WK-MEG-CD-S         PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)
               VALUE  " AND TATE_FLG = '".
           10  WK-TATE-FLG-S       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)
               VALUE  " AND GYOKU_ID = '".
           10  WK-GYOKU-ID-S       PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  計上基準日
           10  FILLER              PIC  X(23)
               VALUE  " AND KEIJOU_KIJUNBI <= ".
           10  WK-KAISI-KJN-YMD-S  PIC  S9(08).
      *-----------------------------------------------------------------
      *---------- 前払金管理
         05  WK-MSG-1-8.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMB00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)
               VALUE  " AND SEC_SBT_CD = '".
           10  WK-SEC-SBT-CD-S     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(15)
               VALUE  " AND MEG_CD = '".
           10  WK-MEG-CD-S         PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)
               VALUE  " AND TATE_FLG = '".
           10  WK-TATE-FLG-S       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)
               VALUE  " AND GYOKU_ID = '".
           10  WK-GYOKU-ID-S       PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  計上基準日
           10  FILLER              PIC  X(22)
               VALUE  " AND KEIJOU_KIJUNBI < ".
           10  WK-KEIJOU-KIJUNBI-S PIC  S9(08).
      *---------- 別紙1-9 SQL
         05  WK-MSG-1-9.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZZI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)
               VALUE  " AND SEC_SBT_CD = '".
           10  WK-SEC-SBT-CD-S     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(15)
               VALUE  " AND MEG_CD = '".
           10  WK-MEG-CD-S         PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)
               VALUE  " AND TATE_FLG = '".
           10  WK-TATE-FLG-S       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)
               VALUE  " AND GYOKU_ID = '".
           10  WK-GYOKU-ID-S       PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  計上基準日
           10  FILLER              PIC  X(22)
               VALUE  " AND KEIJOU_KIJUNBI > ".
           10  WK-KAISI-KJN-YMD-S  PIC  S9(08).
           10  FILLER              PIC  X(22)
               VALUE  " AND KEIJOU_KIJUNBI < ".
           10  WK-SABON-UPDATE-FROM-S
                                   PIC  S9(08).
      *----------  原取引ID
           10  FILLER              PIC  X(16)
               VALUE  " AND TORI_ID = '".
           10  WK-TORI-ID-S        PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      ******************************************************************
      *        サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
      *----------  リターンパッケージセットルーチンコピー句
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
       01  PARM-SMZJ4014-INOUT.
           COPY  "SMZJ4014.cpy".
       01  PARM-SMZJ4012-INOUT.
           COPY  "SMZJ4012.cpy".
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *        連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ1610-INOUT.
           COPY  "SMZJ1610.cpy".
       01  PARM-SMZJ1610-RTNPKG.
      *----------  RTNパッケージ
         05  PARM-SMZJ1610-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *        PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ1610-INOUT
                  PARM-SMZJ1610-RTNPKG.
      ******************************************************************
      *        開始時残高計算
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  SMZJ1610  START  ****"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  SMZJ1610  END  ****"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *    3.1  前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  前処理  START  ****"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBLID-GET-RTN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  前処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1  初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  初期化処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  WORK-AREA
      *                FLG-AREA                                         @3212SEINO@@
                       HST-AREA
                       SQL-AREA
                       E-MSG-TBL
                       PARM-SCZY1170-IN
                       PARM-SCZY1170-RTNPKG
                       PARM-SCZY1160-INOUT
                       PARM-SMZJ4014-INOUT
                       PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
                       PARM-SMZJ1610-ARG2
                       PARM-SMZJ1610-ARG3
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----初回コール時のみFLAG-AREAを初期化する                        @SEINO@@
           IF  FIRST-SW = 'YES'                                         @SEINO@@
           THEN                                                         @SEINO@@
             INITIALIZE  FLG-AREA2                                      @3212SEINO@@
             MOVE  'NO '                TO  FIRST-SW                    @SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
           MOVE  CNS-RTN-000
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *---------- ワークリターンコード ← '000'(正常)
           MOVE  CNS-RTN-000            TO  WK-RTN-CD
      *---------- ARG2.異動データ-同一コスト継続フラグ
           MOVE  CNS-C0                 TO  IDO-DATA-SAME-COST-KZ-FLG
                                        OF  PARM-SMZJ1610-ARG2
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":WORK-AREA=["WORK-AREA"]"
      *D   DISPLAY  CNS-PGM-ID":FLG-AREA =["FLG-AREA "]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-AREA2 =["FLG-AREA2 "]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FIRST-SW            =["FIRST-SW"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":HST-AREA =["HST-AREA "]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA =["SQL-AREA "]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL=["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN    =["
      D             PARM-SCZY1170-IN    "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG=["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT =["
      D             PARM-SCZY1160-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1610-ARG2  =["
      D             PARM-SMZJ1610-ARG2  "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1610-ARG3  =["
      D             PARM-SMZJ1610-ARG3  "]"
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.異動データ-同一コスト継続フラグ=["
      D             IDO-DATA-SAME-COST-KZ-FLG  OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
      *---------- 銘柄別断面情報.処理実行日
           MOVE  SYORI-YMD              OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-SYORI-YMD
      *---------- 銘柄別断面情報.起動ID
           MOVE  KIDOU-ID               OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-KIDOU-ID
      *---------- 銘柄別断面情報.利用会社コード
           MOVE  RIYO-CMP-CD            OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-RIYO-CMP-CD
      *---------- 銘柄別断面情報.ファンドコード
           MOVE  FUND-CD                OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-FUND-CD
      *---------- 銘柄別断面情報.ポートフォリオコード
           MOVE  PTF-CD                 OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-PTF-CD
      *---------- 銘柄別断面情報.開始基準日
           MOVE  KAISI-KJN-YMD          OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-KAISI-KJN-YMD
      *---------- 銘柄別断面情報.基準日
           MOVE  KJN-YMD                OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-KJN-YMD
      *---------- 銘柄別断面情報.銘柄コード
           MOVE  MEG-CD                 OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-MEG-CD
      *---------- 銘柄別断面情報.証券種別コード
           MOVE  SEC-SBT-CD             OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-SEC-SBT-CD
      *---------- 銘柄別断面情報.資産負債・買建売建フラグ
           MOVE  TATE-FLG               OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-TATE-FLG
      *---------- 銘柄別断面情報.玉ID
           MOVE  GYOKU-ID               OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-GYOKU-ID
      *---------- 銘柄別断面情報.差分更新From日
           MOVE  SABON-UPDATE-FROM      OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-SABON-UPDATE-FROM
      *---------- 銘柄別断面情報.銘柄種類
           MOVE  MEG-CD-SHRU            OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-MEG-CD-SHRU
      *---------- 銘柄別断面情報.再計算区分
           MOVE  SAI-CALC-KBN           OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-SAI-CALC-KBN
      *---------- 銘柄別断面情報.銘柄種類２
           MOVE  MEG-CD-SHRU2           OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ1610-ARG1
             TO  WK-MEG-CD-SHRU2
      *---------- 約定ベース受渡順フラグ
           MOVE  YKJ-UKE-JUN-FLG        OF  PARM-SMZJ1610-ARG1
             TO  WK-YKJ-UKE-JUN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["WK-RIYO-CMP-CD "]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["WK-FUND-CD     "]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日=["WK-KAISI-KJN-YMD   "]"
      D    DISPLAY  CNS-PGM-ID":基準日    =["WK-KJN-YMD   "]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["WK-MEG-CD          "]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD  "]"
      D    DISPLAY  CNS-PGM-ID":資産負債.買建売建フラグ=["WK-TATE-FLG"]"
      D    DISPLAY  CNS-PGM-ID":玉ID=["WK-GYOKU-ID"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日=["WK-SABON-UPDATE-FROM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄種類  =["WK-MEG-CD-SHRU"]"
      D    DISPLAY  CNS-PGM-ID":再計算区分=["WK-SAI-CALC-KBN"]"
      D    DISPLAY  CNS-PGM-ID":銘柄種類２=["WK-MEG-CD-SHRU2"]"
      D    DISPLAY  CNS-PGM-ID":約定ベース受渡順フラグ=["
      D                         WK-YKJ-UKE-JUN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":****  初期化処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-RTNPKG
                       PARM-SCZY1160-INOUT
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  残高履歴テーブル
           MOVE  CNS-TBL-TKMZZR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  残高異動テーブル
           MOVE  CNS-TBL-TKMZZI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *----------  資金残履歴テーブル
           MOVE  CNS-TBL-TKMZSR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *----------  資金簿価異動テーブル
           MOVE  CNS-TBL-TKMZSI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *----------  元本残高テーブル
           MOVE  CNS-TBL-TKMZGZ00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
      *----------  前払金管理テーブル
           MOVE  CNS-TBL-TKMZMB00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(6)
      *----------  前払金管理計算データ
           MOVE  CNS-TBL-TKMZBW10
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(7)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1   "]"
      D    DISPLAY  CNS-PGM-ID":残高履歴テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":残高異動テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":資金残履歴テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":元本残高テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID":前払金管理テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID":前払金管理計算データ=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(7)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":COUNTER OF   PARM-RTNPKG=["
      D             COUNTER             OF   PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ワークテーブル残高履歴
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKMZZR00
      *----------  ワークテーブル残高異動
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TBL-TKMZZI00
      *----------  ワークテーブル資金残履歴
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TBL-TKMZSR00
      *----------  ワークテーブル資金簿価異動
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TBL-TKMZSI00
      *----------  ワークテーブル元本残高
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TBL-TKMZGZ00
      *----------  ワークテーブル前払金管理
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(6)
               TO  WK-TBL-TKMZMB00
      *----------  ワークテーブ前払金管理計算データ
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(7)
               TO  WK-TBL-TKMZBW10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークテーブル残高履歴 =["
      D             WK-TBL-TKMZZR00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル残高異動 =["
      D             WK-TBL-TKMZZI00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル資金残履歴 =["
      D             WK-TBL-TKMZSR00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル資金簿価異動 =["
      D             WK-TBL-TKMZSI00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル元本残高 =["
      D             WK-TBL-TKMZGZ00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル前払金管理 =["
      D             WK-TBL-TKMZMB00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブ前払金管理計算データ =["
      D             WK-TBL-TKMZBW10"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2  主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  主処理  START  ****"
      *-----------------------------------------------------------------
      *----------  対象銘柄チェック処理
           PERFORM  TASYOU-MEG-CHECK-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** 主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    対象銘柄チェック処理
      ******************************************************************
       TASYOU-MEG-CHECK-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄チェック処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.銘柄種類=["
      D             WK-MEG-CD-SHRU"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-MEG-CD-SHRU
      *----------  ARG1.銘柄別断面情報.銘柄種類＝1：物の場合
             WHEN  CNS-MEG-CD-SHRU-1
      *----------  3.2.2 対象銘柄は物の場合の処理
               PERFORM  TASYOU-MEG-MONO-RTN
      *----------  ARG1.銘柄別断面情報.銘柄種類＝3：資金の場合
             WHEN  CNS-MEG-CD-SHRU-3
      *----------  3.2.3 対象銘柄は資金の場合の処理
               PERFORM  TASYOU-MEG-SIKIN-RTN
      *----------  ARG1.銘柄別断面情報.銘柄種類＝2：元本の場合
             WHEN  CNS-MEG-CD-SHRU-2
      *----------  3.2.4 対象銘柄は元本の場合の処理
               PERFORM  TASYOU-MEG-GANPON-RTN
      *----------  3.2.5 対象銘柄は上記以外の場合
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-002
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-PARM-ERR
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄チェック処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TASYOU-MEG-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2 対象銘柄は物の場合の処理
      ******************************************************************
       TASYOU-MEG-MONO-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 対象銘柄は物の場合の処理  START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.差分更新From日=["
      D             WK-SABON-UPDATE-FROM "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.開始基準日=["
      D             WK-KAISI-KJN-YMD   "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.再計算区分 =["
      D             WK-SAI-CALC-KBN"]"
      D    DISPLAY  CNS-PGM-ID":AGR2.差分更新モード取得ルート区分 =["
      D             SABUN-UPD-GET-KBN   OF  PARM-SMZJ1610-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.銘柄種類２ =["
      D             WK-MEG-CD-SHRU2"]"
      *-----------------------------------------------------------------
           IF  WK-SABON-UPDATE-FROM  =  ZERO
           THEN
             IF  WK-KAISI-KJN-YMD  NOT=  ZERO
             THEN
      *---------- 3.2.2.1 1)残高履歴TBLから残高履歴情報を取得処理
               PERFORM  TKMZZR00-GET-RTN
             ELSE
               CONTINUE
             END-IF
      *---------- ARG1.銘柄別断面情報.銘柄種類２＝'2'(債券)の場合
             IF  WK-MEG-CD-SHRU2 = CNS-MEG-CD-SHRU2-2
             THEN
      *---------- 3.2.2.1 3) ①前払金管理TBLから前払金管理情報を取得処理
               PERFORM  TKMZMB00-INSERT1-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
      *---------- 3.2.2.2 1)残高異動TBLから残高異動情報を取得処理
             PERFORM  TKMZZI00-GET-RTN
      *---------- 4)AGR2.差分更新モード取得ルート区分≠1:残高の場合
             IF  SABUN-UPD-GET-KBN      OF  PARM-SMZJ1610-ARG2  NOT =
                 CNS-SABUN-UPD-GET-KBN-1
             THEN
               PERFORM  SABUN-UPD-GET-RTN
             ELSE
               CONTINUE
             END-IF
      *---------- 3.2.2.2 4) ARG1.銘柄別断面情報.銘柄種類２＝'2'(債券)の場合
             IF  WK-MEG-CD-SHRU2 = CNS-MEG-CD-SHRU2-2  AND
                 WK-MEG-CD-SHRU  = CNS-MEG-CD-SHRU-1
             THEN
      *---------- ①前払金管理TBLから前払金管理情報を取得処理
               PERFORM  TKMZMB00-INSERT2-RTN
             ELSE
               CONTINUE
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄は物の場合の処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TASYOU-MEG-MONO-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.1 1)残高履歴TBLから残高履歴情報を取得処理
      ******************************************************************
       TKMZZR00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 残高履歴情報を取得処理  START "
      *-----------------------------------------------------------------
      *----------  残高履歴 SELECT 作成
           PERFORM  TKMZZR00-SELECT-RTN
      *----------  残高履歴 CURSOR 作成
           PERFORM  TKMZZR00-OPEN-RTN
      *----------  残高履歴 FETCH 処理
           PERFORM  TKMZZR00-FETCH-RTN
      *----------  残高履歴 CURSOR CLOSE 処理
      ***  PERFORM  TKMZZR00-CLOSE-RTN                                  @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 残高履歴情報を取得処理  END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-GET-EXT.
           EXIT.
      ******************************************************************
      *    残高履歴 SELECT 作成
      ******************************************************************
       TKMZZR00-SELECT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴 SELECT 作成  START  ***"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZZR00-S,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-2
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZZR00-S,
                 WK-FUND-CD-S           OF  WK-MSG-1-2
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZZR00-S,
                 WK-PTF-CD-S            OF  WK-MSG-1-2
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZZR00-S,
                 WK-SEC-SBT-CD-S        OF  WK-MSG-1-2
      *---------- 銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZZR00-S,
                 WK-MEG-CD-S            OF  WK-MSG-1-2
      *---------- 資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZZR00-S,
                 WK-TATE-FLG-S          OF  WK-MSG-1-2
      *---------- 玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZZR00-S,
                 WK-GYOKU-ID-S          OF  WK-MSG-1-2
      *---------- 基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZZR00-S,
                 WK-KJN-YMD-S           OF  WK-MSG-1-2
      *---------- 残高履歴テーブル
           MOVE  WK-TBL-TKMZZR00
             TO  SQL-TBL-TKMZZR00       OF  SQL-SELECT-1-2,
                 WK-TKMZZR00            OF  WK-MSG-1-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD       OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD           OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD        OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD            OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID":玉ID=["
      D             H-GYOKU-ID          OF  H-TKMZZR00-S"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             H-KJN-YMD           OF  H-TKMZZR00-S"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT1                                         @3212SEINO@@
      *---------- ＳＱＬ文
           MOVE  SQL-SELECT-1-2         TO  SQLSTMT1                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ  =["     @3212SEINO@@
      D             FLG-TKMZZR00-CR-OPEN "]"                            @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZZR00-CR-OPEN = CNS-OFF                           @SEINO@@
           THEN                                                         @SEINO@@
           EXEC  SQL
             PREPARE  S1  FROM :SQLSTMT1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-003
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------DECLARE  残高履歴 CURSOR
           EXEC  SQL  DECLARE  TKMZZR00_CURSOR  CURSOR  FOR  S1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴 SELECT 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-SELECT-EXT.
           EXIT.
      ******************************************************************
      *    残高履歴 CURSOR 作成
      ******************************************************************
       TKMZZR00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴 CURSOR 作成  START  ***"
      *-----------------------------------------------------------------
      *----------OPEN  残高履歴 CURSOR
           EXEC  SQL
             OPEN  TKMZZR00_CURSOR
               USING :H-TKMZZR00-S.H-RIYO-CMP-CD,
                     :H-TKMZZR00-S.H-FUND-CD,
                     :H-TKMZZR00-S.H-PTF-CD,
                     :H-TKMZZR00-S.H-SEC-SBT-CD,
                     :H-TKMZZR00-S.H-MEG-CD,
                     :H-TKMZZR00-S.H-TATE-FLG,
                     :H-TKMZZR00-S.H-GYOKU-ID,
                     :H-TKMZZR00-S.H-KJN-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZZR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZR00-CR-OPEN  =["
      D             FLG-TKMZZR00-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-004
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴 CURSOR 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    残高履歴 FETCH 処理
      ******************************************************************
       TKMZZR00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高履歴 FETCH 処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZZR00
           EXEC SQL
               FETCH
                    TKMZZR00_CURSOR
               INTO :H-TKMZZR00
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-TKMZZR00
                 TO  TKMZZR00-PARM      OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":開始時残高履歴情報 =["
      D             TKMZZR00-PARM       OF  PARM-SMZJ1610-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨未収収益計上・戻入額 =["
      D             SJTK-MSSE-KJMIG     OF  H-TKMZZR00"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨未収収益計上・戻入額 =["
      D             UYTK-MSSE-KJMIG     OF  H-TKMZZR00"]"
      *-----------------------------------------------------------------
               IF  WK-SABON-UPDATE-FROM  NOT=  ZERO
               THEN
      *----------  AGR2.差分更新モード取得ルート区分
                 MOVE  CNS-SABUN-UPD-GET-KBN-1
                   TO  SABUN-UPD-GET-KBN  OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":AGR2.差分更新モード取得ルート区分 =["
      D             SABUN-UPD-GET-KBN   OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *----------  ワークリターンコード ← '113'(データ取得不能)
               MOVE  CNS-RTN-113        TO  WK-RTN-CD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード =["WK-RTN-CD"]"
      *-----------------------------------------------------------------
             WHEN   OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-005
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-2       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴 FETCH 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    残高履歴 CURSOR CLOSE 処理
      ******************************************************************
      *TKMZZR00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D   DISPLAY  CNS-PGM-ID":***残高履歴 CURSOR CLOSE 処理 START ***"
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZZR00-CR-OPEN=["
      *D             FLG-TKMZZR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZZR00_CURSOR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZZR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZZR00-CR-OPEN=["
      *D             FLG-TKMZZR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-006
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-2         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D   DISPLAY  CNS-PGM-ID":*** 残高履歴 CURSOR CLOSE 処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZZR00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    3.2.2.1 3)前払金管理TBLから前払金管理情報を取得処理
      ******************************************************************
       TKMZMB00-INSERT1-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 前払金管理情報を取得処理1  START "
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  WK-SYORI-YMD-S         OF  SQL-INSERT-1-7
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  WK-KIDOU-ID-S          OF  SQL-INSERT-1-7
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZMB00-S7,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-7
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZMB00-S7,
                 WK-FUND-CD-S           OF  WK-MSG-1-7
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZMB00-S7,
                 WK-PTF-CD-S            OF  WK-MSG-1-7
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZMB00-S7,
                 WK-SEC-SBT-CD-S        OF  WK-MSG-1-7
      *---------- 銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZMB00-S7,
                 WK-MEG-CD-S            OF  WK-MSG-1-7
      *---------- 資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZMB00-S7,
                 WK-TATE-FLG-S          OF  WK-MSG-1-7
      *---------- 玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZMB00-S7,
                 WK-GYOKU-ID-S          OF  WK-MSG-1-7
      *---------- 開始基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KAISI-KJN-YMD        OF  H-TKMZMB00-S7,
                 WK-KAISI-KJN-YMD-S     OF  WK-MSG-1-7
      *---------- 前払金管理計算データ
           MOVE  WK-TBL-TKMZBW10
             TO  SQL-TBL-TKMZBW10       OF  SQL-INSERT-1-7
      *---------- 前払金管理テーブル
           MOVE  WK-TBL-TKMZMB00
             TO  SQL-TBL-TKMZMB00       OF  SQL-INSERT-1-7,
                 WK-TKMZMB00            OF  WK-MSG-1-7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             WK-SYORI-YMD-S      OF  SQL-INSERT-1-7"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             WK-KIDOU-ID-S       OF  SQL-INSERT-1-7"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD       OF  H-TKMZMB00-S7"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD           OF  H-TKMZMB00-S7"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMZMB00-S7"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD        OF  H-TKMZMB00-S7"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD            OF  H-TKMZMB00-S7"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZMB00-S7"]"
      D    DISPLAY  CNS-PGM-ID":玉ID=["
      D             H-GYOKU-ID          OF  H-TKMZMB00-S7"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日=["
      D             H-KAISI-KJN-YMD     OF  H-TKMZMB00-S7"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
      *---------- ＳＱＬ文
           MOVE  SQL-INSERT-1-7         TO  SQLSTMT2                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT2=["SQLSTMT2"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ  =["   @3212SEINO@@
      D             FLG-TKMZBW10-S2-INSERT "]"                          @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @SEINO@@
           IF  FLG-TKMZBW10-S2-INSERT = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
           EXEC  SQL
               PREPARE  S2  FROM :SQLSTMT2                              @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-007
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  SQL-INSERT         OF  SQL-INSERT-1-7,
                     SQL-SELECT-1-7,
                     WK-MSG-1-7         DELIMITED  BY SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
           EXEC SQL
               EXECUTE S2
                 USING :H-TKMZMB00-S7
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-INSERT1=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW10-S2-INSERT      @SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ  =["   @3212SEINO@@
      D             FLG-TKMZBW10-S2-INSERT "]"                          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               CONTINUE
             WHEN  CNS-SQL-UNIQUE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-008
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  SQL-INSERT       OF  SQL-INSERT-1-7,
                       SQL-SELECT-1-7,
                       WK-MSG-1-7       DELIMITED  BY SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-009
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  SQL-INSERT       OF  SQL-INSERT-1-7,
                       SQL-SELECT-1-7,
                       WK-MSG-1-7       DELIMITED  BY SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 前払金管理情報を取得処理1  END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMB00-INSERT1-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.2 残高異動TBLから残高異動情報を取得処理
      ******************************************************************
       TKMZZI00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 残高異動情報を取得処理  START "
      D    DISPLAY  CNS-PGM-ID":WK-YKJ-UKE-JUN-FLG=["                   @3212SEINO@@
      D             WK-YKJ-UKE-JUN-FLG "]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-YKJ-UKE-JUN-FLG  = CNS-C1                             @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  残高異動 SELECT 作成                                 @3212SEINO@@
             PERFORM  TKMZZI00-SELECT-A-RTN                             @3212SEINO@@
      *----------  残高異動 CURSOR 作成                                 @3212SEINO@@
             PERFORM  TKMZZI00-OPEN-A-RTN                               @3212SEINO@@
      *----------  残高異動 FETCH 処理                                  @3212SEINO@@
             PERFORM  TKMZZI00-FETCH-A-RTN                              @3212SEINO@@
           ELSE                                                         @3212SEINO@@
      *----------  残高異動 SELECT 作成                                 @3212SEINO@@
             PERFORM  TKMZZI00-SELECT-B-RTN                             @3212SEINO@@
      *----------  残高異動 CURSOR 作成                                 @3212SEINO@@
             PERFORM  TKMZZI00-OPEN-B-RTN                               @3212SEINO@@
      *----------  残高異動 FETCH 処理                                  @3212SEINO@@
             PERFORM  TKMZZI00-FETCH-B-RTN                              @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *----------  残高異動 CURSOR CLOSE 処理
      *    PERFORM  TKMZZI00-CLOSE-RTN                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 残高異動情報を取得処理  END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-GET-EXT.
           EXIT.
      ******************************************************************
      *    4)AGR2.差分更新モード取得ルート区分≠1:残高の場合
      ******************************************************************
       SABUN-UPD-GET-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": AGR2.差分更新モード取得ルート区分≠1:残高の場合 "
      *-----------------------------------------------------------------
           PERFORM  SMZJ4014-CALL-RTN
           IF  WK-BUY-SEC-SBT-KBN  =  CNS-C1
           THEN
      *----------  A)取引事由判定
             MOVE  TORI-JIYU            OF  TKMZZI00-PARM
                                        OF  PARM-SMZJ1610-ARG2
               TO  WK-SMZJ4012-TORI-JIYU
             PERFORM  SMZJ4012-CALL-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.異動計算パターン情報-売り続く限り"
      D    "同一コスト=["URI-TUDUKU-SAME-COST  OF  PARM-SMZJ1610-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク売買フラグ=["WK-URIKAI-FLG"]"
      *-----------------------------------------------------------------
      *----------  B)◆ARG1.異動計算パターン情報-売り続く限り同一コスト＝'1':YES 且つ
      *              ワーク売買フラグ＝'2'（無視）の場合
             IF  URI-TUDUKU-SAME-COST  OF  PARM-SMZJ1610-ARG1 = CNS-C1
             AND WK-URIKAI-FLG = CNS-C2
             THEN
               PERFORM  TKMZZI00-GET-9-RTN
             ELSE
      *----------  ワーク売り続く中間.取引事由
               MOVE  TORI-JIYU          OF  TKMZZI00-PARM
                                        OF  PARM-SMZJ1610-ARG2
                 TO  WK-TORI-JIYU       OF  WK-CHUKAN-CHI
      *----------  ワーク売り続く中間.市場通貨払出単価
               MOVE  SJTK-H-TNK         OF  TKMZZI00-PARM
                                        OF  PARM-SMZJ1610-ARG2
                 TO  WK-SJTK-H-TNK      OF  WK-CHUKAN-CHI
      *----------  ワーク売り続く中間.運用通貨払出単価
               MOVE  UYTK-H-TNK         OF  TKMZZI00-PARM
                                        OF  PARM-SMZJ1610-ARG2
                 TO  WK-UYTK-H-TNK      OF  WK-CHUKAN-CHI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.取引事由         = ["
      D             WK-TORI-JIYU        OF  WK-CHUKAN-CHI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.市場通貨払出単価 = ["
      D             WK-SJTK-H-TNK       OF  WK-CHUKAN-CHI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.運用通貨払出単価 = ["
      D             WK-UYTK-H-TNK       OF  WK-CHUKAN-CHI"]"
      *-----------------------------------------------------------------
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.売り続く無効時代用データなし区分=["
      D    URI-TUDUKU-MKJD-NODATA-KBN   OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
      *----------  C)ARG2.売り続く無効時代用データなし区分≠1の場合
             IF  URI-TUDUKU-MKJD-NODATA-KBN   OF  PARM-SMZJ1610-ARG2
                 NOT =  CNS-1
             THEN
               MOVE  WK-TORI-JIYU       OF  WK-CHUKAN-CHI
                 TO  WK-SMZJ4012-TORI-JIYU
               PERFORM  SMZJ4012-CALL-RTN
             ELSE
               CONTINUE
             END-IF
      *----------  D)ARG2.売り続く無効時代用データなし区分≠1の場合
             IF  URI-TUDUKU-MKJD-NODATA-KBN   OF  PARM-SMZJ1610-ARG2
                 NOT =  CNS-1
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.異動計算パターン情報-売り続く限り"
      D    "同一コスト=["URI-TUDUKU-SAME-COST  OF  PARM-SMZJ1610-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク売買フラグ=["WK-URIKAI-FLG"]"
      *-----------------------------------------------------------------
               IF  URI-TUDUKU-SAME-COST  OF  PARM-SMZJ1610-ARG1 = CNS-C1
               AND WK-URIKAI-FLG = CNS-C1
               THEN
      *----------  ARG2.異動データ-同一コスト継続フラグ
                 MOVE  CNS-C1
                   TO  IDO-DATA-SAME-COST-KZ-FLG  OF  PARM-SMZJ1610-ARG2
               ELSE
      *----------  ARG2.異動データ-同一コスト継続フラグ
                 MOVE  CNS-C0
                   TO  IDO-DATA-SAME-COST-KZ-FLG  OF  PARM-SMZJ1610-ARG2
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.異動データ-同一コスト継続フラグ=["
      D    IDO-DATA-SAME-COST-KZ-FLG    OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.異動データ-同一コスト継続フラグ=["
      D    IDO-DATA-SAME-COST-KZ-FLG    OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
      *----------  E)ARG2.異動データ-同一コスト継続フラグ＝'1'の場合
             IF  IDO-DATA-SAME-COST-KZ-FLG    OF  PARM-SMZJ1610-ARG2 =
                 CNS-C1
             THEN
      *----------  ARG2.開始時残高異動情報.市場通貨払出単価
               MOVE  WK-SJTK-H-TNK      OF  WK-CHUKAN-CHI
                 TO  SJTK-H-TNK         OF  TKMZZI00-PARM
                                        OF  PARM-SMZJ1610-ARG2
      *----------  ARG2.開始時残高異動情報.運用通貨払出単価
               MOVE  WK-UYTK-H-TNK      OF  WK-CHUKAN-CHI
                 TO  UYTK-H-TNK         OF  TKMZZI00-PARM
                                        OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.開始時残高異動情報.市場通貨払出"
      D    "単価 = ["SJTK-H-TNK         OF  TKMZZI00-PARM
      D                                 OF  PARM-SMZJ1610-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.開始時残高異動情報.運用通貨払出"
      D    "単価 = ["UYTK-H-TNK         OF  TKMZZI00-PARM
      D                                 OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": AGR2.差分更新モード取得ルート区分≠1  END "
      *-----------------------------------------------------------------
           CONTINUE.
       SABUN-UPD-GET-EXT.
           EXIT.
      ******************************************************************
      *     ①証券種別判断
      ******************************************************************
       SMZJ4014-CALL-RTN      SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ": ①証券種別判断  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ4014-INOUT
                       PARM-RTNPKG
      *----------  証券種別コード
           MOVE  SEC-SBT-CD             OF  TKMZZI00-PARM
                                        OF  PARM-SMZJ1610-ARG2
             TO  SEC-SBT-CD             OF  PARM-SMZJ4014-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-A
             TO  HANTEI-TARGET-KBN      OF  PARM-SMZJ4014-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":証券種別コード             =["
      D             SEC-SBT-CD          OF  PARM-SMZJ4014-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分               =["
      D             HANTEI-TARGET-KBN   OF  PARM-SMZJ4014-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ4014"             USING  PARM-SMZJ4014-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":売り続く証券種別区分     =["
      D             BUY-SEC-SBT-KBN     OF  PARM-SMZJ4014-ARG2"]"
      *-----------------------------------------------------------------
           MOVE  BUY-SEC-SBT-KBN        OF  PARM-SMZJ4014-ARG2
             TO  WK-BUY-SEC-SBT-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク売り続く証券区別区分=["
      D             WK-BUY-SEC-SBT-KBN"]"
      D    DISPLAY  CNS-PGM-ID ": ①証券種別判断  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ4014-CALL-EXT.
           EXIT.
      ******************************************************************
      *     取引事由判定
      ******************************************************************
       SMZJ4012-CALL-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   取引事由判定 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-SMZJ4012-TORI-JIYU
             TO  TORI-JIYU              OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-C6
             TO  HANTEI-TARGET-KBN      OF  PARM-SMZJ4012-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引事由=["
      D             TORI-JIYU           OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":判定対象区分=["
      D             HANTEI-TARGET-KBN   OF  PARM-SMZJ4012-ARG1"]"
      *-------------------<DEBUG>---------------------------------------
      *---------- 【SMZJ4012】取引事由判定をコールして、リターンパッケージを取得する
           CALL  "SMZJ4012"             USING  PARM-SMZJ4012-INOUT
                                               PARM-RTNPKG
      *---------- ワーク売買フラグ
           MOVE  URIKAI-FLG             OF  PARM-SMZJ4012-ARG2
             TO  WK-URIKAI-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク売買フラグ =["WK-URIKAI-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":***   取引事由判定 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ4012-CALL-EXT.
           EXIT.
      ******************************************************************
      *    別紙1-9 SQL
      ******************************************************************
       TKMZZI00-GET-9-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 直近残高異動情報を取得する処理  START "
      D    DISPLAY  CNS-PGM-ID":ARG1.約定ベース受渡順フラグ=["          @3212SEINO@@
      D             WK-YKJ-UKE-JUN-FLG"]"                               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-YKJ-UKE-JUN-FLG  = CNS-C1                             @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  残高異動 SELECT 作成                                 @3212SEINO@@
             PERFORM  TKMZZI00-SEL-9A-RTN                               @3212SEINO@@
      *----------  残高異動 CURSOR 作成                                 @3212SEINO@@
             PERFORM  TKMZZI00-OPEN-9A-RTN                              @3212SEINO@@
      *----------  残高異動 FETCH 処理                                  @3212SEINO@@
             PERFORM  TKMZZI00-FET-9A-RTN                               @3212SEINO@@
           ELSE                                                         @3212SEINO@@
      *----------  残高異動 SELECT 作成                                 @3212SEINO@@
             PERFORM  TKMZZI00-SEL-9B-RTN                               @3212SEINO@@
      *----------  残高異動 CURSOR 作成                                 @3212SEINO@@
             PERFORM  TKMZZI00-OPEN-9B-RTN                              @3212SEINO@@
      *----------  残高異動 FETCH 処理                                  @3212SEINO@@
             PERFORM  TKMZZI00-FET-9B-RTN                               @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *----------  残高異動 CURSOR CLOSE 処理
      *    PERFORM  TKMZZI00-CLO-9-RTN                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 直近残高異動情報を取得する処理  END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-GET-9-EXT.
           EXIT.
      ******************************************************************
      *    残高異動 SELECT 作成
      ******************************************************************
       TKMZZI00-SEL-9A-RTN    SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 SELECT 作成  START  ***"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZZI00-S9,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-9
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZZI00-S9,
                 WK-FUND-CD-S           OF  WK-MSG-1-9
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZZI00-S9,
                 WK-PTF-CD-S            OF  WK-MSG-1-9
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZZI00-S9,
                 WK-SEC-SBT-CD-S        OF  WK-MSG-1-9
      *---------- 銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZZI00-S9,
                 WK-MEG-CD-S            OF  WK-MSG-1-9
      *---------- 資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZZI00-S9,
                 WK-TATE-FLG-S          OF  WK-MSG-1-9
      *---------- 玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZZI00-S9,
                 WK-GYOKU-ID-S          OF  WK-MSG-1-9
      *---------- 開始基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KAISI-KJN-YMD        OF  H-TKMZZI00-S9,
                 WK-KAISI-KJN-YMD-S     OF  WK-MSG-1-9
      *---------- 差分更新From日
           MOVE  WK-SABON-UPDATE-FROM
             TO  H-SABON-UPDATE-FROM    OF  H-TKMZZI00-S9,
                 WK-SABON-UPDATE-FROM-S OF  WK-MSG-1-9
      *---------- 原取引ID
           MOVE  TORI-ID                OF  TKMZZI00-PARM
                                        OF  PARM-SMZJ1610-ARG2
             TO  H-TORI-ID              OF  H-TKMZZI00-S9,
                 WK-TORI-ID-S           OF  WK-MSG-1-9
      *---------- 残高異動テーブル
           MOVE  WK-TBL-TKMZZI00
             TO  SQL-TBL-TKMZZI00       OF  SQL-SELECT-1-9,
                 WK-TKMZZI00            OF  WK-MSG-1-9
           MOVE  CNS-UKE-YMD                                            @3212SEINO@@
             TO  WK-ORDER-BY            OF  SQL-SELECT-1-9              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード      = ["
      D             H-RIYO-CMP-CD       OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      = ["
      D             H-FUND-CD           OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード= ["
      D             H-PTF-CD            OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード      = ["
      D             H-SEC-SBT-CD        OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          = ["
      D             H-MEG-CD            OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                = ["
      D             H-GYOKU-ID          OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日          = ["
      D             H-KAISI-KJN-YMD     OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日      = ["
      D             H-SABON-UPDATE-FROM OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":原取引ID            = ["
      D             H-TORI-ID           OF  H-TKMZZI00-S9"]"
      D    DISPLAY  CNS-PGM-ID":WK-ORDER-BY         = ["
      D             WK-ORDER-BY         OF  SQL-SELECT-1-9"]"
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-9=["SQL-SELECT-1-9"]"
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-9    =["WK-MSG-1-9"]"
      *-----------------------------------------------------------------
      ***  INITIALIZE  SQLSTMT                                          @SEINO@@
           INITIALIZE  SQLSTMT9A                                        @3212SEINO@@
      *---------- ＳＱＬ文
      ***  MOVE  SQL-SELECT-1-9         TO  SQLSTMT                     @SEINO@@
           MOVE  SQL-SELECT-1-9         TO  SQLSTMT9A                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                    @SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT9A=["SQLSTMT9A"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":直近残高異動カーソルオープンフラグA=["  @3212SEINO@@
      D             FLG-TKMZZI00-CR9A-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***      PREPARE  S9  FROM :SQLSTMT                               @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZZI00-CR9A-OPEN  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL                                                    @SEINO@@
               PREPARE  S9  FROM :SQLSTMT9A                             @3212SEINO@@
           END-EXEC                                                     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=[" SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-010
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------DECLARE  残高異動 CURSOR
           EXEC  SQL  DECLARE  TKMZZI00_CUR9A  CURSOR  FOR  S9 END-EXEC @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR  DECLARE)=[" SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 SELECT 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-SEL-9A-EXT.                                             @3212SEINO@@
           EXIT.
      ******************************************************************
      *    残高異動 CURSOR 作成
      ******************************************************************
       TKMZZI00-OPEN-9A-RTN   SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 CURSOR 作成  START  ***"
      *-----------------------------------------------------------------
      *----------OPEN  残高異動 CURSOR
           EXEC  SQL
             OPEN  TKMZZI00_CUR9A                                       @3212SEINO@@
               USING :H-TKMZZI00-S9.H-RIYO-CMP-CD,
                     :H-TKMZZI00-S9.H-FUND-CD,
                     :H-TKMZZI00-S9.H-PTF-CD,
                     :H-TKMZZI00-S9.H-SEC-SBT-CD,
                     :H-TKMZZI00-S9.H-MEG-CD,
                     :H-TKMZZI00-S9.H-TATE-FLG,
                     :H-TKMZZI00-S9.H-GYOKU-ID,
                     :H-TKMZZI00-S9.H-KAISI-KJN-YMD,
                     :H-TKMZZI00-S9.H-SABON-UPDATE-FROM,
                     :H-TKMZZI00-S9.H-TORI-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZZI00-CR9A-OPEN      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR9A-OPEN  =["             @3212SEINO@@
      D             FLG-TKMZZI00-CR9A-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-011
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 CURSOR 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-OPEN-9A-EXT.
           EXIT.
      ******************************************************************
      *    残高異動 FETCH 処理
      ******************************************************************
       TKMZZI00-FET-9A-RTN    SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高異動 FETCH 処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZZI00-9
           EXEC SQL
               FETCH
                    TKMZZI00_CUR9A                                      @3212SEINO@@
               INTO :H-TKMZZI00-9
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  ワーク売り続く中間.取引事由
               MOVE  H-TORI-JIYU        OF  H-TKMZZI00-9
                 TO  WK-TORI-JIYU       OF  WK-CHUKAN-CHI
      *----------  ワーク売り続く中間.市場通貨払出単価
               MOVE  H-SJTK-H-TNK       OF  H-TKMZZI00-9
                 TO  WK-SJTK-H-TNK      OF  WK-CHUKAN-CHI
      *----------  ワーク売り続く中間.運用通貨払出単価
               MOVE  H-UYTK-H-TNK       OF  H-TKMZZI00-9
                 TO  WK-UYTK-H-TNK      OF  WK-CHUKAN-CHI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.取引事由         = ["
      D             WK-TORI-JIYU        OF  WK-CHUKAN-CHI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.市場通貨払出単価 = ["
      D             WK-SJTK-H-TNK       OF  WK-CHUKAN-CHI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.運用通貨払出単価 = ["
      D             WK-UYTK-H-TNK       OF  WK-CHUKAN-CHI"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------  ARG2.売り続く無効時代用データなし区分
               MOVE  CNS-1
                 TO  URI-TUDUKU-MKJD-NODATA-KBN   OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.売り続く無効時代用データなし区分=["
      D    URI-TUDUKU-MKJD-NODATA-KBN   OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
             WHEN   OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-012
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 FETCH 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-FET-9A-EXT.                                             @3212SEINO@@
           EXIT.
      ******************************************************************@3212SEINO@@
      *    残高異動 SELECT 作成                                         @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMZZI00-SEL-9B-RTN    SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 SELECT 作成  START  ***"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *---------- 利用会社コード                                        @3212SEINO@@
           MOVE  WK-RIYO-CMP-CD                                         @3212SEINO@@
             TO  H-RIYO-CMP-CD          OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- ファンドコード                                        @3212SEINO@@
           MOVE  WK-FUND-CD                                             @3212SEINO@@
             TO  H-FUND-CD              OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-FUND-CD-S           OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- ポートフォリオコード                                  @3212SEINO@@
           MOVE  WK-PTF-CD                                              @3212SEINO@@
             TO  H-PTF-CD               OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-PTF-CD-S            OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- 証券種別コード                                        @3212SEINO@@
           MOVE  WK-SEC-SBT-CD                                          @3212SEINO@@
             TO  H-SEC-SBT-CD           OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-SEC-SBT-CD-S        OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- 銘柄コード                                            @3212SEINO@@
           MOVE  WK-MEG-CD                                              @3212SEINO@@
             TO  H-MEG-CD               OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-MEG-CD-S            OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- 資産/負債・買建/売建フラグ                            @3212SEINO@@
           MOVE  WK-TATE-FLG                                            @3212SEINO@@
             TO  H-TATE-FLG             OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-TATE-FLG-S          OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- 玉ID                                                  @3212SEINO@@
           MOVE  WK-GYOKU-ID                                            @3212SEINO@@
             TO  H-GYOKU-ID             OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-GYOKU-ID-S          OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- 開始基準日                                            @3212SEINO@@
           MOVE  WK-KAISI-KJN-YMD                                       @3212SEINO@@
             TO  H-KAISI-KJN-YMD        OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-KAISI-KJN-YMD-S     OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- 差分更新From日                                        @3212SEINO@@
           MOVE  WK-SABON-UPDATE-FROM                                   @3212SEINO@@
             TO  H-SABON-UPDATE-FROM    OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-SABON-UPDATE-FROM-S OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- 原取引ID                                              @3212SEINO@@
           MOVE  TORI-ID                OF  TKMZZI00-PARM               @3212SEINO@@
                                        OF  PARM-SMZJ1610-ARG2          @3212SEINO@@
             TO  H-TORI-ID              OF  H-TKMZZI00-S9,              @3212SEINO@@
                 WK-TORI-ID-S           OF  WK-MSG-1-9                  @3212SEINO@@
      *---------- 残高異動テーブル                                      @3212SEINO@@
           MOVE  WK-TBL-TKMZZI00                                        @3212SEINO@@
             TO  SQL-TBL-TKMZZI00       OF  SQL-SELECT-1-9,             @3212SEINO@@
                 WK-TKMZZI00            OF  WK-MSG-1-9                  @3212SEINO@@
           MOVE  CNS-KEIJOU-KIJUNBI                                     @3212SEINO@@
             TO  WK-ORDER-BY            OF  SQL-SELECT-1-9              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":利用会社コード      = ["                @3212SEINO@@
      D             H-RIYO-CMP-CD       OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ファンドコード      = ["                @3212SEINO@@
      D             H-FUND-CD           OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード= ["                @3212SEINO@@
      D             H-PTF-CD            OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":証券種別コード      = ["                @3212SEINO@@
      D             H-SEC-SBT-CD        OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄コード          = ["                @3212SEINO@@
      D             H-MEG-CD            OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["           @3212SEINO@@
      D             H-TATE-FLG          OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":玉ID                = ["                @3212SEINO@@
      D             H-GYOKU-ID          OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":開始基準日          = ["                @3212SEINO@@
      D             H-KAISI-KJN-YMD     OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":差分更新From日      = ["                @3212SEINO@@
      D             H-SABON-UPDATE-FROM OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":原取引ID            = ["                @3212SEINO@@
      D             H-TORI-ID           OF  H-TKMZZI00-S9"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-ORDER-BY         = ["                @3212SEINO@@
      D             WK-ORDER-BY         OF  SQL-SELECT-1-9"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-9=["SQL-SELECT-1-9"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-9    =["WK-MSG-1-9"]"          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      ***  INITIALIZE  SQLSTMT                                          @3212SEINO@@
           INITIALIZE  SQLSTMT9B                                        @3212SEINO@@
      *---------- ＳＱＬ文                                              @3212SEINO@@
      ***  MOVE  SQL-SELECT-1-9         TO  SQLSTMT                     @3212SEINO@@
           MOVE  SQL-SELECT-1-9         TO  SQLSTMT9B                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT9B=["SQLSTMT9B"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":直近残高異動カーソルオープンフラグB=["  @3212SEINO@@
      D             FLG-TKMZZI00-CR9B-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      ***  EXEC  SQL                                                    @3212SEINO@@
      ***      PREPARE  S9  FROM :SQLSTMT                               @3212SEINO@@
      ***  END-EXEC                                                     @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZZI00-CR9B-OPEN  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL                                                    @3212SEINO@@
               PREPARE  S10  FROM :SQLSTMT9B                            @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=[" SQLCODE"]"          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEINO@@
           THEN                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           ELSE                                                         @3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
             MOVE  CNS-PGM-ID                                           @3212SEINO@@
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
             MOVE  CNS-POS-013                                          @3212SEINO@@
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
             MOVE  CNS-RTN-900                                          @3212SEINO@@
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
             MOVE  SQLCODE                                              @3212SEINO@@
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
             MOVE  CNS-DETAIL-1                                         @3212SEINO@@
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
             STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
                     WK-MSG-1-9         DELIMITED  BY  SIZE             @3212SEINO@@
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
             PERFORM  ERR-RTN                                           @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------DECLARE  残高異動 CURSOR                               @3212SEINO@@
           EXEC  SQL  DECLARE  TKMZZI00_CUR9B  CURSOR  FOR  S10 END-EXEC@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR  DECLARE)=[" SQLCODE"]"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 SELECT 作成  END  ***"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMZZI00-SEL-9B-EXT.                                             @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *    残高異動 CURSOR 作成                                         @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMZZI00-OPEN-9B-RTN   SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 CURSOR 作成  START  ***"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------OPEN  残高異動 CURSOR                                  @3212SEINO@@
           EXEC  SQL                                                    @3212SEINO@@
             OPEN  TKMZZI00_CUR9B                                       @3212SEINO@@
               USING :H-TKMZZI00-S9.H-RIYO-CMP-CD,                      @3212SEINO@@
                     :H-TKMZZI00-S9.H-FUND-CD,                          @3212SEINO@@
                     :H-TKMZZI00-S9.H-PTF-CD,                           @3212SEINO@@
                     :H-TKMZZI00-S9.H-SEC-SBT-CD,                       @3212SEINO@@
                     :H-TKMZZI00-S9.H-MEG-CD,                           @3212SEINO@@
                     :H-TKMZZI00-S9.H-TATE-FLG,                         @3212SEINO@@
                     :H-TKMZZI00-S9.H-GYOKU-ID,                         @3212SEINO@@
                     :H-TKMZZI00-S9.H-KAISI-KJN-YMD,                    @3212SEINO@@
                     :H-TKMZZI00-S9.H-SABON-UPDATE-FROM,                @3212SEINO@@
                     :H-TKMZZI00-S9.H-TORI-ID                           @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN)   =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-ON               TO  FLG-TKMZZI00-CR9B-OPEN      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR9B-OPEN  =["             @3212SEINO@@
      D             FLG-TKMZZI00-CR9B-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           ELSE                                                         @3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
             MOVE  CNS-PGM-ID                                           @3212SEINO@@
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
             MOVE  CNS-POS-014                                          @3212SEINO@@
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
             MOVE  CNS-RTN-900                                          @3212SEINO@@
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
             MOVE  SQLCODE                                              @3212SEINO@@
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
             MOVE  CNS-DETAIL-1                                         @3212SEINO@@
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
             STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
                     WK-MSG-1-9         DELIMITED  BY  SIZE             @3212SEINO@@
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
             PERFORM  ERR-RTN                                           @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 CURSOR 作成  END  ***"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMZZI00-OPEN-9B-EXT.                                            @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *    残高異動 FETCH 処理                                          @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMZZI00-FET-9B-RTN    SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 残高異動 FETCH 処理  START  ***"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE                   H-TKMZZI00-9                    @3212SEINO@@
           EXEC SQL                                                     @3212SEINO@@
               FETCH                                                    @3212SEINO@@
                    TKMZZI00_CUR9B                                      @3212SEINO@@
               INTO :H-TKMZZI00-9                                       @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE(FETCH)=["SQLCODE"]"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           EVALUATE  SQLCODE                                            @3212SEINO@@
             WHEN  CNS-SQL-NORMAL                                       @3212SEINO@@
      *----------  ワーク売り続く中間.取引事由                          @3212SEINO@@
               MOVE  H-TORI-JIYU        OF  H-TKMZZI00-9                @3212SEINO@@
                 TO  WK-TORI-JIYU       OF  WK-CHUKAN-CHI               @3212SEINO@@
      *----------  ワーク売り続く中間.市場通貨払出単価                  @3212SEINO@@
               MOVE  H-SJTK-H-TNK       OF  H-TKMZZI00-9                @3212SEINO@@
                 TO  WK-SJTK-H-TNK      OF  WK-CHUKAN-CHI               @3212SEINO@@
      *----------  ワーク売り続く中間.運用通貨払出単価                  @3212SEINO@@
               MOVE  H-UYTK-H-TNK       OF  H-TKMZZI00-9                @3212SEINO@@
                 TO  WK-UYTK-H-TNK      OF  WK-CHUKAN-CHI               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.取引事由         = ["@3212SEINO@@
      D             WK-TORI-JIYU        OF  WK-CHUKAN-CHI"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.市場通貨払出単価 = ["@3212SEINO@@
      D             WK-SJTK-H-TNK       OF  WK-CHUKAN-CHI"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ワーク売り続く中間.運用通貨払出単価 = ["@3212SEINO@@
      D             WK-UYTK-H-TNK       OF  WK-CHUKAN-CHI"]"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND                                     @3212SEINO@@
      *----------  ARG2.売り続く無効時代用データなし区分                @3212SEINO@@
               MOVE  CNS-1                                              @3212SEINO@@
                 TO  URI-TUDUKU-MKJD-NODATA-KBN   OF  PARM-SMZJ1610-ARG2@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ARG2.売り続く無効時代用データなし区分=["@3212SEINO@@
      D    URI-TUDUKU-MKJD-NODATA-KBN   OF  PARM-SMZJ1610-ARG2"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN   OTHER                                               @3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
               MOVE  CNS-PGM-ID                                         @3212SEINO@@
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
               MOVE  CNS-POS-015                                        @3212SEINO@@
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
               MOVE  CNS-RTN-900                                        @3212SEINO@@
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
               MOVE  SQLCODE                                            @3212SEINO@@
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
               MOVE  CNS-DETAIL-1                                       @3212SEINO@@
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
               STRING  CNS-SQL-MSG-SELECT,                              @3212SEINO@@
                       WK-MSG-1-9       DELIMITED  BY  SIZE             @3212SEINO@@
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
               PERFORM  ERR-RTN                                         @3212SEINO@@
           END-EVALUATE                                                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 FETCH 処理  END  ***"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMZZI00-FET-9B-EXT.                                             @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *    残高異動 CURSOR CLOSE 処理
      ******************************************************************
      *TKMZZI00-CLO-9-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D   DISPLAY  CNS-PGM-ID":***残高異動 CURSOR CLOSE 処理 START ***"
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR9-OPEN=["
      *D             FLG-TKMZZI00-CR9-OPEN"]"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZZI00_CUR9
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE(CLOSE)   =[" SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR9-OPEN
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR9-OPEN=["
      *D             FLG-TKMZZI00-CR9-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-013
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-9         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D   DISPLAY  CNS-PGM-ID":*** 残高異動 CURSOR CLOSE 処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZZI00-CLO-9-EXT.
      *    EXIT.
      ******************************************************************
      *    残高異動 SELECT 作成
      ******************************************************************
       TKMZZI00-SELECT-A-RTN  SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 SELECT 作成  START  ***"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZZI00-S,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-3
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZZI00-S,
                 WK-FUND-CD-S           OF  WK-MSG-1-3
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZZI00-S,
                 WK-PTF-CD-S            OF  WK-MSG-1-3
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZZI00-S,
                 WK-SEC-SBT-CD-S        OF  WK-MSG-1-3
      *---------- 銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZZI00-S,
                 WK-MEG-CD-S            OF  WK-MSG-1-3
      *---------- 資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZZI00-S,
                 WK-TATE-FLG-S          OF  WK-MSG-1-3
      *---------- 玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZZI00-S,
                 WK-GYOKU-ID-S          OF  WK-MSG-1-3
      *---------- 開始基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KEIJOU-KIJUNBI-MIN   OF  H-TKMZZI00-S,
                 WK-KAISI-KJN-YMD-MIN-S OF  WK-MSG-1-3
      *---------- 差分更新From日
           MOVE  WK-SABON-UPDATE-FROM
             TO  H-KEIJOU-KIJUNBI       OF  H-TKMZZI00-S,
                 WK-KAISI-KJN-YMD-S     OF  WK-MSG-1-3
      *---------- 残高異動テーブル
           MOVE  WK-TBL-TKMZZI00
             TO  SQL-TBL-TKMZZI00-1     OF  SQL-SELECT-1-3,
                 SQL-TBL-TKMZZI00-2     OF  SQL-SELECT-1-3,
                 WK-TKMZZI00            OF  WK-MSG-1-3
           MOVE  CNS-UKE-YMD                                            @3212SEINO@@
             TO  WK-ORDER-BY            OF  SQL-SELECT-1-3,             @3212SEINO@@
                 WK-ORDER-BY            OF  WK-MSG-1-3                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD       OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD           OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD        OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD            OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":玉ID=["
      D             H-GYOKU-ID          OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日=["
      D             H-KEIJOU-KIJUNBI-MIN OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日=["
      D             H-KEIJOU-KIJUNBI    OF  H-TKMZZI00-S"]"
      D    DISPLAY  CNS-PGM-ID":WK-YKJ-UKE-JUN-FLG=["
      D             WK-YKJ-UKE-JUN-FLG "]"
      D    DISPLAY  CNS-PGM-ID":WK-ORDER-BY=["
      D             WK-ORDER-BY  OF  SQL-SELECT-1-3 "]"
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-3=["SQL-SELECT-1-3"]"
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-3=["WK-MSG-1-3"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT3A                                        @3212SEINO@@
      *---------- ＳＱＬ文
           MOVE  SQL-SELECT-1-3         TO  SQLSTMT3A                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT3A=["SQLSTMT3A"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグA =["     @3212SEINO@@
      D             FLG-TKMZZI00-CRA-OPEN "]"                           @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZZI00-CRA-OPEN  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL
               PREPARE  S3  FROM :SQLSTMT3A                             @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-016
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------DECLARE  残高異動 CURSOR
           EXEC  SQL
               DECLARE  TKMZZI00_CURSOR_A  CURSOR  FOR  S3              @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR  DECLARE)=[" SQLCODE "]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 SELECT 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-SELECT-A-EXT.                                           @3212SEINO@@
           EXIT.
      ******************************************************************
      *    残高異動 CURSOR 作成
      ******************************************************************
       TKMZZI00-OPEN-A-RTN    SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 CURSOR 作成  START  ***"
      *-----------------------------------------------------------------
      *----------OPEN  残高異動 CURSOR
           EXEC  SQL
             OPEN  TKMZZI00_CURSOR_A                                    @3212SEINO@@
               USING :H-TKMZZI00-S.H-RIYO-CMP-CD,
                     :H-TKMZZI00-S.H-FUND-CD,
                     :H-TKMZZI00-S.H-PTF-CD,
                     :H-TKMZZI00-S.H-SEC-SBT-CD,
                     :H-TKMZZI00-S.H-MEG-CD,
                     :H-TKMZZI00-S.H-TATE-FLG,
                     :H-TKMZZI00-S.H-GYOKU-ID,
                     :H-TKMZZI00-S.H-KEIJOU-KIJUNBI-MIN,
                     :H-TKMZZI00-S.H-KEIJOU-KIJUNBI,
                     :H-TKMZZI00-S.H-RIYO-CMP-CD,
                     :H-TKMZZI00-S.H-FUND-CD,
                     :H-TKMZZI00-S.H-PTF-CD,
                     :H-TKMZZI00-S.H-SEC-SBT-CD,
                     :H-TKMZZI00-S.H-MEG-CD,
                     :H-TKMZZI00-S.H-TATE-FLG,
                     :H-TKMZZI00-S.H-GYOKU-ID,
                     :H-TKMZZI00-S.H-KEIJOU-KIJUNBI-MIN,
                     :H-TKMZZI00-S.H-KEIJOU-KIJUNBI
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN)   =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZZI00-CRA-OPEN       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CRA-OPEN  =["              @3212SEINO@@
      D             FLG-TKMZZI00-CRA-OPEN "]"                           @3212SEINO@@
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-017
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 CURSOR 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-OPEN-A-EXT.                                             @3212SEINO@@
           EXIT.
      ******************************************************************
      *    残高異動 FETCH 処理
      ******************************************************************
       TKMZZI00-FETCH-A-RTN   SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高異動 FETCH 処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZZI00
           EXEC SQL
               FETCH
                    TKMZZI00_CURSOR_A                                   @3212SEINO@@
               INTO :H-TKMZZI00
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-TKMZZI00
                 TO  TKMZZI00-PARM      OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":開始時残高異動情報 =["
      D             TKMZZI00-PARM       OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
               IF  WK-SABON-UPDATE-FROM = ZERO
               THEN
      *---------- ARG2.コピー元データ区分
                 MOVE  CNS-CPY-MOTO-DATA-KBN-1
                   TO  CPY-MOTO-DATA-KBN
                                        OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.コピー元データ区分 =["
      D             CPY-MOTO-DATA-KBN   OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
      *---------- ワークリターンコード ← '000'(正常)
                 MOVE  CNS-RTN-000      TO  WK-RTN-CD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード =["
      D             WK-RTN-CD"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               IF  WK-SABON-UPDATE-FROM = ZERO
               THEN
                 CONTINUE
               ELSE
                 EVALUATE  WK-MEG-CD-SHRU
      *----------  ARG1.銘柄別断面情報.銘柄種類＝1：物の場合
                   WHEN  CNS-MEG-CD-SHRU-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.開始基準日=["
      D             WK-KAISI-KJN-YMD   "]"
      *-----------------------------------------------------------------
      *---------- ①残高履歴TBLから残高履歴情報を取得する（「別紙1-2 SQL説明」を参照）
                     IF  WK-KAISI-KJN-YMD  NOT=  ZERO
                     THEN
                       PERFORM  TKMZZR00-GET-RTN
                     ELSE
                       CONTINUE
                     END-IF
      *----------  ARG1.銘柄別断面情報.銘柄種類＝2：元本の場合
                   WHEN  CNS-MEG-CD-SHRU-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.開始基準日=["
      D             WK-KAISI-KJN-YMD   "]"
      *-----------------------------------------------------------------
      *---------- ①元本残高TBLから元本残高情報を取得する（「別紙1-6 SQL説明」を参照）
                     IF  WK-KAISI-KJN-YMD  NOT=  ZERO
                     THEN
                       PERFORM  TKMZGZ00-GET-RTN
                     ELSE
                       CONTINUE
                     END-IF
                   WHEN  OTHER
                     CONTINUE
                 END-EVALUATE
               END-IF
             WHEN   OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-018
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高異動 FETCH 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-FETCH-A-EXT.                                            @3212SEINO@@
           EXIT.
      ******************************************************************@3212SEINO@@
      *    残高異動 SELECT 作成                                         @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMZZI00-SELECT-B-RTN  SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 SELECT 作成  START  ***"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *---------- 利用会社コード                                        @3212SEINO@@
           MOVE  WK-RIYO-CMP-CD                                         @3212SEINO@@
             TO  H-RIYO-CMP-CD          OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- ファンドコード                                        @3212SEINO@@
           MOVE  WK-FUND-CD                                             @3212SEINO@@
             TO  H-FUND-CD              OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-FUND-CD-S           OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- ポートフォリオコード                                  @3212SEINO@@
           MOVE  WK-PTF-CD                                              @3212SEINO@@
             TO  H-PTF-CD               OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-PTF-CD-S            OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- 証券種別コード                                        @3212SEINO@@
           MOVE  WK-SEC-SBT-CD                                          @3212SEINO@@
             TO  H-SEC-SBT-CD           OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-SEC-SBT-CD-S        OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- 銘柄コード                                            @3212SEINO@@
           MOVE  WK-MEG-CD                                              @3212SEINO@@
             TO  H-MEG-CD               OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-MEG-CD-S            OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- 資産/負債・買建/売建フラグ                            @3212SEINO@@
           MOVE  WK-TATE-FLG                                            @3212SEINO@@
             TO  H-TATE-FLG             OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-TATE-FLG-S          OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- 玉ID                                                  @3212SEINO@@
           MOVE  WK-GYOKU-ID                                            @3212SEINO@@
             TO  H-GYOKU-ID             OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-GYOKU-ID-S          OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- 開始基準日                                            @3212SEINO@@
           MOVE  WK-KAISI-KJN-YMD                                       @3212SEINO@@
             TO  H-KEIJOU-KIJUNBI-MIN   OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-KAISI-KJN-YMD-MIN-S OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- 差分更新From日                                        @3212SEINO@@
           MOVE  WK-SABON-UPDATE-FROM                                   @3212SEINO@@
             TO  H-KEIJOU-KIJUNBI       OF  H-TKMZZI00-S,               @3212SEINO@@
                 WK-KAISI-KJN-YMD-S     OF  WK-MSG-1-3                  @3212SEINO@@
      *---------- 残高異動テーブル                                      @3212SEINO@@
           MOVE  WK-TBL-TKMZZI00                                        @3212SEINO@@
             TO  SQL-TBL-TKMZZI00-1     OF  SQL-SELECT-1-3,             @3212SEINO@@
                 SQL-TBL-TKMZZI00-2     OF  SQL-SELECT-1-3,             @3212SEINO@@
                 WK-TKMZZI00            OF  WK-MSG-1-3                  @3212SEINO@@
           MOVE  CNS-KEIJOU-KIJUNBI                                     @3212SEINO@@
             TO  WK-ORDER-BY            OF  SQL-SELECT-1-3,             @3212SEINO@@
                 WK-ORDER-BY            OF  WK-MSG-1-3                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["                       @3212SEINO@@
      D             H-RIYO-CMP-CD       OF  H-TKMZZI00-S"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["                       @3212SEINO@@
      D             H-FUND-CD           OF  H-TKMZZI00-S"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["                 @3212SEINO@@
      D             H-PTF-CD            OF  H-TKMZZI00-S"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["                       @3212SEINO@@
      D             H-SEC-SBT-CD        OF  H-TKMZZI00-S"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["                           @3212SEINO@@
      D             H-MEG-CD            OF  H-TKMZZI00-S"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["           @3212SEINO@@
      D             H-TATE-FLG          OF  H-TKMZZI00-S"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":玉ID=["                                 @3212SEINO@@
      D             H-GYOKU-ID          OF  H-TKMZZI00-S"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":開始基準日=["                           @3212SEINO@@
      D             H-KEIJOU-KIJUNBI-MIN OF  H-TKMZZI00-S"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":差分更新From日=["                       @3212SEINO@@
      D             H-KEIJOU-KIJUNBI    OF  H-TKMZZI00-S"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-ORDER-BY=["                          @3212SEINO@@
      D             WK-ORDER-BY  OF  SQL-SELECT-1-3 "]"                 @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-3=["SQL-SELECT-1-3"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-3=["WK-MSG-1-3"]"              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT3B                                        @3212SEINO@@
      *---------- ＳＱＬ文                                              @3212SEINO@@
           MOVE  SQL-SELECT-1-3         TO  SQLSTMT3B                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT3B=["SQLSTMT3B"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグB =["     @3212SEINO@@
      D             FLG-TKMZZI00-CRB-OPEN "]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZZI00-CRB-OPEN  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL                                                    @3212SEINO@@
               PREPARE  S12  FROM :SQLSTMT3B                            @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=[" SQLCODE "]"         @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEINO@@
           THEN                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           ELSE                                                         @3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
             MOVE  CNS-PGM-ID                                           @3212SEINO@@
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
             MOVE  CNS-POS-019                                          @3212SEINO@@
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
             MOVE  CNS-RTN-900                                          @3212SEINO@@
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
             MOVE  SQLCODE                                              @3212SEINO@@
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
             MOVE  CNS-DETAIL-1                                         @3212SEINO@@
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
             STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
                     WK-MSG-1-3         DELIMITED  BY  SIZE             @3212SEINO@@
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
             PERFORM  ERR-RTN                                           @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------DECLARE  残高異動 CURSOR                               @3212SEINO@@
           EXEC  SQL                                                    @3212SEINO@@
               DECLARE  TKMZZI00_CURSOR_B  CURSOR  FOR  S12             @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR  DECLARE)=[" SQLCODE "]" @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 SELECT 作成  END  ***"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMZZI00-SELECT-B-EXT.                                           @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *    残高異動 CURSOR 作成                                         @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMZZI00-OPEN-B-RTN    SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 CURSOR 作成  START  ***"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------OPEN  残高異動 CURSOR                                  @3212SEINO@@
           EXEC  SQL                                                    @3212SEINO@@
             OPEN  TKMZZI00_CURSOR_B                                    @3212SEINO@@
               USING :H-TKMZZI00-S.H-RIYO-CMP-CD,                       @3212SEINO@@
                     :H-TKMZZI00-S.H-FUND-CD,                           @3212SEINO@@
                     :H-TKMZZI00-S.H-PTF-CD,                            @3212SEINO@@
                     :H-TKMZZI00-S.H-SEC-SBT-CD,                        @3212SEINO@@
                     :H-TKMZZI00-S.H-MEG-CD,                            @3212SEINO@@
                     :H-TKMZZI00-S.H-TATE-FLG,                          @3212SEINO@@
                     :H-TKMZZI00-S.H-GYOKU-ID,                          @3212SEINO@@
                     :H-TKMZZI00-S.H-KEIJOU-KIJUNBI-MIN,                @3212SEINO@@
                     :H-TKMZZI00-S.H-KEIJOU-KIJUNBI,                    @3212SEINO@@
                     :H-TKMZZI00-S.H-RIYO-CMP-CD,                       @3212SEINO@@
                     :H-TKMZZI00-S.H-FUND-CD,                           @3212SEINO@@
                     :H-TKMZZI00-S.H-PTF-CD,                            @3212SEINO@@
                     :H-TKMZZI00-S.H-SEC-SBT-CD,                        @3212SEINO@@
                     :H-TKMZZI00-S.H-MEG-CD,                            @3212SEINO@@
                     :H-TKMZZI00-S.H-TATE-FLG,                          @3212SEINO@@
                     :H-TKMZZI00-S.H-GYOKU-ID,                          @3212SEINO@@
                     :H-TKMZZI00-S.H-KEIJOU-KIJUNBI-MIN,                @3212SEINO@@
                     :H-TKMZZI00-S.H-KEIJOU-KIJUNBI                     @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN)   =[" SQLCODE "]"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-ON               TO  FLG-TKMZZI00-CRB-OPEN       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CRB-OPEN  =["              @3212SEINO@@
      D             FLG-TKMZZI00-CRB-OPEN "]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           ELSE                                                         @3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
             MOVE  CNS-PGM-ID                                           @3212SEINO@@
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
             MOVE  CNS-POS-020                                          @3212SEINO@@
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
             MOVE  CNS-RTN-900                                          @3212SEINO@@
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
             MOVE  SQLCODE                                              @3212SEINO@@
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
             MOVE  CNS-DETAIL-1                                         @3212SEINO@@
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
             STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
                     WK-MSG-1-3         DELIMITED  BY  SIZE             @3212SEINO@@
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
             PERFORM  ERR-RTN                                           @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 CURSOR 作成  END  ***"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMZZI00-OPEN-B-EXT.                                             @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *    残高異動 FETCH 処理                                          @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMZZI00-FETCH-B-RTN   SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 残高異動 FETCH 処理  START  ***"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE                   H-TKMZZI00                      @3212SEINO@@
           EXEC SQL                                                     @3212SEINO@@
               FETCH                                                    @3212SEINO@@
                    TKMZZI00_CURSOR_B                                   @3212SEINO@@
               INTO :H-TKMZZI00                                         @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE(FETCH)=["SQLCODE"]"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           EVALUATE  SQLCODE                                            @3212SEINO@@
             WHEN  CNS-SQL-NORMAL                                       @3212SEINO@@
               MOVE  H-TKMZZI00                                         @3212SEINO@@
                 TO  TKMZZI00-PARM      OF  PARM-SMZJ1610-ARG2          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":開始時残高異動情報 =["                  @3212SEINO@@
      D             TKMZZI00-PARM       OF  PARM-SMZJ1610-ARG2"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               IF  WK-SABON-UPDATE-FROM = ZERO                          @3212SEINO@@
               THEN                                                     @3212SEINO@@
      *---------- ARG2.コピー元データ区分                               @3212SEINO@@
                 MOVE  CNS-CPY-MOTO-DATA-KBN-1                          @3212SEINO@@
                   TO  CPY-MOTO-DATA-KBN                                @3212SEINO@@
                                        OF  PARM-SMZJ1610-ARG2          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ARG2.コピー元データ区分 =["             @3212SEINO@@
      D             CPY-MOTO-DATA-KBN   OF  PARM-SMZJ1610-ARG2"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *---------- ワークリターンコード ← '000'(正常)                   @3212SEINO@@
                 MOVE  CNS-RTN-000      TO  WK-RTN-CD                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード =["                @3212SEINO@@
      D             WK-RTN-CD"]"                                        @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               ELSE                                                     @3212SEINO@@
                 CONTINUE                                               @3212SEINO@@
               END-IF                                                   @3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND                                     @3212SEINO@@
               IF  WK-SABON-UPDATE-FROM = ZERO                          @3212SEINO@@
               THEN                                                     @3212SEINO@@
                 CONTINUE                                               @3212SEINO@@
               ELSE                                                     @3212SEINO@@
                 EVALUATE  WK-MEG-CD-SHRU                               @3212SEINO@@
      *----------  ARG1.銘柄別断面情報.銘柄種類＝1：物の場合            @3212SEINO@@
                   WHEN  CNS-MEG-CD-SHRU-1                              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.開始基準日=["       @3212SEINO@@
      D             WK-KAISI-KJN-YMD   "]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *---------- ①残高履歴TBLから残高履歴情報を取得する（「別紙1-2 SQL説明」を参照）
                     IF  WK-KAISI-KJN-YMD  NOT=  ZERO                   @3212SEINO@@
                     THEN                                               @3212SEINO@@
                       PERFORM  TKMZZR00-GET-RTN                        @3212SEINO@@
                     ELSE                                               @3212SEINO@@
                       CONTINUE                                         @3212SEINO@@
                     END-IF                                             @3212SEINO@@
      *----------  ARG1.銘柄別断面情報.銘柄種類＝2：元本の場合          @3212SEINO@@
                   WHEN  CNS-MEG-CD-SHRU-2                              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.開始基準日=["       @3212SEINO@@
      D             WK-KAISI-KJN-YMD   "]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *---------- ①元本残高TBLから元本残高情報を取得する（「別紙1-6 SQL説明」を参照）
                     IF  WK-KAISI-KJN-YMD  NOT=  ZERO                   @3212SEINO@@
                     THEN                                               @3212SEINO@@
                       PERFORM  TKMZGZ00-GET-RTN                        @3212SEINO@@
                     ELSE                                               @3212SEINO@@
                       CONTINUE                                         @3212SEINO@@
                     END-IF                                             @3212SEINO@@
                   WHEN  OTHER                                          @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                 END-EVALUATE                                           @3212SEINO@@
               END-IF                                                   @3212SEINO@@
             WHEN   OTHER                                               @3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
               MOVE  CNS-PGM-ID                                         @3212SEINO@@
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
               MOVE  CNS-POS-021                                        @3212SEINO@@
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
               MOVE  CNS-RTN-900                                        @3212SEINO@@
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
               MOVE  SQLCODE                                            @3212SEINO@@
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
               MOVE  CNS-DETAIL-1                                       @3212SEINO@@
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
               STRING  CNS-SQL-MSG-SELECT,                              @3212SEINO@@
                       WK-MSG-1-3       DELIMITED  BY  SIZE             @3212SEINO@@
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
               PERFORM  ERR-RTN                                         @3212SEINO@@
           END-EVALUATE                                                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":***  残高異動 FETCH 処理  END  ***"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMZZI00-FETCH-B-EXT.                                            @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *    残高異動 CURSOR CLOSE 処理
      ******************************************************************
      *TKMZZI00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D   DISPLAY  CNS-PGM-ID":***残高異動 CURSOR CLOSE 処理 START ***"
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR-OPEN=["
      *D             FLG-TKMZZI00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZZI00_CURSOR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE(CLOSE)   =[" SQLCODE "]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR-OPEN=["
      *D             FLG-TKMZZI00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-017
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-3         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D   DISPLAY  CNS-PGM-ID":*** 残高異動 CURSOR CLOSE 処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZZI00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    3.2.2.2 4)前払金管理TBLから前払金管理情報を取得処理
      ******************************************************************
       TKMZMB00-INSERT2-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 前払金管理情報を取得処理2  START "
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  WK-SYORI-YMD-S         OF  SQL-INSERT-1-8
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  WK-KIDOU-ID-S          OF  SQL-INSERT-1-8
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZMB00-S8,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-8
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZMB00-S8,
                 WK-FUND-CD-S           OF  WK-MSG-1-8
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZMB00-S8,
                 WK-PTF-CD-S            OF  WK-MSG-1-8
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZMB00-S8,
                 WK-SEC-SBT-CD-S        OF  WK-MSG-1-8
      *---------- 銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZMB00-S8,
                 WK-MEG-CD-S            OF  WK-MSG-1-8
      *---------- 資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZMB00-S8,
                 WK-TATE-FLG-S          OF  WK-MSG-1-8
      *---------- 玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZMB00-S8,
                 WK-GYOKU-ID-S          OF  WK-MSG-1-8
      *---------- 計上基準日
           MOVE  WK-SABON-UPDATE-FROM
             TO  H-KEIJOU-KIJUNBI       OF  H-TKMZMB00-S8,
                 WK-KEIJOU-KIJUNBI-S    OF  WK-MSG-1-8
      *---------- 前払金管理計算データ
           MOVE  WK-TBL-TKMZBW10
             TO  SQL-TBL-TKMZBW10       OF  SQL-INSERT-1-8
      *---------- 前払金管理テーブル
           MOVE  WK-TBL-TKMZMB00
             TO  SQL-TBL-TKMZMB00       OF  SQL-INSERT-1-8,
                 WK-TKMZMB00            OF  WK-MSG-1-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             WK-SYORI-YMD-S      OF  SQL-INSERT-1-8"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             WK-KIDOU-ID-S       OF  SQL-INSERT-1-8"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD       OF  H-TKMZMB00-S8"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD           OF  H-TKMZMB00-S8"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMZMB00-S8"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD        OF  H-TKMZMB00-S8"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD            OF  H-TKMZMB00-S8"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZMB00-S8"]"
      D    DISPLAY  CNS-PGM-ID":玉ID=["
      D             H-GYOKU-ID          OF  H-TKMZMB00-S8"]"
      D    DISPLAY  CNS-PGM-ID":計上基準日=["
      D             H-KEIJOU-KIJUNBI    OF  H-TKMZMB00-S8"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
      *---------- ＳＱＬ文
           MOVE  SQL-INSERT-1-8         TO  SQLSTMT4                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT4=["SQLSTMT4"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２  =[" @3212SEINO@@
      D             FLG-TKMZBW10-S4-INSERT "]"                          @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @SEINO@@
           IF  FLG-TKMZBW10-S4-INSERT = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
           EXEC  SQL
               PREPARE  S4  FROM :SQLSTMT4                              @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-022
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  SQL-INSERT         OF  SQL-INSERT-1-8,
                     SQL-SELECT-1-8,
                     WK-MSG-1-8         DELIMITED  BY SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
           EXEC SQL
               EXECUTE S4
                 USING :H-TKMZMB00-S8
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-INSERT2=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW10-S4-INSERT      @SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２  =[" @3212SEINO@@
      D             FLG-TKMZBW10-S4-INSERT "]"                          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               CONTINUE
             WHEN  CNS-SQL-UNIQUE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-023
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  SQL-INSERT       OF  SQL-INSERT-1-8,
                       SQL-SELECT-1-8,
                       WK-MSG-1-8       DELIMITED  BY SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-024
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  SQL-INSERT       OF  SQL-INSERT-1-8,
                       SQL-SELECT-1-8,
                       WK-MSG-1-8       DELIMITED  BY SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 前払金管理情報を取得処理2  END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMB00-INSERT2-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3 対象銘柄は資金の場合の処理
      ******************************************************************
       TASYOU-MEG-SIKIN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 対象銘柄は資金の場合の処理  START "
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.差分更新From日=["
      D             WK-SABON-UPDATE-FROM"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.開始基準日=["
      D             WK-KAISI-KJN-YMD   "]"
      *-----------------------------------------------------------------
           IF  WK-SABON-UPDATE-FROM  =  ZERO
           THEN
      *---------- 3.2.3.1 資金残履歴TBLから資金残履歴情報を取得処理
             IF  WK-KAISI-KJN-YMD  NOT=  ZERO
             THEN
               PERFORM  TKMZSR00-GET-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
      *---------- 3.2.3.2 資金簿価異動TBLから資金簿価異動情報を取得処理
             PERFORM  TKMZSI00-GET-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象銘柄は資金の場合の処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TASYOU-MEG-SIKIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.1 資金残履歴TBLから資金残履歴情報を取得処理
      ******************************************************************
       TKMZSR00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 資金残履歴情報を取得処理  START "
      *-----------------------------------------------------------------
      *----------  資金残履歴 SELECT 作成
           PERFORM  TKMZSR00-SELECT-RTN
      *----------  資金残履歴 CURSOR 作成
           PERFORM  TKMZSR00-OPEN-RTN
      *----------  資金残履歴 FETCH 処理
           PERFORM  TKMZSR00-FETCH-RTN
      *----------  資金残履歴 CURSOR CLOSE 処理
      ***  PERFORM  TKMZSR00-CLOSE-RTN                                  @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 資金残履歴情報を取得処理  END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSR00-GET-EXT.
           EXIT.
      ******************************************************************
      *    資金残履歴 SELECT 作成
      ******************************************************************
       TKMZSR00-SELECT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴 SELECT 作成  START  ***"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZSR00-S,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-4
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZSR00-S,
                 WK-FUND-CD-S           OF  WK-MSG-1-4
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZSR00-S,
                 WK-PTF-CD-S            OF  WK-MSG-1-4
      *---------- 決済口座番号
           MOVE  WK-MEG-CD
             TO  H-KS-KOZA-NO           OF  H-TKMZSR00-S,
                 WK-KS-KOZA-NO-S        OF  WK-MSG-1-4
      *---------- 基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZSR00-S,
                 WK-KJN-YMD-S           OF  WK-MSG-1-4
      *---------- 資金残履歴テーブル
           MOVE  WK-TBL-TKMZSR00
             TO  SQL-TBL-TKMZSR00       OF  SQL-SELECT-1-4,
                 WK-TKMZSR00            OF  WK-MSG-1-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD       OF  H-TKMZSR00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD           OF  H-TKMZSR00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMZSR00-S"]"
      D    DISPLAY  CNS-PGM-ID":決済口座番号=["
      D             H-KS-KOZA-NO        OF  H-TKMZSR00-S"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             H-KJN-YMD           OF  H-TKMZSR00-S"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT5                                         @3212SEINO@@
      *---------- ＳＱＬ文
           MOVE  SQL-SELECT-1-4         TO  SQLSTMT5                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT5=["SQLSTMT5"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴カーソルオープンフラグ  =["   @3212SEINO@@
      D             FLG-TKMZSR00-CR-OPEN "]"                            @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZSR00-CR-OPEN = CNS-OFF                           @SEINO@@
           THEN                                                         @SEINO@@
           EXEC  SQL
               PREPARE  S5  FROM :SQLSTMT5                              @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------DECLARE  資金残履歴 CURSOR
           EXEC  SQL DECLARE  TKMZSR00_CURSOR  CURSOR  FOR  S5  END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR  DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴 SELECT 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSR00-SELECT-EXT.
           EXIT.
      ******************************************************************
      *    資金残履歴 CURSOR 作成
      ******************************************************************
       TKMZSR00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴 CURSOR 作成  START  ***"
      *-----------------------------------------------------------------
      *----------OPEN  資金残履歴 CURSOR
           EXEC  SQL
             OPEN  TKMZSR00_CURSOR
               USING :H-TKMZSR00-S.H-RIYO-CMP-CD,
                     :H-TKMZSR00-S.H-FUND-CD,
                     :H-TKMZSR00-S.H-PTF-CD,
                     :H-TKMZSR00-S.H-KS-KOZA-NO,
                     :H-TKMZSR00-S.H-KJN-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN) =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZSR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSR00-CR-OPEN  =["
      D             FLG-TKMZSR00-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-026
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴 CURSOR 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSR00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    資金残履歴 FETCH 処理
      ******************************************************************
       TKMZSR00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金残履歴 FETCH 処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZSR00
           EXEC SQL
               FETCH
                    TKMZSR00_CURSOR
               INTO :H-TKMZSR00
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-TKMZSR00
                 TO  TKMZSR00-PARM      OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":開始時資金残履歴情報 =["
      D             TKMZSR00-PARM       OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
               IF  WK-SABON-UPDATE-FROM  NOT=  ZERO
               THEN
      *----------  AGR2.差分更新モード取得ルート区分
                 MOVE  CNS-SABUN-UPD-GET-KBN-1
                   TO  SABUN-UPD-GET-KBN  OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":AGR2.差分更新モード取得ルート区分 =["
      D             SABUN-UPD-GET-KBN   OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *----------  ワークリターンコード ← '113'(データ取得不能)
               MOVE  CNS-RTN-113        TO  WK-RTN-CD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード =["WK-RTN-CD"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-027
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-4       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴 FETCH 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSR00-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    資金残履歴 CURSOR CLOSE 処理
      ******************************************************************
      *TKMZSR00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D             ":***資金残履歴 CURSOR CLOSE 処理 START ***"
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSR00-CR-OPEN=["
      *D             FLG-TKMZSR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZSR00_CURSOR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE(CLOSE) =["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZSR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSR00-CR-OPEN=["
      *D             FLG-TKMZSR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-024
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-4         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D             ":*** 資金残履歴 CURSOR CLOSE 処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZSR00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    3.2.3.2 資金簿価異動TBLから資金簿価異動情報を取得処理
      ******************************************************************
       TKMZSI00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 資金簿価異動情報を取得処理  START "
      *-----------------------------------------------------------------
      *----------  資金簿価異動 SELECT 作成
           PERFORM  TKMZSI00-SELECT-RTN
      *----------  資金簿価異動 CURSOR 作成
           PERFORM  TKMZSI00-OPEN-RTN
      *----------  資金簿価異動 FETCH 処理
           PERFORM  TKMZSI00-FETCH-RTN
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *----------  資金簿価異動 CURSOR CLOSE 処理
      *    PERFORM  TKMZSI00-CLOSE-RTN                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 資金簿価異動情報を取得処理  END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSI00-GET-EXT.
           EXIT.
      ******************************************************************
      *    資金簿価異動 SELECT 作成
      ******************************************************************
       TKMZSI00-SELECT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金簿価異動 SELECT 作成 START ***"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZSI00-S,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-5
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZSI00-S,
                 WK-FUND-CD-S           OF  WK-MSG-1-5
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZSI00-S,
                 WK-PTF-CD-S            OF  WK-MSG-1-5
      *---------- 決済口座番号
           MOVE  WK-MEG-CD
             TO  H-KS-KOZA-NO           OF  H-TKMZSI00-S,
                 WK-KS-KOZA-NO-S        OF  WK-MSG-1-5
      *---------- 異動日(開始基準日)
           MOVE  WK-KAISI-KJN-YMD
             TO  H-IDO-YMD-MIN          OF  H-TKMZSI00-S,
                 WK-IDO-YMD-MIN-S       OF  WK-MSG-1-5
      *********** テーマ1307対応で、WK-SABON-UPDATE-FROM  = ZEROの場合、@3212SEINO@@
      *********** 別紙1-5は発行しないので、該当SQL分岐発行対応不要      @3212SEINO@@
           IF  WK-SABON-UPDATE-FROM  = ZERO
           THEN
      *---------- 基準日
             MOVE  WK-KJN-YMD
               TO  H-IDO-YMD            OF  H-TKMZSI00-S,
                   WK-IDO-YMD-S         OF  WK-MSG-1-5
             MOVE  CNS-LES-EQU5         TO  WK-LES-EQU5
             MOVE  CNS-LES-EQU          TO  WK-OPERATOR5
           ELSE
             MOVE  WK-SABON-UPDATE-FROM
               TO  H-IDO-YMD            OF  H-TKMZSI00-S,
                   WK-IDO-YMD-S         OF  WK-MSG-1-5
             MOVE  CNS-EQUAL5           TO  WK-LES-EQU5
             MOVE  CNS-EQUAL            TO  WK-OPERATOR5
           END-IF
      *---------- 資金簿価異動テーブル
           MOVE  WK-TBL-TKMZSI00
             TO  SQL-TBL-TKMZSI00       OF  SQL-SELECT-1-5,
                 WK-TKMZSI00            OF  WK-MSG-1-5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD       OF  H-TKMZSI00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD           OF  H-TKMZSI00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMZSI00-S"]"
      D    DISPLAY  CNS-PGM-ID":決済口座番号=["
      D             H-KS-KOZA-NO        OF  H-TKMZSI00-S"]"
      D    DISPLAY  CNS-PGM-ID":異動日_MIN=["
      D             H-IDO-YMD-MIN       OF  H-TKMZSI00-S"]"
      D    DISPLAY  CNS-PGM-ID":異動日=["
      D             H-IDO-YMD           OF  H-TKMZSI00-S"]"
      *-----------------------------------------------------------------
      ***  INITIALIZE  SQLSTMT                                          @SEINO@@
           INITIALIZE  SQLSTMT6                                         @3212SEINO@@
      *---------- ＳＱＬ文
      ***  MOVE  SQL-SELECT-1-5         TO  SQLSTMT                     @SEINO@@
           MOVE  SQL-SELECT-1-5         TO  SQLSTMT6                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                    @SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT6=["SQLSTMT6"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ  =[" @3212SEINO@@
      D             FLG-TKMZSI00-CR-OPEN "]"                            @3212SEINO@@
      *-----------------------------------------------------------------
      ***  EXEC  SQL                                                    @SEINO@@
      ***      PREPARE  S6  FROM :SQLSTMT                               @SEINO@@
      ***  END-EXEC                                                     @SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZSI00-CR-OPEN  =  CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL                                                    @SEINO@@
               PREPARE  S6  FROM :SQLSTMT6                              @3212SEINO@@
           END-EXEC                                                     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------DECLARE  資金簿価異動 CURSOR
           EXEC  SQL DECLARE  TKMZSI00_CURSOR  CURSOR  FOR  S6  END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR  DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金簿価異動 SELECT 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSI00-SELECT-EXT.
           EXIT.
      ******************************************************************
      *    資金簿価異動 CURSOR 作成
      ******************************************************************
       TKMZSI00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金簿価異動 CURSOR 作成  START ***"
      *-----------------------------------------------------------------
      *----------OPEN  資金簿価異動 CURSOR
           EXEC  SQL
             OPEN  TKMZSI00_CURSOR
               USING :H-TKMZSI00-S.H-RIYO-CMP-CD,
                     :H-TKMZSI00-S.H-FUND-CD,
                     :H-TKMZSI00-S.H-PTF-CD,
                     :H-TKMZSI00-S.H-KS-KOZA-NO,
                     :H-TKMZSI00-S.H-IDO-YMD-MIN,
                     :H-TKMZSI00-S.H-IDO-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN) =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZSI00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSI00-CR-OPEN  =["
      D             FLG-TKMZSI00-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-026
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金簿価異動 CURSOR 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSI00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    資金簿価異動 FETCH 処理
      ******************************************************************
       TKMZSI00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金簿価異動 FETCH 処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZSI00
           EXEC SQL
               FETCH
                    TKMZSI00_CURSOR
               INTO :H-TKMZSI00
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-TKMZSI00
                 TO  TKMZSI00-PARM      OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":開始時資金簿価異動情報 =["
      D             TKMZSI00-PARM       OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
               IF  WK-SABON-UPDATE-FROM = ZERO
               THEN
      *---------- ARG2.コピー元データ区分
                 MOVE  CNS-CPY-MOTO-DATA-KBN-1
                   TO  CPY-MOTO-DATA-KBN
                                        OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.コピー元データ区分 =["
      D             CPY-MOTO-DATA-KBN   OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
      *---------- ワークリターンコード ← '000'(正常)
                 MOVE  CNS-RTN-000      TO  WK-RTN-CD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード =["
      D             WK-RTN-CD"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               IF  WK-SABON-UPDATE-FROM = ZERO
               THEN
                 CONTINUE
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.開始基準日=["
      D             WK-KAISI-KJN-YMD   "]"
      *-----------------------------------------------------------------
      *---------- ①資金残履歴TBLから資金残履歴情報を取得する（「別紙1-4 SQL説明」を参照）
                 IF  WK-KAISI-KJN-YMD  NOT=  ZERO
                 THEN
                   PERFORM  TKMZSR00-GET-RTN
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-027
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-5       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金簿価異動 FETCH 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSI00-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    資金簿価異動 CURSOR CLOSE 処理
      ******************************************************************
      *TKMZSI00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D             ":***資金簿価異動 CURSOR CLOSE 処理 START ***"
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSI00-CR-OPEN=["
      *D             FLG-TKMZSI00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZSI00_CURSOR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE(CLOSE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZSI00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSI00-CR-OPEN=["
      *D             FLG-TKMZSI00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-028
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-5         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D             ":*** 資金簿価異動 CURSOR CLOSE 処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZSI00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    3.2.4 対象銘柄は元本の場合の処理
      ******************************************************************
       TASYOU-MEG-GANPON-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 対象銘柄は元本の場合の処理  START "
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.差分更新From日=["
      D             WK-SABON-UPDATE-FROM "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.開始基準日=["
      D             WK-KAISI-KJN-YMD   "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.銘柄別断面情報.銘柄種類２ =["
      D             WK-MEG-CD-SHRU2"]"
      *-----------------------------------------------------------------
           IF  WK-SABON-UPDATE-FROM  =  ZERO
           THEN
      *---------- 3.2.4.1 元本残高TBLから元本残高情報を取得処理
             IF  WK-KAISI-KJN-YMD  NOT=  ZERO
             THEN
               PERFORM  TKMZGZ00-GET-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
      *---------- 3.2.4.2 残高異動TBLから残高異動情報を取得処理
             PERFORM  TKMZZI00-GET-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 対象銘柄は元本の場合の処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TASYOU-MEG-GANPON-EXT.
           EXIT.
      ******************************************************************
      *    3.2.4.1 元本残高TBLから元本残高情報を取得処理
      ******************************************************************
       TKMZGZ00-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 元本残高情報を取得処理  START "
      *-----------------------------------------------------------------
      *----------  元本残高 SELECT 作成
           PERFORM  TKMZGZ00-SELECT-RTN
      *----------  元本残高 CURSOR 作成
           PERFORM  TKMZGZ00-OPEN-RTN
      *----------  元本残高 FETCH 処理
           PERFORM  TKMZGZ00-FETCH-RTN
      *----------  元本残高 CURSOR CLOSE 処理
      ***  PERFORM  TKMZGZ00-CLOSE-RTN                                  @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 元本残高情報を取得処理  END "
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZGZ00-GET-EXT.
           EXIT.
      ******************************************************************
      *    元本残高 SELECT 作成
      ******************************************************************
       TKMZGZ00-SELECT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高 SELECT 作成 START ***"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZGZ00-S,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-6
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZGZ00-S,
                 WK-FUND-CD-S           OF  WK-MSG-1-6
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZGZ00-S,
                 WK-PTF-CD-S            OF  WK-MSG-1-6
      *---------- 基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZGZ00-S,
                 WK-KJN-YMD-S           OF  WK-MSG-1-6
      *---------- 元本残高テーブル
           MOVE  WK-TBL-TKMZGZ00
             TO  SQL-TBL-TKMZGZ00       OF  SQL-SELECT-1-6,
                 WK-TKMZGZ00            OF  WK-MSG-1-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD       OF  H-TKMZGZ00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD           OF  H-TKMZGZ00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMZGZ00-S"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             H-KJN-YMD           OF  H-TKMZGZ00-S"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT7                                         @3212SEINO@@
      *---------- ＳＱＬ文
           MOVE  SQL-SELECT-1-6         TO  SQLSTMT7                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT7=["SQLSTMT7"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高カーソルオープンフラグ  =["     @3212SEINO@@
      D             FLG-TKMZGZ00-CR-OPEN "]"                            @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZGZ00-CR-OPEN = CNS-OFF                           @SEINO@@
           THEN                                                         @SEINO@@
           EXEC  SQL
               PREPARE  S7  FROM :SQLSTMT7                              @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-034
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------DECLARE  元本残高 CURSOR
           EXEC  SQL DECLARE  TKMZGZ00_CURSOR  CURSOR  FOR  S7  END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR  DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高 SELECT 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZGZ00-SELECT-EXT.
           EXIT.
      ******************************************************************
      *    元本残高 CURSOR 作成
      ******************************************************************
       TKMZGZ00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高 CURSOR 作成  START  ***"
      *-----------------------------------------------------------------
      *----------OPEN  元本残高 CURSOR
           EXEC  SQL
             OPEN  TKMZGZ00_CURSOR
               USING :H-TKMZGZ00-S.H-RIYO-CMP-CD,
                     :H-TKMZGZ00-S.H-FUND-CD,
                     :H-TKMZGZ00-S.H-PTF-CD,
                     :H-TKMZGZ00-S.H-KJN-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZGZ00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZGZ00-CR-OPEN  =["
      D             FLG-TKMZGZ00-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-035
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高 CURSOR 作成  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZGZ00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    元本残高 FETCH 処理
      ******************************************************************
       TKMZGZ00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 元本残高 FETCH 処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZGZ00
           EXEC SQL
               FETCH
                    TKMZGZ00_CURSOR
               INTO :H-TKMZGZ00
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-TKMZGZ00
                 TO  TKMZGZ00-PARM      OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":開始時元本残高情報 =["
      D             TKMZGZ00-PARM       OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
               IF  WK-SABON-UPDATE-FROM  NOT=  ZERO
               THEN
      *----------  AGR2.差分更新モード取得ルート区分
                 MOVE  CNS-SABUN-UPD-GET-KBN-1
                   TO  SABUN-UPD-GET-KBN  OF  PARM-SMZJ1610-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":AGR2.差分更新モード取得ルート区分 =["
      D             SABUN-UPD-GET-KBN   OF  PARM-SMZJ1610-ARG2"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *----------  ワークリターンコード ← '113'(データ取得不能)
               MOVE  CNS-RTN-113        TO  WK-RTN-CD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード =["WK-RTN-CD"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-036
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-6       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高 FETCH 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZGZ00-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    元本残高 CURSOR CLOSE 処理
      ******************************************************************
      *TKMZGZ00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D   DISPLAY  CNS-PGM-ID":***元本残高 CURSOR CLOSE 処理 START ***"
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZGZ00-CR-OPEN=["
      *D             FLG-TKMZGZ00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZGZ00_CURSOR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE(CLOSE) =["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZGZ00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZGZ00-CR-OPEN=["
      *D             FLG-TKMZGZ00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-032
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-6         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D   DISPLAY  CNS-PGM-ID":*** 元本残高 CURSOR CLOSE 処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZGZ00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *        3.3 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": ***   後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D          ": リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           MOVE  WK-RTN-CD
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":RTN-CD   OF  PARM-SCZY1170-ARG1 = ["
      D                        RTN-CD   OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1610-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":PARM-SCZY1170-RTNPKG = ["
      D            PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":PARM-SMZJ1610-ARG3 = ["
      D            PARM-SMZJ1610-ARG3"]"
      D    DISPLAY CNS-PGM-ID":COUNT = ["
      D            COUNTER              OF PARM-SMZJ1610-ARG3"]"
      D    DISPLAY CNS-PGM-ID":エラー検知プログラム名 = ["
      D       ERR-PGM-ID
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":ポジション = ["
      D       ERR-POS
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":リターンコード = ["
      D       RTN-CD
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":詳細リターンコード = ["
      D       DETAIL-RTN-CD
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":詳細リターンコードデコードフラグ = ["
      D       DETAIL-RTN-CD-FLG
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":フリーメッセージ = ["
      D       FREE-MSG
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID
      D           ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *    3.4 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ1610-ARG2   OF  PARM-SMZJ1610-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1610-ARG2=["
      D             PARM-SMZJ1610-ARG2  OF PARM-SMZJ1610-INOUT"]"
      *-----------------------------------------------------------------
      *----------  カーソルをクローズ
           PERFORM  CURSOR-CLOSE-RTN
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D           ": リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1610-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":PARM-SCZY1170-RTNPKG = ["
      D            PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":PARM-SMZJ1610-ARG3 = ["
      D            PARM-SMZJ1610-ARG3"]"
      D    DISPLAY CNS-PGM-ID":COUNT = ["
      D            COUNTER              OF  PARM-SMZJ1610-ARG3"]"
      D    DISPLAY CNS-PGM-ID":エラー検知プログラム名 = ["
      D       ERR-PGM-ID
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":ポジション = ["
      D       ERR-POS
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":リターンコード = ["
      D       RTN-CD
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":詳細リターンコード = ["
      D       DETAIL-RTN-CD
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":詳細リターンコードデコードフラグ = ["
      D       DETAIL-RTN-CD-FLG
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":フリーメッセージ = ["
      D       FREE-MSG
      D          OF PARM-SMZJ1610-ARG3(COUNTER OF PARM-SMZJ1610-ARG3)"]"
      D    DISPLAY CNS-PGM-ID
      D            ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY CNS-PGM-ID": ***  エラー処理  END  ***"
      D    DISPLAY CNS-PGM-ID": ***  SMZJ1610  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
      ******************************************************************
      *    カーソルをクローズ
      ******************************************************************
       CURSOR-CLOSE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***カーソルをクローズ  START***"
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ  =["   @3212SEINO@@
      D             FLG-TKMZBW10-S2-INSERT"]"                           @3212SEINO@@
      *-----------------------------------------------------------------
           IF  FLG-TKMZBW10-S2-INSERT  =  CNS-ON                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-TKMZBW10-S2-INSERT      @SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ  =["   @3212SEINO@@
      D             FLG-TKMZBW10-S2-INSERT"]"                           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２  =[" @3212SEINO@@
      D             FLG-TKMZBW10-S4-INSERT"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW10-S4-INSERT  =  CNS-ON                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-TKMZBW10-S4-INSERT      @SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２  =[" @3212SEINO@@
      D             FLG-TKMZBW10-S4-INSERT"]"                           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高カーソルオープンフラグ  =["     @3212SEINO@@
      D             FLG-TKMZGZ00-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-TKMZGZ00-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE TKMZGZ00_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZGZ00-CR-OPEN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高カーソルオープンフラグ  =["     @3212SEINO@@
      D             FLG-TKMZGZ00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴カーソルオープンフラグ  =["   @3212SEINO@@
      D             FLG-TKMZSR00-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-TKMZSR00-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE TKMZSR00_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZSR00-CR-OPEN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴カーソルオープンフラグ  =["   @3212SEINO@@
      D             FLG-TKMZSR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ  =[" @3212SEINO@@
      D             FLG-TKMZSI00-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-TKMZSI00-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE TKMZSI00_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZSI00-CR-OPEN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ  =[" @3212SEINO@@
      D             FLG-TKMZSI00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ  =["     @3212SEINO@@
      D             FLG-TKMZZR00-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-TKMZZR00-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE TKMZZR00_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZZR00-CR-OPEN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ  =["     @3212SEINO@@
      D             FLG-TKMZZR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグA =["     @3212SEINO@@
      D             FLG-TKMZZI00-CRA-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-TKMZZI00-CRA-OPEN = CNS-ON                           @3212SEINO@@
           THEN
             EXEC  SQL
                 CLOSE TKMZZI00_CURSOR_A                                @3212SEINO@@
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZZI00-CRA-OPEN       @3212SEINO@@
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグA =["     @3212SEINO@@
      D             FLG-TKMZZI00-CRA-OPEN"]"                            @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグB =["     @3212SEINO@@
      D             FLG-TKMZZI00-CRB-OPEN"]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZZI00-CRB-OPEN = CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
                 CLOSE TKMZZI00_CURSOR_B                                @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-TKMZZI00-CRB-OPEN       @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグB =["     @3212SEINO@@
      D             FLG-TKMZZI00-CRB-OPEN"]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直近残高異動カーソルオープンフラグA=["  @3212SEINO@@
      D             FLG-TKMZZI00-CR9A-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------
           IF  FLG-TKMZZI00-CR9A-OPEN = CNS-ON                          @3212SEINO@@
           THEN
             EXEC  SQL
                 CLOSE TKMZZI00_CUR9A                                   @3212SEINO@@
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR9A-OPEN      @3212SEINO@@
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直近残高異動カーソルオープンフラグA=["  @3212SEINO@@
      D             FLG-TKMZZI00-CR9A-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":直近残高異動カーソルオープンフラグB=["  @3212SEINO@@
      D             FLG-TKMZZI00-CR9B-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZZI00-CR9B-OPEN = CNS-ON                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
                 CLOSE TKMZZI00_CUR9B                                   @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR9B-OPEN      @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":直近残高異動カーソルオープンフラグB=["  @3212SEINO@@
      D             FLG-TKMZZI00-CR9B-OPEN"]"                           @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カーソルをクローズ  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR-CLOSE-EXT.
           EXIT.
