      ******************************************************************
      *$Header: $
      ******************************************************************
      *
      *     システムＩＤ   : T-STAR
      *     システム名称   : 新有価証券バックオフィスシステム
      *     プログラム名称 : 最適化管理明細テーブル更新処理
      *     処理概要       : ①最適化管理テーブル(TKDYAA53)とシステム表
      *                    : (USER_TABLES,USER_TAB_PARTITIONS)の状況によ
      *                    : り、最適化管理明細テーブルのレコード
      *                    : 追加・削除を行う。
      *                    : ②最適化管理テーブル(TKDYAA53)・最適化管理
      *                    : 明細テーブル(TKDYAA56)に設定された優先順位
      *                    : の状態により、最適化管理明細テーブルの優先
      *                    : 順位を更新する。
      *     引数           : IN  基準日
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20130219   新規  GUT        高楽  　新規作成
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    MDYB1403.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  13-02-19.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V  WITH  DEBUGGING  MODE.
       OBJECT-COMPUTER.       RP5470.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *                   作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id: $".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
       01  CONST-AREA.
      *----------  プログラムＩＤ
         05  CNS-PROGRAM-ID        PIC  X(08)  VALUE "MDYB1403".
      *----------  最適化管理テーブル
         05  CNS-TBL-TKDYAA53      PIC  X(08)  VALUE "TKDYAA53".
      *----------  最適化管理明細テーブル
         05  CNS-TBL-TKDYAA56      PIC  X(08)  VALUE "TKDYAA56".
      *----------  リターンコード: 正常終了
         05  CNS-RET-CD-NORMAL     PIC  X(03)  VALUE "000".
      *----------  リターンコード: システムエラー（Oracle）
         05  CNS-RET-CD-ORAERR     PIC  X(03)  VALUE "900".
      *----------  リターンコード: システムエラー（Oracle以外）
         05  CNS-RET-CD-SYSERR     PIC  X(03)  VALUE "901".
         05  CNS-SQL-NORMAL        PIC  S9(04)  COMP-3 VALUE +0000.
         05  CNS-SQL-NOTFOUND      PIC  S9(04)  COMP-3 VALUE +1403.
      *----------  OPEN FLG
         05  CNS-ON                PIC  9(01)  VALUE  1.
      *----------  CLOSE FLG
         05  CNS-OFF               PIC  9(01)  VALUE  0.
      ******************************************************************
      *                   ワーク  エリア
      ******************************************************************
       01  WK-AREA.
      *----------  戻り値
         05  WK-RTN-STS            PIC  9(02).
      *----------  基準日
         05  WK-KJN-YMD            PIC  X(08).
         05  WK-TAB-TKDYAA53       PIC  X(13).
         05  WK-TAB-TKDYAA56       PIC  X(13).
         05  WK-PROGRAM-ID         PIC  X(16).
         05  WK-SQL-CONNECT        PIC  X(89).
         05  WK-COMMIT-RELEASE     PIC  X(15).
         05  WK-ERR-SQLSTMT        PIC  X(400).
         05  WK-TBL-KBN            PIC  X(01).
         05  WK-LEN                PIC  9(02).
      *
      *----------  ワークRTNパッケージ
       01  WK-KYOUTUU-RTNPKG.
         05  WK-PARM-RTNPKG.
           COPY "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                      フラグエリア
      ******************************************************************
       01  FLAG-AREA.
         05  FLG-CR1-OPEN          PIC  9(01).
         05  FLG-CR2-OPEN          PIC  9(01).
         05  FLG-CR3-OPEN          PIC  9(01).
         05  FLG-CR4-OPEN          PIC  9(01).
         05  FLG-LOOP-END          PIC  9(01).
      *----------  Oracle接続判定フラグ
         05  FLG-ORA-CONNECT       PIC  9(01).
      ******************************************************************
      *                サブプログラム             パラメ－タ  エリア
      ******************************************************************
      *----------  バッチ開始メッセージ出力ルーチン
       01  PARM-SCZY7010-INOUT.
           COPY  "SCZY7010.cpy".
      *
      *----------  バッチ終了メッセージ出力ルーチン
       01  PARM-SCZY7020-INOUT.
           COPY "SCZY7020.cpy".
      *
      *----------  バッチ引数一括取得ルーチン
       01  PARM-SCZY7090-INOUT.
           COPY  "SCZY7090.cpy".
      *
      *----------  バッチＤＢ接続情報取得ルーチン
       01  PARM-SCZY7100-INOUT.
           COPY  "SCZY7100.cpy".
      *
      *----------  リターンパッケージセットルーチン
       01  PARM-SCZY1170-INOUT.
      *----------  リターンパッケージセットルーチンコピー句
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *
      *----------  テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      ******************************************************************
      *    SQL通信, ORACLE通信,ホスト変数定義 エリア
      ******************************************************************
           EXEC SQL INCLUDE  SQLCA             END-EXEC.
           EXEC SQL BEGIN DECLARE  SECTION     END-EXEC.
       01  ORA-WORKING-ITEMS.
      *----------  ORACLE接続
         05  H-ORA-USER            PIC  X(80).
         05  H-TABLE-NAME          PIC  X(20).
         05  H-PARTITION-NAME      PIC  X(30).
         05  H-TBL-ID              PIC  X(20).
         05  H-A-PRIO              PIC  9(02).
         05  H-B-PRIO              PIC  9(02).
         05  SQLSTMT1              PIC  X(500)  VARYING.
         05  SQLSTMT2              PIC  X(400)  VARYING.
           EXEC SQL END  DECLARE   SECTION     END-EXEC.
      ******************************************************************
      *
      *        手  続  き  部
      *
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
      *                      MDYB1403処理
      ******************************************************************
       MDYB1403-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  MDYB1403-RTN  START  ***"
      *-----------------------------------------------------------------
      *----------  前処理
           PERFORM  INIT-RTN
      *----------  主処理
           PERFORM  MAIN-RTN
      *----------  後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  MDYB1403-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MDYB1403-EXT.
           STOP RUN WK-RTN-STS.
      ******************************************************************
      *               前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   WK-AREA
                        WK-KYOUTUU-RTNPKG
                        ORA-WORKING-ITEMS
                        FLAG-AREA
                        PARM-SCZY7010-INOUT
                        PARM-SCZY7020-INOUT
                        PARM-SCZY7090-INOUT
                        PARM-SCZY7100-INOUT
                        PARM-SCZY1160-INOUT
                        PARM-SCZY1170-INOUT
                        PARM-SCZY1170-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-AREA            =["WK-AREA"]"
      D    DISPLAY  "WK-KYOUTUU-RTNPKG  =["WK-KYOUTUU-RTNPKG"]"
      D    DISPLAY  "ORA-WORKING-ITEMS  =["ORA-WORKING-ITEMS"]"
      D    DISPLAY  "FLAG-AREA          =["FLAG-AREA"]"
      D    DISPLAY  "PARM-SCZY7010-INOUT=["PARM-SCZY7010-INOUT"]"
      D    DISPLAY  "PARM-SCZY7020-INOUT=["PARM-SCZY7020-INOUT"]"
      D    DISPLAY  "PARM-SCZY7090-INOUT=["PARM-SCZY7090-INOUT"]"
      D    DISPLAY  "PARM-SCZY7100-INOUT=["PARM-SCZY7100-INOUT"]"
      D    DISPLAY  "PARM-SCZY1160-INOUT=["PARM-SCZY1160-INOUT"]"
      D    DISPLAY  "PARM-SCZY1170-INOUT=["PARM-SCZY1170-INOUT"]"
      D    DISPLAY  "PARM-SCZY1170-RTNPKG=["PARM-SCZY1170-RTNPKG"]"
      *-----------------------------------------------------------------
      *----------  バッチ開始メッセージ出力ルーチン処理
           PERFORM  SCZY7010-RTN
      *----------  バッチ引数取得ルーチン処理
           PERFORM  SCZY7090-RTN
      *----------  バッチ引数一括取得ルーチン
           PERFORM  SCZY7100-RTN
      *----------  DB接続処理
           PERFORM  DB-CONNECT-RTN
      *----------  テーブルID取得ルーチン処理
           PERFORM  SCZY1160-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  INIT-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *                 バッチ開始メッセージ出力ルーチン処理
      ******************************************************************
       SCZY7010-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY7010処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-PROGRAM-ID
             TO  PGM-ID                      OF PARM-SCZY7010-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "PGM-ID                  OF PARM-SCZY7010-INOUT=["
      D              PGM-ID                  OF PARM-SCZY7010-INOUT"]"
      D    DISPLAY  "CALL バッチ開始メッセージ出力ルーチSCZY7010 開始"
      *-----------------------------------------------------------------
           CALL "SCZY7010"                USING  PARM-SCZY7010-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CALL バッチ開始メッセージ出力ルーチSCZY7010 終了"
      D    DISPLAY  "***  SCZY7010処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7010-EXT.
           EXIT.
      ******************************************************************
      *                 バッチ引数一括取得ルーチン
      ******************************************************************
       SCZY7090-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY7090処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  1
             TO  ARG-NUM                     OF PARM-SCZY7090-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG-NUM                 OF PARM-SCZY7090-INOUT=["
      D              ARG-NUM                 OF PARM-SCZY7090-INOUT"]"
      D    DISPLAY  "CALL バッチ引数一括取得ルーチンSCZY7090 開始"
      *-----------------------------------------------------------------
           CALL  "SCZY7090"               USING  PARM-SCZY7090-INOUT
                                                 WK-KYOUTUU-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CALL バッチ引数一括取得ルーチンSCZY7090 終了"
      D    DISPLAY  "RTN-CD                  OF PARM-SCZY7090-RTNPKG=["
      D              RTN-CD                  OF WK-KYOUTUU-RTNPKG
      D                             (COUNTER OF WK-KYOUTUU-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                        OF WK-KYOUTUU-RTNPKG
                                    (COUNTER OF WK-KYOUTUU-RTNPKG)
               = CNS-RET-CD-NORMAL
           THEN
               MOVE  ARG-STRING              OF PARM-SCZY7090-ARG2(1)
                 TO  WK-KJN-YMD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "基準日        =["WK-KJN-YMD"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0001"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-SYSERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
               MOVE  WK-KYOUTUU-RTNPKG       TO PARM-SCZY1170-RTNPKG
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY7090処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7090-EXT.
           EXIT.
      ******************************************************************
      *             バッチＤＢ接続情報取得ルーチン処理
      ******************************************************************
       SCZY7100-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY7100処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-KYOUTUU-RTNPKG
           MOVE  "C000"
             TO  RIYO-CMP-CD                 OF PARM-SCZY7100-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD             OF PARM-SCZY7100-INOUT=["
      D              RIYO-CMP-CD             OF PARM-SCZY7100-INOUT"]"
      D    DISPLAY  "CALL バッチＤＢ接続情報取得ルーチンSCZY7100 開始"
      *-----------------------------------------------------------------
           CALL "SCZY7100"                USING  PARM-SCZY7100-INOUT
                                                 WK-KYOUTUU-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CALL バッチＤＢ接続情報取得ルーチンSCZY7100 終了"
      D    DISPLAY  "RTN-CD                  OF PARM-SCZY7100-RTNPKG=["
      D              RTN-CD                  OF WK-KYOUTUU-RTNPKG
      D                             (COUNTER OF WK-KYOUTUU-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                        OF WK-KYOUTUU-RTNPKG
                                    (COUNTER OF WK-KYOUTUU-RTNPKG)
               NOT = CNS-RET-CD-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0002"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-SYSERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
               MOVE  WK-KYOUTUU-RTNPKG       TO PARM-SCZY1170-RTNPKG
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY7100処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7100-EXT.
           EXIT.
      ******************************************************************
      *                 ＤＢ接続処理
      ******************************************************************
       DB-CONNECT-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ＤＢ接続処理  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
               WHENEVER SQLERROR CONTINUE
           END-EXEC
           MOVE  DB-SETUZOKU-JYOUHOU         OF PARM-SCZY7100-ARG2
             TO  H-ORA-USER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "H-ORA-USER=["H-ORA-USER"]"
      *-----------------------------------------------------------------
           EXEC SQL
               CONNECT :H-ORA-USER
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *----------  ORACLE接続成功
               MOVE  CNS-ON                  TO FLG-ORA-CONNECT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      D    DISPLAY  "ORACLE接続成功"
      *-----------------------------------------------------------------
           ELSE
               STRING  "CONNECT :"
                       H-ORA-USER
                       DELIMITED BY SIZE
                       INTO  WK-SQL-CONNECT
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0003"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-SQL-CONNECT
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ＤＢ接続処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-CONNECT-EXT.
           EXIT.
      ******************************************************************
      *                 テーブルID取得処理
      ******************************************************************
       SCZY1160-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY1160処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-KYOUTUU-RTNPKG
      *----------  利用会社コード
           MOVE  "C000"
             TO  RIYO-CMP-CD                 OF PARM-SCZY1160-ARG1
      *---------- テーブルID
           MOVE  CNS-TBL-TKDYAA53
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(1)
           MOVE  CNS-TBL-TKDYAA56
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD             OF PARM-SCZY1160-ARG1=["
      D              RIYO-CMP-CD             OF PARM-SCZY1160-ARG1"]"
      D    DISPLAY  "TBL-ID                  OF PARM-SCZY1160-ARG1(1)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  "TBL-ID                  OF PARM-SCZY1160-ARG1(2)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  "CALL テーブルID取得ルーチンSCZY1160 開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"               USING  PARM-SCZY1160-INOUT
                                                 WK-KYOUTUU-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CALL テーブルID取得ルーチンSCZY1160 終了"
      D    DISPLAY  "RTN-CD                  OF PARM-SCZY1160-RTNPKG=["
      D              RTN-CD                  OF WK-KYOUTUU-RTNPKG
      D                             (COUNTER OF WK-KYOUTUU-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                        OF WK-KYOUTUU-RTNPKG
                                    (COUNTER OF WK-KYOUTUU-RTNPKG)
               = CNS-RET-CD-NORMAL
           THEN
               MOVE  HENSYUGO-TBL-ID         OF PARM-SCZY1160-ARG2(1)
                 TO  WK-TAB-TKDYAA53
               MOVE  HENSYUGO-TBL-ID         OF PARM-SCZY1160-ARG2(2)
                 TO  WK-TAB-TKDYAA56
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-TAB-TKDYAA53=["WK-TAB-TKDYAA53"]"
      D    DISPLAY  "WK-TAB-TKDYAA56=["WK-TAB-TKDYAA56"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0004"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-SYSERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
               MOVE  WK-KYOUTUU-RTNPKG       TO PARM-SCZY1170-RTNPKG
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY1160処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1160-EXT.
           EXIT.
      ******************************************************************
      *               主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  MAIN-RTN  START  ***"
      *-----------------------------------------------------------------
      *----------  不一致分を削除する
           PERFORM  DEL-FUICHI-RTN
      *----------  新規テーブルを追加する
           PERFORM  ADD-TBL-RTN
      *----------  新規パーティションテーブルを追加する
           PERFORM  ADD-PARTBL-RTN
      *----------  最適化管理テーブルの設定ミスに対して、関連ログを出力する
           PERFORM  SYUTURYOKU-TK53-RTN
      *----------  優先順位を更新する
           PERFORM  UPD-YUSENJYUNI-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  MAIN-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *              3.2.1.不一致分を削除する
      ******************************************************************
       DEL-FUICHI-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  不一致分を削除する  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-PROGRAM-ID              TO WK-PROGRAM-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "基準日 =["WK-KJN-YMD"]"
      D    DISPLAY  "プログラムID =["WK-PROGRAM-ID"]"
      D    DISPLAY  "***  システム表の状況と不一致になったデータを"
      D             "削除する  START  ***"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT1
           MOVE  1                           TO SQLSTMT1-LEN
           STRING  "DELETE FROM "
                   WK-TAB-TKDYAA56
                   " C WHERE "
                   " (TRIM(C.TBL_ID),"
                   " NVL(TRIM(C.PARTITION_NAME),' '))  NOT IN "
                   " ((SELECT A.TABLE_NAME, ' ' FROM USER_TABLES A "
                   " WHERE A.PARTITIONED = 'NO') "
                   " UNION ALL "
                   " (SELECT B.TABLE_NAME, B.PARTITION_NAME "
                   " FROM USER_TAB_PARTITIONS B))"
               DELIMITED BY SIZE
               INTO  SQLSTMT1-ARR
               POINTER  SQLSTMT1-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT1-ARR=["SQLSTMT1-ARR"]"
      D    DISPLAY  "SQLSTMT1-LEN=["SQLSTMT1-LEN"]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE D01  FROM :SQLSTMT1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0005"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
           EXEC SQL
               EXECUTE D01
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DEL1)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
               AND SQLCODE  NOT = CNS-SQL-NOTFOUND
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0006"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "処理継続"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  システム表の状況と不一致になったデータを"
      D             "削除する  END  ***"
      D    DISPLAY  "***  最適化管理テーブル(TKDYAA53)の状況と不一致"
      D             "になったデータを削除する  START  ***"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT2
           MOVE  1                           TO SQLSTMT2-LEN
           STRING  "DELETE FROM "
                   WK-TAB-TKDYAA56
                   " B WHERE "
                   " SUBSTR(B.TBL_ID, 1, 8) NOT IN "
                   " (SELECT TRIM(A.TBL_ID) "
                   " FROM "
                   WK-TAB-TKDYAA53
                   " A)"
               DELIMITED BY SIZE
               INTO  SQLSTMT2-ARR
               POINTER  SQLSTMT2-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT2-ARR=["SQLSTMT2-ARR"]"
      D    DISPLAY  "SQLSTMT2-LEN=["SQLSTMT2-LEN"]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文 PREPARE
           EXEC SQL
               PREPARE D02  FROM :SQLSTMT2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0007"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT2-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
           EXEC SQL
               EXECUTE D02
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DEL2)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
               AND SQLCODE  NOT = CNS-SQL-NOTFOUND
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0008"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT2-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "処理継続"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  最適化管理テーブル(TKDYAA53)の状況と不一致"
      D             "になったデータを削除する  END  ***"
      D    DISPLAY  "***  不一致分を削除する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-FUICHI-EXT.
           EXIT.
      ******************************************************************
      *               3.2.2.新規テーブルを追加する
      ******************************************************************
       ADD-TBL-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*** 新規テーブルを追加する START ***"
      *-----------------------------------------------------------------
      *----------  カーソル1をオープンする
           PERFORM  CURSOR1-OPEN-RTN
      *----------  カーソル1をフェッチする
           PERFORM  CURSOR1-FETCH-RTN
      *----------  カーソル1をクローズする
           PERFORM  CURSOR1-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*** 新規テーブルを追加する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ADD-TBL-EXT.
           EXIT.
      ******************************************************************
      *    カーソル1 OPEN処理
      ******************************************************************
       CURSOR1-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル1 OPEN処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT1
           MOVE  1                           TO SQLSTMT1-LEN
           STRING  "SELECT A.TABLE_NAME, NVL(C.TBL_ID,' ') "
                   " FROM USER_TABLES A "
                   " INNER JOIN "
                   WK-TAB-TKDYAA53
                   " B ON ( A.PARTITIONED = 'NO' AND "
                   " SUBSTR(A.TABLE_NAME, 1, 8) = TRIM(B.TBL_ID) ) "
                   "  LEFT JOIN "
                    WK-TAB-TKDYAA56
                   " C ON ( A.TABLE_NAME = TRIM(C.TBL_ID) ) "
               DELIMITED BY SIZE
               INTO  SQLSTMT1-ARR
               POINTER  SQLSTMT1-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT1-ARR=["SQLSTMT1-ARR"]"
      D    DISPLAY  "SQLSTMT1-LEN=["SQLSTMT1-LEN"]"
      *-----------------------------------------------------------------
      *----------  SQL文 PREPARE
           EXEC SQL
             PREPARE S01  FROM :SQLSTMT1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0009"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
             DECLARE CR1 CURSOR  FOR S01
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0010"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *----------  カーソル OPEN
           EXEC SQL
             OPEN  CR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0011"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  CNS-ON                  TO FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR1-OPEN=["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル1 OPEN処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソル1 FETCH処理
      ******************************************************************
       CURSOR1-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル1 FETCH処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-ON                      TO FLG-LOOP-END
           PERFORM  UNTIL  FLG-LOOP-END = CNS-OFF
             MOVE  SPACE                     TO H-TABLE-NAME
             MOVE  SPACE                     TO H-TBL-ID
      *----------  カーソル FETCH
             EXEC SQL
               FETCH  CR1
                INTO  :H-TABLE-NAME,
                      :H-TBL-ID
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 IF  H-TBL-ID = SPACE
                 THEN
                     IF  H-TABLE-NAME(9:1) = ' '
                     THEN
                         MOVE  " "           TO WK-TBL-KBN
                     ELSE
                         MOVE  "C"           TO WK-TBL-KBN
                     END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得されたテーブルID IS SPACE"
      D    DISPLAY  "H-TABLE-NAME=["H-TABLE-NAME"]"
      D    DISPLAY  "WK-TBL-KBN=["WK-TBL-KBN"]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
                     INITIALIZE  SQLSTMT2
                     MOVE  1                 TO SQLSTMT2-LEN
                     STRING  "INSERT INTO "
                             WK-TAB-TKDYAA56
                             " VALUES "
                             " (:V1,' ',99,:V2,' ',0,NULL,NULL,"
                             "0,SYSDATE,' ',' ',:V3)"
                         DELIMITED BY SIZE
                         INTO  SQLSTMT2-ARR
                         POINTER  SQLSTMT2-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT2-ARR=["SQLSTMT2-ARR"]"
      D    DISPLAY  "SQLSTMT2-LEN=["SQLSTMT2-LEN"]"
      *-----------------------------------------------------------------
                     STRING  SQLSTMT2-ARR
                            "[V1:" H-TABLE-NAME "]"
                            "[V2:" WK-TBL-KBN "]"
                            "[V3:" WK-PROGRAM-ID "]"
                        DELIMITED  BY  SIZE
                        INTO  WK-ERR-SQLSTMT
      *----------  ＳＱＬ文 PREPARE
                     EXEC SQL
                         PREPARE I01  FROM :SQLSTMT2
                     END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
                     IF  SQLCODE  NOT = CNS-SQL-NORMAL
                     THEN
      *----------  エラー検知プログラム名
                         MOVE  CNS-PROGRAM-ID
                           TO  ERR-PGM-ID    OF PARM-SCZY1170-ARG1
      *----------  ポジション
                         MOVE  "0012"
                           TO  ERR-POS       OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                         MOVE  CNS-RET-CD-ORAERR
                           TO  RTN-CD        OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                         MOVE  SQLCODE
                           TO  DETAIL-RTN-CD OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                         MOVE  "1"           TO DETAIL-RTN-CD-FLG
                                             OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                         MOVE  WK-ERR-SQLSTMT
                           TO  FREE-MSG      OF PARM-SCZY1170-ARG1
                         PERFORM  ERR-RTN
                     END-IF
                     EXEC SQL
                         EXECUTE I01
                         USING :H-TABLE-NAME,
                               :WK-TBL-KBN,
                               :WK-PROGRAM-ID
                     END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(INS1)=["SQLCODE"]"
      *-----------------------------------------------------------------
                     IF  SQLCODE  NOT = CNS-SQL-NORMAL
                     THEN
      *----------  エラー検知プログラム名
                         MOVE  CNS-PROGRAM-ID
                           TO  ERR-PGM-ID    OF PARM-SCZY1170-ARG1
      *----------  ポジション
                         MOVE  "0013"
                           TO  ERR-POS       OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                         MOVE  CNS-RET-CD-ORAERR
                           TO  RTN-CD        OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                         MOVE  SQLCODE
                           TO  DETAIL-RTN-CD OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                         MOVE  "1"           TO DETAIL-RTN-CD-FLG
                                             OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                         MOVE  WK-ERR-SQLSTMT
                           TO  FREE-MSG      OF PARM-SCZY1170-ARG1
                         PERFORM  ERR-RTN
                     ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "処理継続"
      *-----------------------------------------------------------------
                         CONTINUE
                     END-IF
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "H-TBL-ID=["H-TBL-ID"]"
      D    DISPLAY  "取得されたテーブルID 存在 IN TKDYAA56,追加しない"
      *-----------------------------------------------------------------
                     CONTINUE
                 END-IF
               WHEN  CNS-SQL-NOTFOUND
                 MOVE  CNS-OFF               TO FLG-LOOP-END
               WHEN  OTHER
      *----------  エラー検知プログラム名
                 MOVE  CNS-PROGRAM-ID
                   TO  ERR-PGM-ID            OF PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  "0014"
                   TO  ERR-POS               OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RET-CD-ORAERR
                   TO  RTN-CD                OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD         OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  "1"
                   TO  DETAIL-RTN-CD-FLG     OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                 MOVE  SQLSTMT1-ARR
                   TO  FREE-MSG              OF PARM-SCZY1170-ARG1
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル1 FETCH処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    カーソル1 CLOSE処理
      ******************************************************************
       CURSOR1-CLOSE-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル1 CLOSE処理  START  ***"
      *-----------------------------------------------------------------
           IF  FLG-CR1-OPEN = CNS-ON
           THEN
               EXEC SQL
                 CLOSE  CR1
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE)=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  = CNS-SQL-NORMAL
               THEN
                   MOVE  CNS-OFF             TO FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR1-OPEN=["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  エラー検知プログラム名
                   MOVE  CNS-PROGRAM-ID
                     TO  ERR-PGM-ID          OF PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  "0015"
                     TO  ERR-POS             OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RET-CD-ORAERR
                     TO  RTN-CD              OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE
                     TO  DETAIL-RTN-CD       OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  "1"
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  SQLSTMT1-ARR
                     TO  FREE-MSG            OF PARM-SCZY1170-ARG1
                   PERFORM  ERR-RTN
               END-IF
           ELSE
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル1 CLOSE処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *              3.2.3.新規パーティションテーブルを追加する
      ******************************************************************
       ADD-PARTBL-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*** 新規パーティションテーブルを追加する START ***"
      *-----------------------------------------------------------------
      *----------  カーソル2をオープンする
           PERFORM  CURSOR2-OPEN-RTN
      *----------  カーソル2をフェッチする
           PERFORM  CURSOR2-FETCH-RTN
      *----------  カーソル2をクローズする
           PERFORM  CURSOR2-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*** 新規パーティションテーブルを追加する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ADD-PARTBL-EXT.
           EXIT.
      ******************************************************************
      *    カーソル2 OPEN処理
      ******************************************************************
       CURSOR2-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル2 OPEN処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT1
           MOVE  1                           TO SQLSTMT1-LEN
           STRING  "SELECT A.TABLE_NAME,A.PARTITION_NAME, "
                   " NVL(C.TBL_ID,' ') "
                   " FROM USER_TAB_PARTITIONS A "
                   " INNER JOIN "
                   WK-TAB-TKDYAA53
                   " B ON "
                   " (SUBSTR(A.TABLE_NAME, 1, 8) = TRIM(B.TBL_ID) ) "
                   "  LEFT JOIN "
                    WK-TAB-TKDYAA56
                   " C ON ( A.TABLE_NAME = TRIM(C.TBL_ID) AND "
                   " A.PARTITION_NAME = TRIM(C.PARTITION_NAME) )"
               DELIMITED BY SIZE
               INTO  SQLSTMT1-ARR
               POINTER  SQLSTMT1-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT1-ARR=["SQLSTMT1-ARR"]"
      D    DISPLAY  "SQLSTMT1-LEN=["SQLSTMT1-LEN"]"
      *-----------------------------------------------------------------
      *----------  SQL文 PREPARE
           EXEC SQL
             PREPARE S02  FROM :SQLSTMT1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0016"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
             DECLARE CR2 CURSOR  FOR S02
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0017"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *----------  カーソル OPEN
           EXEC SQL
             OPEN  CR2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0018"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  CNS-ON                  TO FLG-CR2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR2-OPEN=["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル2 OPEN処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR2-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソル2 FETCH処理
      ******************************************************************
       CURSOR2-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル2 FETCH処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-ON                      TO FLG-LOOP-END
           PERFORM  UNTIL  FLG-LOOP-END = CNS-OFF
             MOVE  SPACE                     TO H-TABLE-NAME
             MOVE  SPACE                     TO H-PARTITION-NAME
             MOVE  SPACE                     TO H-TBL-ID
      *----------  カーソル FETCH
             EXEC SQL
               FETCH  CR2
                INTO  :H-TABLE-NAME,
                      :H-PARTITION-NAME,
                      :H-TBL-ID
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 IF  H-TBL-ID = SPACE
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得されたテーブルID IS SPACE"
      D    DISPLAY  "H-TABLE-NAME=["H-TABLE-NAME"]"
      D    DISPLAY  "H-PARTITION-NAME=["H-PARTITION-NAME"]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
                     INITIALIZE  SQLSTMT2
                     MOVE  SPACE             TO WK-ERR-SQLSTMT
                     MOVE  1                 TO SQLSTMT2-LEN
                     STRING  "INSERT INTO "
                             WK-TAB-TKDYAA56
                             " VALUES "
                             " (:V1,:V2,99,'P',' ',0,NULL,NULL,"
                             "0,SYSDATE,' ',' ',:V3)"
                         DELIMITED BY SIZE
                         INTO  SQLSTMT2-ARR
                         POINTER  SQLSTMT2-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT2-ARR=["SQLSTMT2-ARR"]"
      D    DISPLAY  "SQLSTMT2-LEN=["SQLSTMT2-LEN"]"
      *-----------------------------------------------------------------
                     STRING  SQLSTMT2-ARR
                            "[V1:" H-TABLE-NAME "]"
                            "[V2:" H-PARTITION-NAME "]"
                            "[V3:" WK-PROGRAM-ID "]"
                        DELIMITED  BY  SIZE
                        INTO  WK-ERR-SQLSTMT
      *----------  ＳＱＬ文 PREPARE
                     EXEC SQL
                         PREPARE I02  FROM :SQLSTMT2
                     END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
                     IF  SQLCODE  NOT = CNS-SQL-NORMAL
                     THEN
      *----------  エラー検知プログラム名
                         MOVE  CNS-PROGRAM-ID
                           TO  ERR-PGM-ID    OF PARM-SCZY1170-ARG1
      *----------  ポジション
                         MOVE  "0019"
                           TO  ERR-POS       OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                         MOVE  CNS-RET-CD-ORAERR
                           TO  RTN-CD        OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                         MOVE  SQLCODE
                           TO  DETAIL-RTN-CD OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                         MOVE  "1"           TO DETAIL-RTN-CD-FLG
                                             OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                         MOVE  WK-ERR-SQLSTMT
                           TO  FREE-MSG      OF PARM-SCZY1170-ARG1
                         PERFORM  ERR-RTN
                     END-IF
                     EXEC SQL
                         EXECUTE I02
                         USING :H-TABLE-NAME,
                               :H-PARTITION-NAME,
                               :WK-PROGRAM-ID
                     END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(INS2)=["SQLCODE"]"
      *-----------------------------------------------------------------
                     IF  SQLCODE  NOT = CNS-SQL-NORMAL
                     THEN
      *----------  エラー検知プログラム名
                         MOVE  CNS-PROGRAM-ID
                           TO  ERR-PGM-ID    OF PARM-SCZY1170-ARG1
      *----------  ポジション
                         MOVE  "0020"
                           TO  ERR-POS       OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                         MOVE  CNS-RET-CD-ORAERR
                           TO  RTN-CD        OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                         MOVE  SQLCODE
                           TO  DETAIL-RTN-CD OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                         MOVE  "1"             TO DETAIL-RTN-CD-FLG
                                             OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                         MOVE  WK-ERR-SQLSTMT
                           TO  FREE-MSG      OF PARM-SCZY1170-ARG1
                         PERFORM  ERR-RTN
                     ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "処理継続"
      *-----------------------------------------------------------------
                         CONTINUE
                     END-IF
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "H-TABLE-NAME=["H-TABLE-NAME"]"
      D    DISPLAY  "H-PARTITION-NAME=["H-PARTITION-NAME"]"
      D    DISPLAY  "取得されたテーブルID 存在 IN TKDYAA56,追加しない"
      *-----------------------------------------------------------------
                     CONTINUE
                 END-IF
               WHEN  CNS-SQL-NOTFOUND
                 MOVE  CNS-OFF               TO FLG-LOOP-END
               WHEN  OTHER
      *----------  エラー検知プログラム名
                 MOVE  CNS-PROGRAM-ID
                   TO  ERR-PGM-ID            OF PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  "0021"
                   TO  ERR-POS               OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RET-CD-ORAERR
                   TO  RTN-CD                OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD         OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  "1"
                   TO  DETAIL-RTN-CD-FLG     OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                 MOVE  SQLSTMT1-ARR
                   TO  FREE-MSG              OF PARM-SCZY1170-ARG1
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル2 FETCH処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR2-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    カーソル2 CLOSE処理
      ******************************************************************
       CURSOR2-CLOSE-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル2 CLOSE処理  START  ***"
      *-----------------------------------------------------------------
           IF  FLG-CR2-OPEN = CNS-ON
           THEN
               EXEC SQL
                 CLOSE  CR2
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE)=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  = CNS-SQL-NORMAL
               THEN
                   MOVE  CNS-OFF             TO FLG-CR2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR2-OPEN=["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  エラー検知プログラム名
                   MOVE  CNS-PROGRAM-ID
                     TO  ERR-PGM-ID          OF PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  "0022"
                     TO  ERR-POS             OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RET-CD-ORAERR
                     TO  RTN-CD              OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE
                     TO  DETAIL-RTN-CD       OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  "1"
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  SQLSTMT1-ARR
                     TO  FREE-MSG            OF PARM-SCZY1170-ARG1
                   PERFORM  ERR-RTN
               END-IF
           ELSE
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル2 CLOSE処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR2-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.4.最適化管理テーブルの設定ミスに対して、関連ログを出力する
      ******************************************************************
       SYUTURYOKU-TK53-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  最適化管理テーブルの設定ミスに対して、"
      D             "関連ログを出力する  START ***"
      *-----------------------------------------------------------------
      *----------  カーソル3をオープンする
           PERFORM  CURSOR3-OPEN-RTN
      *----------  カーソル3をフェッチする
           PERFORM  CURSOR3-FETCH-RTN
      *----------  カーソル3をクローズする
           PERFORM  CURSOR3-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  最適化管理テーブルの設定ミスに対して、"
      D             "関連ログを出力する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SYUTURYOKU-TK53-EXT.
           EXIT.
      ******************************************************************
      *    カーソル3 OPEN処理
      ******************************************************************
       CURSOR3-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル3 OPEN処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT1
           MOVE  1                           TO SQLSTMT1-LEN
           STRING  "(SELECT A.TBL_ID "
                   " FROM "
                   WK-TAB-TKDYAA53
                   " A WHERE (A.TABLE_KBN = ' ' OR A.TABLE_KBN = 'C') "
                   " AND NOT EXISTS "
                   " (SELECT NULL FROM USER_TABLES B "
                   " WHERE SUBSTR(B.TABLE_NAME, 1, 8) = "
                   " TRIM(A.TBL_ID) AND B.PARTITIONED = 'NO') ) "
                   " UNION ALL "
                   " (SELECT C.TBL_ID "
                   " FROM "
                   WK-TAB-TKDYAA53
                   " C WHERE C.TABLE_KBN = 'P' "
                   " AND NOT EXISTS "
                   "(SELECT NULL FROM USER_TABLES D "
                   " WHERE SUBSTR(D.TABLE_NAME, 1, 8) = "
                   " TRIM(C.TBL_ID) AND D.PARTITIONED = 'YES') ) "
               DELIMITED BY SIZE
               INTO  SQLSTMT1-ARR
               POINTER  SQLSTMT1-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT1-ARR=["SQLSTMT1-ARR"]"
      D    DISPLAY  "SQLSTMT1-LEN=["SQLSTMT1-LEN"]"
      *-----------------------------------------------------------------
      *----------  SQL文 PREPARE
           EXEC SQL
             PREPARE S03  FROM :SQLSTMT1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0023"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
             DECLARE CR3 CURSOR  FOR S03
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0024"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *----------  カーソル OPEN
           EXEC SQL
             OPEN  CR3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0025"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  CNS-ON                  TO FLG-CR3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR3-OPEN=["FLG-CR3-OPEN"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル3 OPEN処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR3-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソル3 FETCH処理
      ******************************************************************
       CURSOR3-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル3 FETCH処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-ON                      TO FLG-LOOP-END
           PERFORM  UNTIL  FLG-LOOP-END = CNS-OFF
             MOVE  SPACE                     TO H-TBL-ID
      *----------  カーソル FETCH
             EXEC SQL
               FETCH  CR3
                INTO  :H-TBL-ID
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 DISPLAY  "TKDYAA53設定ミスの為SKIPしました："H-TBL-ID
               WHEN  CNS-SQL-NOTFOUND
                 MOVE  CNS-OFF               TO FLG-LOOP-END
               WHEN  OTHER
      *----------  エラー検知プログラム名
                 MOVE  CNS-PROGRAM-ID
                   TO  ERR-PGM-ID            OF PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  "0026"
                   TO  ERR-POS               OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RET-CD-ORAERR
                   TO  RTN-CD                OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD         OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  "1"
                   TO  DETAIL-RTN-CD-FLG     OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                 MOVE  SQLSTMT1-ARR
                   TO  FREE-MSG              OF PARM-SCZY1170-ARG1
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル3 FETCH処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR3-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    カーソル3 CLOSE処理
      ******************************************************************
       CURSOR3-CLOSE-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル3 CLOSE処理  START  ***"
      *-----------------------------------------------------------------
           IF  FLG-CR3-OPEN = CNS-ON
           THEN
               EXEC SQL
                 CLOSE  CR3
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE)=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  = CNS-SQL-NORMAL
               THEN
                   MOVE  CNS-OFF             TO FLG-CR3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR3-OPEN=["FLG-CR3-OPEN"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  エラー検知プログラム名
                   MOVE  CNS-PROGRAM-ID
                     TO  ERR-PGM-ID          OF PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  "0027"
                     TO  ERR-POS             OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RET-CD-ORAERR
                     TO  RTN-CD              OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE
                     TO  DETAIL-RTN-CD       OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  "1"
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  SQLSTMT1-ARR
                     TO  FREE-MSG            OF PARM-SCZY1170-ARG1
                   PERFORM  ERR-RTN
               END-IF
           ELSE
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル3 CLOSE処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR3-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *               3.2.5.優先順位を更新する
      ******************************************************************
       UPD-YUSENJYUNI-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  優先順位を更新する  START ***"
      *-----------------------------------------------------------------
      *----------  カーソル4をオープンする
           PERFORM  CURSOR4-OPEN-RTN
      *----------  カーソル4をフェッチする
           PERFORM  CURSOR4-FETCH-RTN
      *----------  カーソル4をクローズする
           PERFORM  CURSOR4-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  優先順位を更新する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UPD-YUSENJYUNI-EXT.
           EXIT.
      ******************************************************************
      *    カーソル4 OPEN処理
      ******************************************************************
       CURSOR4-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル4 OPEN処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT1
           MOVE  1                           TO SQLSTMT1-LEN
           STRING  "SELECT A.PRIO, B.PRIO, B.TBL_ID, "
                   " B.PARTITION_NAME FROM "
                   WK-TAB-TKDYAA53
                   " A, "
                   WK-TAB-TKDYAA56
                   " B WHERE TRIM(A.TBL_ID) = SUBSTR(B.TBL_ID, 1, 8) "
                   " AND A.TABLE_KBN = B.TABLE_KBN"
               DELIMITED BY SIZE
               INTO  SQLSTMT1-ARR
               POINTER  SQLSTMT1-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT1-ARR=["SQLSTMT1-ARR"]"
      D    DISPLAY  "SQLSTMT1-LEN=["SQLSTMT1-LEN"]"
      *-----------------------------------------------------------------
      *----------  SQL文 PREPARE
           EXEC SQL
             PREPARE S04  FROM :SQLSTMT1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0028"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *----------  カーソル DECLARE
           EXEC SQL
             DECLARE CR4 CURSOR  FOR S04
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0029"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *----------  カーソル OPEN
           EXEC SQL
             OPEN  CR4
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  "0030"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SQLSTMT1-ARR
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           ELSE
               MOVE  CNS-ON                  TO FLG-CR4-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR4-OPEN=["FLG-CR4-OPEN"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル4 OPEN処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR4-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソル4 FETCH処理
      ******************************************************************
       CURSOR4-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル4 FETCH処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-ON                      TO FLG-LOOP-END
           PERFORM  UNTIL  FLG-LOOP-END = CNS-OFF
             MOVE  ZERO                      TO H-A-PRIO
             MOVE  ZERO                      TO H-B-PRIO
             MOVE  SPACE                     TO H-TBL-ID
             MOVE  SPACE                     TO H-PARTITION-NAME
      *----------  カーソル FETCH
             EXEC SQL
               FETCH  CR4
                INTO  :H-A-PRIO,
                      :H-B-PRIO,
                      :H-TBL-ID,
                      :H-PARTITION-NAME
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 IF  H-A-PRIO  NOT = 99 AND H-A-PRIO < H-B-PRIO
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "H-A-PRIO=["H-A-PRIO"]"
      D    DISPLAY  "H-B-PRIO=["H-B-PRIO"]"
      D    DISPLAY  "H-A-PRIO NOT = 99 AND H-A-PRIO<H-B-PRIOの場合、"
      D             "優先順位更新する"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
                     INITIALIZE  SQLSTMT2
                     MOVE  SPACE             TO WK-ERR-SQLSTMT
                     MOVE  1                 TO SQLSTMT2-LEN
      *----------  ＳＱＬ文作成
                     STRING  "UPDATE "
                             WK-TAB-TKDYAA56
                             " SET "
                             " PRIO = :V1, "
                             " UPD_DATE = SYSDATE, "
                             " UPD_LOGIN_CMP_CD = ' ', "
                             " UPD_SID = ' ', "
                             " UPD_PGMID = :V2 "
                             " WHERE "
                             " TBL_ID = :V3 "
                             " AND PARTITION_NAME = :V4"
                         DELIMITED BY SIZE
                         INTO  SQLSTMT2-ARR
                         POINTER  SQLSTMT2-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT2-ARR=["SQLSTMT2-ARR"]"
      D    DISPLAY  "SQLSTMT2-LEN=["SQLSTMT2-LEN"]"
      *-----------------------------------------------------------------
                     STRING  SQLSTMT2-ARR
                            "[V1:" H-A-PRIO  "]"
                            "[V2:" WK-PROGRAM-ID  "]"
                            "[V3:" H-TBL-ID  "]"
                            "[V4:" H-PARTITION-NAME  "]"
                        DELIMITED  BY  SIZE
                        INTO  WK-ERR-SQLSTMT
      *----------  ＳＱＬ文 PREPARE
                     EXEC SQL
                         PREPARE U01  FROM :SQLSTMT2
                     END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
                     IF  SQLCODE  NOT = CNS-SQL-NORMAL
                     THEN
      *----------  エラー検知プログラム名
                         MOVE  CNS-PROGRAM-ID
                           TO  ERR-PGM-ID    OF PARM-SCZY1170-ARG1
      *----------  ポジション
                         MOVE  "0031"
                           TO  ERR-POS       OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                         MOVE  CNS-RET-CD-ORAERR
                           TO  RTN-CD        OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                         MOVE  SQLCODE
                           TO  DETAIL-RTN-CD OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                         MOVE  "1"             TO DETAIL-RTN-CD-FLG
                                             OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                         MOVE  WK-ERR-SQLSTMT
                           TO  FREE-MSG      OF PARM-SCZY1170-ARG1
                         PERFORM  ERR-RTN
                     END-IF
                     EXEC SQL
                         EXECUTE U01
                         USING :H-A-PRIO,
                               :WK-PROGRAM-ID,
                               :H-TBL-ID,
                               :H-PARTITION-NAME
                     END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(UPD)=["SQLCODE"]"
      *-----------------------------------------------------------------
                     IF  SQLCODE  NOT = CNS-SQL-NORMAL
                     THEN
      *----------  エラー検知プログラム名
                         MOVE  CNS-PROGRAM-ID
                           TO  ERR-PGM-ID    OF PARM-SCZY1170-ARG1
      *----------  ポジション
                         MOVE  "0032"
                           TO  ERR-POS       OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                         MOVE  CNS-RET-CD-ORAERR
                           TO  RTN-CD        OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                         MOVE  SQLCODE
                           TO  DETAIL-RTN-CD OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                         MOVE  "1"           TO DETAIL-RTN-CD-FLG
                                             OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                         MOVE  WK-ERR-SQLSTMT
                           TO  FREE-MSG      OF PARM-SCZY1170-ARG1
                         PERFORM  ERR-RTN
                     ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "処理継続"
      *-----------------------------------------------------------------
                         CONTINUE
                     END-IF
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "H-A-PRIO=["H-A-PRIO"]"
      D    DISPLAY  "H-B-PRIO=["H-B-PRIO"]"
      D    DISPLAY  "H-A-PRIO=99 OR H-A-PRIO>=H-B-PRIOの場合、"
      D             "優先順位更新しない"
      *-----------------------------------------------------------------
                     CONTINUE
                 END-IF
               WHEN  CNS-SQL-NOTFOUND
                 MOVE  CNS-OFF               TO FLG-LOOP-END
               WHEN  OTHER
      *----------  エラー検知プログラム名
                 MOVE  CNS-PROGRAM-ID
                   TO  ERR-PGM-ID            OF PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  "0033"
                   TO  ERR-POS               OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RET-CD-ORAERR
                   TO  RTN-CD                OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD         OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  "1"
                   TO  DETAIL-RTN-CD-FLG     OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                 MOVE  SQLSTMT1-ARR
                   TO  FREE-MSG              OF PARM-SCZY1170-ARG1
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル4 FETCH処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR4-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    カーソル4 CLOSE処理
      ******************************************************************
       CURSOR4-CLOSE-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル4 CLOSE処理  START  ***"
      *-----------------------------------------------------------------
           IF  FLG-CR4-OPEN = CNS-ON
           THEN
               EXEC SQL
                 CLOSE  CR4
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE)=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  = CNS-SQL-NORMAL
               THEN
                   MOVE  CNS-OFF             TO FLG-CR4-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR4-OPEN=["FLG-CR4-OPEN"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  エラー検知プログラム名
                   MOVE  CNS-PROGRAM-ID
                     TO  ERR-PGM-ID          OF PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  "0034"
                     TO  ERR-POS             OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RET-CD-ORAERR
                     TO  RTN-CD              OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE
                     TO  DETAIL-RTN-CD       OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  "1"
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  SQLSTMT1-ARR
                     TO  FREE-MSG            OF PARM-SCZY1170-ARG1
                   PERFORM  ERR-RTN
               END-IF
           ELSE
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  カーソル4 CLOSE処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR4-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *       後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ORACLE接続終了(COMMIT)処理
           PERFORM  DB-COMMIT-RTN
      *----------  リターンパッケージセットルーチン処理
           PERFORM  SCZY1170-RTN
      *----------  バッチ終了メッセージ出力ルーチン処理
           PERFORM  SCZY7020-RTN
           MOVE  0                           TO WK-RTN-STS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-RTN-STS =["WK-RTN-STS"]"
      D    DISPLAY  "***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *       ORACLE接続終了(COMMIT)処理
      ******************************************************************
       DB-COMMIT-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   ORACLE接続終了(COMMIT)  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
               COMMIT  RELEASE
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "COMMIT(SQLCODE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
               STRING  "COMMIT  RELEASE"
                       DELIMITED BY SIZE
                       INTO  WK-COMMIT-RELEASE
      *---------- エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID
                 TO  ERR-PGM-ID              OF PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  "0035"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RET-CD-ORAERR
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  WK-COMMIT-RELEASE
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ORACLE接続終了(COMMIT)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT-EXT.
           EXIT.
      ******************************************************************
      *       リターンパッケージセットルーチン処理
      ******************************************************************
       SCZY1170-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   SCZY1170処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-RET-CD-NORMAL
             TO  RTN-CD                      OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD                  OF PARM-SCZY1170-ARG1=["
      D              RTN-CD                  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "CALL リターンパッケージセットルーチンSCZY1170 開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"               USING  PARM-SCZY1170-INOUT
                                                 PARM-SCZY1170-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CALL リターンパッケージセットルーチンSCZY1170 終了"
      D    DISPLAY  "PARM-SCZY1170-RTNPKG=["PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  "***   SCZY1170処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1170-EXT.
           EXIT.
      ******************************************************************
      *       バッチ終了メッセージ出力ルーチン処理
      ******************************************************************
       SCZY7020-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   SCZY7020処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-KYOUTUU-RTNPKG
      *---------- エラー種別
           MOVE  "N"
             TO  ERR-SYUBETU                 OF PARM-SCZY7020-ARG1
      *---------- プログラム名
           MOVE  CNS-PROGRAM-ID
             TO  PGM-ID                      OF PARM-SCZY7020-ARG2
      *---------- 利用会社コード
           MOVE  "C000"
             TO  RIYO-CMP-CD                 OF PARM-SCZY7020-ARG2
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                     OF PARM-SCZY7020-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-SYUBETU             OF PARM-SCZY7020-ARG1=["
      D              ERR-SYUBETU             OF PARM-SCZY7020-ARG1"]"
      D    DISPLAY  "PGM-ID                  OF PARM-SCZY7020-ARG2=["
      D              PGM-ID                  OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "RIYO-CMP-CD             OF PARM-SCZY7020-ARG2=["
      D              RIYO-CMP-CD             OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "KJN-YMD                 OF PARM-SCZY7020-ARG2=["
      D              KJN-YMD                 OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "JIKOU-SYORI-ID          OF PARM-SCZY7020-ARG2=["
      D              JIKOU-SYORI-ID          OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "KIDOU-ID                OF PARM-SCZY7020-ARG2=["
      D              KIDOU-ID                OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "CALL バッチ終了メッセージ出力ルーチンSCZY7020 開始"
      *-----------------------------------------------------------------
           CALL  "SCZY7020"               USING  PARM-SCZY7020-INOUT
                                                 WK-KYOUTUU-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CALL バッチ終了メッセージ出力ルーチンSCZY7020 終了"
      D    DISPLAY  "***   SCZY7020処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7020-EXT.
           EXIT.
      ******************************************************************
      *               エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-PGM-ID              OF PARM-SCZY1170-ARG1=["
      D              ERR-PGM-ID              OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS                 OF PARM-SCZY1170-ARG1=["
      D              ERR-POS                 OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD                  OF PARM-SCZY1170-ARG1=["
      D              RTN-CD                  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1=["
      D              DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1=["
      D              DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG                OF PARM-SCZY1170-ARG1=["
      D              FREE-MSG                OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "***   ERR-RTN  START  ***"
      D    DISPLAY  "FLG-CR1-OPEN=["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-CR1-OPEN = CNS-ON
           THEN
               EXEC SQL
                   CLOSE CR1
               END-EXEC
               MOVE  CNS-OFF                 TO FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE1) =["SQLCODE"]"
      D    DISPLAY  "FLG-CR1-OPEN =["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR2-OPEN=["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-CR2-OPEN = CNS-ON
           THEN
               EXEC SQL
                   CLOSE CR2
               END-EXEC
               MOVE  CNS-OFF                 TO FLG-CR2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE2) =["SQLCODE"]"
      D    DISPLAY  "FLG-CR2-OPEN =["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR3-OPEN=["FLG-CR3-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-CR3-OPEN = CNS-ON
           THEN
               EXEC SQL
                   CLOSE CR3
               END-EXEC
               MOVE  CNS-OFF                 TO FLG-CR3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE3) =["SQLCODE"]"
      D    DISPLAY  "FLG-CR3-OPEN =["FLG-CR3-OPEN"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-CR4-OPEN=["FLG-CR4-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-CR4-OPEN = CNS-ON
           THEN
               EXEC SQL
                   CLOSE CR4
               END-EXEC
               MOVE  CNS-OFF                 TO FLG-CR4-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE4) =["SQLCODE"]"
      D    DISPLAY  "FLG-CR4-OPEN =["FLG-CR4-OPEN"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-ORA-CONNECT =["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  DBロールバック処理
           IF  FLG-ORA-CONNECT = CNS-ON
           THEN
      *----------  使用したカーソルの全クローズ
               EXEC SQL
                   ROLLBACK RELEASE
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(ROLLBACK)=["SQLCODE"]"
      *-----------------------------------------------------------------
           END-IF
           MOVE   CNS-OFF                    TO FLG-ORA-CONNECT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-ORA-CONNECT =["FLG-ORA-CONNECT"]"
      D    DISPLAY  "***   SCZY1170処理  START  ***"
      D    DISPLAY  "CALL リターンパッケージセットルーチンSCZY1170 開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"               USING  PARM-SCZY1170-INOUT
                                                 PARM-SCZY1170-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CALL リターンパッケージセットルーチンSCZY1170 終了"
      D    DISPLAY  "PARM-SCZY1170-RTNPKG=["PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  "***   SCZY1170処理  END  ***"
      D    DISPLAY  "***   SCZY7020処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-KYOUTUU-RTNPKG
      *---------- エラー種別
           MOVE  "S"
             TO  ERR-SYUBETU                 OF PARM-SCZY7020-ARG1
      *---------- プログラム名
           MOVE  CNS-PROGRAM-ID
             TO  PGM-ID                      OF PARM-SCZY7020-ARG2
      *---------- 利用会社コード
           MOVE  "C000"
             TO  RIYO-CMP-CD                 OF PARM-SCZY7020-ARG2
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                     OF PARM-SCZY7020-ARG2
           MOVE  PARM-SCZY1170-RTNPKG        TO WK-KYOUTUU-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-SYUBETU             OF PARM-SCZY7020-ARG1=["
      D              ERR-SYUBETU             OF PARM-SCZY7020-ARG1"]"
      D    DISPLAY  "PGM-ID                  OF PARM-SCZY7020-ARG2=["
      D              PGM-ID                  OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "RIYO-CMP-CD             OF PARM-SCZY7020-ARG2=["
      D              RIYO-CMP-CD             OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "KJN-YMD                 OF PARM-SCZY7020-ARG2=["
      D              KJN-YMD                 OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "JIKOU-SYORI-ID          OF PARM-SCZY7020-ARG2=["
      D              JIKOU-SYORI-ID          OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "KIDOU-ID                OF PARM-SCZY7020-ARG2=["
      D              KIDOU-ID                OF PARM-SCZY7020-ARG2"]"
      D    DISPLAY  "PARM-SCZY7020-RTNPKG=["WK-KYOUTUU-RTNPKG"]"
      D    DISPLAY  "CALL バッチ終了メッセージ出力ルーチンSCZY7020 開始"
      *-----------------------------------------------------------------
           CALL  "SCZY7020"               USING  PARM-SCZY7020-INOUT
                                                 WK-KYOUTUU-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CALL バッチ終了メッセージ出力ルーチンSCZY7020 終了"
      D    DISPLAY  "***   SCZY7020処理  END  ***"
      *-----------------------------------------------------------------
           MOVE    16                        TO WK-RTN-STS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-RTN-STS=["WK-RTN-STS"]"
      D    DISPLAY  "***   ERR-RTN  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           STOP RUN WK-RTN-STS.
