      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ1210
      * プログラム名称 : 処理対象断面決定
      * 処理概要       : 対象ポートフォリオからデータを抽出して，ポートフ
      *                  ォリオ属性、基準日計算情報より、
      *                  対象ポートフォリオを更新して、基準日断面情報を作
      *                  成する。
      * 参照ＤＢ       :
      * 引数           : IN   指定From日
      *                : IN   指定To日
      *                : IN   強制計算区分
      *                : IN   対象ポートフォリオ
      *                : OUT  締め日
      *                : OUT  計算From日
      *                : OUT  警告フラグ
      *                : OUT  RTNパッケージ
      *
      * 改訂履歴
      * 年月日        区分     所属    担当     内容
      * ------------  ----     ------  -------  -------------
      * 20080318      新規     SCS     馬東雲   新規作成
      * 20080710      修正     SCS     于瓊     残タスク9
      * 20080710      修正     SCS     于瓊     残タスク22
      * 20080815      修正     SCS     于瓊     基準日計算情報テーブルへの更新対応
      * 20080821      修正     SCS     于瓊     決算日サブ対応
      * 20080825      修正     SCS     于瓊     残タスク58
      * 20081007      修正     SCS     高帥     残タスク83
      * 20081118      修正     SCS     王粒     残タスク80、残タスク105
      * 20081212      修正     SCS     張凌翔   残タスク80
      * 20090120      修正     SCS     李菁     連結障害0001068対応、残タスク137対応
      * 20090220      修正     SCS     王飛     サブ間連結テスト障害対応
      * 20090302      修正     SCS     王飛     残タスク181、残タスク174
      * 20090317      修正     SCS     顧建鋒   連結障害1518
      * 20090423      修正     SCS     徐曉俊   総合障害341
      * 20090429      修正     SCS     王  粒   総合障害314
      * 20090511      修正     SCS     顧建鋒   ①テーマ91
      * 20090622      修正     SCS     何傑文   総合障害887
      * 20090827      修正     SCS     何傑文   連結障害2013
      * 20090831      修正     SCS     王飛     総合障害2298
      * 20090923      修正     SCS     王飛     総合障害2536
      * 20091222      修正     SCS     王飛     テーマ1075
      * 20100203      修正     SCS     張香桃   性能改善：基準日断面情報
      *                                       （TKMZBW02）INSERTバルク化
      * 20100302      修正     SCS     張香桃   GIPS2.0差分
      * 20100603      修正     SCS     陳幸縁   テーマ2834
      * 20110106      修正     SCS     楊 超    テーマ3132
      * 20110321      修正     SCS     兪巧芳   テーマ3105
      * 20110418      修正     SCS     楊 超    テーマ3212-1
      * 20110906      修正     SCS     高帥     テーマ3281
      * 20120405      修正     SCS     シャ建   テーマ3382対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ1210.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-03-18.
       DATE-COMPILED.
      ******************************************************************
      *
      *        環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *        デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
      *----------  共通コンスタント定義の宣言
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
         05  CNS-0                 PIC  S9(01)  VALUE  0.
         05  CNS-1                 PIC  S9(01)  VALUE  1.
         05  CNS-2                 PIC  S9(01)  VALUE  2.
         05  CNS-3                 PIC  S9(01)  VALUE  3.
         05  CNS-4                 PIC  S9(01)  VALUE  4.
         05  CNS-5                 PIC  S9(01)  VALUE  5.
         05  CNS-13                PIC  S9(02)  VALUE  13.              20110906
         05  CNS-CHAR-SPACE        PIC  X(01)  VALUE  " ".
         05  CNS-CHAR-0            PIC  X(01)  VALUE  "0".
         05  CNS-CHAR-1            PIC  X(01)  VALUE  "1".
         05  CNS-CHAR-2            PIC  X(01)  VALUE  "2".
         05  CNS-CHAR-3            PIC  X(01)  VALUE  "3".
         05  CNS-CHAR-4            PIC  X(01)  VALUE  "4".
         05  CNS-CHAR-5            PIC  X(01)  VALUE  "5".
         05  CNS-CHAR-6            PIC  X(01)  VALUE  "6".
         05  CNS-CHAR-7            PIC  X(01)  VALUE  "7".
         05  CNS-CHAR-9            PIC  X(01)  VALUE  "9".
         05  CNS-100               PIC  9(03)  VALUE  100.
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ1210".
      *----------  進捗管理
         05  CNS-TBL-TKDYAA40      PIC  X(08)  VALUE  "TKDYAA40".
      *----------  取引テーブル
         05  CNS-TBL-TKMXTR00      PIC  X(08)  VALUE  "TKMXTR00".
      *----------  基準日計算情報
         05  CNS-TBL-TKMZKK00      PIC  X(08)  VALUE  "TKMZKK00".
      *----------  基準日断面情報
         05  CNS-TBL-TKMZBW02      PIC  X(08)  VALUE  "TKMZBW02".
      *----------  残高履歴
         05  CNS-TBL-TKMZZR00      PIC  X(08)  VALUE  "TKMZZR00".
      *----------  資金残履歴
         05  CNS-TBL-TKMZSR00      PIC  X(08)  VALUE  "TKMZSR00".
      *----------  元本残高
         05  CNS-TBL-TKMZGZ00      PIC  X(08)  VALUE  "TKMZGZ00".
      *----------  勘定残高
         05  CNS-TBL-TKMZKZ00      PIC  X(08)  VALUE  "TKMZKZ00".
      *----------  資金取引
         05  CNS-TBL-TKMXST00      PIC  X(08)  VALUE  "TKMXST00".
      *----------  債券過去経過利息
         05  CNS-TBL-TKMZKR00      PIC  X(08)  VALUE  "TKMZKR00".
      *----------  未収収益
         05  CNS-TBL-TKMZMS00      PIC  X(08)  VALUE  "TKMZMS00".
      *----------  締め日フラグ
         05  CNS-SHIME-YMD-FLG-0   PIC  X(01)  VALUE  "0".
         05  CNS-SHIME-YMD-FLG-1   PIC  X(01)  VALUE  "1".
      *----------  正常終了日フラグ
         05  CNS-NML-END-DAT-FLG-0
                                   PIC  X(01)  VALUE  "0".
         05  CNS-NML-END-DAT-FLG-1
                                   PIC  X(01)  VALUE  "1".
      *----------  決算日情報区分
         05  CNS-KESSAN-JYOUHOU-KBN-1
                                   PIC  X(01)  VALUE  "1".
      *----------  進捗ステータス
         05  CNS-SHINTK-STS1       PIC  X(03)  VALUE  "000".
         05  CNS-SHINTK-STS2       PIC  X(03)  VALUE  "100".
      *----------  進捗タスクID
         05  CNS-SHINTK-TASK-ID    PIC  X(07)  VALUE  "ST00500".
      *----------  ワーク計算期間パッケージ.計算From日
         05  CNS-CALC-FROM         PIC  9(08)  VALUE  19800101.
      *----------  警告フラグ
         05  CNS-WARN-FLG-D1       PIC  X(02)  VALUE  "D1".
         05  CNS-WARN-FLG-D2       PIC  X(02)  VALUE  "D2".
         05  CNS-WARN-FLG-D3       PIC  X(02)  VALUE  "D3".
      *----------  リターンコード
         05  CNS-RTN-113           PIC  X(03)  VALUE  "113".
         05  CNS-RTN-100           PIC  X(03)  VALUE  "100".            20110906
      *----------  実行ステータス
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-SQL-MSG-INSERT    PIC  X(17)  VALUE
                                               " SQL-MSG(INSERT):".
         05  CNS-SQL-MSG-DELETE    PIC  X(17)  VALUE
                                               " SQL-MSG(DELETE):".
         05  CNS-ERR-33            PIC  X(13)  VALUE
             "SQL処理エラー".
      ******************************************************************
      *    ワークエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
         05  WK-DATA-IN.
      *----------  指定From日
           10  WK-SITEI-FROM       PIC  S9(08).
      *----------  指定To日
           10  WK-SITEI-TO         PIC  S9(08).
      *----------  強制計算区分
           10  WK-KYOSE-CALC-KBN   PIC  X(01).
      *----------  対象ポートフォリオ
           10  WK-OBJ-PTF-PARM.
      *----------  処理実行日
             15  WK-SYORI-YMD      PIC  S9(08).
      *----------  起動ID
             15  WK-KIDOU-ID       PIC  X(04).
      *----------  利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  締め日
             15  WK-SHIME-YMD      PIC  S9(08).
      *----------  計算From日
             15  WK-CALC-FROM      PIC  S9(08).
      *----------  差分計算Start日
             15  WK-SABON-CALC-FROM
                                   PIC  S9(08).
      *----------  差分計算End日
             15  WK-SABON-CALC-TO  PIC  S9(08).
      *----------  強制計算Start日
             15  WK-KYOSE-CALC-FROM
                                   PIC  S9(08).
      *----------  強制計算End日
             15  WK-KYOSE-CALC-TO  PIC  S9(08).
      *----------  更新ログインユーザ会社コード
             15  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  勘定異動／残高作成
           10  WK-KJIDO-ZANSK      PIC  9(01).
      *----------  ワーク計算期間パッケージ
         05  WK-CALC-KKN-PACKAGE.
      *----------  締め日フラグ
           10  WK-SHIME-YMD-FLG    PIC  X(01).
      *----------  締め日
           10  WK-SHIME-YMD        PIC  S9(08).
      *----------  正常終了日フラグ
           10  WK-NML-END-DAT-FLG  PIC  X(01).
      *----------  正常終了日
           10  WK-NML-END-DAT      PIC  S9(08).
      *----------  計算From日
           10  WK-CALC-FROM        PIC  S9(08).
      *----------  計算From日再処理方法
           10  WK-CALC-FROM-HS     PIC  X(01).
      *----------  期間処理方法
           10  WK-KKN-HS           PIC  X(01).
      *----------  開始断面フラグ
           10  WK-START-DMN-FLG    PIC  X(01).
      *----------  差分計算Start日
           10  WK-SABON-CALC-FROM  PIC  S9(08).
      *----------  差分計算End日
           10  WK-SABON-CALC-TO    PIC  S9(08).
      *----------  強制計算Start日
           10  WK-KYOSE-CALC-FROM  PIC  S9(08).
      *----------  強制計算End日
           10  WK-KYOSE-CALC-TO    PIC  S9(08).
      *----------  ポートフォリオ変更フラグ
           10  WK-PTF-UPD-FLG      PIC  X(01).
      *----------  ポートフォリオ訂正フラグ
           10  WK-PTF-TEISEI-FLG   PIC  X(01).
      *----------  開始断面進捗STS
           10  WK-START-DMN-STS    PIC  X(01).
      *----------  直前基準日
           10  WK-TZ-KJN-YJMD      PIC  S9(08).
      *----------  直前基準日進捗STS
           10  WK-TZ-KJN-YJMD-STS  PIC  X(03).
      *----------  実計算From日(開始断面なし用)
           10  WK-JITSU-CALC-FROM  PIC  S9(08).
      *----------  ワークポートフォリオ情報パッケージ
         05  WK-PTF-INFO-PACKAGE.
      *----------  期間数
           10  WK-KKN-SU           PIC  S9(03).
      *----------  期間エリア
           10  WK-KKN-ARE  OCCURS  100.
      *----------  期間From
             15  WK-KKN1-FROM-YMD  PIC  S9(08).
      *----------  期間To
             15  WK-KKN1-TO-YMD    PIC  S9(08).
      *----------  期間From２
             15  WK-KKN2-FROM-YMD  PIC  S9(08).
      *----------  期間To２
             15  WK-KKN2-TO-YMD    PIC  S9(08).
      *----------  基本会計ベースフラグ
             15  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  異動計算パターンコード
             15  WK-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
      *----------  保有目的
             15  WK-POSSESSION-OBJECT
                                   PIC  X(01).
      *----------  運用通貨コード
             15  WK-CAPITAL-TUKA-CD
                                   PIC  X(04).
      *----------  仕訳基準パターンコード
             15  WK-SWK-KJN-PTN-CD
                                   PIC  X(08).
      *----------  測定基準区分
             15  WK-ST-KJN-KBN     PIC  X(01).
      *----------  日次評価法フラグ
             15  WK-NITIJI-HYK-FLG
                                   PIC  X(01).
      *----------  料率パターンコード
             15  WK-COMMISSION-PATTERN
                                   PIC  X(04).
      *----------  約定主義会計フラグ
             15  WK-YKJ-SYUGI-KAIKEI
                                   PIC  X(01).
      *----------  キャッシュフロー２回発生区分
             15  WK-CASH-FLOW-KBN  PIC  X(01).
      *----------  約定レートコード
             15  WK-YKJ-RATE-CD    PIC  X(04).
      *----------  未収配当計上割合
             15  WK-MISYU-HAITOU-WARIAI
                                   PIC  S9(08)V9(10).
      *----------  ワーク基準日情報パッケージ
         05  WK-KJN-PACKAGE.
      *----------  基準日数
           10  WK-KJN-NISU         PIC  S9(04).
      *----------  基準日詳細
           10  WK-KJN-YMD-SYOSAI   OCCURS  1000.
      *----------  基準日
             15  WK-KJN-YMD        PIC  S9(08).
      *----------  基準日種類
             15  WK-KJN-YMD-SHRU   PIC  X(01).
      *----------  ワーク月末日
         05  WK-GMATU-YMD          PIC  S9(08).
      *----------  ワークポートフォリオ詳細パッケージ
         05  WK-PTF-SHOSAI-PACKAGE.
      *----------  日次評価法フラグ
           10  WK-NITIJI-HYK-FLG   PIC  X(01).
      *----------  設定日
           10  WK-SET-YMD          PIC  X(08).
      *----------  解約日
           10  WK-CANCL-YMD        PIC  X(08).
      *----------  特別イベント日１
           10  WK-EVENT-YMD1       PIC  S9(08).
      *----------  特別イベント日２
           10  WK-EVENT-YMD2       PIC  S9(08).
      *----------  特別イベント日３
           10  WK-EVENT-YMD3       PIC  S9(08).
      *----------  決算回数
           10  WK-KESSAN-TIMES     PIC  S9(02).
      *----------  本決算月日
           10  WK-HON-KESSAN-MMDD  PIC  9(04).
      *----------  決算月日１
           10  WK-KESSAN-MMDD1     PIC  9(04).
      *----------  決算月日２
           10  WK-KESSAN-MMDD2     PIC  9(04).
      *----------  決算月日３
           10  WK-KESSAN-MMDD3     PIC  9(04).
      *----------  決算月日４
           10  WK-KESSAN-MMDD4     PIC  9(04).
      *----------  決算休日処理区分
           10  WK-KESSAN-QJT-SYRI  PIC  X(01).
      *----------  ワーク月末計算START日
         05  WK-GMATU-CALC-PACKAGE
                                   PIC  S9(08).
      *----------  ワーク決算日算出パッケージ
         05  WK-KESSAN-YMD-PACKAGE.
      *----------  計算From日
           10  WK-CALC-FROM        PIC  9(08).
      *----------  計算To日
           10  WK-CALC-TO          PIC  9(08).
      *----------  決算日数
           10  WK-KESSAN-NISU      PIC  9(03).
      *----------  決算日詳細
           10  WK-KESSAN-SHOSAI    OCCURS  500.
      *----------  決算日
             15  WK-KESSAN-YMD     PIC  9(08).
      *----------  シフト区分
             15  WK-SHIFT-KBN      PIC  9(01).
      *----------  ワーク基準日ソートパッケージ
         05  WK-KJN-SORT-PACKAGE.
      *----------  基準日数
           10  WK-KJN-NISU         PIC  S9(04).
      *----------  基準日詳細
           10  WK-KJN-SHOSAI       OCCURS  1000.
      *----------  基準日
             15  WK-KJN-YMD        PIC  S9(08).
      *----------  基準日種類
             15  WK-KJN-YMD-SHRU   PIC  X(01).
      *----------  ワーク基準日
         05  WK-KJN-DATE           PIC  S9(08).
      *----------  ワーク基準日種類
         05  WK-KJN-SHRU           PIC  X(01).
      *----------  ワーク基本会計ベースフラグ
         05  WK-KHKAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  ワーク計算From日前取引存在フラグ
         05  WK-CALC-FROM-TRHK-PACKAGE
                                   PIC  X(01).
      *----------  INSERT用データパッケージ
         05  WK-INSERT-DATA-PAKAGE-1.
           10  WK-INSERT-DATA-PAKAGE OCCURS  100.
      *----------  処理実行日
             15  WK-SYORI-YMD      PIC  S9(08).
      *----------  起動ID
             15  WK-KIDOU-ID       PIC  X(04).
      *----------  利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  基準日
             15  WK-KJN-YMD        PIC  S9(08).
      *----------  順番
             15  WK-JUNBAN         PIC  S9(07).
      *----------  開始基準日
             15  WK-KAISI-KJN-YMD  PIC  S9(08).
      *----------  開始基準日の翌日
             15  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  基準日種類
             15  WK-KJN-YMD-SHRU   PIC  X(01).
      *----------  計算パターン
             15  WK-CALC-PTN       PIC  X(01).
      *----------  基本会計ベースフラグ
             15  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  進捗ステータス（開始基準日）
             15  WK-STK-STS-KS-KJN-YMD
                                   PIC  X(03).
      *----------  進捗ステータス（基準日）
             15  WK-STK-STS-KJN-YMD
                                   PIC  X(03).
      *----------  異動計算パターンコード
             15  WK-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
      *----------  保有目的
             15  WK-POSSESSION-OBJECT
                                   PIC  X(01).
      *----------  運用通貨コード
             15  WK-CAPITAL-TUKA-CD
                                   PIC  X(04).
      *----------  仕訳基準パターンコード
             15  WK-SWK-KJN-PTN-CD PIC  X(08).
      *----------  測定基準区分
             15  WK-ST-KJN-KBN     PIC  X(01).
      *----------  日次評価法フラグ
             15  WK-NITIJI-HYK-FLG PIC  X(01).
      *----------  料率パターンコード
             15  WK-COMMISSION-PATTERN
                                   PIC  X(04).
      *----------  約定主義会計フラグ
             15  WK-YKJ-SYUGI-KAIKEI
                                   PIC  X(01).
      *----------  キャッシュフロー２回発生区分
             15  WK-CASH-FLOW-KBN  PIC  X(01).
      *----------  基準日断面作成区分
             15  WK-KYJ-YMD-DMN-SK-KBN
                                   PIC  X(01).
      *----------  ワーク日次用日付
             15  WK-NITIJIYOU-HIZUKE
                                   PIC  S9(08).
      *----------  約定レートコード
             15  WK-YKJ-RATE-CD
                                   PIC  X(04).
      *----------  未収配当計上割合
             15  WK-MISYU-HAITOU-WARIAI
                                   PIC  S9(08)V9(10).
      *----------  更新日時
             15  WK-UPD-DATE       PIC  X(14).
      *----------  更新ログインユーザ会社コード
             15  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  更新ユーザＩＤ
             15  WK-UPD-SID        PIC  X(20).
      *----------  更新プログラムＩＤ
             15  WK-UPD-PGMID      PIC  X(16).
      *----------  DELETE用データパッケージ1
         05  WK-DELETE-DATA-PAKAGE-1.
           10  WK-DELETE-DATA-PAKAGE1 OCCURS  100.
      *----------  利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  開始基準日
             15  WK-KAISI-KJN-YMD  PIC  S9(08).
      *----------  基準日
             15  WK-KJN-YMD        PIC  S9(08).
      *----------  DELETE用データパッケージ2
         05  WK-DELETE-DATA-PAKAGE-2.
           10  WK-DELETE-DATA-PAKAGE2 OCCURS  100.
      *----------  利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  評価系列コード
      *      15  WK-HYK-KRTU-CD    PIC  X(04).
      *----------  開始基準日
             15  WK-KAISI-KJN-YMD  PIC  S9(08).
      *----------  基準日
             15  WK-KJN-YMD        PIC  S9(08).
      *----------  ワークデータセットフラグ
         05  WK-DATA-SET-FLG       PIC  9(01).
      *  ----------  CNT-IDX
         05  WK-CNT-IDX            PIC  9(04).
      *----------  進捗管理テーブル
         05  WK-TBL-TKDYAA40       PIC  X(13).
      *----------  取引テーブル
         05  WK-TBL-TKMXTR00       PIC  X(13).
      *----------  基準日計算情報テーブル
         05  WK-TBL-TKMZKK00       PIC  X(13).
      *----------  基準日断面情報テーブル
         05  WK-TBL-TKMZBW02       PIC  X(13).
      *----------  残高履歴テーブル
         05  WK-TBL-TKMZZR00       PIC  X(13).
      *----------  資金残履歴テーブル
         05  WK-TBL-TKMZSR00       PIC  X(13).
      *----------  元本残高テーブル
         05  WK-TBL-TKMZGZ00       PIC  X(13).
      *----------  勘定残高テーブル
         05  WK-TBL-TKMZKZ00       PIC  X(13).
      *----------  資金取引
         05  WK-TBL-TKMXST00       PIC  X(13).
      *----------  債券過去経過利息
         05  WK-TBL-TKMZKR00       PIC  X(13).
      *----------  未収収益
         05  WK-TBL-TKMZMS00       PIC  X(13).
      *----------  終了フラグ
         05  WK-END-FLG            PIC  9(01).
         05  WK-1-4-FETCH-FLG      PIC  9(01).
      *----------  計数用
         05  WK-CNT                PIC  9(03).
      *----------  計算用
         05  WK-TORI-INFO-FLG      PIC  S9(01).
         05  WK-IDX                PIC  S9(03).
         05  WK-IDX1               PIC  S9(04).
         05  WK-IDX2               PIC  S9(03).
         05  WK-IDX3               PIC  S9(03).
         05  WK-IDX4               PIC  S9(03).
         05  WK-IDX5               PIC  S9(03).
         05  WK-IDX6               PIC  S9(03).
         05  WK-IDX6-1             PIC  S9(03).
         05  WK-IDX7               PIC  S9(03).
         05  WK-IDX8               PIC  S9(04).
         05  WK-IDX9               PIC  S9(04).
         05  WK-IDX10              PIC  S9(04).
         05  WK-IDX11              PIC  S9(04).
         05  WK-IDX12              PIC  S9(04).
         05  WK-IDX13              PIC  S9(04).
         05  WK-IDX14              PIC  S9(04).
         05  WK-IDX5-LOOP-FLAG     PIC  S9(01).
         05  WK-IDX7-LOOP-FLAG     PIC  S9(01).
         05  WK-TODAY-YMD          PIC  S9(08).
         05  WK-TMP-CALC-START.
           10  WK-YYYY             PIC  S9(04).
           10  WK-MM               PIC  S9(02).
           10  WK-DD               PIC  S9(02).
      *  05  WK-TKDYAA40-CR-1-1-FLG                                     @3212SEINO@@
      *                            PIC  S9(01).                         @3212SEINO@@
      *  05  WK-TKDYAA40-CR-1-2-FLG                                     @3212SEINO@@
      *                            PIC  S9(01).                         @3212SEINO@@
      *  05  WK-TKMXXX00-CR-1-3-FLG                                     @3212SEINO@@
      *                            PIC  S9(01).                         @3212SEINO@@
      *  05  WK-TKDYAA40-CR-1-5-FLG                                     @3212SEINO@@
      *                            PIC  S9(01).                         @3212SEINO@@
      *  05  WK-TKMXTR00-CR-1-7-FLG                                     @3212SEINO@@
      *                            PIC  S9(01).                         @3212SEINO@@
      *  05  WK-TKDYAA40-CR-1-8-FLG                                     @3212SEINO@@
      *                            PIC  S9(01).                         @3212SEINO@@
      *----------  基準日計算情報データカーソルオープンフラグ           @3212SEINO@@
      *  05  WK-TKMZKK00-CR-1-4-FLG                                     @3212SEINO@@
      *                            PIC  S9(01).                         @3212SEINO@@
      *----------  取引情報データカーソルオープンフラグ                 @3212SEINO@@
      *  05  WK-TKMXTR00-CR-1-6-FLG                                     @3212SEINO@@
      *                            PIC  S9(01).                         @3212SEINO@@
      *---------- ポジション
         05  WK-ERR-POS1           PIC  S9(04).
         05  WK-ERR-POS2           PIC  S9(04).
         05  WK-ERR-POS3           PIC  S9(04).
         05  WK-ERR-POS4           PIC  S9(04).
         05  WK-ERR-POS5           PIC  S9(04).
         05  WK-ERR-POS6           PIC  S9(04).
      *---------- ワーク断面期間FROM                                    20110906
         05  WK-DMN-KKN-FROM       PIC  S9(08).                         20110906
      *---------- ワーク断面期間TO                                      20110906
         05  WK-DMN-KKN-TO         PIC  S9(08).                         20110906
      *---------- ワーク月数                                            20110906
         05  WK-TSUKI-KAZU         PIC  S9(05)V9(06).                   20110906
      ******************************************************************
      *                ORACLE ホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  進捗管理TBL(別紙1-1)
         05  H-TKDYAA40.
      *----------  最終処理基準日
           10  H-SS-SYORI-YMD      PIC  S9(08).
      *----------  進捗管理TBL条件(別紙1-1)
         05  H-TKDYAA40-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  進捗ステータス
           10  H-SHINTK-STS        PIC  X(03).
      *----------  進捗タスクID
           10  H-SHINTK-TASK-ID    PIC  X(07).
      *----------  進捗管理TBL(別紙1-2)
         05  H-TKDYAA40-1.
      *----------  最終処理基準日
           10  H-SS-SYORI-YMD      PIC  S9(08).
      *----------  進捗管理TBL条件(別紙1-2)
         05  H-TKDYAA40-S-1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  進捗ステータス
           10  H-SHINTK-STS        PIC  X(03).
      *----------  進捗タスクID
           10  H-SHINTK-TASK-ID
                                   PIC  X(07).
      *----------  指定To日
           10  H-SITEI-TO          PIC  S9(08).
      *----------  取引テーブルTBL(別紙1-3)
         05  H-TKMXXX00.
      *----------  FROM日
           10  H-FROM-YMD          PIC  S9(08).
      *----------  取引テーブルTBL条件(別紙1-3)
         05  H-TKMXXX00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基準日計算情報TBL(別紙1-4)
         05  H-TKMZKK00.
      *----------  仕訳基準パターンコード
           10  H-SWK-KJN-PTN-CD    PIC  X(08).
      *----------  異動計算パターンコード
           10  H-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
      *----------  基準日計算情報TBL条件(別紙1-4)
         05  H-TKMZKK00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  期間From
           10  H-KKN1-FROM-YMD     PIC  S9(08).
      *----------  期間TO
           10  H-KKN1-TO-YMD       PIC  S9(08).
      *----------  進捗管理TBL(別紙1-5)
         05  H-TKDYAA40-2.
      *----------  最終処理基準日
           10  H-SS-SYORI-YMD      PIC  S9(08).
      *----------  進捗管理TBL条件(別紙1-5)
         05  H-TKDYAA40-S-2.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  進捗タスクID
           10  H-SHINTK-TASK-ID
                                   PIC  X(07).
      *----------  計算From日
           10  H-CALC-FROM         PIC  S9(08).
      *----------  取引テーブルTBL(別紙1-6)
         05  H-TKMXTR00-1.
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  取引テーブルTBL条件(別紙1-6)
         05  H-TKMXTR00-S-1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  計算From日
           10  H-CALC-FROM         PIC  S9(08).
      *----------  取引テーブルTBL(別紙1-7)
         05  H-TKMXTR00-2.
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  取引テーブルTBL条件(別紙1-7)
         05  H-TKMXTR00-S-2.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  計算From日
           10  H-CALC-FROM         PIC  S9(08).
      *----------  進捗管理TBL(別紙1-8)
         05  H-TKDYAA40-3.
      *----------  最終処理基準日
           10  H-SS-SYORI-YMD      PIC  S9(08).
      *----------  進捗ステータス
           10  H-SHINTK-STS        PIC  X(03).
      *----------  進捗管理TBL条件(別紙1-8)
         05  H-TKDYAA40-S-3.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  進捗タスクID
           10  H-SHINTK-TASK-ID
                                   PIC  X(07).
      *----------  計算From日
           10  H-CALC-FROM         PIC  S9(08).
      *----------  基準日断面情報TBL(別紙1-9)
         05  H-TKMZBW02-I.
           10  H-TKMZBW02-I-O      OCCURS  100.
      *----------  処理実行日
             15  H-SYORI-YMD       PIC  S9(08).
      *----------  起動ID
             15  H-KIDOU-ID        PIC  X(04).
      *----------  利用会社コード
             15  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD          PIC  X(04).
      *----------  基準日
             15  H-KJN-YMD         PIC  S9(08).
      *----------  順番
             15  H-JUNBAN          PIC  S9(07).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  開始基準日の翌日
             15  H-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  基準日種類
             15  H-KJN-YMD-SHRU    PIC  X(01).
      *----------  基準日断面作成区分
             15  H-KYJ-YMD-DMN-SK-KBN
                                   PIC  X(01).
      *----------  計算パターン
             15  H-CALC-PTN        PIC  X(01).
      *----------  仕訳基準パターンコード
             15  H-SWK-KJN-PTN-CD  PIC  X(08).
      *----------  基本会計ベースフラグ
             15  H-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  測定基準区分
             15  H-ST-KJN-KBN      PIC  X(01).
      *----------  進捗ステータス（開始基準日）
             15  H-STK-STS-KS-KJN-YMD
                                   PIC  X(03).
      *----------  進捗ステータス（基準日）
             15  H-STK-STS-KJN-YMD
                                   PIC  X(03).
      *----------  異動計算パターンコード
             15  H-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
      *----------  保有目的
             15  H-POSSESSION-OBJECT
                                   PIC  X(01).
      *----------  運用通貨コード
             15  H-CAPITAL-TUKA-CD
                                   PIC  X(04).
      *----------  日次評価法フラグ
             15  H-NITIJI-HYK-FLG  PIC  X(01).
      *----------  料率パターンコード
             15  H-COMMISSION-PATTERN
                                   PIC  X(04).
      *----------  約定主義会計フラグ
             15  H-YKJ-SYUGI-KAIKEI
                                   PIC  X(01).
      *----------  キャッシュフロー２回発生区分
             15  H-CASH-FLOW-KBN   PIC  X(01).
      *----------  約定レートコード
             15  H-YKJ-RATE-CD     PIC  X(04).
      *----------  未収配当計上割合
             15  H-MISYU-HAITOU-WARIAI
                                   PIC  S9(08)V9(10).
      *----------  更新ログインユーザ会社コード
             15  H-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  件数
         05  HST-CNT               PIC  S9(04)  COMP.
      *---------- 残高履歴TBL条件(別紙1-10)
         05  H-TKMZZR00-D.
           10  H-TKMZZR00-D-O      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD          PIC  X(04).
      *----------  DELETE用データパッケージ.開始基準日
             15  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  DELETE用データパッケージ.基準日
             15  H-KJN-YMD         PIC  S9(08).
      *----------  資金残履歴TBL条件(別紙1-11)
         05  H-TKMZSR00-D.
           10  H-TKMZSR00-D-O      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD          PIC  X(04).
      *----------  DELETE用データパッケージ.開始基準日
             15  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  DELETE用データパッケージ.基準日
             15  H-KJN-YMD         PIC  S9(08).
      *----------  元本残高TBL条件(別紙1-12)
         05  H-TKMZGZ00-D.
           10  H-TKMZGZ00-D-O      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD          PIC  X(04).
      *----------  DELETE用データパッケージ.開始基準日
             15  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  DELETE用データパッケージ.基準日
             15  H-KJN-YMD         PIC  S9(08).
      *----------  勘定残高TBL条件(別紙1-13)
         05  H-TKMZKZ00-D.
           10  H-TKMZKZ00-D-O      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD          PIC  X(04).
      *----------  評価系列コード
      *      15  H-HYK-KRTU-CD     PIC  X(04).
      *----------  DELETE用データパッケージ.開始基準日
             15  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  DELETE用データパッケージ.基準日
             15  H-KJN-YMD         PIC  S9(08).
      *----------  基準日計算情報TBL条件(別紙1-15)
         05  H-TKMZKK00-D.
           10  H-TKMZKK00-D-O      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD          PIC  X(04).
      *----------  DELETE用データパッケージ.開始基準日
             15  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  DELETE用データパッケージ.基準日
             15  H-KJN-YMD         PIC  S9(08).
      *  05  SQLSTMT               PIC  X(2500).                        @3212SEINO@@
         05  SQLSTMT1              PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT2              PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT3              PIC  X(700)  VARYING.                @3212SEINO@@
         05  SQLSTMT4              PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT5              PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT6              PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT7              PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT8              PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT9              PIC  X(1100) VARYING.                @3212SEINO@@
         05  SQLSTMT10             PIC  X(200)  VARYING.                @3212SEINO@@
         05  SQLSTMT11             PIC  X(200)  VARYING.                @3212SEINO@@
         05  SQLSTMT12             PIC  X(200)  VARYING.                @3212SEINO@@
         05  SQLSTMT13             PIC  X(200)  VARYING.                @3212SEINO@@
         05  SQLSTMT15             PIC  X(200)  VARYING.                @3212SEINO@@
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *    SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  進捗管理SQL文(別紙1-1)
         05  SQL-SELECT-1-1.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(14)  VALUE
               "  SS_SYORI_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKDYAA40        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(32)  VALUE
                 "  AND SHINTK_STS = :P_SHINTK_STS".
             15  FILLER            PIC  X(40)  VALUE
                 "  AND SHINTK_TASK_ID = :P_SHINTK_TASK_ID".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE  " ORDER BY ".
      *----------  最終処理基準日  降順
             15  FILLER            PIC  X(17)  VALUE
                                               "SS_SYORI_YMD DESC".
      *----------  進捗管理SQL文(別紙1-2)
         05  SQL-SELECT-1-2.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(14)  VALUE
               "  SS_SYORI_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKDYAA40        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(32)  VALUE
                 "  AND SHINTK_STS = :P_SHINTK_STS".
             15  FILLER            PIC  X(40)  VALUE
                 "  AND SHINTK_TASK_ID = :P_SHINTK_TASK_ID".
             15  FILLER            PIC  X(32)  VALUE
                 "  AND SS_SYORI_YMD < :P_SITEI_TO".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE  " ORDER BY ".
      *----------  最終処理基準日  降順
             15  FILLER            PIC  X(17)  VALUE
                                                   "SS_SYORI_YMD DESC".
      *----------  取引テーブルSQL文(別紙1-3)
         05  SQL-SELECT-1-3.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(10)  VALUE
               "  YKJ_YMD".
           10  SQL-AS.
             15  FILLER            PIC  X(04)  VALUE
                 " AS ".
             15  FILLER            PIC  X(10)  VALUE
               "  FROM_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMXTR00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
                 "  AND ".
             15  FILLER            PIC  X(22)  VALUE
                 "  FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(07)  VALUE
                 "  AND (".
             15  FILLER            PIC  X(20)  VALUE
                 "  PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(18)  VALUE
                 "  OR PTF_CD = ' ')".
      *----------  UNION
             15  FILLER            PIC  X(07)  VALUE  " UNION ".
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(10)  VALUE
               "  IDO_YMD".
           10  SQL-AS.
             15  FILLER            PIC  X(04)  VALUE
                 " AS ".
             15  FILLER            PIC  X(10)  VALUE
               "  FROM_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMXST00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
                 "  AND ".
             15  FILLER            PIC  X(22)  VALUE
                 "  FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(07)  VALUE
                 "  AND (".
             15  FILLER            PIC  X(20)  VALUE
                 "  PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(18)  VALUE
                 "  OR PTF_CD = ' ')".
      *----------  UNION
             15  FILLER            PIC  X(07)  VALUE  " UNION ".
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(13)  VALUE
               "  TEKIYO_FROM".
           10  SQL-AS.
             15  FILLER            PIC  X(04)  VALUE
                 " AS ".
             15  FILLER            PIC  X(10)  VALUE
               "  FROM_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMZKR00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
                 "  AND ".
             15  FILLER            PIC  X(22)  VALUE
                 "  FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(06)  VALUE
                 "  AND ".
             15  FILLER            PIC  X(20)  VALUE
                 "  PTF_CD = :P_PTF_CD".
      *----------  UNION
             15  FILLER            PIC  X(07)  VALUE  " UNION ".
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(13)  VALUE
               "  TEKIYO_FROM".
           10  SQL-AS.
             15  FILLER            PIC  X(04)  VALUE
                 " AS ".
             15  FILLER            PIC  X(10)  VALUE
               "  FROM_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMZMS00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
                 "  AND ".
             15  FILLER            PIC  X(22)  VALUE
                 "  FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(06)  VALUE
                 "  AND ".
             15  FILLER            PIC  X(20)  VALUE
                 "  PTF_CD = :P_PTF_CD".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE  " ORDER BY ".
      *----------  FROM日  昇順
             15  FILLER            PIC  X(08)  VALUE  "FROM_YMD".
      *----------  基準日計算情報SQL文(別紙1-4)
         05  SQL-SELECT-1-4.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(17)  VALUE
               "  SWK_KJN_PTN_CD,".
             15  FILLER            PIC  X(21)  VALUE
               "  IDO_CALC_PATTERN_CD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMZKK00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(22)  VALUE
                 "  AND KJN_YMD BETWEEN ".
             15  FILLER            PIC  X(13)  VALUE
                 " :P_KKN1_FROM".
             15  FILLER            PIC  X(05)  VALUE
                 "  AND".
             15  FILLER            PIC  X(11)  VALUE
                 " :P_KKN1_TO".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE  " ORDER BY ".
      *----------  基準日
             15  FILLER            PIC  X(07)  VALUE  "KJN_YMD".
      *----------  進捗管理SQL文(別紙1-5)
         05  SQL-SELECT-1-5.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(14)  VALUE
               "  SS_SYORI_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKDYAA40        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(40)  VALUE
                 "  AND SHINTK_TASK_ID = :P_SHINTK_TASK_ID".
             15  FILLER            PIC  X(33)  VALUE
                 "  AND SS_SYORI_YMD < :P_CALC_FROM".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE  " ORDER BY ".
      *----------  基準日  降順
             15  FILLER            PIC  X(17)  VALUE
                                                   "SS_SYORI_YMD DESC".
      *----------  取引テーブルSQL文(別紙1-6)
         05  SQL-SELECT-1-6.
           10  SQL-FETCH.
             15  FILLER            PIC  X(07)  VALUE
                 " SELECT".
             15  FILLER            PIC  X(10)  VALUE
                 " UKE_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMXTR00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(07)  VALUE
                 "  AND (".
             15  FILLER            PIC  X(24)  VALUE
                 "  ( FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND PTF_CD = :P_PTF_CD )".
             15  FILLER            PIC  X(04)  VALUE
                 "  OR".
             15  FILLER            PIC  X(24)  VALUE
                 "  ( FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = ' ' )".
             15  FILLER            PIC  X(03)  VALUE
                 "  )".
             15  FILLER            PIC  X(28)  VALUE
                 "  AND YKJ_YMD < :P_CALC_FROM".
             15  FILLER            PIC  X(29)  VALUE
                 "  AND UKE_YMD >= :P_CALC_FROM".
      *----------  取引テーブルSQL文(別紙1-7)
         05  SQL-SELECT-1-7.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 " SELECT".
             15  FILLER            PIC  X(10)  VALUE
                 " UKE_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMXTR00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(07)  VALUE
                 "  AND (".
             15  FILLER            PIC  X(24)  VALUE
                 "  ( FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND PTF_CD = :P_PTF_CD )".
             15  FILLER            PIC  X(04)  VALUE
                 "  OR".
             15  FILLER            PIC  X(24)  VALUE
                 "  ( FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = ' ' )".
             15  FILLER            PIC  X(03)  VALUE
                 "  )".
             15  FILLER            PIC  X(28)  VALUE
                 "  AND YKJ_YMD < :P_CALC_FROM".
             15  FILLER            PIC  X(16)  VALUE
                 "  AND ROWNUM = 1".
      *----------  進捗管理SQL文(別紙1-8)
         05  SQL-SELECT-1-8.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(15)  VALUE
               "  SS_SYORI_YMD,".
             15  FILLER            PIC  X(15)  VALUE
               "  SHINTK_STS".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKDYAA40        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(40)  VALUE
                 "  AND SHINTK_TASK_ID = :P_SHINTK_TASK_ID".
             15  FILLER            PIC  X(33)  VALUE
                 "  AND SS_SYORI_YMD < :P_CALC_FROM".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE  " ORDER BY ".
      *----------  最終処理基準日  降順
             15  FILLER            PIC  X(17)  VALUE
                                                   "SS_SYORI_YMD DESC".
      *----------  基準日断面情報SQL文(別紙1-9)
         05  SQL-INSERT-1-9.
           10  SQL-INSERT.
             15  FILLER            PIC  X(13)  VALUE
                 " INSERT INTO ".
             15  SQL-TKMZBW02      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " (".
             15  FILLER            PIC  X(12)  VALUE
                 "  SYORI_YMD,".
             15  FILLER            PIC  X(11)  VALUE
                 "  KIDOU_ID,".
             15  FILLER            PIC  X(14)  VALUE
                 "  RIYO_CMP_CD,".
             15  FILLER            PIC  X(10)  VALUE
                 "  FUND_CD,".
             15  FILLER            PIC  X(09)  VALUE
                 "  PTF_CD,".
             15  FILLER            PIC  X(10)  VALUE
                 "  KJN_YMD,".
             15  FILLER            PIC  X(09)  VALUE
                 "  JUNBAN,".
             15  FILLER            PIC  X(16)  VALUE
                 "  KAISI_KJN_YMD,".
             15  FILLER            PIC  X(21)  VALUE
                 "  KAISI_KJN_YMD_NEXT,".
             15  FILLER            PIC  X(15)  VALUE
                 "  KJN_YMD_SHRU,".
             15  FILLER            PIC  X(21)  VALUE
                 "  KJN_YMD_DMN_SK_KBN,".
             15  FILLER            PIC  X(11)  VALUE
                 "  CALC_PTN,".
             15  FILLER            PIC  X(17)  VALUE
                 "  SWK_KJN_PTN_CD,".
             15  FILLER            PIC  X(21)  VALUE
                 "  KH_KAIKEI_BASE_FLG,".
             15  FILLER            PIC  X(13)  VALUE
                 "  ST_KJN_KBN,".
             15  FILLER            PIC  X(21)  VALUE
                 "  STK_STS_KS_KJN_YMD,".
             15  FILLER            PIC  X(18)  VALUE
                 "  STK_STS_KJN_YMD,".
             15  FILLER            PIC  X(22)  VALUE
                 "  IDO_CALC_PATTERN_CD,".
             15  FILLER            PIC  X(20)  VALUE
                 "  POSSESSION_OBJECT,".
             15  FILLER            PIC  X(18)  VALUE
                 "  CAPITAL_TUKA_CD,".
             15  FILLER            PIC  X(17)  VALUE
                 "  NITIJI_HYK_FLG,".
             15  FILLER            PIC  X(21)  VALUE
                 "  COMMISSION_PATTERN,".
             15  FILLER            PIC  X(19)  VALUE
                 "  YKJ_SYUGI_KAIKEI,".
             15  FILLER            PIC  X(16)  VALUE
                 "  CASH_FLOW_KBN,".
             15  FILLER            PIC  X(14)  VALUE
                 "  YKJ_RATE_CD,".
             15  FILLER            PIC  X(22)  VALUE
                 "  MISYU_HAITOU_WARIAI,".
             15  FILLER            PIC  X(12)  VALUE
                 "  UPD_DATE, ".
             15  FILLER            PIC  X(20)  VALUE
                 "  UPD_LOGIN_CMP_CD, ".
             15  FILLER            PIC  X(11)  VALUE
                 "  UPD_SID, ".
             15  FILLER            PIC  X(13)  VALUE
                 "  UPD_PGMID )".
           10  SQL-VALUES.
             15  FILLER            PIC  X(09)  VALUE
                 "  VALUES ".
             15  FILLER            PIC  X(04)  VALUE
                 "  ( ".
             15  FILLER            PIC  X(13)  VALUE
                 ":P_SYORI_YMD,".
             15  FILLER            PIC  X(12)  VALUE
                 ":P_KIDOU_ID,".
             15  FILLER            PIC  X(15)  VALUE
                 ":P_RIYO_CMP_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 ":P_FUND_CD,".
             15  FILLER            PIC  X(10)  VALUE
                 ":P_PTF_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 ":P_KJN_YMD,".
             15  FILLER            PIC  X(10)  VALUE
                 ":P_JUNBAN,".
             15  FILLER            PIC  X(17)  VALUE
                 ":P_KAISI_KJN_YMD,".
             15  FILLER            PIC  X(22)  VALUE
                 ":P_KAISI_KJN_YMD_NEXT,".
             15  FILLER            PIC  X(16)  VALUE
                 ":P_KJN_YMD_SHRU,".
             15  FILLER            PIC  X(22)  VALUE
                 ":P_KJN_YMD_DMN_SK_KBN,".
             15  FILLER            PIC  X(12)  VALUE
                 ":P_CALC_PTN,".
             15  FILLER            PIC  X(18)  VALUE
                 ":P_SWK_KJN_PTN_CD,".
             15  FILLER            PIC  X(22)  VALUE
                 ":P_KH_KAIKEI_BASE_FLG,".
             15  FILLER            PIC  X(14)  VALUE
                 ":P_ST_KJN_KBN,".
             15  FILLER            PIC  X(22)  VALUE
                 ":P_STK_STS_KS_KJN_YMD,".
             15  FILLER            PIC  X(19)  VALUE
                 ":P_STK_STS_KJN_YMD,".
             15  FILLER            PIC  X(23)  VALUE
                 ":P_IDO_CALC_PATTERN_CD,".
             15  FILLER            PIC  X(21)  VALUE
                 ":P_POSSESSION_OBJECT,".
             15  FILLER            PIC  X(19)  VALUE
                 ":P_CAPITAL_TUKA_CD,".
             15  FILLER            PIC  X(18)  VALUE
                 ":P_NITIJI_HYK_FLG,".
             15  FILLER            PIC  X(22)  VALUE
                 ":P_COMMISSION_PATTERN,".
             15  FILLER            PIC  X(20)  VALUE
                 ":P_YKJ_SYUGI_KAIKEI,".
             15  FILLER            PIC  X(17)  VALUE
                 ":P_CASH_FLOW_KBN,".
             15  FILLER            PIC  X(15)  VALUE
                 ":P_YKJ_RATE_CD,".
             15  FILLER            PIC  X(23)  VALUE
                 ":P_MISYU_HAITOU_WARIAI,".
             15  FILLER            PIC  X(08)  VALUE
                 "SYSDATE,".
             15  FILLER            PIC  X(20)  VALUE
                 ":P_UPD_LOGIN_CMP_CD,".
             15  FILLER            PIC  X(04)  VALUE
                 "' ',".
             15  FILLER            PIC  X(12)  VALUE
                 "'SMZJ1210' )".
      *----------  残高履歴SQL文(別紙1-10)
         05  SQL-DELETE-1-10.
           10  SQL-DELETE.
             15  FILLER            PIC  X(07)  VALUE
               " DELETE".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMZZR00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(07)  VALUE
                 "  AND (".
             15  FILLER            PIC  X(28)  VALUE
                 "  KJN_YMD > :P_KAISI_KJN_YMD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND KJN_YMD < :P_KJN_YMD".
             15  FILLER            PIC  X(03)  VALUE
                 "  )".
      *----------  資金残履歴SQL文(別紙1-11)
         05  SQL-DELETE-1-11.
           10  SQL-DELETE.
             15  FILLER            PIC  X(07)  VALUE
               " DELETE".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMZSR00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(07)  VALUE
                 "  AND (".
             15  FILLER            PIC  X(28)  VALUE
                 "  KJN_YMD > :P_KAISI_KJN_YMD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND KJN_YMD < :P_KJN_YMD".
             15  FILLER            PIC  X(03)  VALUE
                 "  )".
      *----------  元本残高SQL文(別紙1-12)
         05  SQL-DELETE-1-12.
           10  SQL-DELETE.
             15  FILLER            PIC  X(07)  VALUE
               " DELETE".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMZGZ00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(07)  VALUE
                 "  AND (".
             15  FILLER            PIC  X(28)  VALUE
                 "  KJN_YMD > :P_KAISI_KJN_YMD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND KJN_YMD < :P_KJN_YMD".
             15  FILLER            PIC  X(03)  VALUE
                 "  )".
      *----------  勘定残高SQL文(別紙1-13)
         05  SQL-DELETE-1-13.
           10  SQL-DELETE.
             15  FILLER            PIC  X(07)  VALUE
               " DELETE".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMZKZ00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(23)  VALUE
                 "  AND HYK_KRTU_CD = ' '".
             15  FILLER            PIC  X(07)   VALUE
                 "  AND (".
             15  FILLER            PIC  X(28)  VALUE
                 "  KJN_YMD > :P_KAISI_KJN_YMD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND KJN_YMD < :P_KJN_YMD".
             15  FILLER            PIC  X(03)  VALUE
                 "  )".
      *----------  基準日計算情報SQL文(別紙1-15)
         05  SQL-DELETE-1-15.
           10  SQL-DELETE.
             15  FILLER            PIC  X(07)  VALUE
               " DELETE".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
           10  SQL-TKMZKK00        PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(07)   VALUE
                 "  AND (".
             15  FILLER            PIC  X(28)  VALUE
                 "  KJN_YMD > :P_KAISI_KJN_YMD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND KJN_YMD < :P_KJN_YMD".
             15  FILLER            PIC  X(03)  VALUE
                 "  )".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- SELECT SQL文(別紙1-1)
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKDYAA40         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(35)  VALUE
               "' AND SHINTK_STS = '".
           10  WK-SHINTK-STS       PIC  X(03).
           10  FILLER              PIC  X(40)  VALUE
               "' AND SHINTK_TASK_ID = '".
           10  WK-SHINTK-TASK-ID   PIC  X(07).
      *---------- SELECT SQL文(別紙1-2)
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKDYAA40         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(20)  VALUE
               "' AND SHINTK_STS = '".
           10  WK-SHINTK-STS       PIC  X(03).
           10  FILLER              PIC  X(24)  VALUE
               "' AND SHINTK_TASK_ID = '".
           10  WK-SHINTK-TASK-ID   PIC  X(07).
           10  FILLER              PIC  X(23)  VALUE
               "' AND SS_SYORI_YMD <= ".
           10  WK-SITEI-TO         PIC  S9(08).
      *---------- SELECT SQL文(別紙1-3)
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMXTR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMXST00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMS00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(17)  VALUE
               "  RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE
               "' AND (".
           10  FILLER              PIC  X(15)  VALUE
               "  ( FUND_CD = '".
           10  WK-FUND-CD-1.
             15  WK-FUND-CD        PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' AND PTF_CD = '".
           10  WK-PTF-CD-1.
             15  WK-PTF-CD         PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "' )".
           10  FILLER              PIC  X(04)  VALUE
               "  OR".
           10  FILLER              PIC  X(15)  VALUE
               "  ( FUND_CD = '".
           10  WK-FUND-CD-2.
             15  WK-FUND-CD        PIC  X(12).
           10  FILLER              PIC  X(23)  VALUE
               "' AND PTF_CD = ' ')".
           10  WK-PTF-CD-2.
             15  WK-PTF-CD         PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "  )".
      *---------- FETCH SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKK00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(23)  VALUE
                 "' AND KJN_YMD BETWEEN (".
           10  WK-KKN1-FROM-YMD    PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
                 ", ".
           10  WK-KKN1-TO-YMD      PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
                 " )".
      *---------- SELECT SQL文(別紙1-5)
         05  WK-MSG-1-5.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKDYAA40         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(24)  VALUE
               "' AND SHINTK_TASK_ID = '".
           10  WK-SHINTK-TASK-ID   PIC  X(07).
           10  FILLER              PIC  X(21)  VALUE
                 "' AND SS_SYORI_YMD < ".
           10  WK-CALC-FROM        PIC  S9(08).
      *---------- FETCH SQL文(別紙1-6)
         05  WK-MSG-1-6.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMXTR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(17)  VALUE
               "  RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE
               "' AND (".
           10  FILLER              PIC  X(15)  VALUE
               "  ( FUND_CD = '".
           10  WK-FUND-CD-1.
             15  WK-FUND-CD        PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' AND PTF_CD = '".
           10  WK-PTF-CD-1.
             15  WK-PTF-CD         PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "' )".
           10  FILLER              PIC  X(04)  VALUE
               "  OR".
           10  FILLER              PIC  X(15)  VALUE
               "  ( FUND_CD = '".
           10  WK-FUND-CD-2.
             15  WK-FUND-CD        PIC  X(12).
           10  FILLER              PIC  X(23)  VALUE
               "' AND PTF_CD = ' ')".
           10  WK-PTF-CD-2.
             15  WK-PTF-CD         PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "  )".
           10  FILLER              PIC  X(16)  VALUE
                 "  AND YKJ_YMD < ".
           10  WK-CALC-FROM-1.
             15  WK-CALC-FROM      PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
                 " AND UKE_YMD >= ".
           10  WK-CALC-FROM-2.
             15  WK-CALC-FROM      PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
                " ".
      *---------- FETCH SQL文(別紙1-7)
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMXTR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(17)  VALUE
               "  RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE
               "' AND (".
           10  FILLER              PIC  X(15)  VALUE
               "  ( FUND_CD = '".
           10  WK-FUND-CD-1.
             15  WK-FUND-CD        PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' AND PTF_CD = '".
           10  WK-PTF-CD-1.
             15  WK-PTF-CD         PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "' )".
           10  FILLER              PIC  X(04)  VALUE
               "  OR".
           10  FILLER              PIC  X(15)  VALUE
               "  ( FUND_CD = '".
           10  WK-FUND-CD-2.
             15  WK-FUND-CD        PIC  X(12).
           10  FILLER              PIC  X(23)  VALUE
               "' AND PTF_CD = ' ')".
           10  WK-PTF-CD-2.
             15  WK-PTF-CD         PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "  )".
           10  FILLER              PIC  X(17)  VALUE
                 "  AND YKJ_YMD  < ".
           10  WK-CALC-FROM        PIC  S9(08).
      *---------- SELECT SQL文(別紙1-8)
         05  WK-MSG-1-8.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKDYAA40         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(24)  VALUE
               "' AND SHINTK_TASK_ID = '".
           10  WK-SHINTK-TASK-ID   PIC  X(07).
           10  FILLER              PIC  X(21)  VALUE
                 "' AND SS_SYORI_YMD < ".
           10  WK-CALC-FROM        PIC  S9(08).
      *---------- INSERT SQL文(別紙1-9)
         05  WK-MSG-1-9.
           10  FILLER            PIC  X(09)  VALUE
                 "  VALUES ".
           10  FILLER            PIC  X(04)  VALUE
                 "  ( ".
           10  WK-SYORI-YMD      PIC  S9(08).
           10  FILLER            PIC  X(03)  VALUE
                 ",' ".
           10  WK-KIDOU-ID       PIC  X(04).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-RIYO-CMP-CD    PIC  X(04).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-FUND-CD        PIC  X(12).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-PTF-CD         PIC  X(04).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-KJN-YMD        PIC  S9(08).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-JUNBAN         PIC  S9(07).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-KAISI-KJN-YMD  PIC  S9(08).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-KJN-YMD-SHRU   PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-KYJ-YMD-DMN-SK-KBN
                                   PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-CALC-PTN       PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-SWK-KJN-PTN-CD PIC  X(08).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-ST-KJN-KBN     PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-STK-STS-KS-KJN-YMD
                                   PIC  X(03).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-STK-STS-KJN-YMD
                                   PIC  X(03).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-POSSESSION-OBJECT
                                   PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-CAPITAL-TUKA-CD
                                   PIC  X(04).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-NITIJI-HYK-FLG PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-COMMISSION-PATTERN
                                   PIC  X(04).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-YKJ-SYUGI-KAIKEI
                                   PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-CASH-FLOW-KBN  PIC  X(01).
           10  FILLER            PIC  X(04)  VALUE
                 "', '".
           10  WK-YKJ-RATE-CD    PIC  X(04).
           10  FILLER            PIC  X(03)  VALUE
                 "', ".
           10  WK-MISYU-HAITOU-WARIAI
                                   PIC  S9(08)V9(10).
           10  FILLER            PIC  X(02)  VALUE
                 ", ".
           10  FILLER            PIC  X(08)  VALUE
                 "SYSDATE,".
           10  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
           10  FILLER            PIC  X(02)  VALUE
                 ", ".
           10  FILLER            PIC  X(04)  VALUE
                 "' ',".
           10  FILLER            PIC  X(12)  VALUE
                 "'SMZJ1210' )".
      *---------- DELETE SQL文(別紙1-10)
         05  WK-MSG-1-10.
           10  FILLER            PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZZR00       PIC  X(13).
           10  FILLER            PIC  X(02)  VALUE
               "),".
           10  FILLER            PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD    PIC  X(04).
           10  FILLER            PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD        PIC  X(12).
           10  FILLER            PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD         PIC  X(04).
           10  FILLER            PIC  X(07)  VALUE
                 "' AND (".
           10  FILLER            PIC  X(12)  VALUE
                 "  KJN_YMD > ".
           10  WK-KAISI-KJN-YMD  PIC  S9(08).
           10  FILLER            PIC  X(15)  VALUE
                 " AND KJN_YMD > ".
           10  WK-KJN-YMD        PIC  S9(08).
           10  FILLER            PIC  X(03)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-11)
         05  WK-MSG-1-11.
           10  FILLER            PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSR00       PIC  X(13).
           10  FILLER            PIC  X(02)  VALUE
               "),".
           10  FILLER            PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD    PIC  X(04).
           10  FILLER            PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD        PIC  X(12).
           10  FILLER            PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD         PIC  X(04).
           10  FILLER            PIC  X(07)  VALUE
                 "' AND (".
           10  FILLER            PIC  X(12)  VALUE
                 "  KJN_YMD > ".
           10  WK-KAISI-KJN-YMD  PIC  S9(08).
           10  FILLER            PIC  X(15)  VALUE
                 " AND KJN_YMD > ".
           10  WK-KJN-YMD        PIC  S9(08).
           10  FILLER            PIC  X(03)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-12)
         05  WK-MSG-1-12.
           10  FILLER            PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZGZ00       PIC  X(13).
           10  FILLER            PIC  X(02)  VALUE
               "),".
           10  FILLER            PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD    PIC  X(04).
           10  FILLER            PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD        PIC  X(12).
           10  FILLER            PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD         PIC  X(04).
           10  FILLER            PIC  X(07)  VALUE
                 "' AND (".
           10  FILLER            PIC  X(12)  VALUE
                 "  KJN_YMD > ".
           10  WK-KAISI-KJN-YMD  PIC  S9(08).
           10  FILLER            PIC  X(15)  VALUE
                 " AND KJN_YMD > ".
           10  WK-KJN-YMD        PIC  S9(08).
           10  FILLER            PIC  X(03)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-13)
         05  WK-MSG-1-13.
           10  FILLER            PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKZ00       PIC  X(13).
           10  FILLER            PIC  X(02)  VALUE
               "),".
           10  FILLER            PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD    PIC  X(04).
           10  FILLER            PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD        PIC  X(12).
           10  FILLER            PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD         PIC  X(04).
           10  FILLER            PIC  X(22)  VALUE
               "'  AND HYK_KRTU_CD = '".
      *    10  WK-HYK-KRTU-CD    PIC  X(04).
           10  FILLER            PIC  X(08)  VALUE
                 " ' AND (".
           10  FILLER            PIC  X(12)  VALUE
                 "  KJN_YMD > ".
           10  WK-KAISI-KJN-YMD  PIC  S9(08).
           10  FILLER            PIC  X(15)  VALUE
                 " AND KJN_YMD < ".
           10  WK-KJN-YMD        PIC  S9(08).
           10  FILLER            PIC  X(03)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-15)
         05  WK-MSG-1-15.
           10  FILLER            PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKK00       PIC  X(13).
           10  FILLER            PIC  X(02)  VALUE
               "),".
           10  FILLER            PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD    PIC  X(04).
           10  FILLER            PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD        PIC  X(12).
           10  FILLER            PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD         PIC  X(04).
           10  FILLER            PIC  X(07)  VALUE
                 "' AND (".
           10  FILLER            PIC  X(12)  VALUE
                 "  KJN_YMD > ".
           10  WK-KAISI-KJN-YMD  PIC  S9(08).
           10  FILLER            PIC  X(15)  VALUE
                 " AND KJN_YMD > ".
           10  WK-KJN-YMD        PIC  S9(08).
           10  FILLER            PIC  X(03)  VALUE
                 " )".
      ******************************************************************@3212SEINO@@
      *                フラグエリア                                     @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FLAG-AREA.                                                   @3212SEINO@@
      *----------  カーソル1-1フラグ                                    @3212SEINO@@
         05  WK-TKDYAA40-CR-1-1-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-2フラグ                                    @3212SEINO@@
         05  WK-TKDYAA40-CR-1-2-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-3フラグ                                    @3212SEINO@@
         05  WK-TKMXXX00-CR-1-3-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-4フラグ                                    @3212SEINO@@
         05  WK-TKMZKK00-CR-1-4-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-5フラグ                                    @3212SEINO@@
         05  WK-TKDYAA40-CR-1-5-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-6フラグ                                    @3212SEINO@@
         05  WK-TKMXTR00-CR-1-6-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-7フラグ                                    @3212SEINO@@
         05  WK-TKMXTR00-CR-1-7-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-8フラグ                                    @3212SEINO@@
         05  WK-TKDYAA40-CR-1-8-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-9フラグ                                    @3212SEINO@@
         05  WK-TKMZBW02-CR-1-9-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-10フラグ                                   @3212SEINO@@
         05  WK-TKMZZR00-CR-1-1-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-11フラグ                                   @3212SEINO@@
         05  WK-TKMZSR00-CR-1-1-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-12フラグ                                   @3212SEINO@@
         05  WK-TKMZGZ00-CR-1-1-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-13フラグ                                   @3212SEINO@@
         05  WK-TKMZKZ00-CR-1-1-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *----------  カーソル1-15フラグ                                   @3212SEINO@@
         05  WK-TKMZKK00-CR-1-1-FLG                                     @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *                複数回起動チェック用スイッチ                     @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FIRST-SW                PIC  X(03)  VALUE 'YES'.             @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  昇順で並べる
       01  PARM-SMZJ4017-INOUT.
           COPY  "SMZJ4017.cpy".
       01  PARM-SMZJ4017-RTNPKG.
         05  PARM-SMZJ4017-ARG3.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
      *----------  リターンパッケージセットルーチンコピー句
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY1020 カレンダールーチン
       01  PARM-SCZY1020-INOUT.
           COPY  "SCZY1020.cpy".
       01  PARM-SCZY1020-RTNPKG.
         05  PARM-SCZY1020-ARG3.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY4017 ポートフォリオ期間取得(復数)ルーチン
       01  PARM-SCZY4017-INOUT.
           COPY  "SCZY4017.cpy".
       01  PARM-SCZY4017-RTNPKG.
         05  PARM-SCZY4017-ARG3.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY4007 ポートフォリオ属性取得ルーチン
       01  PARM-SCZY4007-INOUT.
           COPY  "SCZY4007.cpy".
       01  PARM-SCZY4007-RTNPKG.
         05  PARM-SCZY4007-ARG3.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY1180 進捗管理データ削除ルーチン
       01  PARM-SCZY1180-INOUT.
           COPY  "SCZY1180.cpy".
       01  PARM-SCZY1180-RTNPKG.
         05  PARM-SCZY1180-ARG3.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY4026 決算日算出共通ルーチン
       01  PARM-SCZY4026-INOUT.
           COPY  "SCZY4026.cpy".
       01  PARM-SCZY4026-RTNPKG.
         05  PARM-SCZY4026-ARG3.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  ARG2リターンパッケージセットルーチン
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *        連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ1210-INOUT.
           COPY  "SMZJ1210.cpy".
       01  PARM-SMZJ1210-RTNPKG.
         05  PARM-SMZJ1210-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *    PROCEDURE              DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ1210-INOUT
                  PARM-SMZJ1210-RTNPKG.
      ******************************************************************
      *               処理対象断面決定
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ◇◆◇SMZJ1210  START◇◆◇  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ◇◆◇SMZJ1210  END◇◆◇  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           EXIT.
      ******************************************************************
      *     3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBLID-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *     3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     WORK-AREA
                          HST-AREA
                          SQL-AREA
                          E-MSG-TBL
                          PARM-SCZY1160-INOUT
                          PARM-SCZY1020-INOUT
                          PARM-SCZY4017-INOUT
                          PARM-SCZY4007-INOUT
                          PARM-SCZY4026-INOUT
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-SCZY1180-INOUT
                          PARM-SCZY1180-RTNPKG
                          PARM-RTNPKG
                          PARM-SMZJ1210-ARG2  OF  PARM-SMZJ1210-RTNPKG
                          PARM-SMZJ1210-ARG3  OF  PARM-SMZJ1210-INOUT
      *-----------------------------------------------------------------@3212SEINO@
      D    DISPLAY  CNS-PGM-ID":FIRST-SW            =["FIRST-SW"]"      @3212SEINO@
      *-----------------------------------------------------------------@3212SEINO@
      *-----  初回ＣＡＬＬ時のみフラグエリアの初期化を行う              @3212SEINO@@
           IF     FIRST-SW = 'YES'                                      @3212SEINO@@
           THEN                                                         @3212SEINO@@
                  INITIALIZE              FLAG-AREA                     @3212SEINO@@
                  MOVE  'NO '         TO  FIRST-SW                      @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLAG-AREA= ["FLAG-AREA"]"               @3212SEINO@
      D    DISPLAY  CNS-PGM-ID":FIRST-SW  = ["FIRST-SW"]"               @3212SEINO@
      D    DISPLAY  CNS-PGM-ID":WORK-AREA        = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HST-AREA         = ["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA         = ["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL        = ["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT = ["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1020-INOUT = ["
      D             PARM-SCZY1020-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4017-INOUT = ["
      D             PARM-SCZY4017-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4007-INOUT = ["
      D             PARM-SCZY4007-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4026-INOUT = ["
      D             PARM-SCZY4026-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN = ["PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG= ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1180-INOUT = ["
      D             PARM-SCZY1180-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1180-RTNPKG= ["
      D             PARM-SCZY1180-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG = ["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1210-ARG2  = ["
      D             PARM-SMZJ1210-ARG2  OF  PARM-SMZJ1210-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1210-ARG3  = ["
      D             PARM-SMZJ1210-ARG3  OF  PARM-SMZJ1210-INOUT"]"
      *-----------------------------------------------------------------
           MOVE  CNS-RTN-000
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD  OF  PARM-SCZY1170-ARG1 = ["
      D             RTN-CD  OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  指定From日
           MOVE  SITEI-FROM             OF  PARM-SMZJ1210-ARG1
             TO  WK-SITEI-FROM          OF  WK-DATA-IN
      *----------  指定To日
           MOVE  SITEI-TO               OF  PARM-SMZJ1210-ARG1
             TO  WK-SITEI-TO            OF  WK-DATA-IN
      *----------  強制計算区分
           MOVE  KYOSE-CALC-KBN         OF  PARM-SMZJ1210-ARG1
             TO  WK-KYOSE-CALC-KBN      OF  WK-DATA-IN
      *----------  対象ポートフォリオ
           MOVE  OBJ-PTF-PARM           OF  PARM-SMZJ1210-ARG1
             TO  WK-OBJ-PTF-PARM        OF  WK-DATA-IN
      *----------  勘定異動／残高作成
           MOVE  KJIDO-ZANSK            OF  PARM-SMZJ1210-ARG1
             TO  WK-KJIDO-ZANSK         OF  WK-DATA-IN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":指定From日  = ["
      D             WK-SITEI-FROM       OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":指定To日  = ["
      D             WK-SITEI-TO         OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":強制計算区分  = ["
      D             WK-KYOSE-CALC-KBN   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":対象ポートフォリオ  = ["
      D             WK-OBJ-PTF-PARM     OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動／残高作成  = ["
      D             WK-KJIDO-ZANSK      OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------------<DEBUG>------------------------------------------
      D    DISPLAY  CNS-PGM-ID"****  初期化処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  進捗管理
           MOVE  CNS-TBL-TKDYAA40
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  取引テーブル
           MOVE  CNS-TBL-TKMXTR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *----------  基準日計算情報
           MOVE  CNS-TBL-TKMZKK00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *----------  基準日断面情報
           MOVE  CNS-TBL-TKMZBW02
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *----------  残高履歴
           MOVE  CNS-TBL-TKMZZR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
      *----------  資金残履歴
           MOVE  CNS-TBL-TKMZSR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(6)
      *----------  元本残高
           MOVE  CNS-TBL-TKMZGZ00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(7)
      *----------  勘定残高
           MOVE  CNS-TBL-TKMZKZ00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(8)
      *----------  資金取引
           MOVE  CNS-TBL-TKMXST00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(9)
      *----------  債券過去経過利息
           MOVE  CNS-TBL-TKMZKR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(10)
      *----------  未収収益
           MOVE  CNS-TBL-TKMZMS00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(11)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD  OF PARM-SCZY1160-ARG1=["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(1)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(2)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(3)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(4)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(5)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(6)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(7)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(7)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(8)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(8)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(9)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(9)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(10)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(10)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(11)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(11)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG          =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  進捗管理
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKDYAA40
      *----------  取引テーブル
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TBL-TKMXTR00
      *----------  基準日計算情報
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TBL-TKMZKK00
      *----------  基準日断面情報
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TBL-TKMZBW02
      *----------  残高履歴
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TBL-TKMZZR00
      *----------  資金残履歴
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(6)
               TO  WK-TBL-TKMZSR00
      *----------  元本残高
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(7)
               TO  WK-TBL-TKMZGZ00
      *----------  勘定残高
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(8)
               TO  WK-TBL-TKMZKZ00
      *----------  資金取引
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(9)
               TO  WK-TBL-TKMXST00
      *----------  債券過去経過利息
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(10)
               TO  WK-TBL-TKMZKR00
      *----------  未収収益
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(11)
               TO  WK-TBL-TKMZMS00
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理              =["
      D             WK-TBL-TKDYAA40"]"
      D    DISPLAY  CNS-PGM-ID":取引テーブル          =["
      D             WK-TBL-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":基準日計算情報        =["
      D             WK-TBL-TKMZKK00"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面情報        =["
      D             WK-TBL-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":残高履歴              =["
      D             WK-TBL-TKMZZR00"]"
      D    DISPLAY  CNS-PGM-ID":資金残履歴            =["
      D             WK-TBL-TKMZSR00"]"
      D    DISPLAY  CNS-PGM-ID":元本残高              =["
      D             WK-TBL-TKMZGZ00"]"
      D    DISPLAY  CNS-PGM-ID":勘定残高              =["
      D             WK-TBL-TKMZKZ00"]"
      D    DISPLAY  CNS-PGM-ID":資金取引              =["
      D             WK-TBL-TKMXST00"]"
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息      =["
      D             WK-TBL-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":未収収益              =["
      D             WK-TBL-TKMZMS00"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得処理  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *     3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.1計算期間決定
           PERFORM  CALC-KKN-DEC-RTN
           IF  WK-END-FLG = CNS-ON
           THEN
             CONTINUE
           ELSE
      *----------  3.2.2対象断面算出
             PERFORM  OBJ-DMN-YMD-RTN
      *----------  3.2.3各準備処理
             PERFORM  EVR-PRE-RTN
      *----------  3.2.4基準日断面情報INSERT処理と不要断面削除処理
             PERFORM  KJN-DMN-INS-NDMN-RTN
      *----------  3.2.6ARG3セット
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG3セット START"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.締め日    =["
      D             WK-SHIME-YMD        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID ":ＧＩＰＳモード=["
      D             GIPS-MODE           OF PARM-SMZJ1210-ARG1"]"
      *-----------------------------------------------------------------
      *----------  ARG3.締め日
             MOVE  WK-SHIME-YMD         OF  WK-CALC-KKN-PACKAGE
               TO  SHIME-YMD            OF  PARM-SMZJ1210-ARG3
      *----------  ARG3.計算From日
             MOVE  WK-CALC-FROM         OF  WK-CALC-KKN-PACKAGE
               TO  CALC-FROM            OF  PARM-SMZJ1210-ARG3
      *----------  ARG1.ＧＩＰＳモード＝1：ＧＩＰＳモードの場合
           IF  GIPS-MODE                OF PARM-SMZJ1210-ARG1 = CNS-1
           THEN
      *----------  ARG3.処理フラグ ← 1：処理する
               MOVE  CNS-1
                 TO  SYORI-FLG          OF  PARM-SMZJ1210-ARG3
           ELSE
      *----------  ARG3.処理フラグ ← 0：処理しない
               MOVE  CNS-0
                 TO  SYORI-FLG          OF  PARM-SMZJ1210-ARG3
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG3.締め日    =["
      D             SHIME-YMD           OF  PARM-SMZJ1210-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":ARG3.計算From日=["
      D             CALC-FROM           OF  PARM-SMZJ1210-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":ARG3セット END"
      D    DISPLAY  CNS-PGM-ID":ARG3.処理フラグ =["
      D             SYORI-FLG          OF  PARM-SMZJ1210-ARG3"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1計算期間決定
      ******************************************************************
       CALC-KKN-DEC-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  計算期間決定  START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.1計算パターン決定
           PERFORM  CALC-PATRN-DEC-RTN
           IF  WK-END-FLG  = CNS-ON
           THEN
             CONTINUE
           ELSE
      *----------  3.2.1.2期間決める処理
             PERFORM  KKN-DEC-DISP-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  計算期間決定  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-KKN-DEC-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.1計算パターン決定
      ******************************************************************
       CALC-PATRN-DEC-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  計算パターン決定  START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.1.1締め日判定
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 3.2.1.1.1締め日判定  START  ***"
      *-----------------------------------------------------------------
      *----------  進捗管理TBL
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TKDYAA40           OF  SQL-SELECT-1-1,
                 WK-TKDYAA40            OF  WK-MSG-1-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKDYAA40-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKDYAA40-S,
                 WK-FUND-CD             OF  WK-MSG-1-1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKDYAA40-S,
                 WK-PTF-CD              OF  WK-MSG-1-1
      *----------  進捗ステータス
           MOVE  CNS-SHINTK-STS1
             TO  H-SHINTK-STS           OF  H-TKDYAA40-S,
                 WK-SHINTK-STS          OF  WK-MSG-1-1
      *----------  進捗タスクID
           MOVE  CNS-SHINTK-TASK-ID
             TO  H-SHINTK-TASK-ID       OF  H-TKDYAA40-S,
                 WK-SHINTK-TASK-ID      OF  WK-MSG-1-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-1     =["SQL-SELECT-1-1"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD     OF  H-TKDYAA40-S=["
      D             H-RIYO-CMP-CD       OF  H-TKDYAA40-S"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD         OF  H-TKDYAA40-S=["
      D             H-FUND-CD           OF  H-TKDYAA40-S"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD          OF  H-TKDYAA40-S=["
      D             H-PTF-CD            OF  H-TKDYAA40-S"]"
      D    DISPLAY  CNS-PGM-ID":H-SHINTK-STS      OF  H-TKDYAA40-S=["
      D             H-SHINTK-STS        OF  H-TKDYAA40-S"]"
      D    DISPLAY  CNS-PGM-ID":H-SHINTK-TASK-ID  OF  H-TKDYAA40-S=["
      D             H-SHINTK-TASK-ID    OF  H-TKDYAA40-S"]"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
      *    MOVE  SQL-SELECT-1-1         TO  SQLSTMT                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT1-ARR                                     @3212SEINO@@
           MOVE  1                      TO  SQLSTMT1-LEN                @3212SEINO@@
           STRING  SQL-SELECT-1-1                                       @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT1-ARR                                   @3212SEINO@@
                   WITH  POINTER  SQLSTMT1-LEN                          @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1-ARR=["SQLSTMT1-ARR"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKDYAA40-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-TKDYAA40-CR-1-1-FLG  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC SQL                                                   @3212SEINO@@
                 PREPARE S1 FROM :SQLSTMT1                              @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理（TKDYAA40）CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-002
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
             EXEC  SQL  DECLARE  TKDYAA40_CURSOR CURSOR  FOR S1 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  カーソルオープン処理
           EXEC  SQL
               OPEN TKDYAA40_CURSOR
           USING  :H-TKDYAA40-S.H-RIYO-CMP-CD,
                  :H-TKDYAA40-S.H-FUND-CD,
                  :H-TKDYAA40-S.H-PTF-CD,
                  :H-TKDYAA40-S.H-SHINTK-STS,
                  :H-TKDYAA40-S.H-SHINTK-TASK-ID
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON              TO  WK-TKDYAA40-CR-1-1-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-1-FLG=["
      D             WK-TKDYAA40-CR-1-1-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-003
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *----------  カーソルフェッチ処理
           INITIALIZE                   H-TKDYAA40
           EXEC  SQL
               FETCH
                    TKDYAA40_CURSOR
               INTO :H-TKDYAA40.H-SS-SYORI-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理取得最終処理基準日=["
      D             H-SS-SYORI-YMD      OF  H-TKDYAA40"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *----------  ワーク計算期間パッケージ.締め日フラグ
               MOVE  CNS-SHIME-YMD-FLG-1
                 TO  WK-SHIME-YMD-FLG   OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.締め日
               MOVE  H-SS-SYORI-YMD     OF  H-TKDYAA40
                 TO  WK-SHIME-YMD       OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.締め日フラグ=["
      D             WK-SHIME-YMD-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.締め日=["
      D             WK-SHIME-YMD        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.指定To日=["
      D             WK-SITEI-TO         OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
               IF  WK-SITEI-TO  OF  WK-DATA-IN <= WK-SHIME-YMD
                 OF  WK-CALC-KKN-PACKAGE
               THEN
      *----------  ARG3.警告フラグ
                 MOVE  CNS-WARN-FLG-D2
                   TO  WARN-FLG         OF  PARM-SMZJ1210-ARG3
      *----------  ARG3.締め日
                 MOVE  H-SS-SYORI-YMD   OF  H-TKDYAA40
                   TO  SHIME-YMD        OF  PARM-SMZJ1210-ARG3
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG3.締め日=["
      D             SHIME-YMD           OF  PARM-SMZJ1210-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":ARG3.警告フラグ=["
      D             WARN-FLG            OF  PARM-SMZJ1210-ARG3"]"
      *-----------------------------------------------------------------
      *----------  終了フラグ
                 MOVE  CNS-ON        TO  WK-END-FLG
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理CURSOR FETCH NOTFOUNDの場合"
      *-----------------------------------------------------------------
               MOVE  CNS-SHIME-YMD-FLG-0
                 TO  WK-SHIME-YMD-FLG   OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.締め日フラグ=["
      D             WK-SHIME-YMD-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-004
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *    EXEC  SQL                                                    @3212SEINO@@
      *        CLOSE TKDYAA40_CURSOR                                    @3212SEINO@@
      *    END-EXEC                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-CLOSE=["SQLCODE"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEINO@@
      *    THEN                                                         @3212SEINO@@
      *      MOVE  CNS-OFF              TO  WK-TKDYAA40-CR-1-1-FLG      @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-1-FLG=["               @3212SEINO@@
      *             WK-TKDYAA40-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    ELSE                                                         @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":進捗管理SQL処理エラー（CLOSE)"          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *      MOVE  CNS-PGM-ID                                           @3212SEINO@@
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *      MOVE  CNS-POS-005                                          @3212SEINO@@
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *      MOVE  CNS-RTN-900                                          @3212SEINO@@
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *      MOVE  SQLCODE                                              @3212SEINO@@
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      *              WK-MSG-1-1         DELIMITED  BY  SIZE             @3212SEINO@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      PERFORM  ERR-RTN                                           @3212SEINO@@
      *    END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 3.2.1.1.1締め日判定  END  ***"
      *-----------------------------------------------------------------
           IF  WK-END-FLG  =  CNS-ON
           THEN
             CONTINUE
           ELSE
      *----------  3.2.1.1.2正常終了日判定
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 3.2.1.1.2正常終了日判定  START  ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.指定From日 =["
      D             WK-SITEI-FROM       OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.強制計算区分=["
      D             WK-KYOSE-CALC-KBN   OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
             IF   WK-SITEI-FROM         OF  WK-DATA-IN = CNS-0  AND
                  WK-KYOSE-CALC-KBN     OF  WK-DATA-IN = CNS-CHAR-0
             THEN
      *----------  正常終了日判定
               PERFORM  NOR-END-YMD-DES-RTN
             ELSE
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 3.2.1.1.2正常終了日判定  END  ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.1.3ワーク計算期間パッケージ編集
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.指定From日 =["
      D             WK-SITEI-FROM       OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.締め日=["
      D             WK-SHIME-YMD        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.締め日フラグ=["
      D             WK-SHIME-YMD-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.強制計算区分=["
      D             WK-KYOSE-CALC-KBN   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.正常終了日フラ"
      D             "グ=["WK-NML-END-DAT-FLG  OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             IF  WK-SITEI-FROM           OF  WK-DATA-IN NOT = CNS-0
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.指定From日NOT = 0 の場合"
      *-----------------------------------------------------------------
               EVALUATE  WK-SHIME-YMD-FLG  OF  WK-CALC-KKN-PACKAGE
                 WHEN  CNS-CHAR-1
                   EVALUATE  WK-KYOSE-CALC-KBN OF  WK-DATA-IN
                     WHEN  CNS-CHAR-1
                       IF  WK-SITEI-FROM  OF  WK-DATA-IN > WK-SHIME-YMD
                         OF  WK-CALC-KKN-PACKAGE
                       THEN
      *----------  ワーク計算期間パッケージ.計算From日
                         MOVE  WK-SITEI-FROM
                           OF  WK-DATA-IN
                           TO  WK-CALC-FROM
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                         MOVE  CNS-CHAR-0
                           TO  WK-CALC-FROM-HS
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                         MOVE  CNS-CHAR-1
                           TO  WK-KKN-HS
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                         MOVE  CNS-CHAR-1
                           TO  WK-START-DMN-FLG
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                         MOVE  CNS-CHAR-1
                           TO  WK-START-DMN-STS
                           OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                       ELSE
      *----------  ワーク計算期間パッケージ.計算From日
                         MOVE  WK-SHIME-YMD
                           OF  WK-CALC-KKN-PACKAGE
                           TO  WK-CALC-FROM
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                         MOVE  CNS-CHAR-1
                           TO  WK-CALC-FROM-HS
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                         MOVE  CNS-CHAR-1
                           TO  WK-KKN-HS
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                         MOVE  CNS-CHAR-1
                           TO  WK-START-DMN-FLG
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                         MOVE  CNS-CHAR-1
                           TO  WK-START-DMN-STS
                           OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                       END-IF
                     WHEN  CNS-CHAR-0
                       IF  WK-SITEI-FROM  OF  WK-DATA-IN > WK-SHIME-YMD
                         OF  WK-CALC-KKN-PACKAGE
                       THEN
      *----------  ワーク計算期間パッケージ.計算From日
                         MOVE  WK-SITEI-FROM
                           OF  WK-DATA-IN
                           TO  WK-CALC-FROM
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                         MOVE  CNS-CHAR-0
                           TO  WK-CALC-FROM-HS
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                         MOVE  CNS-CHAR-2
                           TO  WK-KKN-HS
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                         MOVE  CNS-CHAR-1
                           TO  WK-START-DMN-FLG
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                         MOVE  CNS-CHAR-1
                           TO  WK-START-DMN-STS
                           OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                       ELSE
      *----------  ワーク計算期間パッケージ.計算From日
                         MOVE  WK-SHIME-YMD
                           OF  WK-CALC-KKN-PACKAGE
                           TO  WK-CALC-FROM
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                         MOVE  CNS-CHAR-1
                           TO  WK-CALC-FROM-HS
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                         MOVE  CNS-CHAR-2
                           TO  WK-KKN-HS
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                         MOVE  CNS-CHAR-1
                           TO  WK-START-DMN-FLG
                           OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                         MOVE  CNS-CHAR-1
                           TO  WK-START-DMN-STS
                           OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                       END-IF
                     WHEN  OTHER
                       CONTINUE
                   END-EVALUATE
                 WHEN  CNS-CHAR-0
                   EVALUATE  WK-KYOSE-CALC-KBN   OF  WK-DATA-IN
                     WHEN  CNS-CHAR-1
      *----------  ワーク計算期間パッケージ.計算From日
                       MOVE  WK-SITEI-FROM
                         OF  WK-DATA-IN
                         TO  WK-CALC-FROM
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                       MOVE  CNS-CHAR-0
                         TO  WK-CALC-FROM-HS
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                       MOVE  CNS-CHAR-1
                         TO  WK-KKN-HS    OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                       MOVE  CNS-CHAR-9
                         TO  WK-START-DMN-FLG
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                       MOVE  CNS-CHAR-SPACE
                         TO  WK-START-DMN-STS
                         OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                     WHEN  CNS-CHAR-0
      *----------  ワーク計算期間パッケージ.計算From日
                       MOVE  WK-SITEI-FROM
                         OF  WK-DATA-IN
                         TO  WK-CALC-FROM
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                       MOVE  CNS-CHAR-0
                         TO  WK-CALC-FROM-HS
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                       MOVE  CNS-CHAR-2
                         TO  WK-KKN-HS    OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                       MOVE  CNS-CHAR-9
                         TO  WK-START-DMN-FLG
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                       MOVE  CNS-CHAR-SPACE
                         TO  WK-START-DMN-STS
                         OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                     WHEN  OTHER
                       CONTINUE
                   END-EVALUATE
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.指定From日 = 0 の場合"
      *-----------------------------------------------------------------
               EVALUATE  WK-SHIME-YMD-FLG    OF  WK-CALC-KKN-PACKAGE
                 WHEN  CNS-CHAR-1
                   EVALUATE  WK-KYOSE-CALC-KBN   OF  WK-DATA-IN
                     WHEN  CNS-CHAR-1
      *----------  ワーク計算期間パッケージ.計算From日
                       MOVE  WK-SHIME-YMD
                         OF  WK-CALC-KKN-PACKAGE
                         TO  WK-CALC-FROM
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                       MOVE  CNS-CHAR-1
                         TO  WK-CALC-FROM-HS
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                       MOVE  CNS-CHAR-1
                         TO  WK-KKN-HS    OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                       MOVE  CNS-CHAR-1
                         TO  WK-START-DMN-FLG
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                       MOVE  CNS-CHAR-1
                         TO  WK-START-DMN-STS
                         OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                     WHEN  CNS-CHAR-0
                       EVALUATE  WK-NML-END-DAT-FLG
                                        OF WK-CALC-KKN-PACKAGE
                         WHEN  CNS-CHAR-1
      *----------  ワーク計算期間パッケージ.計算From日
                           MOVE  WK-NML-END-DAT
                             OF  WK-CALC-KKN-PACKAGE
                             TO  WK-CALC-FROM
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                           MOVE  CNS-CHAR-1
                             TO  WK-CALC-FROM-HS
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                           MOVE  CNS-CHAR-2
                             TO  WK-KKN-HS
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                           MOVE  CNS-CHAR-1
                             TO  WK-START-DMN-FLG
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                           MOVE  CNS-CHAR-1
                             TO  WK-START-DMN-STS
                             OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                         WHEN  CNS-CHAR-0
      *----------  ワーク計算期間パッケージ.計算From日
                           MOVE  WK-SHIME-YMD
                             OF  WK-CALC-KKN-PACKAGE
                             TO  WK-CALC-FROM
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                           MOVE  CNS-CHAR-1
                             TO  WK-CALC-FROM-HS
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                           MOVE  CNS-CHAR-2
                             TO  WK-KKN-HS
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                           MOVE  CNS-CHAR-1
                             TO  WK-START-DMN-FLG
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                           MOVE  CNS-CHAR-1
                             TO  WK-START-DMN-STS
                             OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                         WHEN  OTHER
                           CONTINUE
                       END-EVALUATE
                     WHEN  OTHER
                       CONTINUE
                   END-EVALUATE
                 WHEN  CNS-CHAR-0
                   EVALUATE  WK-KYOSE-CALC-KBN   OF  WK-DATA-IN
                     WHEN  CNS-CHAR-1
      *----------  ワーク計算期間パッケージ.計算From日
                       MOVE  CNS-0
                         TO  WK-CALC-FROM
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                       MOVE  CNS-CHAR-2
                         TO  WK-CALC-FROM-HS
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                       MOVE  CNS-CHAR-1
                         TO  WK-KKN-HS    OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                       MOVE  CNS-CHAR-0
                         TO  WK-START-DMN-FLG
                         OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                       MOVE  CNS-CHAR-6
                         TO  WK-START-DMN-STS
                         OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                     WHEN  CNS-CHAR-0
                       EVALUATE  WK-NML-END-DAT-FLG
                                        OF WK-CALC-KKN-PACKAGE
                         WHEN  CNS-CHAR-1
      *----------  ワーク計算期間パッケージ.計算From日
                           MOVE  WK-NML-END-DAT
                             OF  WK-CALC-KKN-PACKAGE
                             TO  WK-CALC-FROM
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                           MOVE  CNS-CHAR-1
                             TO  WK-CALC-FROM-HS
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                           MOVE  CNS-CHAR-2
                             TO  WK-KKN-HS
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                           MOVE  CNS-CHAR-1
                             TO  WK-START-DMN-FLG
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                           MOVE  CNS-CHAR-1
                             TO  WK-START-DMN-STS
                             OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                         WHEN  CNS-CHAR-0
      *----------  ワーク計算期間パッケージ.計算From日
                           MOVE  CNS-0
                             TO  WK-CALC-FROM
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.計算From日再処理方法
                           MOVE  CNS-CHAR-2
                             TO  WK-CALC-FROM-HS
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.期間処理方法
                           MOVE  CNS-CHAR-1
                             TO  WK-KKN-HS
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面フラグ
                           MOVE  CNS-CHAR-0
                             TO  WK-START-DMN-FLG
                             OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.開始断面進捗STS
                           MOVE  CNS-CHAR-6
                             TO  WK-START-DMN-STS
                             OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.計算From日再処理方法=["
      D             WK-CALC-FROM-HS     OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                         WHEN  OTHER
                           CONTINUE
                       END-EVALUATE
                     WHEN  OTHER
                       CONTINUE
                   END-EVALUATE
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": 3.2.1.1.3ワーク計算期間パッケージ編集  END"
      *-----------------------------------------------------------------
      *----------  3.2.1.1.4 計算From日再処理
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 3.2.1.1.4計算From日再処理  START***"
      *-----------------------------------------------------------------
      *----------  A)ワーク計算期間パッケージ.計算From日再処理方法＝'1'(翌日)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日"
      D            "再処理方法 =["
      D             WK-CALC-FROM-HS  OF WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             IF  WK-CALC-FROM-HS  OF WK-CALC-KKN-PACKAGE = CNS-CHAR-1
             THEN
      *----------  CALL 【SCZY1020】(計算From日再処理)
               PERFORM  CALC-FROM-DAYS-RTN
             ELSE
      *----------B)ワーク計算期間パッケージ.計算From日再処理方法＝'2'(取引計上日)
               IF  WK-CALC-FROM-HS  OF WK-CALC-KKN-PACKAGE = CNS-CHAR-2
               THEN
      *----------  エラーポジション
                 MOVE  CNS-POS-006        TO  WK-ERR-POS1
      *----------  取引テーブル(計算From日再処理)CURSOR PREPARE
                 PERFORM  TRHK-TBL-PREP-RTN
      *----------  エラーポジション
                 MOVE  CNS-POS-007        TO  WK-ERR-POS1
      *----------  取引テーブル(計算From日再処理)CURSOR OPEN
                 PERFORM  TRHK-TBL-OPEN-RTN
      *----------  エラーポジション
                 MOVE  CNS-POS-008        TO  WK-ERR-POS1
      *----------  取引テーブル(計算From日再処理)CURSOR FETCH1
                 PERFORM  TRHK-TBL-FETCH1-RTN
      *----------  エラーポジション                                     @3212SEINO@@
      *          MOVE  CNS-POS-009        TO  WK-ERR-POS1               @3212SEINO@@
      *----------  取引テーブル(計算From日再処理)CLOSE                  @3212SEINO@@
      *          PERFORM  TRHK-TBL-CLOSE-RTN                            @3212SEINO@@
               ELSE
                 CONTINUE
               END-IF
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 3.2.1.1.4計算From日再処理  END  ***"
      D    DISPLAY  CNS-PGM-ID":***  計算パターン決定  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-PATRN-DEC-EXT.
           EXIT.
      ******************************************************************
      *     正常終了日判定
      ******************************************************************
       NOR-END-YMD-DES-RTN    SECTION.
      *----------  進捗管理TBL
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TKDYAA40           OF  SQL-SELECT-1-2,
                 WK-TKDYAA40            OF  WK-MSG-1-2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKDYAA40-S-1,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKDYAA40-S-1,
                 WK-FUND-CD             OF  WK-MSG-1-2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKDYAA40-S-1,
                 WK-PTF-CD              OF  WK-MSG-1-2
      *----------  進捗ステータス
           MOVE  CNS-SHINTK-STS2
             TO  H-SHINTK-STS           OF  H-TKDYAA40-S-1,
                 WK-SHINTK-STS          OF  WK-MSG-1-2
      *----------  進捗タスクID
           MOVE  CNS-SHINTK-TASK-ID
             TO  H-SHINTK-TASK-ID       OF  H-TKDYAA40-S-1,
                 WK-SHINTK-TASK-ID      OF  WK-MSG-1-2
      *----------  指定To日
           MOVE  WK-SITEI-TO            OF  WK-DATA-IN
             TO  H-SITEI-TO             OF  H-TKDYAA40-S-1,
                 WK-SITEI-TO            OF  WK-MSG-1-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-2=["SQL-SELECT-1-2"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD     OF  H-TKDYAA40-S-1=["
      D             H-RIYO-CMP-CD       OF  H-TKDYAA40-S-1"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD         OF  H-TKDYAA40-S-1=["
      D             H-FUND-CD           OF  H-TKDYAA40-S-1"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD          OF  H-TKDYAA40-S-1=["
      D             H-PTF-CD            OF  H-TKDYAA40-S-1"]"
      D    DISPLAY  CNS-PGM-ID":H-SHINTK-STS      OF  H-TKDYAA40-S-1=["
      D             H-SHINTK-STS        OF  H-TKDYAA40-S-1"]"
      D    DISPLAY  CNS-PGM-ID":H-SHINTK-TASK-ID  OF  H-TKDYAA40-S-1=["
      D             H-SHINTK-TASK-ID    OF  H-TKDYAA40-S-1"]"
      D    DISPLAY  CNS-PGM-ID":H-SITEI-TO        OF  H-TKDYAA40-S-1=["
      D             H-SITEI-TO          OF  H-TKDYAA40-S-1"]"
      *-----------------------------------------------------------------@3212SEINO@@
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
      *    MOVE  SQL-SELECT-1-2         TO  SQLSTMT                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT2-ARR                                     @3212SEINO@@
           MOVE  1                      TO  SQLSTMT2-LEN                @3212SEINO@@
           STRING  SQL-SELECT-1-2                                       @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT2-ARR                                   @3212SEINO@@
                   WITH  POINTER  SQLSTMT2-LEN                          @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT2-ARR=["SQLSTMT2-ARR"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-2-FLG=["               @3212SEINO@@
      D             WK-TKDYAA40-CR-1-2-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-TKDYAA40-CR-1-2-FLG  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC SQL                                                   @3212SEINO@@
                 PREPARE S2 FROM :SQLSTMT2                              @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-010
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-2       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
             EXEC  SQL  DECLARE  TKDYAA40_1_CURSOR  CURSOR  FOR S2
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  カーソルオープン処理
           EXEC  SQL
               OPEN TKDYAA40_1_CURSOR
           USING  :H-TKDYAA40-S-1.H-RIYO-CMP-CD,
                  :H-TKDYAA40-S-1.H-FUND-CD,
                  :H-TKDYAA40-S-1.H-PTF-CD,
                  :H-TKDYAA40-S-1.H-SHINTK-STS,
                  :H-TKDYAA40-S-1.H-SHINTK-TASK-ID,
                  :H-TKDYAA40-S-1.H-SITEI-TO
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON             TO  WK-TKDYAA40-CR-1-2-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-2-FLG=["
      D             WK-TKDYAA40-CR-1-2-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-011
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *----------  カーソルフェッチ処理
           INITIALIZE                   H-TKDYAA40-1
           EXEC  SQL
               FETCH
                    TKDYAA40_1_CURSOR
               INTO :H-TKDYAA40-1.H-SS-SYORI-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理取得最終処理基準日=["
      D             H-SS-SYORI-YMD      OF  H-TKDYAA40-1"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  正常
               MOVE  CNS-NML-END-DAT-FLG-1
                 TO  WK-NML-END-DAT-FLG OF  WK-CALC-KKN-PACKAGE
               MOVE  H-SS-SYORI-YMD     OF  H-TKDYAA40-1
                 TO  WK-NML-END-DAT     OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.正常終了日"
      D             "フラグ=["
      D             WK-NML-END-DAT-FLG  OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.正常終了日=["
      D             WK-NML-END-DAT      OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理CURSOR FETCH NOTFOUNDの場合"
      *-----------------------------------------------------------------
               MOVE  CNS-NML-END-DAT-FLG-0
                 TO  WK-NML-END-DAT-FLG OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.正常終了日"
      D             "フラグ=["
      D             WK-NML-END-DAT-FLG  OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗管理SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-012
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-2       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *    EXEC  SQL                                                    @3212SEINO@@
      *        CLOSE TKDYAA40_1_CURSOR                                  @3212SEINO@@
      *    END-EXEC                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":進捗管理SQLCODE-CLOSE=["SQLCODE"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEINO@@
      *    THEN                                                         @3212SEINO@@
      *      MOVE  CNS-OFF              TO  WK-TKDYAA40-CR-1-2-FLG      @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-2-FLG=["               @3212SEINO@@
      *             WK-TKDYAA40-CR-1-2-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    ELSE                                                         @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":進捗管理SQL処理エラー（CLOSE)"          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *      MOVE  CNS-PGM-ID                                           @3212SEINO@@
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *      MOVE  CNS-POS-013                                          @3212SEINO@@
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *      MOVE  CNS-RTN-900                                          @3212SEINO@@
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *      MOVE  SQLCODE                                              @3212SEINO@@
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      *              WK-MSG-1-2         DELIMITED  BY  SIZE             @3212SEINO@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      PERFORM  ERR-RTN                                           @3212SEINO@@
      *    END-IF                                                       @3212SEINO@@
           CONTINUE.
       NOR-END-YMD-DES-EXT.
           EXIT.
      ******************************************************************
      *    CALL 【SCZY1020】(計算From日再処理)
      ******************************************************************
       CALC-FROM-DAYS-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  CALL【SCZY1020】(計算From日再処理) START ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SCZY1020-INOUT
                        PARM-SCZY1020-RTNPKG
      *----------  【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
           MOVE  WK-CALC-FROM          OF  WK-CALC-KKN-PACKAGE
             TO  IXCAL-KJN-YMD1        OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
           MOVE  CNS-1
             TO  IXCAL-COMP-BASE       OF  PARM-SCZY1020-ARG1
      *----------  日数
           MOVE  CNS-1
             TO  IXCAL-DAYS            OF  PARM-SCZY1020-ARG1
      *----------  単位区分
           MOVE  CNS-1
             TO  IXCAL-TANI-KBN        OF  PARM-SCZY1020-ARG1
      *----------  機能区分
           MOVE  CNS-3
             TO  IXCAL-FUNCTION        OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
           MOVE  CNS-1
             TO  IXCAL-ZENGO-KBN-1     OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE    OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数                        =["
      D             IXCAL-DAYS         OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1  OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  カレンダールーチン【SCZY1020】をコールして、リターンパッケージを取得する
           MOVE  CNS-POS-014           TO  WK-ERR-POS4
           PERFORM  CALL-SCZY1020-RTN
      *----------  ワーク計算期間パッケージ.計算From日
           MOVE  IXCAL-KJN-YMD2         OF  PARM-SCZY1020-ARG1
             TO  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日 =["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  CALL【SCZY1020】(計算From日再処理) END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-FROM-DAYS-EXT.
           EXIT.
      ******************************************************************
      *    取引テーブル(計算From日再処理)CURSOR PREPARE
      ******************************************************************
       TRHK-TBL-PREP-RTN      SECTION.
      *----------  取引テーブルTBL
           MOVE  WK-TBL-TKMXTR00
             TO  SQL-TKMXTR00           OF  SQL-SELECT-1-3,
                 WK-TKMXTR00            OF  WK-MSG-1-3
      *----------  資金取引
           MOVE  WK-TBL-TKMXST00
             TO  SQL-TKMXST00           OF  SQL-SELECT-1-3,
                 WK-TKMXST00            OF  WK-MSG-1-3
      *----------  債券過去経過利息
           MOVE  WK-TBL-TKMZKR00
             TO  SQL-TKMZKR00           OF  SQL-SELECT-1-3,
                 WK-TKMZKR00            OF  WK-MSG-1-3
      *----------  未収収益
           MOVE  WK-TBL-TKMZMS00
             TO  SQL-TKMZMS00           OF  SQL-SELECT-1-3,
                 WK-TKMZMS00            OF  WK-MSG-1-3
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKMXXX00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKMXXX00-S,
                 WK-FUND-CD             OF  WK-FUND-CD-1
             OF  WK-MSG-1-3,
                 WK-FUND-CD             OF  WK-FUND-CD-2
             OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKMXXX00-S,
                 WK-PTF-CD              OF  WK-PTF-CD-1
             OF  WK-MSG-1-3,
                 WK-PTF-CD              OF  WK-PTF-CD-2
             OF  WK-MSG-1-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-3=["SQL-SELECT-1-3"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD       OF  H-TKMXXX00-S=["
      D             H-RIYO-CMP-CD       OF  H-TKMXXX00-S"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD           OF  H-TKMXTXX00-S=["
      D             H-FUND-CD           OF  H-TKMXXX00-S"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD            OF  H-TKMXXX00-S=["
      D             H-PTF-CD            OF  H-TKMXXX00-S"]"
      *-----------------------------------------------------------------@3212SEION@@
      *    INITIALIZE  SQLSTMT                                          @3212SEION@@
      *    MOVE  SQL-SELECT-1-3         TO  SQLSTMT                     @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                    @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
           INITIALIZE  SQLSTMT3-ARR                                     @3212SEION@@
           MOVE  1                      TO  SQLSTMT3-LEN                @3212SEION@@
           STRING  SQL-SELECT-1-3                                       @3212SEION@@
                   DELIMITED BY SIZE                                    @3212SEION@@
                   INTO  SQLSTMT3-ARR                                   @3212SEION@@
                   WITH  POINTER  SQLSTMT3-LEN                          @3212SEION@@
           END-STRING                                                   @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT3-ARR=["SQLSTMT3-ARR"]"          @3212SEION@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMXXX00-CR-1-3-FLG=["               @3212SEINO@@
      D             WK-TKMXXX00-CR-1-3-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEION@@
           IF  WK-TKMXXX00-CR-1-3-FLG  =  CNS-OFF                       @3212SEION@@
           THEN                                                         @3212SEION@@
             EXEC SQL                                                   @3212SEION@@
                 PREPARE S3 FROM :SQLSTMT3                              @3212SEION@@
             END-EXEC                                                   @3212SEION@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE  =  CNS-SQL-NORMAL
             THEN
               CONTINUE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS1
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
           CONTINUE.
       TRHK-TBL-PREP-EXT.
           EXIT.
      ******************************************************************
      *    取引テーブル(計算From日再処理)CURSOR OPEN
      ******************************************************************
       TRHK-TBL-OPEN-RTN      SECTION.
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMXXX00-CR-1-3-FLG=["               @3212SEINO@@
      D             WK-TKMXXX00-CR-1-3-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-TKMXXX00-CR-1-3-FLG  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
                 DECLARE  TKMXXX00_CURSOR  CURSOR  FOR S3               @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  カーソルオープン処理
           EXEC  SQL
               OPEN TKMXXX00_CURSOR
           USING  :H-TKMXXX00-S.H-RIYO-CMP-CD,
                  :H-TKMXXX00-S.H-FUND-CD,
                  :H-TKMXXX00-S.H-PTF-CD,
                  :H-TKMXXX00-S.H-FUND-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON              TO  WK-TKMXXX00-CR-1-3-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TKMXXX00-CR-1-3-FLG=["
      D             WK-TKMXXX00-CR-1-3-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS1
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           CONTINUE.
       TRHK-TBL-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    取引テーブル(計算From日再処理)CURSOR FETCH1
      ******************************************************************
       TRHK-TBL-FETCH1-RTN    SECTION.
      *----------  カーソルフェッチ処理
           INITIALIZE                   H-TKMXXX00
           EXEC  SQL
               FETCH
                    TKMXXX00_CURSOR
               INTO :H-TKMXXX00.H-FROM-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FROM日=["
      D             H-FROM-YMD         OF  H-TKMXXX00"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  正常
               MOVE  H-FROM-YMD         OF  H-TKMXXX00
                 TO  WK-CALC-FROM       OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引CURSOR FETCH NOTFOUNDの場合"
      *-----------------------------------------------------------------
               MOVE  CNS-CALC-FROM
                 TO  WK-CALC-FROM       OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS1
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           CONTINUE.
       TRHK-TBL-FETCH1-EXT.
           EXIT.
      ******************************************************************
      *    取引テーブル(計算From日再処理)CURSOR FETCH2
      ******************************************************************
       TRHK-TBL-FETCH2-RTN    SECTION.
      *----------  カーソルフェッチ処理
           INITIALIZE                   H-TKMXXX00
           EXEC  SQL
               FETCH
                    TKMXXX00_CURSOR
               INTO :H-TKMXXX00.H-FROM-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FROM日=["
      D             H-FROM-YMD          OF  H-TKMXXX00"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *----------  ワーク計算期間パッケージ.実計算From日(開始断面なし用)
               MOVE  H-FROM-YMD         OF  H-TKMXXX00
                 TO  WK-JITSU-CALC-FROM
                 OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":ワーク計算期間パッケージ.実計算From日(開始断面なし用)=["
      D             WK-JITSU-CALC-FROM  OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引CURSOR FETCH NOTFOUNDの場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS1
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           CONTINUE.
       TRHK-TBL-FETCH2-EXT.
           EXIT.
      ******************************************************************@3212SEION@@
      *    取引テーブル(計算From日再処理)CURSOR CLOSE                   @3212SEION@@
      ******************************************************************@3212SEION@@
      *TRHK-TBL-CLOSE-RTN     SECTION.                                  @3212SEION@@
      *    EXEC  SQL                                                    @3212SEION@@
      *        CLOSE TKMXXX00_CURSOR                                    @3212SEION@@
      *    END-EXEC                                                     @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":取引SQLCODE-CLOSE=["SQLCODE"]"          @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *    IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEION@@
      *    THEN                                                         @3212SEION@@
      *      MOVE  CNS-OFF              TO  WK-TKMXXX00-CR-1-3-FLG      @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":WK-TKMXXX00-CR-1-3-FLG=["               @3212SEION@@
      *             WK-TKMXXX00-CR-1-3-FLG"]"                           @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *    ELSE                                                         @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":取引SQL処理エラー（CLOSE)"              @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *----------  エラー検知プログラム名                               @3212SEION@@
      *      MOVE  CNS-PGM-ID                                           @3212SEION@@
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  ポジション                                           @3212SEION@@
      *      MOVE  WK-ERR-POS1                                          @3212SEION@@
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  リターンコード                                       @3212SEION@@
      *      MOVE  CNS-RTN-900                                          @3212SEION@@
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  詳細リターンコード                                   @3212SEION@@
      *      MOVE  SQLCODE                                              @3212SEION@@
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEION@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEION@@
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *---------- フリーメッセージ                                      @3212SEION@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEION@@
      *              WK-MSG-1-3         DELIMITED  BY  SIZE             @3212SEION@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *--------------------<DEBUG>--------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEION@@
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEION@@
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEION@@
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEION@@
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEION@@
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEION@@
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *      PERFORM  ERR-RTN                                           @3212SEION@@
      *    END-IF                                                       @3212SEION@@
      *    CONTINUE.                                                    @3212SEION@@
      *TRHK-TBL-CLOSE-EXT.                                              @3212SEION@@
      *    EXIT.                                                        @3212SEION@@
      ******************************************************************
      *    3.2.1.2期間決める処理
      ******************************************************************
       KKN-DEC-DISP-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日 =["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.指定To日                       =["
      D             WK-SITEI-TO         OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           IF  WK-CALC-FROM             OF  WK-CALC-KKN-PACKAGE
            >  WK-SITEI-TO              OF  WK-DATA-IN
           THEN
             MOVE  WK-SITEI-TO          OF  WK-DATA-IN
               TO  WK-CALC-FROM         OF  WK-CALC-KKN-PACKAGE
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日 =["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.期間処理方法=["
      D             WK-KKN-HS           OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
           IF  WK-KKN-HS                OF  WK-CALC-KKN-PACKAGE =
             CNS-CHAR-1
           THEN
      *----------  ①ワーク計算期間パッケージ.期間処理方法＝'1'(全期間－強制)
      *----------  ワーク計算期間パッケージ.差分計算Start日
             MOVE  CNS-0
               TO  WK-SABON-CALC-FROM   OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.差分計算End日
             MOVE  CNS-0
               TO  WK-SABON-CALC-TO     OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.強制計算Start日
             MOVE  WK-CALC-FROM         OF  WK-CALC-KKN-PACKAGE
               TO  WK-KYOSE-CALC-FROM   OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.強制計算End日
             MOVE  WK-SITEI-TO          OF  WK-DATA-IN
               TO  WK-KYOSE-CALC-TO     OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.差分計算Start"
      D             "日=["WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.差分計算End"
      D             "日=["WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.強制計算Start"
      D             "日=["WK-KYOSE-CALC-FROM  OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.強制計算End日=["
      D             WK-KYOSE-CALC-TO    OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           INITIALIZE   PARM-SCZY4017-INOUT
                        PARM-SCZY4017-RTNPKG
      *----------  A)【SCZY4017】ポートフォリオ期間取得(復数)ルーチンに接続用パラメータの設定を行なう
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY4017-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  FUND-CD                OF  PARM-SCZY4017-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  PTF-CD                 OF  PARM-SCZY4017-ARG1
      *----------  基準日From
           MOVE  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE
             TO  KJN-YMD-FROM           OF  PARM-SCZY4017-ARG1
      *----------  基準日To
           MOVE  WK-SITEI-TO            OF  WK-DATA-IN
             TO  KJN-YMD-TO             OF  PARM-SCZY4017-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY4017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY4017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日From=["
      D             KJN-YMD-FROM        OF  PARM-SCZY4017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日To=["
      D             KJN-YMD-TO          OF  PARM-SCZY4017-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラーポジション
           MOVE  CNS-POS-015            TO  WK-ERR-POS5
      *----------  B)【SCZY4017】ポートフォリオ期間取得(復数)ルーチンをコールして、リターンパッケージを取得する
           PERFORM  CALL-SCZY4017-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4017の戻り値パッケージ.期間数=["
      D             KKN-SU              OF  PARM-SCZY4017-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日 =["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":SCZY4017の戻り値パッケージ.期間数(1).期間From =["
      D             KKN-FROM            OF  KKN-AREA
      D                                OF  PARM-SCZY4017-ARG2(CNS-1)"]"
      *-----------------------------------------------------------------
           IF  WK-CALC-FROM  OF  WK-CALC-KKN-PACKAGE = CNS-CALC-FROM
           AND KKN-FROM      OF  KKN-AREA
                             OF  PARM-SCZY4017-ARG2(CNS-1)
                             >   CNS-CALC-FROM
           THEN
             MOVE  KKN-FROM             OF  KKN-AREA
                                        OF  PARM-SCZY4017-ARG2(CNS-1)
               TO  WK-CALC-FROM         OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日 =["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  ワークポートフォリオ情報パッケージ.期間数
           MOVE  KKN-SU                 OF  PARM-SCZY4017-ARG2
             TO  WK-KKN-SU              OF  WK-PTF-INFO-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワークポートフォリオ情報パッケージ.期間数=["
      D             WK-KKN-SU           OF  WK-PTF-INFO-PACKAGE"]"
      *-----------------------------------------------------------------
      *----------  計算用
           MOVE  CNS-1                  TO  WK-IDX2
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KKN-DEC-DISP-RTN]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  CALC-KKN-ARE-RTN    UNTIL  WK-IDX2  >
             KKN-SU  OF  PARM-SCZY4017-ARG2
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KKN-DEC-DISP-RTN]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  ポートフォリオ履歴判断
           IF  WK-KKN-HS  OF  WK-CALC-KKN-PACKAGE = CNS-CHAR-2
           THEN
      *----------  ポートフォリオ変更フラグ判定
             PERFORM  PTF-CHAG-FLG-JUD-RTN
      *----------  ポートフォリオ訂正フラグ判定
             PERFORM  PTF-CORT-FLG-JUD-RTN
      *----------  期間編集
             PERFORM  KKN-EDIT-RTN
           ELSE
               CONTINUE
           END-IF
           CONTINUE.
       KKN-DEC-DISP-EXT.
           EXIT.
      ******************************************************************
      *    ポートフォリオ変更フラグ判定
      ******************************************************************
       PTF-CHAG-FLG-JUD-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ変更フラグ判定  START  ***"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間数=["
      D             WK-KKN-SU            OF  WK-PTF-INFO-PACKAGE"]"
      *-----------------------------------------------------------------
           IF  WK-KKN-SU                 OF  WK-PTF-INFO-PACKAGE = CNS-1
           THEN
      *----------  ワークポートフォリオ情報パッケージ.期間数＝1の場合
             MOVE  CNS-CHAR-0
               TO  WK-PTF-UPD-FLG        OF  WK-CALC-KKN-PACKAGE
           ELSE
             IF  WK-KKN-SU               OF  WK-PTF-INFO-PACKAGE > CNS-1
             THEN
      *----------  ワークポートフォリオ情報パッケージ.期間数＞1の場合
               MOVE  CNS-CHAR-1
                 TO  WK-PTF-UPD-FLG      OF  WK-CALC-KKN-PACKAGE
             ELSE
               CONTINUE
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.ポートフォリ"
      D             "オ変更フラグ=["
      D             WK-PTF-UPD-FLG       OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ変更フラグ判定  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-CHAG-FLG-JUD-EXT.
           EXIT.
      ******************************************************************
      *    期間エリア処理を繰り返す
      ******************************************************************
       CALC-KKN-ARE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  期間エリア処理を繰り返す  START  ***"
      *-----------------------------------------------------------------
      *----------  ワークポートフォリオ情報パッケージ.期間数(IDX2).期間From
           MOVE  KKN-FROM               OF  KKN-AREA
             OF  PARM-SCZY4017-ARG2(WK-IDX2)
             TO  WK-KKN1-FROM-YMD       OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX2)
      *----------  ワークポートフォリオ情報パッケージ.期間数(IDX2).期間To
           MOVE  KKN-TO                 OF  KKN-AREA
             OF  PARM-SCZY4017-ARG2(WK-IDX2)
             TO  WK-KKN1-TO-YMD         OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間数(IDX2).期間From=["
      D             WK-KKN1-FROM-YMD    OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間数(IDX2).期間TO=["
      D             WK-KKN1-TO-YMD      OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX2)"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX2 = ["WK-IDX2"]"
      *-----------------------------------------------------------------
           IF  WK-IDX2 = CNS-1
           THEN
      *----------  IDX2＝1の場合
             MOVE  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE
               TO  WK-KKN2-FROM-YMD       OF  WK-KKN-ARE
               OF  WK-PTF-INFO-PACKAGE(WK-IDX2)
           ELSE
             IF  WK-IDX2 > CNS-1
             THEN
      *----------  IDX2＞1の場合
               MOVE  KKN-FROM           OF  KKN-AREA
                 OF  PARM-SCZY4017-ARG2(WK-IDX2)
                 TO  WK-KKN2-FROM-YMD   OF  WK-KKN-ARE
                 OF  WK-PTF-INFO-PACKAGE(WK-IDX2)
             ELSE
               CONTINUE
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間数(IDX2).期間From２=["
      D             WK-KKN2-FROM-YMD    OF  WK-KKN-ARE
      D                            OF  WK-PTF-INFO-PACKAGE(WK-IDX2)"]"
      *-----------------------------------------------------------------
           IF  WK-IDX2 = KKN-SU         OF  PARM-SCZY4017-ARG2
           THEN
      *----------  IDX2＝SCZY4017の戻り値パッケージ.期間数の場合
             MOVE  WK-SITEI-TO          OF  WK-DATA-IN
               TO  WK-KKN2-TO-YMD       OF  WK-KKN-ARE
               OF  WK-PTF-INFO-PACKAGE(WK-IDX2)
           ELSE
             IF  WK-IDX2 < KKN-SU       OF  PARM-SCZY4017-ARG2
             THEN
      *----------  IDX2＜SCZY4017の戻り値パッケージ.期間数の場合
               MOVE  KKN-TO             OF  KKN-AREA
                 OF  PARM-SCZY4017-ARG2(WK-IDX2)
                 TO  WK-KKN2-TO-YMD     OF  WK-KKN-ARE
                 OF  WK-PTF-INFO-PACKAGE(WK-IDX2)
             ELSE
               CONTINUE
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間数(IDX2).期間TO２=["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX2)"]"
      *-----------------------------------------------------------------
           COMPUTE   WK-IDX2 = WK-IDX2 + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  期間エリア処理を繰り返す  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-KKN-ARE-EXT.
           EXIT.
      ******************************************************************
      *    ポートフォリオ訂正フラグ判定
      ******************************************************************
       PTF-CORT-FLG-JUD-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ訂正フラグ判定  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SCZY4007-INOUT
                        PARM-SCZY4007-RTNPKG
      *----------  【SCZY4007】パラメータの設定
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY4007-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  FUND-CD                OF  PARM-SCZY4007-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
             OF  WK-DATA-IN
             TO  PTF-CD                 OF  PARM-SCZY4007-ARG1
      *----------  適用開始日
           MOVE  WK-KKN1-FROM-YMD       OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(1)
             TO  TEKIYO-FROM            OF  PARM-SCZY4007-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["
      D             RIYO-CMP-CD         OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["
      D             FUND-CD             OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日          =["
      D             TEKIYO-FROM         OF  PARM-SCZY4007-ARG1"]"
      *-----------------------------------------------------------------
      *----------  【SCZY4007】ポートフォリオ期間取得
           MOVE  CNS-POS-016            TO  WK-ERR-POS1
           MOVE  CNS-POS-017            TO  WK-ERR-POS2
           PERFORM  CALL-SCZY4007-RTN
      *----------   ワーク計算期間パッケージ.ポートフォリオ訂正フラグ
           MOVE  CNS-CHAR-0
             TO  WK-PTF-TEISEI-FLG      OF  WK-CALC-KKN-PACKAGE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ."
      D             "ポートフォリオ訂正フラグ=["
      D             WK-PTF-TEISEI-FLG   OF   WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
      *----------  基準日計算情報を取得する
      *----------  基準日計算情報TBL
           MOVE  WK-TBL-TKMZKK00
             TO  SQL-TKMZKK00           OF  SQL-SELECT-1-4,
                 WK-TKMZKK00            OF  WK-MSG-1-4
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKMZKK00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-4
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKMZKK00-S,
                 WK-FUND-CD             OF  WK-MSG-1-4
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKMZKK00-S,
                 WK-PTF-CD              OF  WK-MSG-1-4
      *----------  期間From
           MOVE  WK-KKN1-FROM-YMD       OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(1)
             TO  H-KKN1-FROM-YMD        OF  H-TKMZKK00-S,
                 WK-KKN1-FROM-YMD       OF  WK-MSG-1-4
      *----------  期間TO
           MOVE  WK-KKN1-TO-YMD         OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(1)
             TO  H-KKN1-TO-YMD          OF  H-TKMZKK00-S,
                 WK-KKN1-TO-YMD         OF  WK-MSG-1-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-4=["SQL-SELECT-1-4"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD        OF  H-TKMZKK00-S=["
      D             H-RIYO-CMP-CD       OF  H-TKMZKK00-S"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD            OF  H-TKMZKK00-S=["
      D             H-FUND-CD           OF  H-TKMZKK00-S"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD             OF  H-TKMZKK00-S=["
      D             H-PTF-CD            OF  H-TKMZKK00-S"]"
      D    DISPLAY  CNS-PGM-ID":H-KKN1-FROM-YMD      OF  H-TKMZKK00-S=["
      D             H-KKN1-FROM-YMD     OF  H-TKMZKK00-S"]"
      D    DISPLAY  CNS-PGM-ID":H-KKN1-TO-YMD        OF  H-TKMZKK00-S=["
      D             H-KKN1-TO-YMD       OF  H-TKMZKK00-S"]"
      *-----------------------------------------------------------------@3212SEINO@@
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
      *    MOVE  SQL-SELECT-1-4         TO  SQLSTMT                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT4-ARR                                     @3212SEINO@@
           MOVE  1                      TO  SQLSTMT4-LEN                @3212SEINO@@
           STRING  SQL-SELECT-1-4                                       @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT4-ARR                                   @3212SEINO@@
                   WITH  POINTER  SQLSTMT4-LEN                          @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT4-ARR=["SQLSTMT4-ARR"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKK00-CR-1-4-FLG=["               @3212SEINO@@
      D             WK-TKMZKK00-CR-1-4-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-TKMZKK00-CR-1-4-FLG  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC SQL                                                   @3212SEINO@@
                 PREPARE S4 FROM :SQLSTMT4                              @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-018
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-4       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
             EXEC SQL DECLARE  TKMZKK00_CURSOR  CURSOR  FOR S4 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  カーソルオープン処理
           EXEC  SQL
               OPEN TKMZKK00_CURSOR
           USING  :H-TKMZKK00-S.H-RIYO-CMP-CD,
                  :H-TKMZKK00-S.H-FUND-CD,
                  :H-TKMZKK00-S.H-PTF-CD,
                  :H-TKMZKK00-S.H-KKN1-FROM-YMD,
                  :H-TKMZKK00-S.H-KKN1-TO-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
      *----------  基準日計算情報データカーソルオープンフラグ
             MOVE  CNS-ON               TO  WK-TKMZKK00-CR-1-4-FLG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":基準日計算情報データカーソルオープンフラグ =["
      D             WK-TKMZKK00-CR-1-4-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-019
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *----------  カーソルフェッチ処理
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [PTF-CORT-FLG-JUD-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM   SQL-1-4-FETCH-RTN  UNTIL WK-PTF-TEISEI-FLG
                         OF   WK-CALC-KKN-PACKAGE = CNS-CHAR-1 OR
                     WK-1-4-FETCH-FLG = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [PTF-CORT-FLG-JUD-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *    EXEC  SQL                                                    @3212SEINO@@
      *      CLOSE TKMZKK00_CURSOR                                      @3212SEINO@@
      *    END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY CNS-PGM-ID                                           @3212SEINO@@
      *            ":基準日計算情報TBL CURSOR CLOSE SQLCODE=["SQLCODE"]"@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEINO@@
      *    THEN                                                         @3212SEINO@@
      *----------  基準日計算情報データカーソルオープンフラグに         @3212SEINO@@
      *      MOVE  CNS-OFF              TO  WK-TKMZKK00-CR-1-4-FLG      @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID                                          @3212SEINO@@
      *             ":基準日計算情報データカーソルオープンフラグに=["   @3212SEINO@@
      *             WK-TKMZKK00-CR-1-4-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    ELSE                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *      MOVE  CNS-PGM-ID                                           @3212SEINO@@
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *      MOVE  CNS-POS-020                                          @3212SEINO@@
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *      MOVE  CNS-RTN-900                                          @3212SEINO@@
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *      MOVE  SQLCODE                                              @3212SEINO@@
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *      MOVE  WK-MSG-1-4                                           @3212SEINO@@
      *        TO  FREE-MSG             OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
      *      PERFORM  ERR-RTN                                           @3212SEINO@@
      *    END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ訂正フラグ判定  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-CORT-FLG-JUD-EXT.
           EXIT.
      ******************************************************************
      *     SQL1-4 FETCH処理
      ******************************************************************
       SQL-1-4-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL1-4 FETCH処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZKK00
           EXEC  SQL
               FETCH
                    TKMZKK00_CURSOR
               INTO :H-TKMZKK00.H-SWK-KJN-PTN-CD,
                    :H-TKMZKK00.H-IDO-CALC-PATTERN-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":仕訳基準パターンコード =["
      D             H-SWK-KJN-PTN-CD           OF  H-TKMZKK00"]"
      D    DISPLAY  CNS-PGM-ID":異動計算パターンコード =["
      D             H-IDO-CALC-PATTERN-CD      OF  H-TKMZKK00"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得データ.仕訳計算パターンコード=["
      D             H-SWK-KJN-PTN-CD         OF  H-TKMZKK00"]"
      D    DISPLAY  CNS-PGM-ID":取得データ.異動計算パターンコード=["
      D             H-IDO-CALC-PATTERN-CD    OF  H-TKMZKK00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":SCZY4007の戻り値.仕訳計算パターンコード    =["
      D             SWK-KJN-PTN-CD           OF  PARM-SCZY4007-ARG2"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":SCZY4007の戻り値.異動計算パターンコード    =["
      D             IDO-CALC-PATTERN-CD      OF  PARM-SCZY4007-ARG2"]"
      *-----------------------------------------------------------------
               IF  H-SWK-KJN-PTN-CD          OF  H-TKMZKK00 =
                   SWK-KJN-PTN-CD            OF  PARM-SCZY4007-ARG2  AND
                   H-IDO-CALC-PATTERN-CD     OF  H-TKMZKK00 =
                   IDO-CALC-PATTERN-CD       OF  PARM-SCZY4007-ARG2
               THEN
                 CONTINUE
               ELSE
      *----------  ワーク計算期間パッケージ.ポートフォリオ訂正フラグ
                 MOVE  CNS-CHAR-1
                   TO  WK-PTF-TEISEI-FLG
                   OF  WK-CALC-KKN-PACKAGE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ"
      D             "ポートフォリオ訂正フラグ=["
      D             WK-PTF-TEISEI-FLG   OF   WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                 MOVE  CNS-ON       TO  WK-1-4-FETCH-FLG
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日計算情報CUR FETCH NOTFOUND"
      *-----------------------------------------------------------------
               MOVE  CNS-ON         TO  WK-1-4-FETCH-FLG
             WHEN OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-021
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-SCZY4017-RTNPKG (
                                COUNTER OF  PARM-SCZY4017-RTNPKG )
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-4       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL1-4 FETCH処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SQL-1-4-FETCH-EXT.
           EXIT.
      ******************************************************************
      *     期間編集
      ******************************************************************
       KKN-EDIT-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  期間編集  START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ."
      D             "ポートフォリオ変更フラグ=["
      D             WK-PTF-UPD-FLG      OF   WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ."
      D             "ポートフォリオ訂正フラグ=["
      D             WK-PTF-TEISEI-FLG   OF   WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
           IF  WK-PTF-UPD-FLG           OF   WK-CALC-KKN-PACKAGE =
                                             CNS-CHAR-0
           THEN
      *----------  ワーク計算期間パッケージ.ポートフォリオ変更フラグ='0'
             IF  WK-PTF-TEISEI-FLG      OF  WK-CALC-KKN-PACKAGE =
               CNS-CHAR-0
             THEN
      *----------  ワーク計算期間パッケージ.ポートフォリオ訂正フラグ='0'
      *----------  差分計算Start日
               MOVE  WK-CALC-FROM       OF  WK-CALC-KKN-PACKAGE
                 TO  WK-SABON-CALC-FROM OF  WK-CALC-KKN-PACKAGE
      *----------  差分計算End日
               MOVE  WK-SITEI-TO        OF  WK-DATA-IN
                 TO  WK-SABON-CALC-TO   OF  WK-CALC-KKN-PACKAGE
      *----------  強制計算Start日
               MOVE  CNS-0
                 TO  WK-KYOSE-CALC-FROM OF  WK-CALC-KKN-PACKAGE
      *----------  強制計算End日
               MOVE  CNS-0
                 TO  WK-KYOSE-CALC-TO   OF  WK-CALC-KKN-PACKAGE
             ELSE
               IF  WK-PTF-TEISEI-FLG    OF  WK-CALC-KKN-PACKAGE =
                 CNS-CHAR-1
               THEN
      *----------  ワーク計算期間パッケージ.ポートフォリオ訂正フラグ='1'
      *----------  差分計算Start日
                 MOVE  CNS-0
                   TO  WK-SABON-CALC-FROM
                   OF  WK-CALC-KKN-PACKAGE
      *----------  差分計算End日
                 MOVE  CNS-0
                   TO  WK-SABON-CALC-TO OF  WK-CALC-KKN-PACKAGE
      *----------  強制計算Start日
                 MOVE  WK-CALC-FROM     OF  WK-CALC-KKN-PACKAGE
                   TO  WK-KYOSE-CALC-FROM
                   OF  WK-CALC-KKN-PACKAGE
      *----------  強制計算End日
                 MOVE  WK-SITEI-TO      OF  WK-DATA-IN
                   TO  WK-KYOSE-CALC-TO OF  WK-CALC-KKN-PACKAGE
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             IF  WK-PTF-UPD-FLG         OF   WK-CALC-KKN-PACKAGE =
               CNS-CHAR-1
             THEN
      *----------  ワーク計算期間パッケージ.ポートフォリオ変更フラグ='1'
               IF  WK-PTF-TEISEI-FLG    OF  WK-CALC-KKN-PACKAGE =
                 CNS-CHAR-0
               THEN
      *----------  ワーク計算期間パッケージ.ポートフォリオ訂正フラグ='0'
      *----------  差分計算Start日
                 MOVE  WK-CALC-FROM     OF  WK-CALC-KKN-PACKAGE
                   TO  WK-SABON-CALC-FROM
                   OF  WK-CALC-KKN-PACKAGE
      *----------  差分計算End日
                 MOVE  WK-KKN1-TO-YMD   OF  WK-KKN-ARE
                   OF  WK-PTF-INFO-PACKAGE(1)
                   TO  WK-SABON-CALC-TO
                   OF  WK-CALC-KKN-PACKAGE
      *----------  カレンダールーチン【SCZY1020】コールし、翌日を取得
                 INITIALIZE   PARM-SCZY1020-INOUT
                              PARM-SCZY1020-RTNPKG
      *----------  【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
                 MOVE  WK-KKN1-TO-YMD   OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(1)
                   TO  IXCAL-KJN-YMD1   OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
                 MOVE  CNS-1
                   TO  IXCAL-COMP-BASE  OF  PARM-SCZY1020-ARG1
      *----------  日数
                 MOVE  CNS-1
                   TO  IXCAL-DAYS       OF  PARM-SCZY1020-ARG1
      *----------  単位区分
                 MOVE  CNS-1
                   TO  IXCAL-TANI-KBN   OF  PARM-SCZY1020-ARG1
      *----------  機能区分
                 MOVE  CNS-3
                   TO  IXCAL-FUNCTION   OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
                 MOVE  CNS-1
                   TO  IXCAL-ZENGO-KBN-1
                   OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数                        =["
      D             IXCAL-DAYS          OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  CALL【SCZY1020】
                 MOVE  CNS-POS-022      TO  WK-ERR-POS4
                 PERFORM  CALL-SCZY1020-RTN
      *----------  翌日を取得
                 MOVE  IXCAL-KJN-YMD2   OF  PARM-SCZY1020-ARG1
                   TO  WK-TODAY-YMD
      *----------  強制計算Start日
                 MOVE  WK-TODAY-YMD
                   TO  WK-KYOSE-CALC-FROM
                   OF  WK-CALC-KKN-PACKAGE
      *----------  強制計算End日
                 MOVE  WK-SITEI-TO      OF  WK-DATA-IN
                   TO  WK-KYOSE-CALC-TO OF  WK-CALC-KKN-PACKAGE
               ELSE
                 IF    WK-PTF-TEISEI-FLG
                                        OF  WK-CALC-KKN-PACKAGE
                       = CNS-CHAR-1
                 THEN
      *----------  ワーク計算期間パッケージ.ポートフォリオ訂正フラグ='1'
      *----------  差分計算Start日
                   MOVE  CNS-0
                     TO  WK-SABON-CALC-FROM
                     OF  WK-CALC-KKN-PACKAGE
      *----------  差分計算End日
                   MOVE  CNS-0
                     TO  WK-SABON-CALC-TO
                     OF  WK-CALC-KKN-PACKAGE
      *----------  強制計算Start日
                   MOVE  WK-CALC-FROM   OF  WK-CALC-KKN-PACKAGE
                     TO  WK-KYOSE-CALC-FROM
                     OF  WK-CALC-KKN-PACKAGE
      *----------  強制計算End日
                   MOVE  WK-SITEI-TO    OF  WK-DATA-IN
                     TO  WK-KYOSE-CALC-TO
                     OF  WK-CALC-KKN-PACKAGE
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
             ELSE
               CONTINUE
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":差分計算Start日=["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":差分計算End日=["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":強制計算Start日=["
      D             WK-KYOSE-CALC-FROM  OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":強制計算End日=["
      D             WK-KYOSE-CALC-TO    OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":***  期間編集  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KKN-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2対象断面算出
      ******************************************************************
       OBJ-DMN-YMD-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象断面算出  START  ***"
      D    DISPLAY  CNS-PGM-ID"断面期間FROM～断面期間TOの月数のチェック"20110906
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["  20110906
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE"]"      20110906
      D    DISPLAY  CNS-PGM-ID":ARG1.指定To日=["                        20110906
      D             SITEI-TO            OF  PARM-SMZJ1210-ARG1"]"       20110906
      *-----------------------------------------------------------------
      *----------  ワーク断面期間FROM ←                                20110906
      *----------  ワーク計算期間パッケージ.計算From日                  20110906
           MOVE  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE         20110906
             TO  WK-DMN-KKN-FROM                                        20110906
      *----------  ワーク断面期間TO ← ARG1.指定To日                    20110906
           MOVE  SITEI-TO               OF  PARM-SMZJ1210-ARG1          20110906
             TO  WK-DMN-KKN-TO                                          20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID":ワーク断面期間FROM=["WK-DMN-KKN-FROM"]" 20110906
      D    DISPLAY  CNS-PGM-ID":ワーク断面期間TO=["WK-DMN-KKN-TO"]"     20110906
      *-----------------------------------------------------------------20110906
      *----------  断面期間FROM～断面期間TOの月数のチェック             20110906
           PERFORM  SCZY1020-YUE-RTN                                    20110906
      *----------  計算用
           MOVE  CNS-1                  TO  WK-IDX
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX=["WK-IDX"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": ワークポートフォリオ情報パッケージ.期間数=["
      D             WK-KKN-SU           OF  WK-PTF-INFO-PACKAGE"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OBJ-DMN-YMD-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  OBJ-DMN-ALL-RTN     UNTIL  WK-IDX >
             WK-KKN-SU  OF  WK-PTF-INFO-PACKAGE
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OBJ-DMN-YMD-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 対象断面算出 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       OBJ-DMN-YMD-EXT.
           EXIT.
      ******************************************************************20110906
      *    CALL 【SCZY1020】(断面期間FROM～断面期間TOの月数)            20110906
      ******************************************************************20110906
       SCZY1020-YUE-RTN       SECTION.                                  20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID ":***  CALL【SCZY1020】"                 20110906
      D             "(断面期間FROM～断面期間TOの月数) START ***"        20110906
      *-----------------------------------------------------------------20110906
           INITIALIZE   PARM-SCZY1020-INOUT                             20110906
                        PARM-SCZY1020-RTNPKG                            20110906
      *----------  【SCZY1020】に接続用パラメータの設定を行なう         20110906
      *----------  機能区分                                             20110906
           MOVE  CNS-2                                                  20110906
             TO  IXCAL-FUNCTION        OF  PARM-SCZY1020-ARG1           20110906
      *----------  基準年月日１                                         20110906
           MOVE  WK-DMN-KKN-FROM                                        20110906
             TO  IXCAL-KJN-YMD1        OF  PARM-SCZY1020-ARG1           20110906
      *----------  計算ベース区分                                       20110906
           MOVE  CNS-1                                                  20110906
             TO  IXCAL-COMP-BASE       OF  PARM-SCZY1020-ARG1           20110906
      *----------  前後区分1                                            20110906
           MOVE  SPACE                                                  20110906
             TO  IXCAL-ZENGO-KBN-1     OF  PARM-SCZY1020-ARG1           20110906
      *----------  前後区分2                                            20110906
           MOVE  CNS-1                                                  20110906
             TO  IXCAL-ZENGO-KBN-2     OF  PARM-SCZY1020-ARG1           20110906
      *----------  単位区分                                             20110906
           MOVE  CNS-2                                                  20110906
             TO  IXCAL-TANI-KBN        OF  PARM-SCZY1020-ARG1           20110906
      *----------  日数                                                 20110906
           MOVE  ZERO                                                   20110906
             TO  IXCAL-DAYS            OF  PARM-SCZY1020-ARG1           20110906
      *----------  基準年月日2                                          20110906
           MOVE  WK-DMN-KKN-TO                                          20110906
             TO  IXCAL-KJN-YMD2        OF  PARM-SCZY1020-ARG1           20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["        20110906
      D             IXCAL-FUNCTION     OF  PARM-SCZY1020-ARG1"]"        20110906
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["        20110906
      D             IXCAL-KJN-YMD1     OF  PARM-SCZY1020-ARG1"]"        20110906
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["        20110906
      D             IXCAL-COMP-BASE    OF  PARM-SCZY1020-ARG1"]"        20110906
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["        20110906
      D             IXCAL-ZENGO-KBN-1  OF  PARM-SCZY1020-ARG1"]"        20110906
      D    DISPLAY  CNS-PGM-ID ":前後区分2                   =["        20110906
      D             IXCAL-ZENGO-KBN-2  OF  PARM-SCZY1020-ARG1"]"        20110906
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["        20110906
      D             IXCAL-TANI-KBN     OF  PARM-SCZY1020-ARG1"]"        20110906
      D    DISPLAY  CNS-PGM-ID ":日数                        =["        20110906
      D             IXCAL-DAYS         OF  PARM-SCZY1020-ARG1"]"        20110906
      D    DISPLAY  CNS-PGM-ID ":基準年月日2                 =["        20110906
      D             IXCAL-KJN-YMD2     OF  PARM-SCZY1020-ARG1"]"        20110906
      *-----------------------------------------------------------------20110906
      *----------  カレンダールーチン【SCZY1020】をコールして、リターンパッケージを取得する20110906
           MOVE  CNS-POS-076           TO  WK-ERR-POS4                  20110906
           PERFORM  CALL-SCZY1020-RTN                                   20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID":IXCAL-DAYS OF  PARM-SCZY1020-ARG1=["    20110906
      D             IXCAL-DAYS         OF  PARM-SCZY1020-ARG1"]"        20110906
      *-----------------------------------------------------------------20110906
      *----------  ワーク月数                                           20110906
           MOVE  IXCAL-DAYS            OF  PARM-SCZY1020-ARG1           20110906
             TO  WK-TSUKI-KAZU                                          20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID":ワーク月数=["WK-TSUKI-KAZU"]"           20110906
      D    DISPLAY  CNS-PGM-ID ":***  CALL【SCZY1020】"                 20110906
      D             "(断面期間FROM～断面期間TOの月数) END ***"          20110906
      D    DISPLAY  CNS-PGM-ID":***  断面期間FROM～断面期間TOの月数"    20110906
      D             "のチェック   START ***"                            20110906
      D    DISPLAY  CNS-PGM-ID":ワーク月数=["WK-TSUKI-KAZU"]"           20110906
      *-----------------------------------------------------------------20110906
           IF  WK-TSUKI-KAZU  <= CNS-13                                 20110906
           THEN                                                         20110906
             CONTINUE                                                   20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID":ワーク月数<=13 処理を続く"              20110906
      *-----------------------------------------------------------------20110906
           ELSE                                                         20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID":ワーク月数>13 チェックエラー"           20110906
      *-----------------------------------------------------------------20110906
      *----------  エラー検知プログラム名                               20110906
             MOVE  CNS-PGM-ID                                           20110906
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20110906
      *----------  ポジション                                           20110906
             MOVE  CNS-POS-077                                          20110906
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20110906
      *----------  リターンコード                                       20110906
             MOVE  CNS-RTN-100                                          20110906
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20110906
      *----------  詳細リターンコード                                   20110906
             MOVE  ZERO                                                 20110906
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20110906
      *----------  詳細リターンコードデコードフラグ                     20110906
             MOVE  SPACE                                                20110906
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20110906
      *---------- フリーメッセージ                                      20110906
             MOVE  SPACE                                                20110906
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1          20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         20110906
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20110906
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         20110906
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20110906
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         20110906
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20110906
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         20110906
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20110906
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         20110906
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20110906
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         20110906
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20110906
      *-----------------------------------------------------------------20110906
      *----------  エラー処理                                           20110906
             PERFORM  ERR-RTN                                           20110906
           END-IF                                                       20110906
      *-------------------<DEBUG>---------------------------------------20110906
      D    DISPLAY  CNS-PGM-ID":***  断面期間FROM～断面期間TOの月数"    20110906
      D             "のチェック   END ***"                              20110906
      *-----------------------------------------------------------------20110906
           CONTINUE.                                                    20110906
       SCZY1020-YUE-EXT.                                                20110906
           EXIT.                                                        20110906
      ******************************************************************
      *    対象断面算出LOOP
      ******************************************************************
       OBJ-DMN-ALL-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象断面算出LOOP  START  ***"
      D    DISPLAY  CNS-PGM-ID":IDX=["WK-IDX"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": ワークポートフォリオ情報パッケージ.期間数=["
      D             WK-KKN-SU           OF  WK-PTF-INFO-PACKAGE"]"
      *-----------------------------------------------------------------
      *----------  ポートフォリオ属性取得
           PERFORM  PTF-ATB-ACP-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ詳細パッケージ."
      D             "日次評価法フラグ=["
      D             WK-NITIJI-HYK-FLG   OF  WK-PTF-SHOSAI-PACKAGE"]"
      *-----------------------------------------------------------------
           IF  WK-NITIJI-HYK-FLG  OF  WK-PTF-SHOSAI-PACKAGE =
               CNS-CHAR-1
           THEN
      *----------  ワークポートフォリオ詳細パッケージ.日次評価法フラグ＝'1'(対象)の場合
             PERFORM  OBJ-CASE-RTN
           ELSE
             CONTINUE
           END-IF
           IF  WK-NITIJI-HYK-FLG  OF  WK-PTF-SHOSAI-PACKAGE =
               CNS-CHAR-0
           THEN
      *----------  ワークポートフォリオ詳細パッケージ.日次評価法フラグ＝'0'(対象外)の場合
             PERFORM  UNOBJ-CASE-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  ポートフォリオ変更日セット処理
           PERFORM  PTF-CHG-YMD-TRE-RTN
      *----------  決算日判定
           PERFORM  KESSANYMD-ONE-TR-RTN
      *----------  計算用(Loop)
           COMPUTE  WK-IDX = WK-IDX + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象断面算出LOOP  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       OBJ-DMN-ALL-EXT.
           EXIT.
      ******************************************************************
      *    ポートフォリオ属性取得
      ******************************************************************
       PTF-ATB-ACP-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ属性取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SCZY4007-INOUT
                        PARM-SCZY4007-RTNPKG
      *----------  【SCZY4007】パラメータの設定
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY4007-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  FUND-CD                OF  PARM-SCZY4007-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  PTF-CD                 OF  PARM-SCZY4007-ARG1
      *----------  適用開始日
           MOVE  WK-KKN1-FROM-YMD       OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
             TO  TEKIYO-FROM            OF  PARM-SCZY4007-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日=["
      D             TEKIYO-FROM         OF  PARM-SCZY4007-ARG1"]"
      *-----------------------------------------------------------------
      *----------  【SCZY4007】ポートフォリオ期間取得
           MOVE  CNS-POS-023            TO  WK-ERR-POS1
           MOVE  CNS-POS-024            TO  WK-ERR-POS2
           PERFORM  CALL-SCZY4007-RTN
      *----------  データセット
      *----------  初期化
           INITIALIZE       WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.日次評価法フラグ
           MOVE  NITIJI-HYK-FLG         OF  PARM-SCZY4007-ARG2
             TO  WK-NITIJI-HYK-FLG      OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.設定日
           MOVE  SET-YMD                OF  PARM-SCZY4007-ARG2
             TO  WK-SET-YMD             OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.解約日
           MOVE  CANCL-YMD              OF  PARM-SCZY4007-ARG2
             TO  WK-CANCL-YMD           OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.特別イベント日１
           MOVE  EVENT-YMD1             OF  PARM-SCZY4007-ARG2
             TO  WK-EVENT-YMD1          OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.特別イベント日２
           MOVE  EVENT-YMD2             OF  PARM-SCZY4007-ARG2
             TO  WK-EVENT-YMD2          OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.特別イベント日３
           MOVE  EVENT-YMD3             OF  PARM-SCZY4007-ARG2
             TO  WK-EVENT-YMD3          OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.決算回数
           MOVE  KESSAN-TIMES           OF  PARM-SCZY4007-ARG2
             TO  WK-KESSAN-TIMES        OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.本決算月日
           MOVE  HON-KESSAN-MMDD        OF  PARM-SCZY4007-ARG2
             TO  WK-HON-KESSAN-MMDD     OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.決算月日１
           MOVE  KESSAN-MMDD1           OF  PARM-SCZY4007-ARG2
             TO  WK-KESSAN-MMDD1        OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.決算月日２
           MOVE  KESSAN-MMDD2           OF  PARM-SCZY4007-ARG2
             TO  WK-KESSAN-MMDD2        OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.決算月日３
           MOVE  KESSAN-MMDD3           OF  PARM-SCZY4007-ARG2
             TO  WK-KESSAN-MMDD3        OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.決算月日４
           MOVE  KESSAN-MMDD4           OF  PARM-SCZY4007-ARG2
             TO  WK-KESSAN-MMDD4        OF  WK-PTF-SHOSAI-PACKAGE
      *----------  ワークポートフォリオ詳細パッケージ.決算休日処理区分
           MOVE  KESSAN-QJT-SYRI        OF  PARM-SCZY4007-ARG2
             TO  WK-KESSAN-QJT-SYRI     OF  WK-PTF-SHOSAI-PACKAGE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.日次評価法フラグ=["
      D             WK-NITIJI-HYK-FLG   OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.設定日=["
      D             WK-SET-YMD          OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.解約日=["
      D             WK-CANCL-YMD        OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.特別イベント日１=["
      D             WK-EVENT-YMD1       OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.特別イベント日２=["
      D             WK-EVENT-YMD2       OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.特別イベント日３=["
      D             WK-EVENT-YMD3       OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.決算回数=["
      D             WK-KESSAN-TIMES     OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.本決算月日=["
      D             WK-HON-KESSAN-MMDD  OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.決算月日１=["
      D             WK-KESSAN-MMDD1     OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.決算月日２=["
      D             WK-KESSAN-MMDD2     OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.決算月日３=["
      D             WK-KESSAN-MMDD3     OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.決算月日４=["
      D             WK-KESSAN-MMDD4     OF   WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ"
      D             "詳細パッケージ.決算休日処理区分=["
      D             WK-KESSAN-QJT-SYRI  OF   WK-PTF-SHOSAI-PACKAGE"]"
      *-----------------------------------------------------------------
      *----------  基本会計ベースフラグ編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY4007】の戻り値."
      D             "仕訳基準パターンコードの一つ桁目=["
      D             SWK-KJN-PTN-CD      OF  PARM-SCZY4007-ARG2(1:1)"]"
      *-----------------------------------------------------------------
           IF  SWK-KJN-PTN-CD     OF  PARM-SCZY4007-ARG2(1:1) = "T"
           THEN
      *----------  【SCZY4007】の戻り値.仕訳基準パターンコードの一つ桁目＝'T'の場合
             MOVE  CNS-CHAR-1
               TO  WK-KH-KAIKEI-BASE-FLG
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX)
           ELSE
             CONTINUE
           END-IF
           IF  SWK-KJN-PTN-CD     OF  PARM-SCZY4007-ARG2(1:1) = "S"
           THEN
      *----------  【SCZY4007】の戻り値.仕訳基準パターンコードの一つ桁目＝'S'の場合
             MOVE  CNS-CHAR-2
               TO  WK-KH-KAIKEI-BASE-FLG
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).基本会計ベースフラグ=["
      D             WK-KH-KAIKEI-BASE-FLG  OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
      *----------  他項目編集
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).異動計算パターンコード
           MOVE  IDO-CALC-PATTERN-CD     OF  PARM-SCZY4007-ARG2
             TO  WK-IDO-CALC-PATTERN-CD  OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).保有目的
           MOVE  POSSESSION-OBJECT       OF  PARM-SCZY4007-ARG2
             TO  WK-POSSESSION-OBJECT    OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).運用通貨コード
           MOVE  CAPITAL-TUKA-CD         OF  PARM-SCZY4007-ARG2
             TO  WK-CAPITAL-TUKA-CD      OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).仕訳基準パターンコード
           MOVE  SWK-KJN-PTN-CD          OF  PARM-SCZY4007-ARG2
             TO  WK-SWK-KJN-PTN-CD       OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).仕訳基準パターンコードの4桁目
           MOVE  SWK-KJN-PTN-CD          OF  PARM-SCZY4007-ARG2(4:1)
             TO  WK-ST-KJN-KBN           OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).日次評価法フラグ
           MOVE  NITIJI-HYK-FLG          OF  PARM-SCZY4007-ARG2
             TO  WK-NITIJI-HYK-FLG       OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).料率パターンコード
           MOVE  COMMISSION-PATTERN      OF  PARM-SCZY4007-ARG2
             TO  WK-COMMISSION-PATTERN   OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).約定主義会計フラグ
           MOVE  YKJ-SYUGI-KAIKEI        OF  PARM-SCZY4007-ARG2
             TO  WK-YKJ-SYUGI-KAIKEI     OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).キャッシュフロー２回発生区分
           MOVE  CASH-FLOW-KBN           OF  PARM-SCZY4007-ARG2
             TO  WK-CASH-FLOW-KBN        OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.期間エリア(IDX).約定レートコード
           MOVE  YKJ-RATE-CD             OF  PARM-SCZY4007-ARG2
             TO  WK-YKJ-RATE-CD          OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワークポートフォリオ情報パッケージ.未収配当計上割合
           MOVE  MISYU-HAITOU-WARIAI     OF  PARM-SCZY4007-ARG2
             TO  WK-MISYU-HAITOU-WARIAI  OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).異動計算パターンコード=["
      D             WK-IDO-CALC-PATTERN-CD OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).保有目的             =["
      D             WK-POSSESSION-OBJECT   OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).運用通貨コード       =["
      D             WK-CAPITAL-TUKA-CD     OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).仕訳基準パターンコード=["
      D             WK-SWK-KJN-PTN-CD    OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).測定基準区分          =["
      D             WK-ST-KJN-KBN        OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).日次評価法フラグ      =["
      D             WK-NITIJI-HYK-FLG    OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).料率パターンコード    =["
      D             WK-COMMISSION-PATTERN  OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).約定主義会計フラグ    =["
      D             WK-YKJ-SYUGI-KAIKEI  OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).キャッシュフロー２回発生区分=["
      D             WK-CASH-FLOW-KBN     OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).約定レートコード      =["
      D             WK-YKJ-RATE-CD       OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).未収配当計上割合      =["
      D             WK-MISYU-HAITOU-WARIAI OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ属性取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-ATB-ACP-EXT.
           EXIT.
      ******************************************************************
      *    対象の場合
      ******************************************************************
       OBJ-CASE-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象の場合  START  ***"
      *-----------------------------------------------------------------
      *----------  ①期間全データの対象化
      *----------  A)From日入れ
      *----------  ワーク基準日情報パッケージ.基準日数
           COMPUTE  WK-KJN-NISU         OF  WK-KJN-PACKAGE =
                    WK-KJN-NISU         OF  WK-KJN-PACKAGE + 1
      *----------  ワーク基準日情報パッケージ.基準日詳細(ワーク基準日情報パッケージ.基準日数).基準日
           MOVE  WK-KKN2-FROM-YMD       OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
             TO  WK-KJN-YMD             OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                 (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
      *----------  ワーク基準日情報パッケージ.基準日詳細(ワーク基準日情報パッケージ.基準日数).基準日種類
           MOVE  CNS-CHAR-0
             TO  WK-KJN-YMD-SHRU        OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                 (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細("
      D             "ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細("
      D             "ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
      *----------  B)真中日入れ
      *----------  ワーク日次用日付
           MOVE  WK-KKN2-FROM-YMD       OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
             TO  WK-NITIJIYOU-HIZUKE
             OF  WK-INSERT-DATA-PAKAGE(CNS-1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間From２=["WK-KKN2-FROM-YMD
      D             OF  WK-KKN-ARE    OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク日次用日付=["
      D    WK-NITIJIYOU-HIZUKE  OF  WK-INSERT-DATA-PAKAGE(CNS-1)"]"
      *-----------------------------------------------------------------
      *----------  あ)カレンダールーチン【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
           MOVE  WK-NITIJIYOU-HIZUKE
             OF  WK-INSERT-DATA-PAKAGE(CNS-1)
             TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
           MOVE  CNS-1
             TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *----------  日数
           MOVE  CNS-1
             TO  IXCAL-DAYS             OF  PARM-SCZY1020-ARG1
      *----------  単位区分
           MOVE  CNS-1
             TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *----------  機能区分
           MOVE  CNS-3
             TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
           MOVE  CNS-1
             TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数                        =["
      D             IXCAL-DAYS          OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  カレンダールーチン【SCZY1020】をコールして、リターンパッケージを取得する
           MOVE  CNS-POS-025            TO  WK-ERR-POS4
           PERFORM  CALL-SCZY1020-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY1020の基準年月日２=["
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  ワーク日次用日付
           MOVE  IXCAL-KJN-YMD2         OF  PARM-SCZY1020-ARG1
             TO  WK-NITIJIYOU-HIZUKE
             OF  WK-INSERT-DATA-PAKAGE(CNS-1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク日次用日付=["
      D    WK-NITIJIYOU-HIZUKE  OF  WK-INSERT-DATA-PAKAGE(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID ":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２    =["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D                               OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OBJ-CASE-RTN]"                GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM UNTIL WK-NITIJIYOU-HIZUKE
                      OF WK-INSERT-DATA-PAKAGE(CNS-1) >=
             WK-KKN2-TO-YMD OF WK-KKN-ARE OF WK-PTF-INFO-PACKAGE(WK-IDX)
      *----------  ワーク基準日情報パッケージ.基準日数
             COMPUTE  WK-KJN-NISU       OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU       OF  WK-KJN-PACKAGE + 1
      *----------  ワーク基準日情報パッケージ.基準日詳細(ワーク基準日情報パッケージ.基準日数).基準日
             MOVE  WK-NITIJIYOU-HIZUKE
               OF  WK-INSERT-DATA-PAKAGE(CNS-1)
               TO  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
      *----------  ワーク基準日情報パッケージ.基準日詳細(ワーク基準日情報パッケージ.基準日数).基準日種類
             MOVE  CNS-CHAR-0
               TO  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細("
      D             "ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細("
      D             "ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
      *----------  Ⅰ)カレンダールーチン【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
             MOVE  WK-NITIJIYOU-HIZUKE
               OF  WK-INSERT-DATA-PAKAGE(CNS-1)
               TO  IXCAL-KJN-YMD1       OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
             MOVE  CNS-1
               TO  IXCAL-COMP-BASE      OF  PARM-SCZY1020-ARG1
      *----------  日数
             MOVE  CNS-1
               TO  IXCAL-DAYS           OF  PARM-SCZY1020-ARG1
      *----------  単位区分
             MOVE  CNS-1
               TO  IXCAL-TANI-KBN       OF  PARM-SCZY1020-ARG1
      *----------  機能区分
             MOVE  CNS-3
               TO  IXCAL-FUNCTION       OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
             MOVE  CNS-1
               TO  IXCAL-ZENGO-KBN-1    OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数                        =["
      D             IXCAL-DAYS          OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  Ⅱ)カレンダールーチン【SCZY1020】をコールして、リターンパッケージを取得する
             MOVE  CNS-POS-026          TO  WK-ERR-POS4
             PERFORM  CALL-SCZY1020-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY1020の基準年月日２=["
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  ワーク日次用日付
             MOVE  IXCAL-KJN-YMD2       OF  PARM-SCZY1020-ARG1
               TO  WK-NITIJIYOU-HIZUKE
               OF  WK-INSERT-DATA-PAKAGE(CNS-1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク日次用日付=["
      D    WK-NITIJIYOU-HIZUKE  OF  WK-INSERT-DATA-PAKAGE(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID ":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２    =["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D                               OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OBJ-CASE-RTN]"                GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  C)To日入れ
      *----------  ワーク基準日情報パッケージ.基準日数
           COMPUTE  WK-KJN-NISU         OF  WK-KJN-PACKAGE =
                    WK-KJN-NISU         OF  WK-KJN-PACKAGE + 1
      *----------  ワーク基準日情報パッケージ.基準日詳細(ワーク基準日情報パッケージ.基準日数).基準日
           MOVE  WK-KKN2-TO-YMD         OF  WK-KKN-ARE
             OF  WK-PTF-INFO-PACKAGE(WK-IDX)
             TO  WK-KJN-YMD             OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                 (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
      *----------  ワーク基準日情報パッケージ.基準日詳細(ワーク基準日情報パッケージ.基準日数).基準日種類
           MOVE  CNS-CHAR-0
             TO  WK-KJN-YMD-SHRU        OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                 (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID ":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２    =["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D                               OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細("
      D             "ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細("
      D             "ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID ":*** 対象の場合 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       OBJ-CASE-EXT.
           EXIT.
      ******************************************************************
      *    対象外の場合
      ******************************************************************
       UNOBJ-CASE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  対象外の場合  START  ***"
      *-----------------------------------------------------------------
      *----------  月末日判定処理
           PERFORM  GMATU-YMD-DES-TR-RTN
      *----------  設定日判定処理
           PERFORM  SET-YMD-DES-TRE-RTN
      *----------  解約日判定処理
           PERFORM  CANCL-YMD-DES-TR-RTN
      *----------  特別イベント日判定処理
           PERFORM  EVENT-YMD-DES-TR-RTN
      *----------  指定To日セット処理
           PERFORM  SITEI-TO-YMD-TRE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 対象外の場合 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UNOBJ-CASE-EXT.
           EXIT.
      ******************************************************************
      *    月末日判定処理
      ******************************************************************
       GMATU-YMD-DES-TR-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  月末日判定処理  START  ***"
      *-----------------------------------------------------------------
      *----------  期間初日の月末日取得処理
           INITIALIZE   PARM-SCZY1020-INOUT
                        PARM-SCZY1020-RTNPKG
      *----------  【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
           MOVE  WK-KKN2-FROM-YMD       OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
             TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
           MOVE  CNS-1
             TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *----------  単位区分
           MOVE  CNS-2
             TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *----------  機能区分
           MOVE  CNS-5
             TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
           MOVE  CNS-2
             TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  カレンダールーチン【SCZY1020】をコールして、リターンパッケージを取得する
           MOVE  CNS-POS-027          TO  WK-ERR-POS4
           PERFORM  CALL-SCZY1020-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY1020の基準年月日２=["
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
           MOVE  IXCAL-KJN-YMD2       OF  PARM-SCZY1020-ARG1
             TO  WK-GMATU-YMD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク月末日=["WK-GMATU-YMD"]"
      D    DISPLAY  CNS-PGM-ID ":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２          =["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
      *----------  ワーク月末日LOOP判定処理
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [GMATU-YMD-DES-TR-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  WORK-GMATU-LOOP-RTN  UNTIL
                    WK-GMATU-YMD > WK-KKN2-TO-YMD
                                      OF  WK-KKN-ARE
                                      OF  WK-PTF-INFO-PACKAGE(WK-IDX)
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [GMATU-YMD-DES-TR-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 月末日判定処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GMATU-YMD-DES-TR-EXT.
           EXIT.
      ******************************************************************
      *    ワーク月末日LOOP判定処理
      ******************************************************************
       WORK-GMATU-LOOP-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ワーク月末日LOOP判定処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ワーク基準日情報パッ ケージセット
           COMPUTE  WK-KJN-NISU         OF  WK-KJN-PACKAGE =
                    WK-KJN-NISU         OF  WK-KJN-PACKAGE + 1
           MOVE  WK-GMATU-YMD
             TO  WK-KJN-YMD             OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                 (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
           MOVE  CNS-CHAR-4
             TO  WK-KJN-YMD-SHRU        OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                 (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数  =["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日   =["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
      *----------  ワーク月末計算START日設定
           MOVE  WK-GMATU-YMD
             TO  WK-TMP-CALC-START
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-TMP-CALC-START =["
      D             WK-TMP-CALC-START "]"
      *-----------------------------------------------------------------
           IF  WK-MM                    OF  WK-TMP-CALC-START = "12"
           THEN
      *----------  ワーク月末日の月＝12の場合
             COMPUTE WK-YYYY            OF  WK-TMP-CALC-START =
                     WK-YYYY            OF  WK-TMP-CALC-START + 1
             MOVE  CNS-1
               TO  WK-MM                OF  WK-TMP-CALC-START
             MOVE  CNS-1
               TO  WK-DD                OF  WK-TMP-CALC-START
             MOVE  WK-TMP-CALC-START
               TO  WK-GMATU-CALC-PACKAGE
           ELSE
               COMPUTE WK-MM            OF  WK-TMP-CALC-START =
                       WK-MM            OF  WK-TMP-CALC-START + 1
               MOVE  CNS-1
                 TO  WK-DD              OF  WK-TMP-CALC-START
               MOVE  WK-TMP-CALC-START
                 TO  WK-GMATU-CALC-PACKAGE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク月末計算START日 =["
      D             WK-GMATU-CALC-PACKAGE "]"
      *-----------------------------------------------------------------
      *----------  CALL 【SCZY1020】
           INITIALIZE   PARM-SCZY1020-INOUT
                        PARM-SCZY1020-RTNPKG
      *----------  【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
           MOVE  WK-GMATU-CALC-PACKAGE
             TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
           MOVE  CNS-1
             TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *----------  単位区分
           MOVE  CNS-2
             TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *----------  機能区分
           MOVE  CNS-5
             TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
           MOVE  CNS-2
             TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  カレンダールーチン【SCZY1020】をコールして、リターンパッケージを取得する
           MOVE  CNS-POS-028            TO  WK-ERR-POS4
           PERFORM  CALL-SCZY1020-RTN
           MOVE  IXCAL-KJN-YMD2         OF  PARM-SCZY1020-ARG1
             TO  WK-GMATU-YMD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク月末日=[" WK-GMATU-YMD"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ワーク月末日LOOP判定処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WORK-GMATU-LOOP-EXT.
           EXIT.
      ******************************************************************
      *    設定日判定処理
      ******************************************************************
       SET-YMD-DES-TRE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  設定日判定処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間From２=["
      D             WK-KKN2-FROM-YMD    OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ詳細パッケージ."
      D              "設定日=["
      D             WK-SET-YMD          OF  WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２=["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
           IF  WK-SET-YMD               OF  WK-PTF-SHOSAI-PACKAGE >=
               WK-KKN2-FROM-YMD         OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
               AND
               WK-SET-YMD               OF  WK-PTF-SHOSAI-PACKAGE <=
               WK-KKN2-TO-YMD           OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
           THEN
             COMPUTE  WK-KJN-NISU       OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU       OF  WK-KJN-PACKAGE + 1
             MOVE  WK-SET-YMD           OF  WK-PTF-SHOSAI-PACKAGE
               TO  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-0
               TO  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 設定日判定処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SET-YMD-DES-TRE-EXT.
           EXIT.
      ******************************************************************
      *    解約日判定処理
      ******************************************************************
       CANCL-YMD-DES-TR-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  解約日判定処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間From２=["
      D             WK-KKN2-FROM-YMD    OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ詳細パッケージ."
      D              "解約日=["
      D             WK-CANCL-YMD        OF  WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２=["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
           IF  WK-CANCL-YMD             OF  WK-PTF-SHOSAI-PACKAGE >=
               WK-KKN2-FROM-YMD         OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
               AND
               WK-CANCL-YMD             OF  WK-PTF-SHOSAI-PACKAGE <=
               WK-KKN2-TO-YMD           OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
           THEN
             COMPUTE  WK-KJN-NISU       OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU       OF  WK-KJN-PACKAGE + 1
             MOVE  WK-CANCL-YMD         OF  WK-PTF-SHOSAI-PACKAGE
               TO  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-0
               TO  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 解約日判定処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CANCL-YMD-DES-TR-EXT.
           EXIT.
      ******************************************************************
      *    特別イベント日判定処理
      ******************************************************************
       EVENT-YMD-DES-TR-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  特別イベント日判定処理  START  ***"
      *-----------------------------------------------------------------
      *----------  特別イベント日１
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間From２=["
      D             WK-KKN2-FROM-YMD    OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ詳細パッケージ."
      D              "特別イベント日１=["
      D             WK-EVENT-YMD1       OF  WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２=["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
           IF  WK-EVENT-YMD1            OF  WK-PTF-SHOSAI-PACKAGE >=
               WK-KKN2-FROM-YMD         OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
               AND
               WK-EVENT-YMD1            OF  WK-PTF-SHOSAI-PACKAGE <=
               WK-KKN2-TO-YMD           OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
           THEN
             COMPUTE  WK-KJN-NISU       OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU       OF  WK-KJN-PACKAGE + 1
             MOVE  WK-EVENT-YMD1        OF  WK-PTF-SHOSAI-PACKAGE
               TO  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-0
               TO  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  特別イベント日２
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間From２=["
      D             WK-KKN2-FROM-YMD    OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ詳細パッケージ."
      D              "特別イベント日２=["
      D             WK-EVENT-YMD2       OF  WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２=["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
           IF  WK-EVENT-YMD2            OF  WK-PTF-SHOSAI-PACKAGE >=
               WK-KKN2-FROM-YMD         OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
               AND
               WK-EVENT-YMD2            OF  WK-PTF-SHOSAI-PACKAGE <=
               WK-KKN2-TO-YMD           OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
           THEN
             COMPUTE  WK-KJN-NISU       OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU       OF  WK-KJN-PACKAGE + 1
             MOVE  WK-EVENT-YMD2        OF  WK-PTF-SHOSAI-PACKAGE
               TO  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-0
               TO  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D            (WK-KJN-NISU         OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  特別イベント日３
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間From２=["
      D             WK-KKN2-FROM-YMD    OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ詳細パッケージ."
      D              "特別イベント日３=["
      D             WK-EVENT-YMD3       OF  WK-PTF-SHOSAI-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア(IDX).期間To２=["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D             OF  WK-PTF-INFO-PACKAGE(WK-IDX)"]"
      *-----------------------------------------------------------------
           IF  WK-EVENT-YMD3            OF  WK-PTF-SHOSAI-PACKAGE >=
               WK-KKN2-FROM-YMD         OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
               AND
               WK-EVENT-YMD3            OF  WK-PTF-SHOSAI-PACKAGE <=
               WK-KKN2-TO-YMD           OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
           THEN
             COMPUTE  WK-KJN-NISU       OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU       OF  WK-KJN-PACKAGE + 1
             MOVE  WK-EVENT-YMD3        OF  WK-PTF-SHOSAI-PACKAGE
               TO  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-0
               TO  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 特別イベント日判定処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       EVENT-YMD-DES-TR-EXT.
           EXIT.
      ******************************************************************
      *    指定To日セット処理
      ******************************************************************
       SITEI-TO-YMD-TRE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  指定To日セット処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX=["WK-IDX"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D              "期間数=["
      D             WK-KKN-SU          OF  WK-PTF-INFO-PACKAGE"]"
      *-----------------------------------------------------------------
           IF  WK-IDX = WK-KKN-SU      OF  WK-PTF-INFO-PACKAGE
           THEN
             COMPUTE  WK-KJN-NISU      OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU      OF  WK-KJN-PACKAGE + 1
             MOVE  WK-SITEI-TO         OF  WK-DATA-IN
               TO  WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
                                       OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU        OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-5
               TO  WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
                                       OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU        OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU        OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD         OF  WK-KJN-YMD-SYOSAI
      D                                OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU       OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU    OF  WK-KJN-YMD-SYOSAI
      D                                OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU       OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 指定To日セット処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SITEI-TO-YMD-TRE-EXT.
           EXIT.
      ******************************************************************
      *    ポートフォリオ変更日セット処理
      ******************************************************************
       PTF-CHG-YMD-TRE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ変更日セット処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX=["WK-IDX"]"
      *-----------------------------------------------------------------
           IF  WK-IDX > 1
           THEN
             INITIALIZE   PARM-SCZY1020-INOUT
                          PARM-SCZY1020-RTNPKG
      *----------  【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
             MOVE  WK-KKN2-FROM-YMD     OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
               TO  IXCAL-KJN-YMD1       OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
             MOVE  CNS-1
               TO  IXCAL-COMP-BASE      OF  PARM-SCZY1020-ARG1
      *----------  日数
             MOVE  CNS-1
               TO  IXCAL-DAYS           OF  PARM-SCZY1020-ARG1
      *----------  単位区分
             MOVE  CNS-1
               TO  IXCAL-TANI-KBN       OF  PARM-SCZY1020-ARG1
      *----------  機能区分
             MOVE  CNS-3
               TO  IXCAL-FUNCTION       OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
             MOVE  CNS-2
               TO  IXCAL-ZENGO-KBN-1    OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数                        =["
      D             IXCAL-DAYS          OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  カレンダールーチン【SCZY1020】をコールして、リターンパッケージを取得する
             MOVE  CNS-POS-029          TO  WK-ERR-POS4
             PERFORM  CALL-SCZY1020-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1020戻り値.基準年月日２=["
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
             COMPUTE  WK-KJN-NISU       OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU       OF  WK-KJN-PACKAGE + 1
             MOVE  IXCAL-KJN-YMD2       OF  PARM-SCZY1020-ARG1
               TO  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-0
               TO  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日=["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** ポートフォリオ変更日セット処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-CHG-YMD-TRE-EXT.
           EXIT.
      ******************************************************************
      *    決算日判定
      ******************************************************************
       KESSANYMD-ONE-TR-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  決算日判定  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
             INITIALIZE       WK-KESSAN-YMD-PACKAGE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ  =["
      D             WK-KESSAN-YMD-PACKAGE"]"
      *-----------------------------------------------------------------
      *----------  決算日算出処理セット
      *----------  ワーク決算日算出パッケージ.計算From日
           MOVE  WK-KKN2-FROM-YMD       OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
             TO  WK-CALC-FROM           OF  WK-KESSAN-YMD-PACKAGE
      *----------  ワーク決算日算出パッケージ.計算To日
           MOVE  WK-KKN2-TO-YMD         OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX)
             TO  WK-CALC-TO             OF  WK-KESSAN-YMD-PACKAGE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-KESSAN-YMD-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ.計算To日=["
      D             WK-CALC-TO          OF  WK-KESSAN-YMD-PACKAGE"]"
      *-----------------------------------------------------------------
      *----------  決算日算出処理実行
           MOVE  CNS-POS-030            TO  WK-ERR-POS3
           PERFORM  SCZY4026-RTN
      *----------  営業日判定処理(場合1)
           MOVE  CNS-1                  TO  WK-IDX3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":IDX3                                =["
      D             WK-IDX3"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク決算日算出パッケージ.決算日数 =["
      D             WK-KESSAN-NISU      OF WK-KESSAN-YMD-PACKAGE"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KESSANYMD-ONE-TR-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  OPEN-YMD-ONE-RTN    UNTIL
                    WK-IDX3 > WK-KESSAN-NISU  OF WK-KESSAN-YMD-PACKAGE
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KESSANYMD-ONE-TR-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 決算日判定 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KESSANYMD-ONE-TR-EXT.
           EXIT.
      ******************************************************************
      *    (c)IDX3≦ワーク決算日算出パッケージ.決算日数の時、下記処理を繰り返す
      ******************************************************************
       OPEN-YMD-ONE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク決算日算出パッケージ.決算日詳細.シフト区分"
      D             "=["WK-SHIFT-KBN    OF  WK-KESSAN-SHOSAI
      D                 OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数  =["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日   =["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク決算日算出パッケージ.決算日詳細.決算日   =["
      D             WK-KESSAN-YMD       OF  WK-KESSAN-SHOSAI
      D             OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
           IF  WK-KESSAN-YMD          OF  WK-KESSAN-SHOSAI
                                      OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)
            <  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE
           THEN
             COMPUTE   WK-IDX3 = WK-IDX3 + 1
           ELSE
           IF  WK-SHIFT-KBN           OF  WK-KESSAN-SHOSAI
                                      OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)
                                      =   ZERO
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ.決算日"
      D             "詳細.シフト区分＝'0'の場合"
      *-----------------------------------------------------------------
      *-----------  ワーク基準日情報パッケージ.基準日数
             COMPUTE  WK-KJN-NISU         OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU         OF  WK-KJN-PACKAGE + 1
             MOVE  WK-KESSAN-YMD          OF  WK-KESSAN-SHOSAI
                                      OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)
               TO  WK-KJN-YMD             OF  WK-KJN-YMD-SYOSAI
                                          OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-1
               TO  WK-KJN-YMD-SHRU        OF  WK-KJN-YMD-SYOSAI
                                          OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
           ELSE
             CONTINUE
           END-IF
           IF  WK-SHIFT-KBN           OF  WK-KESSAN-SHOSAI
                                      OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)
                                      =   CNS-3
           OR  WK-SHIFT-KBN           OF  WK-KESSAN-SHOSAI
                                      OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)
                                      =   CNS-1
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ.決算日"
      D             "詳細.シフト区分＝'3' or '1'の場合"
      *-----------------------------------------------------------------
             COMPUTE  WK-KJN-NISU         OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU         OF  WK-KJN-PACKAGE + 1
             MOVE  WK-KESSAN-YMD          OF  WK-KESSAN-SHOSAI
                                      OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)
               TO  WK-KJN-YMD             OF  WK-KJN-YMD-SYOSAI
                                          OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-3
               TO  WK-KJN-YMD-SHRU        OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
           ELSE
             CONTINUE
           END-IF
           IF  WK-SHIFT-KBN             OF  WK-KESSAN-SHOSAI
                                      OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)
                                        =   CNS-4
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ.決算日"
      D             "詳細.シフト区分＝'4'の場合"
      *-----------------------------------------------------------------
             COMPUTE  WK-KJN-NISU         OF  WK-KJN-PACKAGE =
                      WK-KJN-NISU         OF  WK-KJN-PACKAGE + 1
             MOVE  WK-KESSAN-YMD          OF  WK-KESSAN-SHOSAI
                                      OF  WK-KESSAN-YMD-PACKAGE(WK-IDX3)
               TO  WK-KJN-YMD             OF  WK-KJN-YMD-SYOSAI
                                          OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
             MOVE  CNS-CHAR-2
               TO  WK-KJN-YMD-SHRU        OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE
                   (WK-KJN-NISU           OF  WK-KJN-PACKAGE)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日数  =["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D              "(ワーク基準日情報パッケージ.基準日数).基準日   =["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ.基準日詳細"
      D             "(ワーク基準日情報パッケージ.基準日数).基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-PACKAGE)"]"
      *-----------------------------------------------------------------
           COMPUTE   WK-IDX3 = WK-IDX3 + 1
           END-IF
           CONTINUE.
       OPEN-YMD-ONE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3各準備処理
      ******************************************************************
       EVR-PRE-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  各準備処理  START  ***"
      *-----------------------------------------------------------------
      *---------- 3.2.3.1基準日の昇順で並べる
           PERFORM  KJN-YMD-SRT-RTN
      *---------- 3.2.3.2重複の基準日の削除処理
           PERFORM  REP-KJN-YMD-DEL-RTN
      *---------- 3.2.3.3全期間の開始断面判定処理
           PERFORM  ALL-KKN-STAT-DES-RTN
      *---------- 3.2.3.4計算From日の直前基準日取得
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ = ["
      D             WK-START-DMN-FLG     OF  WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
           IF  WK-START-DMN-FLG   OF  WK-CALC-KKN-PACKAGE = CNS-CHAR-1
           THEN
             PERFORM  CALC-FRM-YMD-BEF-RTN
           ELSE
             CONTINUE
           END-IF
      *---------- 3.2.3.5直前基準日と直前基準日進捗STSの編集
           PERFORM  BEF-KJN-STS-EDT-RTN
      *---------- 3.2.3.6指定From日前の取引も処理対象になっていますの処理
           IF  WK-START-DMN-STS         OF  WK-CALC-KKN-PACKAGE =
               CNS-CHAR-7
           THEN
      *----------  ワーク計算期間パッケージ.開始断面進捗STS＝'7'の場合
      *----------  エラーポジション
             MOVE  CNS-POS-037          TO  WK-ERR-POS1
      *----------  取引テーブル(計算From日再処理)CURSOR PREPARE
             PERFORM  TRHK-TBL-PREP-RTN
      *----------  エラーポジション
             MOVE  CNS-POS-038          TO  WK-ERR-POS1
      *----------  取引テーブル(計算From日再処理)CURSOR OPEN
             PERFORM  TRHK-TBL-OPEN-RTN
      *----------  エラーポジション
             MOVE  CNS-POS-039          TO  WK-ERR-POS1
             MOVE  CNS-POS-040          TO  WK-ERR-POS2
      *----------  取引テーブル(計算From日再処理)CURSOR FETCH2
             PERFORM  TRHK-TBL-FETCH2-RTN
      *----------  エラーポジション                                     @3212SEINO@@
      *      MOVE  CNS-POS-041          TO  WK-ERR-POS1                 @3212SEINO@@
      *----------  取引テーブル(計算From日再処理)CLOSE                  @3212SEINO@@
      *      PERFORM  TRHK-TBL-CLOSE-RTN                                @3212SEINO@@
      *----------  ARG3.警告フラグ
      *      MOVE  CNS-WARN-FLG-D1
      *        TO  WARN-FLG             OF  PARM-SMZJ1210-ARG3
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":ARG3.警告フラグ=["
      *D             WARN-FLG            OF  PARM-SMZJ1210-ARG3"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 各準備処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       EVR-PRE-EXT.
           EXIT.
      ******************************************************************
      *     3.2.3.1基準日の昇順で並べる
      ******************************************************************
       KJN-YMD-SRT-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  3.2.3.1基準日の昇順で並べる  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    PARM-SMZJ4017-INOUT
                         PARM-SMZJ4017-RTNPKG
      *----------  【SMZJ4017】に接続用パラメータの設定を行なう
      *----------  ワーク基準日情報パッケージ.基準日詳細
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KJN-YMD-SRT-RTN_1]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM   VARYING WK-IDX1  FROM 1 BY 1 UNTIL WK-IDX1 > 1000
             MOVE  WK-KJN-YMD-SYOSAI
               OF  WK-KJN-PACKAGE(WK-IDX1)
               TO  KJN-YMD-SYOSAI       OF  PARM-SMZJ4017-ARG1(WK-IDX1)
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KJN-YMD-SRT-RTN_1]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  基準日の昇順で並べる
           CALL   "SMZJ4017"            USING  PARM-SMZJ4017-INOUT
                                               PARM-SMZJ4017-RTNPKG
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KJN-YMD-SRT-RTN_2]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  VARYING WK-IDX8  FROM 1 BY 1 UNTIL WK-IDX8 > 1000
             MOVE  KJN-YMD-SYOSAI       OF  PARM-SMZJ4017-ARG2(WK-IDX8)
               TO  WK-KJN-YMD-SYOSAI    OF  WK-KJN-PACKAGE(WK-IDX8)
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KJN-YMD-SRT-RTN_2]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***   3.2.3.1基準日の昇順で並べる  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KJN-YMD-SRT-EXT.
           EXIT.
      ******************************************************************
      *     3.2.3.2重複の基準日の削除処理
      ******************************************************************
       REP-KJN-YMD-DEL-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  3.2.3.2重複の基準日の削除処理  START  ***"
      *-----------------------------------------------------------------
      *---------- データセット
      *----------  ワーク基準日
           MOVE  WK-KJN-YMD             OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(1)
             TO  WK-KJN-DATE
      *----------  ワーク基準日種類
           MOVE  WK-KJN-YMD-SHRU        OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(1)
             TO  WK-KJN-SHRU
      *----------  ワーク基準日ソートパッケージ.基準日詳細(1).基準日
           MOVE  WK-KJN-YMD             OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(1)
             TO  WK-KJN-YMD             OF  WK-KJN-SHOSAI
                                        OF  WK-KJN-SORT-PACKAGE(1)
      *----------  ワーク基準日ソートパッケージ.基準日詳細(1).基準日種類
           MOVE  WK-KJN-YMD-SHRU        OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(1)
             TO  WK-KJN-YMD-SHRU        OF  WK-KJN-SHOSAI
                                        OF  WK-KJN-SORT-PACKAGE(1)
      *----------  ワーク基準日ソートパッケージ.基準日数
           MOVE  CNS-1
             TO  WK-KJN-NISU            OF  WK-KJN-SORT-PACKAGE
      *----------  重複の基準日の削除処理
           MOVE  CNS-2                  TO  WK-IDX4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク基準日    =["WK-KJN-DATE"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク基準日種類=["WK-KJN-SHRU"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ."
      D             "基準日詳細(1).基準日        =["
      D             WK-KJN-YMD          OF  WK-KJN-SHOSAI
      D                                 OF  WK-KJN-SORT-PACKAGE(1)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ."
      D             "基準日詳細(1).基準日種類    =["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-SHOSAI
      D                                 OF  WK-KJN-SORT-PACKAGE(1)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ."
      D             "基準日数                    =["
      D             WK-KJN-NISU         OF  WK-KJN-SORT-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID ":IDX4            =["
      D             WK-IDX4"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク基準日情報パッケージ."
      D             "基準日数                    =["
      D             WK-KJN-NISU         OF  WK-KJN-PACKAGE"]"
      *---------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [REP-KJN-YMD-DEL-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  KJN-YMD-DELETE-RTN  UNTIL
             WK-IDX4 > WK-KJN-NISU  OF  WK-KJN-PACKAGE
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [REP-KJN-YMD-DEL-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ."
      D             "基準日数                    =["
      D             WK-KJN-NISU         OF  WK-KJN-SORT-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  3.2.3.2重複の基準日の削除処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       REP-KJN-YMD-DEL-EXT.
           EXIT.
      ******************************************************************
      *     重複の基準日の削除処理
      ******************************************************************
       KJN-YMD-DELETE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  重複の基準日の削除処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ."
      D             "基準日詳細("WK-IDX4").基準日   =["
      D             WK-KJN-YMD          OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE(WK-IDX4)"]"
      D    DISPLAY  CNS-PGM-ID"ワーク基準日    =["WK-KJN-DATE"]"
      D    DISPLAY  CNS-PGM-ID"ワーク基準日種類=["WK-KJN-SHRU"]"
      *-----------------------------------------------------------------
           IF  WK-KJN-YMD               OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(WK-IDX4)
            =  WK-KJN-DATE
           THEN
      *----------  ワーク基準日情報パッケージ.基準日詳細(IDX4).基準日＝ワーク基準日の場合
             IF  WK-KJN-SHRU = CNS-4  OR  WK-KJN-SHRU = CNS-5
             THEN
      *----------  ワーク基準日種類＝（4 OR 5）の場合
               MOVE  WK-KJN-YMD-SHRU    OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(WK-IDX4)
                 TO  WK-KJN-YMD-SHRU    OF  WK-KJN-SHOSAI
                                        OF  WK-KJN-SORT-PACKAGE
                 (WK-KJN-NISU           OF  WK-KJN-SORT-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日ソートパッケージ.基準日詳細(ワーク"
      D             "基準日ソートパッケージ.基準日数).基準日種類 =["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-SHOSAI
      D                                 OF  WK-KJN-SORT-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-SORT-PACKAGE) "]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"ワーク基準日種類=["WK-KJN-SHRU"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日情報パッケージ."
      D             "基準日詳細("WK-IDX4").基準日種類=["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-YMD-SYOSAI
      D                                 OF  WK-KJN-PACKAGE(WK-IDX4)"]"
      *-----------------------------------------------------------------
             IF  WK-KJN-SHRU = CNS-0 AND
                (WK-KJN-YMD-SHRU       OF  WK-KJN-YMD-SYOSAI
                               OF  WK-KJN-PACKAGE(WK-IDX4) = CNS-CHAR-1
                OR  WK-KJN-YMD-SHRU    OF  WK-KJN-YMD-SYOSAI
                               OF  WK-KJN-PACKAGE(WK-IDX4) = CNS-CHAR-2
                OR  WK-KJN-YMD-SHRU    OF  WK-KJN-YMD-SYOSAI
                               OF  WK-KJN-PACKAGE(WK-IDX4) = CNS-CHAR-3)
             THEN
      *----------  ワーク基準日種類＝0：決算日以外の場合
      *----------  ワーク基準日情報パッケージ.基準日詳細(IDX4).基準日種類 IN ('1','2','3')の場合
               MOVE  WK-KJN-YMD-SHRU    OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(WK-IDX4)
                 TO  WK-KJN-YMD-SHRU    OF  WK-KJN-SHOSAI
                                        OF  WK-KJN-SORT-PACKAGE
                     (WK-KJN-NISU       OF  WK-KJN-SORT-PACKAGE)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日ソートパッケージ.基準日詳細(ワーク"
      D             "基準日ソートパッケージ.基準日数).基準日種類 =["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-SHOSAI
      D                                 OF  WK-KJN-SORT-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-SORT-PACKAGE) "]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
      *----------  ワーク基準日情報パッケージ.基準日詳細(IDX4).基準日≠ワーク基準日の場合
      *----------  ワーク基準日ソートパッケージ.基準日数
             COMPUTE  WK-KJN-NISU       OF  WK-KJN-SORT-PACKAGE =
                      WK-KJN-NISU       OF  WK-KJN-SORT-PACKAGE + 1
      *----------  ワーク基準日ソートパッケージ.基準日詳細(ワーク基準日ソートパッケージ.基準日数).基準日
             MOVE  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(WK-IDX4)
               TO  WK-KJN-YMD           OF  WK-KJN-SHOSAI
                                        OF  WK-KJN-SORT-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-SORT-PACKAGE)
      *----------  ワーク基準日ソートパッケージ.基準日詳細(ワーク基準日ソートパッケージ.基準日数).基準日種類
             MOVE  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(WK-IDX4)
               TO  WK-KJN-YMD-SHRU      OF  WK-KJN-SHOSAI
                                        OF  WK-KJN-SORT-PACKAGE
                   (WK-KJN-NISU         OF  WK-KJN-SORT-PACKAGE)
      *----------  ワーク基準日
             MOVE  WK-KJN-YMD           OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(WK-IDX4)
               TO  WK-KJN-DATE
      *----------  ワーク基準日種類
             MOVE  WK-KJN-YMD-SHRU      OF  WK-KJN-YMD-SYOSAI
                                        OF  WK-KJN-PACKAGE(WK-IDX4)
               TO  WK-KJN-SHRU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-SORT-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ.基準日詳細"
      D             "(ワーク基準日ソートパッケージ.基準日数).基準日  =["
      D             WK-KJN-YMD          OF  WK-KJN-SHOSAI
      D                                 OF  WK-KJN-SORT-PACKAGE
      D             ( WK-KJN-NISU       OF  WK-KJN-SORT-PACKAGE)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク基準日ソートパッケージ.基準日詳細(ワーク"
      D             "基準日ソートパッケージ.基準日数).基準日種類 =["
      D             WK-KJN-YMD-SHRU     OF  WK-KJN-SHOSAI
      D                                 OF  WK-KJN-SORT-PACKAGE
      D             (WK-KJN-NISU        OF  WK-KJN-SORT-PACKAGE) "]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日                         =["
      D             WK-KJN-DATE "]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日種類                     =["
      D             WK-KJN-SHRU"]"
      *-----------------------------------------------------------------
           END-IF
      *----------  計算用(Loop)
           COMPUTE  WK-IDX4 = WK-IDX4 + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  重複の基準日の削除処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KJN-YMD-DELETE-EXT.
           EXIT.
      ******************************************************************
      *     3.2.3.3全期間の開始断面判定処理
      ******************************************************************
       ALL-KKN-STAT-DES-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  3.2.3.3全期間の開始断面判定処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ = ["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE "]"
      *----------------------------------------------------------------
           IF  WK-START-DMN-FLG   OF  WK-CALC-KKN-PACKAGE = CNS-CHAR-9
           THEN
      *----------  計算From日直前断面存在チェック
             PERFORM  CALC-FRM-BEF-CHK-RTN
             IF  WK-START-DMN-FLG OF  WK-CALC-KKN-PACKAGE = CNS-CHAR-0
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ = ["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
      *----------  ワーク計算期間パッケージ.開始断面フラグ＝0の場合
               PERFORM  KKN-RUL-STRT-DES-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  3.2.3.3全期間の開始断面判定処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ALL-KKN-STAT-DES-EXT.
           EXIT.
      ******************************************************************
      *     計算From日直前断面存在チェック
      ******************************************************************
       CALC-FRM-BEF-CHK-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  計算From日直前断面存在チェック  START  ***"
      *-----------------------------------------------------------------
      *----------  進捗管理TBL
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TKDYAA40           OF  SQL-SELECT-1-5,
                 WK-TKDYAA40            OF  WK-MSG-1-5
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKDYAA40-S-2,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-5
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKDYAA40-S-2,
                 WK-FUND-CD             OF  WK-MSG-1-5
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKDYAA40-S-2,
                 WK-PTF-CD              OF  WK-MSG-1-5
      *----------  進捗タスクID
           MOVE  CNS-SHINTK-TASK-ID
             TO  H-SHINTK-TASK-ID       OF  H-TKDYAA40-S-2,
                 WK-SHINTK-TASK-ID      OF  WK-MSG-1-5
      *----------  ワーク計算期間パッケージ.計算From日
           MOVE  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE
             TO  H-CALC-FROM            OF  H-TKDYAA40-S-2,
                 WK-CALC-FROM           OF  WK-MSG-1-5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-5     =["SQL-SELECT-1-5"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD      OF  H-TKDYAA40-S-2=["
      D             H-RIYO-CMP-CD       OF  H-TKDYAA40-S-2"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD          OF  H-TKDYAA40-S-2=["
      D             H-FUND-CD           OF  H-TKDYAA40-S-2"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD           OF  H-TKDYAA40-S-2=["
      D             H-PTF-CD            OF  H-TKDYAA40-S-2"]"
      D    DISPLAY  CNS-PGM-ID":H-SHINTK-TASK-ID "
      D             "OF H-TKDYAA40-S-2                               =["
      D             H-SHINTK-TASK-ID    OF  H-TKDYAA40-S-2"]"
      D    DISPLAY  CNS-PGM-ID":H-CALC-FROM        OF  H-TKDYAA40-S-2=["
      D             H-CALC-FROM         OF  H-TKDYAA40-S-2"]"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
      *    MOVE  SQL-SELECT-1-5         TO  SQLSTMT                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT5-ARR                                     @3212SEINO@@
           MOVE  1                      TO  SQLSTMT5-LEN                @3212SEINO@@
           STRING  SQL-SELECT-1-5                                       @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT5-ARR                                   @3212SEINO@@
                   WITH  POINTER  SQLSTMT5-LEN                          @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT5-ARR=["SQLSTMT5-ARR"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-5-FLG=["               @3212SEINO@@
      D             WK-TKDYAA40-CR-1-5-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-TKDYAA40-CR-1-5-FLG  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC SQL                                                   @3212SEINO@@
                 PREPARE S5 FROM :SQLSTMT5                              @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-042
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-5       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
             EXEC  SQL  DECLARE  TKDYAA40_2_CURSOR  CURSOR  FOR S5
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  カーソルオープン処理
           EXEC  SQL
               OPEN  TKDYAA40_2_CURSOR
           USING  :H-TKDYAA40-S-2.H-RIYO-CMP-CD,
                  :H-TKDYAA40-S-2.H-FUND-CD,
                  :H-TKDYAA40-S-2.H-PTF-CD,
                  :H-TKDYAA40-S-2.H-SHINTK-TASK-ID,
                  :H-TKDYAA40-S-2.H-CALC-FROM
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON              TO  WK-TKDYAA40-CR-1-5-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-5-FLG=["
      D             WK-TKDYAA40-CR-1-5-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-043
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *----------  カーソルフェッチ処理
           INITIALIZE                   H-TKDYAA40-2
           EXEC  SQL
               FETCH
                    TKDYAA40_2_CURSOR
               INTO :H-TKDYAA40-2.H-SS-SYORI-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得最終処理基準日=["
      D             H-SS-SYORI-YMD      OF  H-TKDYAA40-2"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-CHAR-1
                 TO  WK-START-DMN-FLG   OF  WK-CALC-KKN-PACKAGE
               MOVE  CNS-CHAR-1
                 TO  WK-START-DMN-STS   OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.開始断面フラグ"
      D             "=["WK-START-DMN-FLG
      D                                 OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID"ワーク計算期間パッケージ.開始断面進捗STS"
      D             "=["WK-START-DMN-STS
      D                                 OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-CHAR-0
                 TO  WK-START-DMN-FLG   OF  WK-CALC-KKN-PACKAGE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.開始断面フラグ"
      D             "=["WK-START-DMN-FLG
      D                                 OF  WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-044
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-5       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *    EXEC  SQL                                                    @3212SEINO@@
      *        CLOSE TKDYAA40_2_CURSOR                                  @3212SEINO@@
      *    END-EXEC                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEINO@@
      *    THEN                                                         @3212SEINO@@
      *      MOVE  CNS-OFF              TO  WK-TKDYAA40-CR-1-5-FLG      @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-5-FLG=["               @3212SEINO@@
      *             WK-TKDYAA40-CR-1-5-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    ELSE                                                         @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"                  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *      MOVE  CNS-PGM-ID                                           @3212SEINO@@
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *      MOVE  CNS-POS-045                                          @3212SEINO@@
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *      MOVE  CNS-RTN-900                                          @3212SEINO@@
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *      MOVE  SQLCODE                                              @3212SEINO@@
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      *              WK-MSG-1-5         DELIMITED  BY  SIZE             @3212SEINO@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      PERFORM  ERR-RTN                                           @3212SEINO@@
      *    END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  計算From日直前断面存在チェック  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-FRM-BEF-CHK-EXT.
           EXIT.
      ******************************************************************
      *     全期間の開始断面判定(MAIN)処理
      ******************************************************************
       KKN-RUL-STRT-DES-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  全期間の開始断面判定(MAIN)処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-CHAR-0             TO  WK-CALC-FROM-TRHK-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算From日前取引存在フラグ =["
      D             WK-CALC-FROM-TRHK-PACKAGE"]"
      *-----------------------------------------------------------------
      *----------  取引テーブルTBL
           MOVE  WK-TBL-TKMXTR00
             TO  SQL-TKMXTR00           OF  SQL-SELECT-1-6,
                 WK-TKMXTR00            OF  WK-MSG-1-6
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKMXTR00-S-1,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-6
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKMXTR00-S-1,
                 WK-FUND-CD             OF  WK-FUND-CD-1
                                        OF  WK-MSG-1-6,
                 WK-FUND-CD             OF  WK-FUND-CD-2
                                        OF  WK-MSG-1-6
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKMXTR00-S-1,
                 WK-PTF-CD              OF  WK-PTF-CD-1
                                        OF  WK-MSG-1-6,
                 WK-PTF-CD              OF  WK-PTF-CD-2
                                        OF  WK-MSG-1-6
      *----------  ワーク計算期間パッケージ.計算From日
           MOVE  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE
             TO  H-CALC-FROM            OF  H-TKMXTR00-S-1,
                 WK-CALC-FROM           OF  WK-CALC-FROM-1
                                        OF  WK-MSG-1-6,
                 WK-CALC-FROM           OF  WK-CALC-FROM-2
                                        OF  WK-MSG-1-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-6     =["SQL-SELECT-1-6"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD      OF  H-TKMXTR00-S-1=["
      D             H-RIYO-CMP-CD       OF  H-TKMXTR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD          OF  H-TKMXTR00-S-1=["
      D             H-FUND-CD           OF  H-TKMXTR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD           OF  H-TKMXTR00-S-1=["
      D             H-PTF-CD            OF  H-TKMXTR00-S-1"]"
      D    DISPLAY  CNS-PGM-ID":H-CALC-FROM        OF  H-TKMXTR00-S-1=["
      D             H-CALC-FROM         OF  H-TKMXTR00-S-1"]"
      *-----------------------------------------------------------------@3212SEION@@
      *    INITIALIZE  SQLSTMT                                          @3212SEION@@
      *    MOVE  SQL-SELECT-1-6         TO  SQLSTMT                     @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEION@@
           INITIALIZE  SQLSTMT6-ARR                                     @3212SEION@@
           MOVE  1                      TO  SQLSTMT6-LEN                @3212SEION@@
           STRING  SQL-SELECT-1-6                                       @3212SEION@@
                   DELIMITED BY SIZE                                    @3212SEION@@
                   INTO  SQLSTMT6-ARR                                   @3212SEION@@
                   WITH  POINTER  SQLSTMT6-LEN                          @3212SEION@@
           END-STRING                                                   @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT6-ARR=["SQLSTMT6-ARR"]"          @3212SEION@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMXTR00-CR-1-6-FLG=["               @3212SEINO@@
      D             WK-TKMXTR00-CR-1-6-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEION@@
           IF  WK-TKMXTR00-CR-1-6-FLG  =  CNS-OFF                       @3212SEION@@
           THEN                                                         @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
             EXEC SQL                                                   @3212SEION@@
                 PREPARE S6 FROM :SQLSTMT6                              @3212SEION@@
             END-EXEC                                                   @3212SEION@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-046
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-6       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
             EXEC  SQL  DECLARE  TKMXTR00_1_CURSOR  CURSOR  FOR S6
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  カーソルオープン処理
           EXEC  SQL
               OPEN TKMXTR00_1_CURSOR
           USING  :H-TKMXTR00-S-1.H-RIYO-CMP-CD,
                  :H-TKMXTR00-S-1.H-FUND-CD,
                  :H-TKMXTR00-S-1.H-PTF-CD,
                  :H-TKMXTR00-S-1.H-FUND-CD,
                  :H-TKMXTR00-S-1.H-CALC-FROM,
                  :H-TKMXTR00-S-1.H-CALC-FROM
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  WK-TKMXTR00-CR-1-6-FLG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引情報データカーソルオープンフラグ =["
      D             WK-TKMXTR00-CR-1-6-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-047
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *----------  カーソルフェッチ処理
           INITIALIZE  WK-TORI-INFO-FLG
           MOVE  CNS-1                  TO  WK-TORI-INFO-FLG
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KKN-RUL-STRT-DES-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  SQL-FETCH-PROC-RTN  UNTIL  WK-TORI-INFO-FLG = CNS-0
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KKN-RUL-STRT-DES-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *    EXEC  SQL                                                    @3212SEION@@
      *      CLOSE TKMXTR00_1_CURSOR                                    @3212SEION@@
      *    END-EXEC                                                     @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":直前の未収収益計算データカーソル CLOSE "@3212SEION@@
      *             " SQLCODE=[" SQLCODE "]"                            @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEION@@
      *    THEN                                                         @3212SEION@@
      *      MOVE  CNS-OFF              TO  WK-TKMXTR00-CR-1-6-FLG      @3212SEION@@
      *--------------------<DEBUG>--------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":取引情報データカーソルオープンフラグ =["@3212SEION@@
      *             WK-TKMXTR00-CR-1-6-FLG"]"                           @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *    ELSE                                                         @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"                    @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *----------  エラー検知プログラム名                               @3212SEION@@
      *      MOVE  CNS-PGM-ID                                           @3212SEION@@
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  ポジション                                           @3212SEION@@
      *      MOVE  CNS-POS-048                                          @3212SEION@@
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  リターンコード                                       @3212SEION@@
      *      MOVE  CNS-RTN-900                                          @3212SEION@@
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  詳細リターンコード                                   @3212SEION@@
      *      MOVE  SQLCODE                                              @3212SEION@@
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEION@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEION@@
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *---------- フリーメッセージ                                      @3212SEION@@
      *      MOVE  WK-MSG-1-6                                           @3212SEION@@
      *        TO  FREE-MSG             OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  エラー処理                                           @3212SEION@@
      *      PERFORM  ERR-RTN                                           @3212SEION@@
      *    END-IF                                                       @3212SEION@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算From日前取引存在フラグ =["
      D             WK-CALC-FROM-TRHK-PACKAGE "]"
      *-----------------------------------------------------------------
           IF  WK-CALC-FROM-TRHK-PACKAGE = CNS-0
           THEN
      *----------  ワーク計算From日前取引存在フラグ＝0の場合
             PERFORM  EXCU-SQL1-7-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  開始断面進捗STS編集
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算From日前取引存在フラグ =["
      D             WK-CALC-FROM-TRHK-PACKAGE "]"
      *-----------------------------------------------------------------
           IF  WK-CALC-FROM-TRHK-PACKAGE = CNS-CHAR-1
           THEN
      *----------  ワーク計算From日前取引存在フラグ＝'1'の場合
             MOVE  CNS-CHAR-7
               TO  WK-START-DMN-STS     OF  WK-CALC-KKN-PACKAGE
           ELSE
             CONTINUE
           END-IF
           IF  WK-CALC-FROM-TRHK-PACKAGE = CNS-CHAR-0
           THEN
      *----------  ワーク計算From日前取引存在フラグ＝'0'の場合
             MOVE  CNS-CHAR-6
               TO  WK-START-DMN-STS     OF  WK-CALC-KKN-PACKAGE
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
           CONTINUE.
       KKN-RUL-STRT-DES-EXT.
           EXIT.
      ******************************************************************
      *     SQL1.6 FETCH処理
      ******************************************************************
       SQL-FETCH-PROC-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  月SQL1.6 FETCH処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMXTR00-1
           EXEC  SQL
               FETCH
                    TKMXTR00_1_CURSOR
               INTO :H-TKMXTR00-1.H-UKE-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得受渡日=["
      D             H-UKE-YMD          OF  H-TKMXTR00-1"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  受渡日の会計ベース判定
      *----------  計算用(Loop)
               MOVE  CNS-1             TO  WK-IDX5
               MOVE  CNS-0             TO  WK-IDX5-LOOP-FLAG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX5=["WK-IDX5"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間数=["WK-KKN-SU  OF  WK-PTF-INFO-PACKAGE"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SQL-FETCH-PROC-RTN]"          GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  UKEYMD-KAIKEI-DE-RTN  UNTIL
                 WK-IDX5 > WK-KKN-SU OF WK-PTF-INFO-PACKAGE OR
                 WK-IDX5-LOOP-FLAG = CNS-1
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SQL-FETCH-PROC-RTN]"          GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               IF  WK-KHKAIKEI-BASE-FLG = CNS-CHAR-1
               THEN
      *----------  ワーク基本会計ベースフラグ＝'1'の場合
                 MOVE  CNS-CHAR-1       TO  WK-CALC-FROM-TRHK-PACKAGE
                 MOVE  CNS-0            TO  WK-TORI-INFO-FLG
                 MOVE  CNS-1            TO  WK-IDX5-LOOP-FLAG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算From日前取引存在フラグ =["
      D             WK-CALC-FROM-TRHK-PACKAGE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TORI-INFO-FLG  =["
      D             WK-TORI-INFO-FLG "]"
      D    DISPLAY  CNS-PGM-ID":WK-IDX5-LOOP-FLAG  =["
      D             WK-IDX5-LOOP-FLAG "]"
      *-----------------------------------------------------------------
               ELSE
                 COMPUTE  WK-IDX5 = WK-IDX5 + 1
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-0              TO  WK-TORI-INFO-FLG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TORI-INFO-FLG  =["
      D             WK-TORI-INFO-FLG "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-049
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-6       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   SQL1.6 FETCH処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SQL-FETCH-PROC-EXT.
           EXIT.
      ******************************************************************
      *     EXECUTE  SQL1-7
      ******************************************************************
       EXCU-SQL1-7-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  EXECUTE  SQL1-7  START  ***"
      *-----------------------------------------------------------------
      *----------  取引テーブルTBL
           MOVE  WK-TBL-TKMXTR00
             TO  SQL-TKMXTR00           OF  SQL-SELECT-1-7,
                 WK-TKMXTR00            OF  WK-MSG-1-7
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKMXTR00-S-2,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-7
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKMXTR00-S-2,
                 WK-FUND-CD             OF  WK-FUND-CD-1
                                        OF  WK-MSG-1-7,
                 WK-FUND-CD             OF  WK-FUND-CD-2
                                        OF  WK-MSG-1-7
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKMXTR00-S-2,
                 WK-PTF-CD              OF  WK-PTF-CD-1
                                        OF  WK-MSG-1-7,
                 WK-PTF-CD              OF  WK-PTF-CD-2
                                        OF  WK-MSG-1-7
      *----------  ワーク計算期間パッケージ.計算From日
           MOVE  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE
             TO  H-CALC-FROM            OF  H-TKMXTR00-S-2,
                 WK-CALC-FROM           OF  WK-MSG-1-7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-7     =["SQL-SELECT-1-7"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD      OF  H-TKMXTR00-S-2=["
      D             H-RIYO-CMP-CD       OF  H-TKMXTR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD          OF  H-TKMXTR00-S-2=["
      D             H-FUND-CD           OF  H-TKMXTR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD           OF  H-TKMXTR00-S-2=["
      D             H-PTF-CD            OF  H-TKMXTR00-S-2"]"
      D    DISPLAY  CNS-PGM-ID":H-CALC-FROM        OF  H-TKMXTR00-S-2=["
      D             H-CALC-FROM         OF  H-TKMXTR00-S-2"]"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEION@@
      *    MOVE  SQL-SELECT-1-7         TO  SQLSTMT                     @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
           INITIALIZE  SQLSTMT7-ARR                                     @3212SEION@@
           MOVE  1                      TO  SQLSTMT7-LEN                @3212SEION@@
           STRING  SQL-SELECT-1-7                                       @3212SEION@@
                   DELIMITED BY SIZE                                    @3212SEION@@
                   INTO  SQLSTMT7-ARR                                   @3212SEION@@
                   WITH  POINTER  SQLSTMT7-LEN                          @3212SEION@@
           END-STRING                                                   @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT7-ARR=["SQLSTMT7-ARR"]"          @3212SEION@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMXTR00-CR-1-7-FLG=["               @3212SEINO@@
      D             WK-TKMXTR00-CR-1-7-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEION@@
           IF  WK-TKMXTR00-CR-1-7-FLG  =  CNS-OFF                       @3212SEION@@
           THEN                                                         @3212SEION@@
             EXEC SQL                                                   @3212SEION@@
                 PREPARE  S7  FROM  :SQLSTMT7                           @3212SEION@@
             END-EXEC                                                   @3212SEION@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-050
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-7       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
             EXEC  SQL  DECLARE  TKMXTR00_2_CURSOR  CURSOR  FOR S7
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  カーソルオープン処理
           EXEC  SQL
               OPEN TKMXTR00_2_CURSOR
           USING  :H-TKMXTR00-S-2.H-RIYO-CMP-CD,
                  :H-TKMXTR00-S-2.H-FUND-CD,
                  :H-TKMXTR00-S-2.H-PTF-CD,
                  :H-TKMXTR00-S-2.H-FUND-CD,
                  :H-TKMXTR00-S-2.H-CALC-FROM
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON              TO  WK-TKMXTR00-CR-1-7-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TKMXTR00-CR-1-7-FLG=["
      D             WK-TKMXTR00-CR-1-7-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-051
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-7         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *----------  カーソルフェッチ処理
           INITIALIZE                   H-TKMXTR00-2
           EXEC  SQL
               FETCH
                    TKMXTR00_2_CURSOR
               INTO :H-TKMXTR00-2.H-UKE-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得受渡日=["
      D             H-UKE-YMD           OF  H-TKMXTR00-2"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  ワーク計算From日前取引存在フラグ
               MOVE  CNS-CHAR-1         TO  WK-CALC-FROM-TRHK-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算From日前取引存在フラグ =["
      D             WK-CALC-FROM-TRHK-PACKAGE "]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-052
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-7       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *    EXEC  SQL                                                    @3212SEION@@
      *         CLOSE TKMXTR00_2_CURSOR                                 @3212SEION@@
      *    END-EXEC                                                     @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"              @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *    IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEION@@
      *    THEN                                                         @3212SEION@@
      *      MOVE  CNS-OFF              TO  WK-TKMXTR00-CR-1-7-FLG      @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":WK-TKMXTR00-CR-1-7-FLG=["               @3212SEION@@
      *             WK-TKMXTR00-CR-1-7-FLG"]"                           @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *    ELSE                                                         @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"                  @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *----------  エラー検知プログラム名                               @3212SEION@@
      *      MOVE  CNS-PGM-ID                                           @3212SEION@@
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  ポジション                                           @3212SEION@@
      *      MOVE  CNS-POS-053                                          @3212SEION@@
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  リターンコード                                       @3212SEION@@
      *      MOVE  CNS-RTN-900                                          @3212SEION@@
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  詳細リターンコード                                   @3212SEION@@
      *      MOVE  SQLCODE                                              @3212SEION@@
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEION@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEION@@
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *---------- フリーメッセージ                                      @3212SEION@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEION@@
      *              WK-MSG-1-7         DELIMITED  BY  SIZE             @3212SEION@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *--------------------<DEBUG>--------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEION@@
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEION@@
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEION@@
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEION@@
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEION@@
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEION@@
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *      PERFORM  ERR-RTN                                           @3212SEION@@
      *    END-IF                                                       @3212SEION@@
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  EXECUTE  SQL1-7  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       EXCU-SQL1-7-EXT.
           EXIT.
      ******************************************************************
      *     受渡日の会計ベース判定
      ******************************************************************
       UKEYMD-KAIKEI-DE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  受渡日の会計ベース判定  START  ***"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア("WK-IDX5").期間From２     =["
      D             WK-KKN2-FROM-YMD    OF  WK-KKN-ARE
      D             OF WK-PTF-INFO-PACKAGE(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア("WK-IDX5").期間To２       =["
      D             WK-KKN2-TO-YMD      OF  WK-KKN-ARE
      D             OF WK-PTF-INFO-PACKAGE(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":「別紙1-6 SQL説明」.受渡日=["
      D             H-UKE-YMD           OF  H-TKMXTR00-1"]"
      *-----------------------------------------------------------------
           IF  H-UKE-YMD                OF  H-TKMXTR00-1 >=
               WK-KKN2-FROM-YMD         OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX5)
                                        AND
               H-UKE-YMD                OF  H-TKMXTR00-1 <=
               WK-KKN2-TO-YMD           OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX5)
           THEN
      *----------  ワーク基本会計ベースフラグ
             MOVE  WK-KH-KAIKEI-BASE-FLG
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX5)
               TO  WK-KHKAIKEI-BASE-FLG
             MOVE  CNS-1                TO  WK-IDX5-LOOP-FLAG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX5-LOOP-FLAG  =["
      D             WK-IDX5-LOOP-FLAG "]"
      D    DISPLAY  CNS-PGM-ID":ワーク基本会計ベースフラグ =["
      D             WK-KHKAIKEI-BASE-FLG "]"
      *-----------------------------------------------------------------
           ELSE
             COMPUTE  WK-IDX5 = WK-IDX5 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX5 =["WK-IDX5 "]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   受渡日の会計ベース判定  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UKEYMD-KAIKEI-DE-EXT.
           EXIT.
      ******************************************************************
      *     3.2.3.4計算From日の直前基準日取得
      ******************************************************************
       CALC-FRM-YMD-BEF-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 3.2.3.4計算From日の直前基準日取得 START  ***"
      *-----------------------------------------------------------------
      *----------  進捗管理TBL
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TKDYAA40           OF  SQL-SELECT-1-8,
                 WK-TKDYAA40            OF  WK-MSG-1-8
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKDYAA40-S-3,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-8
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKDYAA40-S-3,
                 WK-FUND-CD             OF  WK-MSG-1-8
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKDYAA40-S-3,
                 WK-PTF-CD              OF  WK-MSG-1-8
      *----------  進捗タスクID
           MOVE  CNS-SHINTK-TASK-ID
             TO  H-SHINTK-TASK-ID       OF  H-TKDYAA40-S-3,
                 WK-SHINTK-TASK-ID      OF  WK-MSG-1-8
      *----------  ワーク計算期間パッケージ.計算From日
           MOVE  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE
             TO  H-CALC-FROM            OF  H-TKDYAA40-S-3,
                 WK-CALC-FROM           OF  WK-MSG-1-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-SELECT-1-8     =["SQL-SELECT-1-8"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD      OF  H-TKDYAA40-S-3=["
      D             H-RIYO-CMP-CD       OF  H-TKDYAA40-S-3"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD          OF  H-TKDYAA40-S-3=["
      D             H-FUND-CD           OF  H-TKDYAA40-S-3"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD           OF  H-TKDYAA40-S-3=["
      D             H-PTF-CD            OF  H-TKDYAA40-S-3"]"
      D    DISPLAY  CNS-PGM-ID":H-CALC-FROM        OF  H-TKDYAA40-S-3=["
      D             H-CALC-FROM         OF  H-TKDYAA40-S-3"]"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEION@@
      *    MOVE  SQL-SELECT-1-8         TO  SQLSTMT                     @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
           INITIALIZE  SQLSTMT8-ARR                                     @3212SEION@@
           MOVE  1                      TO  SQLSTMT8-LEN                @3212SEION@@
           STRING  SQL-SELECT-1-8                                       @3212SEION@@
                   DELIMITED BY SIZE                                    @3212SEION@@
                   INTO  SQLSTMT8-ARR                                   @3212SEION@@
                   WITH  POINTER  SQLSTMT8-LEN                          @3212SEION@@
           END-STRING                                                   @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT8-ARR=["SQLSTMT8-ARR"]"          @3212SEION@@
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-8-FLG=["               @3212SEINO@@
      D             WK-TKDYAA40-CR-1-8-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEION@@
           IF  WK-TKDYAA40-CR-1-8-FLG  =  CNS-OFF                       @3212SEION@@
           THEN                                                         @3212SEION@@
             EXEC SQL                                                   @3212SEION@@
                 PREPARE  S8  FROM  :SQLSTMT8                           @3212SEION@@
             END-EXEC                                                   @3212SEION@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-054
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
             EXEC  SQL  DECLARE  TKDYAA40_3_CURSOR  CURSOR  FOR S8
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  カーソルオープン処理
           EXEC  SQL
               OPEN TKDYAA40_3_CURSOR
           USING  :H-TKDYAA40-S-3.H-RIYO-CMP-CD,
                  :H-TKDYAA40-S-3.H-FUND-CD,
                  :H-TKDYAA40-S-3.H-PTF-CD,
                  :H-TKDYAA40-S-3.H-SHINTK-TASK-ID,
                  :H-TKDYAA40-S-3.H-CALC-FROM
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON              TO  WK-TKDYAA40-CR-1-8-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-8-FLG=["
      D             WK-TKDYAA40-CR-1-8-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-055
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-8         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *----------  カーソルフェッチ処理
           INITIALIZE                   H-TKDYAA40-3
           EXEC  SQL
               FETCH
                    TKDYAA40_3_CURSOR
               INTO :H-TKDYAA40-3.H-SS-SYORI-YMD,
                    :H-TKDYAA40-3.H-SHINTK-STS
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得最終処理基準日=["
      D             H-SS-SYORI-YMD      OF  H-TKDYAA40-3"]"
      D    DISPLAY  CNS-PGM-ID":取得進捗ステータス=["
      D             H-SHINTK-STS        OF  H-TKDYAA40-3"]"
      *-----------------------------------------------------------------
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)(NOTFOUND)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-056
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-057
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *    EXEC  SQL                                                    @3212SEION@@
      *        CLOSE TKDYAA40_3_CURSOR                                  @3212SEION@@
      *    END-EXEC                                                     @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"              @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *    IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEION@@
      *    THEN                                                         @3212SEION@@
      *      MOVE  CNS-OFF              TO  WK-TKDYAA40-CR-1-8-FLG      @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-8-FLG=["               @3212SEION@@
      *             WK-TKDYAA40-CR-1-8-FLG"]"                           @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *    ELSE                                                         @3212SEION@@
      *-----------------------DEBUG-------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"                  @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *----------  エラー検知プログラム名                               @3212SEION@@
      *      MOVE  CNS-PGM-ID                                           @3212SEION@@
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  ポジション                                           @3212SEION@@
      *      MOVE  CNS-POS-058                                          @3212SEION@@
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  リターンコード                                       @3212SEION@@
      *      MOVE  CNS-RTN-900                                          @3212SEION@@
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  詳細リターンコード                                   @3212SEION@@
      *      MOVE  SQLCODE                                              @3212SEION@@
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEION@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEION@@
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *---------- フリーメッセージ                                      @3212SEION@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEION@@
      *              WK-MSG-1-8         DELIMITED  BY  SIZE             @3212SEION@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEION@@
      *--------------------<DEBUG>--------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEION@@
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEION@@
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEION@@
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEION@@
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEION@@
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEION@@
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
      *      PERFORM  ERR-RTN                                           @3212SEION@@
      *    END-IF                                                       @3212SEION@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  3.2.3.4計算From日の直前基準日取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-FRM-YMD-BEF-EXT.
           EXIT.
      ******************************************************************
      *     3.2.3.5直前基準日と直前基準日進捗STSの編集
      ******************************************************************
       BEF-KJN-STS-EDT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":***  3.2.3.5直前基準日と直前基準日進捗STSの編集 START  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面フラグ=["
      D             WK-START-DMN-FLG    OF  WK-CALC-KKN-PACKAGE "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.開始断面進捗STS=["
      D             WK-START-DMN-STS    OF  WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
           IF  WK-START-DMN-FLG         OF  WK-CALC-KKN-PACKAGE =
               CNS-CHAR-0
           THEN
      *----------  ワーク計算期間パッケージ.開始断面フラグ＝'0'の場合
             IF  WK-START-DMN-STS       OF  WK-CALC-KKN-PACKAGE =
                 CNS-CHAR-6
             THEN
      *----------  ワーク計算期間パッケージ.開始断面進捗STS＝'6'の場合
      *----------  ワーク計算期間パッケージ.直前基準日
               MOVE  ZERO
                 TO  WK-TZ-KJN-YJMD     OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.直前基準日進捗STS
               MOVE  CNS-SHINTK-STS2
                 TO  WK-TZ-KJN-YJMD-STS
                 OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.実計算From日(開始断面なし用)
               MOVE  WK-CALC-FROM       OF  WK-CALC-KKN-PACKAGE
                 TO  WK-JITSU-CALC-FROM
                 OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.直前基準日=["
      D             WK-TZ-KJN-YJMD      OF  WK-CALC-KKN-PACKAGE "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.直前基準日進捗STS=["
      D             WK-TZ-KJN-YJMD-STS  OF  WK-CALC-KKN-PACKAGE "]"
      D    DISPLAY  CNS-PGM-ID
      D       ":ワーク計算期間パッケージ.実計算From日(開始断面なし用)=["
      D             WK-JITSU-CALC-FROM  OF  WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
             ELSE
               IF  WK-START-DMN-STS     OF  WK-CALC-KKN-PACKAGE =
                   CNS-CHAR-7
               THEN
      *----------  ワーク計算期間パッケージ.開始断面進捗STS＝'7'の場合
      *----------  ワーク計算期間パッケージ.直前基準日
                 MOVE  ZERO
                   TO  WK-TZ-KJN-YJMD   OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.直前基準日進捗STS
                 MOVE  CNS-SHINTK-STS2
                   TO  WK-TZ-KJN-YJMD-STS
                   OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.直前基準日=["
      D             WK-TZ-KJN-YJMD      OF  WK-CALC-KKN-PACKAGE "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.直前基準日進捗STS=["
      D             WK-TZ-KJN-YJMD-STS  OF  WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             IF  WK-START-DMN-FLG       OF  WK-CALC-KKN-PACKAGE =
                 CNS-CHAR-1
             THEN
      *----------  ワーク計算期間パッケージ.開始断面フラグ＝'1'の場合
               IF  WK-START-DMN-STS     OF  WK-CALC-KKN-PACKAGE =
                   CNS-CHAR-1
               THEN
      *----------  ワーク計算期間パッケージ.開始断面進捗STS＝'1'の場合
      *----------  ワーク計算期間パッケージ.直前基準日
                 MOVE  H-SS-SYORI-YMD   OF  H-TKDYAA40-3
                   TO  WK-TZ-KJN-YJMD   OF  WK-CALC-KKN-PACKAGE
      *----------  ワーク計算期間パッケージ.直前基準日進捗STS
                 MOVE  H-SHINTK-STS     OF  H-TKDYAA40-3
                   TO  WK-TZ-KJN-YJMD-STS
                   OF  WK-CALC-KKN-PACKAGE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.直前基準日=["
      D             WK-TZ-KJN-YJMD      OF  WK-CALC-KKN-PACKAGE "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.直前基準日進捗STS=["
      D             WK-TZ-KJN-YJMD-STS  OF  WK-CALC-KKN-PACKAGE "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             ELSE
               CONTINUE
             END-IF
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":***  3.2.3.5直前基準日と直前基準日進捗STSの編集 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BEF-KJN-STS-EDT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.4基準日断面情報INSERT処理と不要断面削除処理
      ******************************************************************
       KJN-DMN-INS-NDMN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":***  基準日断面情報INSERT処理と不要断面削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  INSERT用データパッケージ を初期化
                INITIALIZE  WK-INSERT-DATA-PAKAGE-1
      *----------  DELETE用データパッケージ を初期化
                INITIALIZE  WK-DELETE-DATA-PAKAGE-1
      *----------  DELETE用データパッケージ2 を初期化
                INITIALIZE  WK-DELETE-DATA-PAKAGE-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ=["
      D             WK-INSERT-DATA-PAKAGE-1"]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ=["
      D             WK-DELETE-DATA-PAKAGE-1"]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ2=["
      D             WK-DELETE-DATA-PAKAGE-2"]"
      *-----------------------------------------------------------------
      *----------  CNT-IDX←１
           MOVE  CNS-1                  TO  WK-CNT-IDX
      *----------  WK-IDX6←１
           MOVE  CNS-1                  TO  WK-IDX6
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX6=["WK-IDX6"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ.基準日数=["
      D             WK-KJN-NISU         OF   WK-KJN-SORT-PACKAGE"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KJN-DMN-INS-NDMN-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM   UNTIL
             WK-IDX6  > WK-KJN-NISU     OF  WK-KJN-SORT-PACKAGE
      *----------  INSERT用データパッケージ 編集
             PERFORM  INS-DAT-PACK-EDT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CNT-IDX=["WK-CNT-IDX"]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ("WK-CNT-IDX")["
      D             WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ("WK-CNT-IDX")["
      D    WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  進捗管理データッを物理削除する
             PERFORM  TKDYAA40-DAT-DEL-RTN
             IF  WK-CNT-IDX = CNS-100
             OR  WK-IDX6 = WK-KJN-NISU  OF  WK-KJN-SORT-PACKAGE
             THEN
      *----------  基準日断面情報INSERT処理
               MOVE  CNS-1              TO  WK-IDX9
               PERFORM    H-TKMZBW02-INS-RTN  UNTIL
               WK-IDX9  > WK-CNT-IDX
               PERFORM    KJN-YMD-KKN-INS-RTN
      *----------  不要断面削除処理
               PERFORM  IM-KKN-DEL-RTN
      *----------  DELETE用データパッケージ を初期化
                INITIALIZE  WK-DELETE-DATA-PAKAGE-1
               MOVE  CNS-1              TO  WK-CNT-IDX
               CONTINUE
             ELSE
               COMPUTE  WK-CNT-IDX = WK-CNT-IDX + CNS-1
               CONTINUE
             END-IF
      *----------  次のIDX6ループへ
             COMPUTE  WK-IDX6 = WK-IDX6 + 1
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KJN-DMN-INS-NDMN-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":*** 基準日断面情報INSERT処理と不要断面削除処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KJN-DMN-INS-NDMN-EXT.
           EXIT.
      ******************************************************************
      *     INSERT用データパッケージ 編集
      ******************************************************************
       INS-DAT-PACK-EDT-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  INSERT用データパッケージ 編集  START  ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象ポートフォリオ.処理実行日=["
      D    SYORI-YMD     OF  OBJ-PTF-PARM  OF  PARM-SMZJ1210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象ポートフォリオ.起動ID=["
      D    KIDOU-ID     OF  OBJ-PTF-PARM  OF  PARM-SMZJ1210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象ポートフォリオ.利用会社コード["
      D    RIYO-CMP-CD     OF  OBJ-PTF-PARM  OF  PARM-SMZJ1210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象ポートフォリオ.ファンドコード["
      D    FUND-CD     OF  OBJ-PTF-PARM  OF  PARM-SMZJ1210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象ポートフォリオ.ポートフォリオ["
      D    PTF-CD     OF  OBJ-PTF-PARM  OF  PARM-SMZJ1210-ARG1"]"
      *-----------------------------------------------------------------
      *----------  INSERT用データパッケージを編集する
      *----------  処理実行日
           MOVE  SYORI-YMD            OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-SYORI-YMD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  起動ID
           MOVE  KIDOU-ID             OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-KIDOU-ID
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-RIYO-CMP-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  ファンドコード
           MOVE  FUND-CD              OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-FUND-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  ポートフォリオコード
           MOVE  PTF-CD               OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-PTF-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.処理実行日=["
      D    WK-SYORI-YMD        OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.起動ID=["
      D    WK-KIDOU-ID         OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.利用会社コード"
      D    "=["WK-RIYO-CMP-CD  OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.ファンドコード"
      D    "=["WK-FUND-CD      OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.ポートフォリオ"
      D    "コード=["WK-PTF-CD OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-KJN-SHOSAI
                                        OF  WK-KJN-SORT-PACKAGE(WK-IDX6)
             TO  WK-KJN-YMD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ.基準日詳細"
      D             "(IDX6).基準日=["WK-KJN-YMD  OF  WK-KJN-SHOSAI
      D             OF  WK-KJN-SORT-PACKAGE(WK-IDX6)"]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日      =["
      D             WK-KJN-YMD  OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  順番
           MOVE  WK-IDX6
             TO  WK-JUNBAN      OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.順番        =["
      D             WK-JUNBAN   OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  開始基準日
           IF  WK-IDX6 = CNS-1
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX6=["WK-IDX6"]"
      *-----------------------------------------------------------------
      *----------  IDX6＝1の場合
             MOVE  WK-TZ-KJN-YJMD       OF  WK-CALC-KKN-PACKAGE
               TO  WK-KAISI-KJN-YMD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.直前基準日  =["
      D             WK-TZ-KJN-YJMD      OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.開始基準日  =["
      D    WK-KAISI-KJN-YMD    OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  WK-IDX6 > CNS-1
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX6=["WK-IDX6"]"
      *-----------------------------------------------------------------
      *----------  IDX6＞1の場合
             MOVE  WK-KJN-YMD          OF  WK-KJN-SHOSAI
               OF  WK-KJN-SORT-PACKAGE(WK-IDX6 - 1)
               TO  WK-KAISI-KJN-YMD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ.基準日詳細"
      D             "(IDX6-1).基準日 = [" WK-KJN-YMD   OF  WK-KJN-SHOSAI
      D              OF  WK-KJN-SORT-PACKAGE(WK-IDX6 - 1)  "]"
      D    DISPLAY  CNS-PGM-ID":開始基準日 = ["
      D    WK-KAISI-KJN-YMD    OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  開始基準日の翌日取得
           IF  WK-KAISI-KJN-YMD
           OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) = ZERO
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":開始基準日 = ["
      D    WK-KAISI-KJN-YMD    OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      *-----------------------------------------------------------------
      *----------  開始基準日の翌日
             MOVE  WK-JITSU-CALC-FROM   OF  WK-CALC-KKN-PACKAGE
               TO  WK-KAISI-KJN-YMD-NEXT
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":ワーク計算期間パッケージ.実計算From日(開始断面なし用)=["
      D             WK-JITSU-CALC-FROM  OF  WK-CALC-KKN-PACKAGE"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.開始基準日の翌日=["
      D    WK-KAISI-KJN-YMD-NEXT OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":開始基準日 = ["
      D    WK-KAISI-KJN-YMD    OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      *-----------------------------------------------------------------
             PERFORM    CALL-1020-KJN-AC-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1020戻り値.基準年月日２=["
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  開始基準日の翌日
             MOVE  IXCAL-KJN-YMD2       OF  PARM-SCZY1020-ARG1
               TO  WK-KAISI-KJN-YMD-NEXT
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.開始基準日の翌日=["
      D    WK-KAISI-KJN-YMD-NEXT OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           END-IF
      *----------  基準日種類
           MOVE  WK-KJN-YMD-SHRU        OF  WK-KJN-SHOSAI
                                        OF  WK-KJN-SORT-PACKAGE(WK-IDX6)
             TO  WK-KJN-YMD-SHRU
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日種類  =["
      D    WK-KJN-YMD-SHRU     OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           IF  WK-IDX6 = CNS-1
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX6=["WK-IDX6"]"
      *-----------------------------------------------------------------
      *----------  IDX6＝1の場合
             IF  WK-CALC-FROM           OF  WK-CALC-KKN-PACKAGE >=
                 WK-SABON-CALC-FROM     OF  WK-CALC-KKN-PACKAGE   AND
                 WK-KJN-YMD
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) <=
                 WK-SABON-CALC-TO       OF  WK-CALC-KKN-PACKAGE
             THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算Start日     =["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日    =["
      D             WK-KJN-YMD  OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算End日       =["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE   "]"
      *-----------------------------------------------------------------
      *----------  計算パターン
               MOVE  CNS-CHAR-1
                 TO  WK-CALC-PTN
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.計算パターン=["
      D    WK-CALC-PTN          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
             ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク計算期間パッケージ.計算From日=["
      D             WK-CALC-FROM        OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算Start日     =["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日    =["
      D    WK-KJN-YMD          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算End日       =["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE   "]"
      *-----------------------------------------------------------------
      *----------  計算パターン
               MOVE  CNS-CHAR-2
                 TO  WK-CALC-PTN
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.計算パターン=["
      D    WK-CALC-PTN          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-----------------------------------------------------------------
           IF  WK-IDX6 > 1 AND
               WK-IDX6 < WK-KJN-NISU    OF  WK-KJN-SORT-PACKAGE
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX6=["WK-IDX6"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-SORT-PACKAGE "]"
      *-----------------------------------------------------------------
      *----------  1＜IDX6＜ワーク基準日ソートパッケージ.基準日数の場合
             IF  WK-KAISI-KJN-YMD-NEXT
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) >=
                 WK-SABON-CALC-FROM     OF  WK-CALC-KKN-PACKAGE   AND
                 WK-KJN-YMD
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) <=
                 WK-SABON-CALC-TO       OF  WK-CALC-KKN-PACKAGE
             THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.開始基準日の翌日    =["
      D    WK-KAISI-KJN-YMD-NEXT OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算Start日     =["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日    =["
      D    WK-KJN-YMD          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算End日       =["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE   "]"
      *-----------------------------------------------------------------
      *----------  計算パターン
               MOVE  CNS-CHAR-1
                 TO  WK-CALC-PTN
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.計算パターン=["
      D    WK-CALC-PTN          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
             ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.開始基準日の翌日    =["
      D    WK-KAISI-KJN-YMD-NEXT OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算Start日     =["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日    =["
      D    WK-KJN-YMD          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算End日       =["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE   "]"
      *-----------------------------------------------------------------
      *----------  計算パターン
               MOVE  CNS-CHAR-2
                 TO  WK-CALC-PTN
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.計算パターン=["
      D    WK-CALC-PTN          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-----------------------------------------------------------------
           IF  WK-IDX6 = WK-KJN-NISU    OF  WK-KJN-SORT-PACKAGE
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX6=["WK-IDX6"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日ソートパッケージ.基準日数=["
      D             WK-KJN-NISU         OF  WK-KJN-SORT-PACKAGE "]"
      *-----------------------------------------------------------------
      *----------  IDX6＝ワーク基準日ソートパッケージ.基準日数の場合
             IF  WK-KJN-YMD-SHRU
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) NOT = CNS-CHAR-2
                 AND WK-IDX6 NOT = CNS-1
             THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日種類=["
      D    WK-KJN-YMD-SHRU     OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      *-----------------------------------------------------------------
      *--------  INSERT用データパッケージ.基準日種類≠'2'(アウト決算日)の場合
               IF  WK-KAISI-KJN-YMD-NEXT
                   OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) >=
                   WK-SABON-CALC-FROM   OF  WK-CALC-KKN-PACKAGE   AND
                   WK-SITEI-TO          OF  WK-DATA-IN   <=
                   WK-SABON-CALC-TO     OF  WK-CALC-KKN-PACKAGE
               THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.開始基準日の翌日    =["
      D    WK-KAISI-KJN-YMD-NEXT OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算Start日     =["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.指定To日                      =["
      D             WK-SITEI-TO         OF  WK-DATA-IN            "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算End日       =["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE   "]"
      *-----------------------------------------------------------------
      *----------  計算パターン
                 MOVE  CNS-CHAR-1
                   TO  WK-CALC-PTN
                   OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.計算パターン=["
      D    WK-CALC-PTN          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
               ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.開始基準日の翌日    =["
      D    WK-KAISI-KJN-YMD-NEXT OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算Start日     =["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.指定To日                      =["
      D             WK-SITEI-TO         OF  WK-DATA-IN            "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算End日       =["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE   "]"
      *-----------------------------------------------------------------
      *----------  計算パターン
                MOVE  CNS-CHAR-2
                   TO  WK-CALC-PTN
                   OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.計算パターン=["
      D    WK-CALC-PTN          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
               END-IF
             ELSE
               CONTINUE
             END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日種類=["
      D    WK-KJN-YMD-SHRU     OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      *-----------------------------------------------------------------
             IF  WK-KJN-YMD-SHRU
                 OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) = CNS-CHAR-2
             THEN
      *--------  INSERT用データパッケージ.基準日種類＝'2'(アウト決算日)の場合
               IF  WK-SITEI-TO          OF  WK-DATA-IN           >=
                   WK-SABON-CALC-FROM   OF  WK-CALC-KKN-PACKAGE  AND
                   WK-SITEI-TO          OF  WK-DATA-IN           <=
                   WK-SABON-CALC-TO     OF  WK-CALC-KKN-PACKAGE
               THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算Start日     =["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.指定To日                      =["
      D             WK-SITEI-TO         OF  WK-DATA-IN            "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算End日       =["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE   "]"
      *-----------------------------------------------------------------
      *----------  計算パターン
                 MOVE  CNS-CHAR-1
                   TO  WK-CALC-PTN
                   OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.計算パターン=["
      D    WK-CALC-PTN          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
               ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算Start日     =["
      D             WK-SABON-CALC-FROM  OF  WK-CALC-KKN-PACKAGE   "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.指定To日                      =["
      D             WK-SITEI-TO         OF  WK-DATA-IN            "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク計算期間パッケージ.差分計算End日       =["
      D             WK-SABON-CALC-TO    OF  WK-CALC-KKN-PACKAGE   "]"
      *-----------------------------------------------------------------
      *----------  計算パターン
                 MOVE  CNS-CHAR-2
                   TO  WK-CALC-PTN
                   OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.計算パターン=["
      D    WK-CALC-PTN          OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
               END-IF
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *----------  基本会計ベースフラグ
           MOVE  CNS-CHAR-SPACE
             TO  WK-KH-KAIKEI-BASE-FLG
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基本会計ベース"
      D             "フラグ=["
      D    WK-KH-KAIKEI-BASE-FLG OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  進捗ステータス（開始基準日）
           IF  WK-IDX6 = CNS-1
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX6=["WK-IDX6"]"
      *-----------------------------------------------------------------
             MOVE  WK-TZ-KJN-YJMD-STS   OF  WK-CALC-KKN-PACKAGE
               TO  WK-STK-STS-KS-KJN-YMD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.進捗ステータス"
      D             "（開始基準日）=["
      D    WK-STK-STS-KS-KJN-YMD OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  進捗ステータス（基準日）
           MOVE  CNS-CHAR-SPACE
             TO  WK-STK-STS-KJN-YMD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.進捗ステータス"
      D             "（基準日） =["
      D    WK-STK-STS-KJN-YMD   OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  異動計算パターンコード
           MOVE  CNS-CHAR-SPACE
             TO  WK-IDO-CALC-PATTERN-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.異動計算"
      D             "パターンコード =["WK-IDO-CALC-PATTERN-CD
      D             OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  保有目的
           MOVE  CNS-CHAR-SPACE
             TO  WK-POSSESSION-OBJECT
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.保有目的 =["
      D    WK-POSSESSION-OBJECT OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  運用通貨コード
           MOVE  CNS-CHAR-SPACE
             TO  WK-CAPITAL-TUKA-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.運用通貨"
      D             "コード =["
      D    WK-CAPITAL-TUKA-CD  OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           IF  WK-KJN-YMD-SHRU
           OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)  = CNS-CHAR-0
           OR  WK-KJN-YMD-SHRU
           OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)  = CNS-CHAR-4
           OR  WK-KJN-YMD-SHRU
           OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)  = CNS-CHAR-5
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日種類=["
      D    WK-KJN-YMD-SHRU      OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  基準日断面作成区分
             MOVE  CNS-CHAR-1
               TO  WK-KYJ-YMD-DMN-SK-KBN
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日断面作成"
      D             "区分   =["
      D    WK-KYJ-YMD-DMN-SK-KBN OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日種類=["
      D    WK-KJN-YMD-SHRU     OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      *-----------------------------------------------------------------
      *----------  基準日断面作成区分
             MOVE  SPACE
               TO  WK-KYJ-YMD-DMN-SK-KBN
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日断面作成"
      D             "区分   =["
      D    WK-KYJ-YMD-DMN-SK-KBN OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           END-IF
      *----------  更新ログインユーザ会社コード
              MOVE  RIYO-CMP-CD         OF  OBJ-PTF-PARM
                                        OF  PARM-SMZJ1210-ARG1
                TO  WK-UPD-LOGIN-CMP-CD
                OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D    WK-UPD-LOGIN-CMP-CD OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID":IDX6=["WK-IDX6"]"
      D    DISPLAY  CNS-PGM-ID":WK-CNT-IDX=["WK-CNT-IDX"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.指定From日 =["
      D             WK-SITEI-FROM       OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.開始基準日の翌日    =["
      D    WK-KAISI-KJN-YMD-NEXT OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  指定FROM日前の未処理有無判断処理
           IF WK-IDX6 = CNS-1 AND WK-CNT-IDX = CNS-1
             AND WK-SITEI-FROM       OF  WK-DATA-IN NOT = CNS-0
             AND WK-KAISI-KJN-YMD-NEXT
              OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
              < WK-SITEI-FROM       OF  WK-DATA-IN
           THEN
      *----------  ARG3.警告フラグ
             MOVE  CNS-WARN-FLG-D3
               TO  WARN-FLG             OF  PARM-SMZJ1210-ARG3
      *----------  ARG3.開始基準日翌日
             MOVE  WK-KAISI-KJN-YMD-NEXT
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
               TO  KAISI-KJN-YMD-NEXT  OF  PARM-SMZJ1210-ARG3
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG3.警告フラグ=["
      D             WARN-FLG            OF  PARM-SMZJ1210-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":ARG3.開始基準日翌日=["
      D             KAISI-KJN-YMD-NEXT  OF  PARM-SMZJ1210-ARG3"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.開始基準日=["
      D    WK-KAISI-KJN-YMD OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日=["
      D    WK-KJN-YMD       OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) "]"
      *-----------------------------------------------------------------
      *----------  DELETE用データパッケージ[CNT-IDX]を編集
      *----------  DELETE用データパッケージ[CNT-IDX].利用会社コード
           MOVE  RIYO-CMP-CD          OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-RIYO-CMP-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX)
      *----------  DELETE用データパッケージ[CNT-IDX].ファンドコード
           MOVE  FUND-CD              OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-FUND-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX)
      *----------  DELETE用データパッケージ[CNT-IDX].ポートフォリオコード
           MOVE  PTF-CD               OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-PTF-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX)
      *----------  DELETE用データパッケージ[CNT-IDX].開始基準日
           MOVE  WK-KAISI-KJN-YMD OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
             TO  WK-KAISI-KJN-YMD OF WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX)
      *----------  DELETE用データパッケージ[CNT-IDX].基準日
           MOVE  WK-KJN-YMD       OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
             TO  WK-KJN-YMD       OF WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ.利用会社コード"
      D    "=["WK-RIYO-CMP-CD OF WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ.ファンドコード"
      D    "=["WK-FUND-CD OF WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ.ポートフォリオ"
      D    "=["WK-PTF-CD OF WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ.開始基準日=["
      D    WK-KAISI-KJN-YMD OF WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ.基準日=["
      D    WK-KJN-YMD       OF WK-DELETE-DATA-PAKAGE1(WK-CNT-IDX) "]"
      *-----------------------------------------------------------------
      *----------  DELETE用データパッケージ2[CNT-IDX]を編集
      *----------  DELETE用データパッケージ2[CNT-IDX].利用会社コード
           MOVE  RIYO-CMP-CD          OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-RIYO-CMP-CD
             OF  WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX)
      *----------  DELETE用データパッケージ2[CNT-IDX].ファンドコード
           MOVE  FUND-CD              OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-FUND-CD
             OF  WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX)
      *----------  DELETE用データパッケージ2[CNT-IDX].ポートフォリオコード
           MOVE  PTF-CD               OF  OBJ-PTF-PARM
                                      OF  PARM-SMZJ1210-ARG1
             TO  WK-PTF-CD
             OF  WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX)
      *----------  DELETE用データパッケージ2[CNT-IDX].評価系列コード
      *    MOVE  SPACE
      *      TO  WK-HYK-KRTU-CD
      *      OF  WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX)
      *----------  DELETE用データパッケージ2[CNT-IDX].開始基準日
           MOVE  WK-KAISI-KJN-YMD OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
             TO  WK-KAISI-KJN-YMD OF WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX)
      *----------  DELETE用データパッケージ2[CNT-IDX].基準日
           MOVE  WK-KJN-YMD       OF WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
             TO  WK-KJN-YMD       OF WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ2.利用会社"
      D   "コード=["WK-RIYO-CMP-CD OF WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX)
      D   "]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ2.ファンド"
      D    "コード=["WK-FUND-CD OF WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ2.ポートフォリ"
      D    "オ=["WK-PTF-CD OF WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX) "]"
      *D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ2.評価系列"
      *D    "コード=["WK-HYK-KRTU-CD
      *D    OF WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ2.開始基準日=["
      D    WK-KAISI-KJN-YMD OF WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID":DELETE用データパッケージ2.基準日=["
      D    WK-KJN-YMD       OF WK-DELETE-DATA-PAKAGE2(WK-CNT-IDX) "]"
      D    DISPLAY  CNS-PGM-ID ":ＧＩＰＳモード=["
      D             GIPS-MODE    OF PARM-SMZJ1210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":IDX6=["WK-IDX6"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク基準日ソートパッケージ.基準日"
      D    "詳細(IDX6).基準日=["WK-KJN-YMD     OF WK-KJN-SHOSAI
      D                         OF WK-KJN-SORT-PACKAGE(WK-IDX6)"]"
      *-----------------------------------------------------------------
      *----------  ARG1.ＧＩＰＳモード＝1：ＧＩＰＳモードの場合
           IF  GIPS-MODE    OF PARM-SMZJ1210-ARG1 = CNS-1
           THEN
      *----------  削除用元1210情報パッケージを編集
             MOVE  WK-IDX6        TO  KJN-NISU  OF DEL-1210-PACKAGE
                                  OF  PARM-SMZJ1210-ARG3
      *----------  基準日詳細[IDX6].基準日
             MOVE  WK-KJN-YMD     OF WK-KJN-SHOSAI
                                  OF WK-KJN-SORT-PACKAGE(WK-IDX6)
               TO  KJN-YMD        OF KJN-YMD-SYOSAI
                                  OF DEL-1210-PACKAGE(WK-IDX6)
      *----------  基準日詳細[IDX6].開始基準日
             IF    WK-IDX6 = CNS-1
             THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク計算期間パッケージ.直前基準日=["
      D             WK-TZ-KJN-YJMD OF WK-CALC-KKN-PACKAGE"]"
      *-----------------------------------------------------------------
                MOVE  WK-TZ-KJN-YJMD OF WK-CALC-KKN-PACKAGE
                  TO  KAISI-KJN-YMD  OF KJN-YMD-SYOSAI
                                     OF DEL-1210-PACKAGE(WK-IDX6)
             ELSE
                COMPUTE WK-IDX6-1 = WK-IDX6 - CNS-1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク基準日ソートパッケージ.基準日"
      D    "詳細(IDX6).基準日=["WK-KJN-YMD     OF WK-KJN-SHOSAI
      D                         OF WK-KJN-SORT-PACKAGE(WK-IDX6-1)"]"
      D             GIPS-MODE   OF PARM-SMZJ1210-ARG1"]"
      *-----------------------------------------------------------------
                MOVE  WK-KJN-YMD     OF WK-KJN-SHOSAI
                                     OF WK-KJN-SORT-PACKAGE(WK-IDX6-1)
                  TO  KAISI-KJN-YMD  OF KJN-YMD-SYOSAI
                                     OF DEL-1210-PACKAGE(WK-IDX6)
             END-IF
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準日詳細[IDX6].基準日=["
      D             KJN-YMD     OF KJN-YMD-SYOSAI
      D                         OF DEL-1210-PACKAGE(WK-IDX6)"]"
      D    DISPLAY  CNS-PGM-ID ":基準日詳細[IDX6].開始基準日=["
      D             KAISI-KJN-YMD  OF KJN-YMD-SYOSAI
      D                         OF DEL-1210-PACKAGE(WK-IDX6)"]"
      *-----------------------------------------------------------------
      *----------  ワークデータセットフラグ
           MOVE  ZERO                   TO  WK-DATA-SET-FLG
      *----------  ポートフォリオ関連項目を編集する
           PERFORM  PTF-CONN-PRO-EDT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***   INSERT用データパッケージ 編集  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INS-DAT-PACK-EDT-EXT.
           EXIT.
      ******************************************************************
      *     開始基準日の翌日取得
      ******************************************************************
       CALL-1020-KJN-AC-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  開始基準日の翌日取得 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SCZY1020-INOUT
                        PARM-SCZY1020-RTNPKG
      *----------  【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
           MOVE  WK-KAISI-KJN-YMD
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
             TO  IXCAL-KJN-YMD1        OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
           MOVE  CNS-1
             TO  IXCAL-COMP-BASE       OF  PARM-SCZY1020-ARG1
      *----------  日数
           MOVE  CNS-1
             TO  IXCAL-DAYS            OF  PARM-SCZY1020-ARG1
      *----------  単位区分
           MOVE  CNS-1
             TO  IXCAL-TANI-KBN        OF  PARM-SCZY1020-ARG1
      *----------  機能区分
           MOVE  CNS-3
             TO  IXCAL-FUNCTION        OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
           MOVE  CNS-1
             TO  IXCAL-ZENGO-KBN-1     OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":SCZY1020】に接続用パラメータの設定を行なう"
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE    OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数                        =["
      D             IXCAL-DAYS         OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1  OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  カレンダールーチン【SCZY1020】をコールして、リターンパッケージを取得する
           MOVE  CNS-POS-059           TO  WK-ERR-POS4
           PERFORM  CALL-SCZY1020-RTN
           CONTINUE.
       CALL-1020-KJN-AC-EXT.
           EXIT.
      ******************************************************************
      *     ポートフォリオ関連項目を編集する
      ******************************************************************
       PTF-CONN-PRO-EDT-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ関連項目を編集する  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-1                  TO  WK-IDX7
           MOVE  CNS-0                  TO  WK-IDX7-LOOP-FLAG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX7=["WK-IDX7"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間数=["WK-KKN-SU    OF  WK-PTF-INFO-PACKAGE"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [PTF-CONN-PRO-EDT-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  PTF-RELA-PRO-EDI-RTN  UNTIL
             WK-IDX7 > WK-KKN-SU  OF  WK-PTF-INFO-PACKAGE OR
             WK-IDX7-LOOP-FLAG = 1
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [PTF-CONN-PRO-EDT-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           IF  WK-DATA-SET-FLG          =  ZERO
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークデータセットフラグ＝0の場合"
      *-----------------------------------------------------------------
      *----------  INSERT用データパッケージ.異動計算パターンコード
             MOVE  WK-IDO-CALC-PATTERN-CD
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-IDO-CALC-PATTERN-CD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.保有目的
             MOVE  WK-POSSESSION-OBJECT
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-POSSESSION-OBJECT
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.運用通貨コード
             MOVE  WK-CAPITAL-TUKA-CD
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-CAPITAL-TUKA-CD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.基本会計ベースフラグ
             MOVE  WK-KH-KAIKEI-BASE-FLG
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-KH-KAIKEI-BASE-FLG
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.仕訳基準パターンコード
             MOVE  WK-SWK-KJN-PTN-CD    OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-SWK-KJN-PTN-CD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.測定基準区分
             MOVE  WK-ST-KJN-KBN        OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-ST-KJN-KBN
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.日次評価法フラグ
             MOVE  WK-NITIJI-HYK-FLG    OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-NITIJI-HYK-FLG
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.料率パターンコード
             MOVE  WK-COMMISSION-PATTERN
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-COMMISSION-PATTERN
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.約定主義会計フラグ
             MOVE  WK-YKJ-SYUGI-KAIKEI
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-YKJ-SYUGI-KAIKEI
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.キャッシュフロー２回発生区分
             MOVE  WK-CASH-FLOW-KBN
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-CASH-FLOW-KBN
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.約定レートコード
             MOVE  WK-YKJ-RATE-CD
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-YKJ-RATE-CD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.未収配当計上割合
             MOVE  WK-MISYU-HAITOU-WARIAI
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(CNS-1)
               TO  WK-MISYU-HAITOU-WARIAI
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.異動計算パターンコード=["
      D             WK-IDO-CALC-PATTERN-CD
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.保有目的 =["
      D             WK-POSSESSION-OBJECT
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.運用通貨コード =["
      D             WK-CAPITAL-TUKA-CD
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.基本会計ベースフラグ =["
      D             WK-KH-KAIKEI-BASE-FLG
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.仕訳基準パターンコード=["
      D             WK-SWK-KJN-PTN-CD
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.測定基準区分=["
      D             WK-ST-KJN-KBN
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.日次評価法フラグ=["
      D             WK-NITIJI-HYK-FLG
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.料率パターンコード=["
      D             WK-COMMISSION-PATTERN
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.約定主義会計フラグ=["
      D             WK-YKJ-SYUGI-KAIKEI
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D       ":INSERT用データパッケージ.キャッシュフロー２回発生区分=["
      D             WK-CASH-FLOW-KBN
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D       ":INSERT用データパッケージ.約定レートコード=["
      D             WK-YKJ-RATE-CD
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D       ":INSERT用データパッケージ.未収配当計上割合=["
      D             WK-MISYU-HAITOU-WARIAI
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークデータセットフラグ≠0の場合"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ関連項目を編集する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-CONN-PRO-EDT-EXT.
           EXIT.
      ******************************************************************
      *    項目を編集する
      ******************************************************************
       PTF-RELA-PRO-EDI-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  項目を編集する  START  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.開始基準日の翌日=["
      D             WK-KAISI-KJN-YMD-NEXT
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア("WK-IDX7").期間From            =["
      D             WK-KKN1-FROM-YMD    OF  WK-KKN-ARE
      D                             OF  WK-PTF-INFO-PACKAGE(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":INSERT用データパッケージ.基準日=["
      D             WK-KJN-YMD  OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオ情報パッケージ."
      D             "期間エリア("WK-IDX7").期間To              =["
      D             WK-KKN1-TO-YMD      OF  WK-KKN-ARE
      D                             OF  WK-PTF-INFO-PACKAGE(WK-IDX7)"]"
      *-----------------------------------------------------------------
           IF  WK-KJN-YMD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) >=
               WK-KKN1-FROM-YMD         OF  WK-KKN-ARE
               OF  WK-PTF-INFO-PACKAGE(WK-IDX7)   AND
               WK-KJN-YMD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX) <=
               WK-KKN1-TO-YMD           OF  WK-KKN-ARE
               OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
           THEN
      *----------  データセット
      *----------  INSERT用データパッケージ.異動計算パターンコード
             MOVE  WK-IDO-CALC-PATTERN-CD
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-IDO-CALC-PATTERN-CD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.保有目的
             MOVE  WK-POSSESSION-OBJECT
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-POSSESSION-OBJECT
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.運用通貨コード
             MOVE  WK-CAPITAL-TUKA-CD
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-CAPITAL-TUKA-CD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.基本会計ベースフラグ
             MOVE  WK-KH-KAIKEI-BASE-FLG
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-KH-KAIKEI-BASE-FLG
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.仕訳基準パターンコード
             MOVE  WK-SWK-KJN-PTN-CD    OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-SWK-KJN-PTN-CD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.測定基準区分
             MOVE  WK-ST-KJN-KBN        OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-ST-KJN-KBN
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.日次評価法フラグ
             MOVE  WK-NITIJI-HYK-FLG    OF  WK-KKN-ARE
                                        OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-NITIJI-HYK-FLG
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.料率パターンコード
             MOVE  WK-COMMISSION-PATTERN
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-COMMISSION-PATTERN
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.約定主義会計フラグ
             MOVE  WK-YKJ-SYUGI-KAIKEI
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-YKJ-SYUGI-KAIKEI
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.キャッシュフロー２回発生区分
             MOVE  WK-CASH-FLOW-KBN
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-CASH-FLOW-KBN
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.約定レートコード
             MOVE  WK-YKJ-RATE-CD
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-YKJ-RATE-CD
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  INSERT用データパッケージ.未収配当計上割合
             MOVE  WK-MISYU-HAITOU-WARIAI
               OF  WK-KKN-ARE           OF  WK-PTF-INFO-PACKAGE(WK-IDX7)
               TO  WK-MISYU-HAITOU-WARIAI
               OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
      *----------  ワークデータセットフラグ
             MOVE  CNS-1                TO  WK-DATA-SET-FLG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.異動計算パターンコード=["
      D             WK-IDO-CALC-PATTERN-CD
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.保有目的 =["
      D             WK-POSSESSION-OBJECT
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.運用通貨コード =["
      D             WK-CAPITAL-TUKA-CD
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.基本会計ベースフラグ =["
      D             WK-KH-KAIKEI-BASE-FLG
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.仕訳基準パターンコード=["
      D             WK-SWK-KJN-PTN-CD
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.測定基準区分=["
      D             WK-ST-KJN-KBN
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.日次評価法フラグ=["
      D             WK-NITIJI-HYK-FLG
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.料率パターンコード=["
      D             WK-COMMISSION-PATTERN
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":INSERT用データパッケージ.約定主義会計フラグ=["
      D             WK-YKJ-SYUGI-KAIKEI
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D       ":INSERT用データパッケージ.キャッシュフロー２回発生区分=["
      D             WK-CASH-FLOW-KBN
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D       ":INSERT用データパッケージ.約定レートコード=["
      D             WK-YKJ-RATE-CD
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID
      D       ":INSERT用データパッケージ.未収配当計上割合=["
      D             WK-MISYU-HAITOU-WARIAI
      D             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークデータセットフラグ  =["
      D             WK-DATA-SET-FLG"]"
      *-----------------------------------------------------------------
             MOVE  CNS-1                TO  WK-IDX7-LOOP-FLAG
           ELSE
             COMPUTE  WK-IDX7 = WK-IDX7 + 1
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 項目を編集する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-RELA-PRO-EDI-EXT.
           EXIT.
      ******************************************************************
      *     H-TKMZBW02-I  SET処理
      ******************************************************************
       H-TKMZBW02-INS-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZBW02-I  SET処理  START ***"
      D    DISPLAY  CNS-PGM-ID":WK-IDX9           =["WK-IDX9"]"
      *-----------------------------------------------------------------
      *----------  基準日断面情報TBL
           MOVE  WK-TBL-TKMZBW02
             TO  SQL-TKMZBW02           OF  SQL-INSERT-1-9
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-SYORI-YMD            OF  H-TKMZBW02-I(WK-IDX9)
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-KIDOU-ID             OF  H-TKMZBW02-I(WK-IDX9)
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW02-I(WK-IDX9)
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-FUND-CD              OF  H-TKMZBW02-I(WK-IDX9)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-PTF-CD               OF  H-TKMZBW02-I(WK-IDX9)
      *----------  基準日
           MOVE  WK-KJN-YMD
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-KJN-YMD              OF  H-TKMZBW02-I(WK-IDX9)
      *----------  順番
           MOVE  WK-JUNBAN
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-JUNBAN               OF  H-TKMZBW02-I(WK-IDX9)
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-KAISI-KJN-YMD        OF  H-TKMZBW02-I(WK-IDX9)
      *----------  開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-KAISI-KJN-YMD-NEXT   OF  H-TKMZBW02-I(WK-IDX9)
      *----------  基準日種類
           MOVE  WK-KJN-YMD-SHRU
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-KJN-YMD-SHRU         OF  H-TKMZBW02-I(WK-IDX9)
      *----------  基準日断面作成区分
           MOVE  WK-KYJ-YMD-DMN-SK-KBN
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-KYJ-YMD-DMN-SK-KBN   OF  H-TKMZBW02-I(WK-IDX9)
      *----------  計算パターン
           MOVE  WK-CALC-PTN
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-CALC-PTN             OF  H-TKMZBW02-I(WK-IDX9)
      *----------  仕訳基準パターンコード
           MOVE  WK-SWK-KJN-PTN-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-SWK-KJN-PTN-CD       OF  H-TKMZBW02-I(WK-IDX9)
      *----------  基本会計ベースフラグ
           MOVE  WK-KH-KAIKEI-BASE-FLG
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-KH-KAIKEI-BASE-FLG   OF  H-TKMZBW02-I(WK-IDX9)
      *----------  測定基準区分
           MOVE  WK-ST-KJN-KBN
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-ST-KJN-KBN           OF  H-TKMZBW02-I(WK-IDX9)
      *----------  進捗ステータス（開始基準日）
           MOVE  WK-STK-STS-KS-KJN-YMD
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-STK-STS-KS-KJN-YMD   OF  H-TKMZBW02-I(WK-IDX9)
      *----------  進捗ステータス（基準日）
           MOVE  WK-STK-STS-KJN-YMD
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-STK-STS-KJN-YMD      OF  H-TKMZBW02-I(WK-IDX9)
      *----------  異動計算パターンコード
           MOVE  WK-IDO-CALC-PATTERN-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-IDO-CALC-PATTERN-CD  OF  H-TKMZBW02-I(WK-IDX9),
      *----------  保有目的
           MOVE  WK-POSSESSION-OBJECT
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-POSSESSION-OBJECT    OF  H-TKMZBW02-I(WK-IDX9)
      *----------  運用通貨コード
           MOVE  WK-CAPITAL-TUKA-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-CAPITAL-TUKA-CD      OF  H-TKMZBW02-I(WK-IDX9)
      *----------  日次評価法フラグ
           MOVE  WK-NITIJI-HYK-FLG
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-NITIJI-HYK-FLG       OF  H-TKMZBW02-I(WK-IDX9)
      *----------  料率パターンコード
           MOVE  WK-COMMISSION-PATTERN
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-COMMISSION-PATTERN   OF  H-TKMZBW02-I(WK-IDX9)
      *----------  約定主義会計フラグ
           MOVE  WK-YKJ-SYUGI-KAIKEI
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-YKJ-SYUGI-KAIKEI     OF  H-TKMZBW02-I(WK-IDX9)
      *----------  キャッシュフロー２回発生区分
           MOVE  WK-CASH-FLOW-KBN
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-CASH-FLOW-KBN        OF  H-TKMZBW02-I(WK-IDX9)
      *----------  約定レートコード
           MOVE  WK-YKJ-RATE-CD
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-YKJ-RATE-CD          OF  H-TKMZBW02-I(WK-IDX9)
      *----------  未収配当計上割合
           MOVE  WK-MISYU-HAITOU-WARIAI
             OF  WK-INSERT-DATA-PAKAGE(WK-IDX9)
             TO  H-MISYU-HAITOU-WARIAI  OF  H-TKMZBW02-I(WK-IDX9)
      *----------  更新ログインユーザ会社コード
           MOVE  WK-UPD-LOGIN-CMP-CD    OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW02-I(WK-IDX9)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日           =["
      D             H-SYORI-YMD         OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":起動ID               =["
      D             H-KIDOU-ID          OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード       =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード       =["
      D             H-FUND-CD           OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD            OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":基準日               =["
      D             H-KJN-YMD           OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":順番                 =["
      D             H-JUNBAN            OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日           =["
      D             H-KAISI-KJN-YMD     OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日     =["
      D             H-KAISI-KJN-YMD-NEXT  OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":基準日種類           =["
      D             H-KJN-YMD-SHRU      OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面作成区分   =["
      D             H-KYJ-YMD-DMN-SK-KBN  OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":計算パターン         =["
      D             H-CALC-PTN          OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":仕訳基準パターンコード=["
      D             H-SWK-KJN-PTN-CD    OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ =["
      D             H-KH-KAIKEI-BASE-FLG
      D                                 OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":測定基準区分         =["
      D             H-ST-KJN-KBN        OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス（開始基準日）=["
      D             H-STK-STS-KS-KJN-YMD
      D                                 OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス（基準日）    =["
      D             H-STK-STS-KJN-YMD   OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":異動計算パターンコード      =["
      D             H-IDO-CALC-PATTERN-CD
      D                                 OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":保有目的                    =["
      D             H-POSSESSION-OBJECT
      D                                 OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨コード              =["
      D             H-CAPITAL-TUKA-CD   OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":日次評価法フラグ            =["
      D             H-NITIJI-HYK-FLG    OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":料率パターンコード          =["
      D             H-COMMISSION-PATTERN  OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":約定主義会計フラグ          =["
      D             H-YKJ-SYUGI-KAIKEI   OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":キャッシュフロー２回発生区分=["
      D             H-CASH-FLOW-KBN    OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":約定レートコード            =["
      D             H-YKJ-RATE-CD  OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":未収配当計上割合            =["
      D             H-MISYU-HAITOU-WARIAI  OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW02-I(WK-IDX9)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZBW02-I  SET処理   END  ***"
      *-----------------------------------------------------------------
      *----------  WK-IDX9 + 1
             COMPUTE   WK-IDX9 = WK-IDX9 + 1
           CONTINUE.
       H-TKMZBW02-INS-EXT.
           EXIT.
      ******************************************************************
      *     WK-MSG-1-9  SET処理
      ******************************************************************
       WK-MSG-1-9-EDIT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-9  SET処理  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  H-SYORI-YMD            OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-SYORI-YMD           OF  WK-MSG-1-9
      *----------  起動ID
           MOVE  H-KIDOU-ID             OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-KIDOU-ID            OF  WK-MSG-1-9
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-9
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-9
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-9
      *----------  基準日
           MOVE  H-KJN-YMD              OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-9
      *----------  順番
           MOVE  H-JUNBAN               OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-JUNBAN              OF  WK-MSG-1-9
      *----------  開始基準日
           MOVE  H-KAISI-KJN-YMD        OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-9
      *----------  開始基準日の翌日
           MOVE  H-KAISI-KJN-YMD-NEXT   OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD-NEXT  OF  WK-MSG-1-9
      *----------  基準日種類
           MOVE  H-KJN-YMD-SHRU         OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-KJN-YMD-SHRU        OF  WK-MSG-1-9
      *----------  基準日断面作成区分
           MOVE  H-KYJ-YMD-DMN-SK-KBN   OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-KYJ-YMD-DMN-SK-KBN  OF  WK-MSG-1-9
      *----------  計算パターン
           MOVE  H-CALC-PTN             OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-CALC-PTN            OF  WK-MSG-1-9
      *----------  仕訳基準パターンコード
           MOVE  H-SWK-KJN-PTN-CD       OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-SWK-KJN-PTN-CD      OF  WK-MSG-1-9
      *----------  基本会計ベースフラグ
           MOVE  H-KH-KAIKEI-BASE-FLG   OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-KH-KAIKEI-BASE-FLG  OF  WK-MSG-1-9
      *----------  測定基準区分
           MOVE  H-ST-KJN-KBN           OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-ST-KJN-KBN          OF  WK-MSG-1-9
      *----------  進捗ステータス（開始基準日）
           MOVE  H-STK-STS-KS-KJN-YMD   OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-STK-STS-KS-KJN-YMD  OF  WK-MSG-1-9
      *----------  進捗ステータス（基準日）
           MOVE  H-STK-STS-KJN-YMD      OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-STK-STS-KJN-YMD     OF  WK-MSG-1-9
      *----------  異動計算パターンコード
           MOVE  H-IDO-CALC-PATTERN-CD  OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-IDO-CALC-PATTERN-CD OF  WK-MSG-1-9
      *----------  保有目的
           MOVE  H-POSSESSION-OBJECT    OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-POSSESSION-OBJECT   OF  WK-MSG-1-9
      *----------  運用通貨コード
           MOVE  H-CAPITAL-TUKA-CD      OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-CAPITAL-TUKA-CD     OF  WK-MSG-1-9
      *----------  日次評価法フラグ
           MOVE  H-NITIJI-HYK-FLG       OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-NITIJI-HYK-FLG      OF  WK-MSG-1-9
      *----------  料率パターンコード
           MOVE  H-COMMISSION-PATTERN   OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-COMMISSION-PATTERN  OF  WK-MSG-1-9
      *----------  約定主義会計フラグ
           MOVE  H-YKJ-SYUGI-KAIKEI     OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-YKJ-SYUGI-KAIKEI    OF  WK-MSG-1-9
      *----------  キャッシュフロー２回発生区分
           MOVE  H-CASH-FLOW-KBN        OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-CASH-FLOW-KBN       OF  WK-MSG-1-9
      *----------  約定レートコード
           MOVE  H-YKJ-RATE-CD          OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-YKJ-RATE-CD         OF  WK-MSG-1-9
      *----------  未収配当計上割合
           MOVE  H-MISYU-HAITOU-WARIAI  OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-MISYU-HAITOU-WARIAI OF  WK-MSG-1-9
      *----------  更新ログインユーザ会社コード
           MOVE  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW02-I(SQLERRD(3) + 1)
             TO  WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-9
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-9           =[" WK-MSG-1-9"]"
      D             ":***  WK-MSG-1-9  SET処理   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-9-EDIT-EXT.
           EXIT.
      ******************************************************************
      *     基準日断面情報INSERT処理
      ******************************************************************
       KJN-YMD-KKN-INS-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  基準日断面情報INSERT & DELETE処理 START ***"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEION@@
      *    MOVE  SQL-INSERT-1-9         TO  SQLSTMT                     @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
           INITIALIZE  SQLSTMT9-ARR                                     @3212SEION@@
           MOVE  1                      TO  SQLSTMT9-LEN                @3212SEION@@
           STRING  SQL-INSERT-1-9                                       @3212SEION@@
                   DELIMITED BY SIZE                                    @3212SEION@@
                   INTO  SQLSTMT9-ARR                                   @3212SEION@@
                   WITH  POINTER  SQLSTMT9-LEN                          @3212SEION@@
           END-STRING                                                   @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT9-ARR=["SQLSTMT9-ARR"]"          @3212SEION@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZBW02-CR-1-9-FLG=["               @3212SEINO@@
      D             WK-TKMZBW02-CR-1-9-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEION@@
           IF  WK-TKMZBW02-CR-1-9-FLG  =  CNS-OFF                       @3212SEION@@
           THEN                                                         @3212SEION@@
             EXEC SQL                                                   @3212SEION@@
                 PREPARE  S9  FROM  :SQLSTMT9                           @3212SEION@@
             END-EXEC                                                   @3212SEION@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-9-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-060
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
           MOVE  WK-CNT-IDX             TO  HST-CNT
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":件数=["HST-CNT"]"
      D    DISPLAY CNS-PGM-ID":件数=["H-TKMZBW02-I-O(1)"]"
      D    DISPLAY CNS-PGM-ID":件数=["H-TKMZBW02-I-O(2)"]"
      *-----------------------------------------------------------------
           EXEC SQL  FOR :HST-CNT
               EXECUTE S9
                 USING :H-TKMZBW02-I-O
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":基準日断面情報INSERT処理 SQLCODE =["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  WK-TKMZBW02-CR-1-9-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZBW02-CR-1-9-FLG=["               @3212SEINO@@
      D             WK-TKMZBW02-CR-1-9-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日断面情報INSERT処理  正常"
      *-----------------------------------------------------------------
      *----------  一意制約違反
             WHEN  CNS-SQL-UNIQUE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日断面情報INSERT処理  一意制約違反"
      *-----------------------------------------------------------------
             PERFORM  WK-MSG-1-9-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-061
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日断面情報INSERT処理  異常"
      *-----------------------------------------------------------------
             PERFORM  WK-MSG-1-9-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-062
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  基準日断面情報INSERT処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KJN-YMD-KKN-INS-EXT.
           EXIT.
      ******************************************************************
      *     不要断面削除処理
      ******************************************************************
       IM-KKN-DEL-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  不要断面削除処理  START  ***"
      D    DISPLAY  CNS-PGM-ID ":ＧＩＰＳモード=["
      D             GIPS-MODE    OF PARM-SMZJ1210-ARG1"]"
      *-----------------------------------------------------------------
      *----------  ARG1.ＧＩＰＳモード<>1：GIPSモード以外場合
           IF  GIPS-MODE    OF PARM-SMZJ1210-ARG1 <> CNS-1
           THEN
      *----------  残高履歴を物理削除する
               MOVE  CNS-1              TO  WK-IDX10
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_1]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM    H-TKMZZR00-DEL-RTN  UNTIL
               WK-IDX10  > WK-CNT-IDX
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_1]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  TKMZZR00-DAT-DEL-RTN
      *----------  資金残履歴を物理削除する
               MOVE  CNS-1              TO  WK-IDX11
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_2]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM    H-TKMZSR00-DEL-RTN  UNTIL
               WK-IDX11  > WK-CNT-IDX
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_2]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  TKMZSR00-DAT-DEL-RTN
      *----------  元本残高を物理削除する
               MOVE  CNS-1              TO  WK-IDX12
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_3]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM    H-TKMZGZ00-DEL-RTN  UNTIL
               WK-IDX12  > WK-CNT-IDX
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_3]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  TKMZGZ00-DAT-DEL-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.勘定異動／残高作成  = ["
      D             WK-KJIDO-ZANSK      OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           IF  WK-KJIDO-ZANSK      OF  WK-DATA-IN  NOT = CNS-2
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ARG1.勘定異動／残高作成≠2（作成しない）の場合"
      *-----------------------------------------------------------------
      *----------  勘定残高を物理削除する
               MOVE  CNS-1              TO  WK-IDX13
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_4]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM    H-TKMZKZ00-DEL-RTN  UNTIL
               WK-IDX13  > WK-CNT-IDX
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_4]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  TKMZKZ00-DAT-DEL-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  基準日計算情報を物理削除する
               MOVE  CNS-1              TO  WK-IDX14
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_5]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM    H-TKMZKK00-DEL-RTN  UNTIL
               WK-IDX14  > WK-CNT-IDX
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IM-KKN-DEL-RTN_5]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  TKMZKK00-DAT-DEL-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  不要断面削除処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       IM-KKN-DEL-EXT.
           EXIT.
      ******************************************************************
      *    進捗管理データッを物理削除する
      ******************************************************************
       TKDYAA40-DAT-DEL-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  進捗管理データッを物理削除する  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SCZY1020-INOUT
                        PARM-SCZY1020-RTNPKG
      *----------  【SCZY1020】に接続用パラメータの設定を行なう
      *----------  基準年月日１
           MOVE  WK-KJN-YMD        OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
             TO  IXCAL-KJN-YMD1        OF  PARM-SCZY1020-ARG1
      *----------  計算ベース区分
           MOVE  CNS-1
             TO  IXCAL-COMP-BASE       OF  PARM-SCZY1020-ARG1
      *----------  日数
           MOVE  CNS-1
             TO  IXCAL-DAYS            OF  PARM-SCZY1020-ARG1
      *----------  単位区分
           MOVE  CNS-1
             TO  IXCAL-TANI-KBN        OF  PARM-SCZY1020-ARG1
      *----------  機能区分
           MOVE  CNS-3
             TO  IXCAL-FUNCTION        OF  PARM-SCZY1020-ARG1
      *----------  前後区分１
           MOVE  CNS-2
             TO  IXCAL-ZENGO-KBN-1     OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":基準年月日１                =["
      D             IXCAL-KJN-YMD1     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算ベース区分              =["
      D             IXCAL-COMP-BASE    OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":日数                        =["
      D             IXCAL-DAYS         OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":単位区分                    =["
      D             IXCAL-TANI-KBN     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":機能区分                    =["
      D             IXCAL-FUNCTION     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":前後区分１                  =["
      D             IXCAL-ZENGO-KBN-1  OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
      *----------  CALL 【SCZY1020】
           MOVE  CNS-POS-073            TO  WK-ERR-POS4
           PERFORM  CALL-SCZY1020-RTN
      *----------  【SCZY1180】に接続用パラメータの設定を行なう
           INITIALIZE   PARM-SCZY1180-INOUT
                        PARM-SCZY1180-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY1180-ARG1
      *----------  基準日FROM
           MOVE  WK-KAISI-KJN-YMD-NEXT
             OF  WK-INSERT-DATA-PAKAGE(WK-CNT-IDX)
             TO  KJN-YMD-FROM           OF  PARM-SCZY1180-ARG1
      *----------  基準日TO
           MOVE  IXCAL-KJN-YMD2         OF  PARM-SCZY1020-ARG1
             TO  KJN-YMD-TO             OF  PARM-SCZY1180-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  FUND-CD                OF  PARM-SCZY1180-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-OBJ-PTF-PARM
                                        OF  WK-DATA-IN
             TO  PTF-CD                 OF  PARM-SCZY1180-ARG1
      *----------  評価系列コード
           MOVE  SPACE
             TO  HYK-KRTU-CD            OF  PARM-SCZY1180-ARG1
      *----------  進捗タスクID
           MOVE  CNS-SHINTK-TASK-ID
             TO  SHINTK-TASK-ID         OF  PARM-SCZY1180-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード          =["
      D             RIYO-CMP-CD         OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":基準日FROM              =["
      D             KJN-YMD-FROM        OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":基準日TO                =["
      D             KJN-YMD-TO          OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード          =["
      D             FUND-CD             OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード    =["
      D             PTF-CD              OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":評価系列コード          =["
      D             HYK-KRTU-CD         OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":進捗タスクID            =["
      D             SHINTK-TASK-ID      OF  PARM-SCZY1180-ARG1"]"
      *-----------------------------------------------------------------
      *----------  CALL 【SCZY1180】
           MOVE  CNS-POS-074            TO  WK-ERR-POS6
           PERFORM  CALL-SCZY1180-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  進捗管理データッを物理削除する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKDYAA40-DAT-DEL-EXT.
           EXIT.
      ******************************************************************
      *     H-TKMZZR00-D  SET処理
      ******************************************************************
       H-TKMZZR00-DEL-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZZR00-D SET処理  START ***"
      *-----------------------------------------------------------------
      *----------  残高履歴TBL
           MOVE  WK-TBL-TKMZZR00
             TO  SQL-TKMZZR00           OF  SQL-DELETE-1-10
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX10)
             TO  H-RIYO-CMP-CD          OF  H-TKMZZR00-D(WK-IDX10)
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX10)
             TO  H-FUND-CD              OF  H-TKMZZR00-D(WK-IDX10)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX10)
             TO  H-PTF-CD               OF  H-TKMZZR00-D(WK-IDX10)
      *----------  DELETE用データパッケージ.開始基準日
           MOVE  WK-KAISI-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX10)
             TO  H-KAISI-KJN-YMD        OF  H-TKMZZR00-D(WK-IDX10)
      *----------  DELETE用データパッケージ.基準日
           MOVE  WK-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX10)
             TO  H-KJN-YMD              OF  H-TKMZZR00-D(WK-IDX10)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX10  =["WK-IDX10"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD   OF  H-TKMZZR00-D  =["
      D             H-RIYO-CMP-CD       OF  H-TKMZZR00-D(WK-IDX10)"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD    OF  H-TKMZZR00-D      =["
      D             H-FUND-CD           OF  H-TKMZZR00-D(WK-IDX10)"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD     OF  H-TKMZZR00-D       =["
      D             H-PTF-CD            OF  H-TKMZZR00-D(WK-IDX10)"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD    OF  H-TKMZZR00-D =["
      D             H-KAISI-KJN-YMD     OF  H-TKMZZR00-D(WK-IDX10)"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD          OF  H-TKMZZR00-D =["
      D             H-KJN-YMD           OF  H-TKMZZR00-D(WK-IDX10)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZZR00-D SET処理   END  ***"
      *-----------------------------------------------------------------
      *----------  WK-IDX10 + 1
             COMPUTE   WK-IDX10 = WK-IDX10 + 1
           CONTINUE.
       H-TKMZZR00-DEL-EXT.
           EXIT.
      ******************************************************************
      *     WK-MSG-1-10  SET処理
      ******************************************************************
       WK-MSG-1-10-EDIT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-10 SET処理  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  残高履歴TBL
           MOVE  WK-TBL-TKMZZR00
             TO  WK-TKMZZR00            OF  WK-MSG-1-10
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZZR00-D(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-10
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZZR00-D(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-10
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZZR00-D(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-10
      *----------  DELETE用データパッケージ.開始基準日
      *    MOVE  H-KAISI-KJN-YMD        OF  H-TKMZZR00-D(SQLERRD(3) + 1)
      *      TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-10
      *----------  DELETE用データパッケージ.基準日
      *    MOVE  H-KJN-YMD              OF  H-TKMZZR00-D(SQLERRD(3) + 1)
      *      TO  WK-KJN-YMD             OF  WK-MSG-1-10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-10  =["WK-MSG-1-10"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-10 SET処理   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-10-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    残高履歴を物理削除する
      ******************************************************************
       TKMZZR00-DAT-DEL-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高履歴を物理削除する  START  ***"
      *-----------------------------------------------------------------@3212SEION@@
      *    INITIALIZE  SQLSTMT                                          @3212SEION@@
      *    MOVE  SQL-DELETE-1-10        TO  SQLSTMT                     @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
           INITIALIZE  SQLSTMT10-ARR                                    @3212SEION@@
           MOVE  1                      TO  SQLSTMT10-LEN               @3212SEION@@
           STRING  SQL-DELETE-1-10                                      @3212SEION@@
                   DELIMITED BY SIZE                                    @3212SEION@@
                   INTO  SQLSTMT10-ARR                                  @3212SEION@@
                   WITH  POINTER  SQLSTMT10-LEN                         @3212SEION@@
           END-STRING                                                   @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT10-ARR=["SQLSTMT10-ARR"]"        @3212SEION@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZZR00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZZR00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEION@@
           IF  WK-TKMZZR00-CR-1-1-FLG  =  CNS-OFF                       @3212SEION@@
           THEN                                                         @3212SEION@@
             EXEC SQL                                                   @3212SEION@@
                 PREPARE S10 FROM :SQLSTMT10                            @3212SEION@@
             END-EXEC                                                   @3212SEION@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-10-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-063
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-10        DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE S10
           USING  :H-TKMZZR00-D-O
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  WK-TKMZZR00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZZR00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZZR00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  WK-TKMZZR00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZZR00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZZR00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
             PERFORM  WK-MSG-1-10-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-064
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-10        DELIMITED    BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴を物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高履歴を物理削除する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-DAT-DEL-EXT.
           EXIT.
      ******************************************************************
      *     H-TKMZSR00-D  SET処理
      ******************************************************************
       H-TKMZSR00-DEL-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZSR00-D SET処理  START ***"
      *-----------------------------------------------------------------
      *----------  資金残履歴TBL
           MOVE  WK-TBL-TKMZSR00
             TO  SQL-TKMZSR00           OF  SQL-DELETE-1-11
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX11)
             TO  H-RIYO-CMP-CD          OF  H-TKMZSR00-D(WK-IDX11)
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX11)
             TO  H-FUND-CD              OF  H-TKMZSR00-D(WK-IDX11)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX11)
             TO  H-PTF-CD               OF  H-TKMZSR00-D(WK-IDX11)
      *----------  DELETE用データパッケージ.開始基準日
           MOVE  WK-KAISI-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX11)
             TO  H-KAISI-KJN-YMD        OF  H-TKMZSR00-D(WK-IDX11)
      *----------  DELETE用データパッケージ.基準日
           MOVE  WK-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX11)
             TO  H-KJN-YMD              OF  H-TKMZSR00-D(WK-IDX11)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX11  =["WK-IDX11"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD    OF  H-TKMZSR00-D  =["
      D             H-RIYO-CMP-CD       OF  H-TKMZSR00-D(WK-IDX11)"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD    OF  H-TKMZSR00-D      =["
      D             H-FUND-CD           OF  H-TKMZSR00-D(WK-IDX11)"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD     OF  H-TKMZSR00-D       =["
      D             H-PTF-CD            OF  H-TKMZSR00-D(WK-IDX11)"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD    OF  H-TKMZSR00-D =["
      D             H-KAISI-KJN-YMD     OF  H-TKMZSR00-D(WK-IDX11)"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD          OF  H-TKMZSR00-D =["
      D             H-KJN-YMD           OF  H-TKMZSR00-D(WK-IDX11)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZSR00-D SET処理   END  ***"
      *-----------------------------------------------------------------
      *----------  WK-IDX11 + 1
             COMPUTE   WK-IDX11 = WK-IDX11 + 1
           CONTINUE.
       H-TKMZSR00-DEL-EXT.
           EXIT.
      ******************************************************************
      *     WK-MSG-1-11  SET処理
      ******************************************************************
       WK-MSG-1-11-EDIT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-11 SET処理  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  資金残履歴TBL
           MOVE  WK-TBL-TKMZSR00
             TO  WK-TKMZSR00            OF  WK-MSG-1-11
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZSR00-D(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-11
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZSR00-D(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-11
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZSR00-D(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-11
      *----------  DELETE用データパッケージ.開始基準日
      *    MOVE  H-KAISI-KJN-YMD        OF  H-TKMZSR00-D(SQLERRD(3) + 1)
      *      TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-11
      *----------  DELETE用データパッケージ.基準日
      *    MOVE  H-KJN-YMD              OF  H-TKMZSR00-D(SQLERRD(3) + 1)
      *      TO  WK-KJN-YMD             OF  WK-MSG-1-11
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-11  =["WK-MSG-1-11"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-11 SET処理   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-11-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    資金残履歴を物理削除する
      ******************************************************************
       TKMZSR00-DAT-DEL-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金残履歴を物理削除する  START  ***"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
      *    MOVE  SQL-DELETE-1-11    TO  SQLSTMT                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT11-ARR                                    @3212SEINO@@
           MOVE  1                      TO  SQLSTMT11-LEN               @3212SEINO@@
           STRING  SQL-DELETE-1-11                                      @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT11-ARR                                  @3212SEINO@@
                   WITH  POINTER  SQLSTMT11-LEN                         @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT11-ARR=["SQLSTMT11-ARR"]"        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZSR00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZSR00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-TKMZSR00-CR-1-1-FLG  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC SQL                                                   @3212SEINO@@
                 PREPARE S11 FROM :SQLSTMT11                            @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-11-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-065
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-11      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE S11
           USING  :H-TKMZSR00-D-O
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  WK-TKMZSR00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZSR00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZSR00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  WK-TKMZSR00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZSR00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZSR00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
             PERFORM  WK-MSG-1-11-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-066
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-11        DELIMITED    BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴を物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金残履歴を物理削除する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSR00-DAT-DEL-EXT.
           EXIT.
      ******************************************************************
      *     H-TKMZGZ00-D  SET処理
      ******************************************************************
       H-TKMZGZ00-DEL-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZGZ00-D SET処理  START ***"
      *-----------------------------------------------------------------
      *----------  元本残高TBL
           MOVE  WK-TBL-TKMZGZ00
             TO  SQL-TKMZGZ00           OF  SQL-DELETE-1-12
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX12)
             TO  H-RIYO-CMP-CD          OF  H-TKMZGZ00-D(WK-IDX12)
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX12)
             TO  H-FUND-CD              OF  H-TKMZGZ00-D(WK-IDX12)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX12)
             TO  H-PTF-CD               OF  H-TKMZGZ00-D(WK-IDX12)
      *----------  DELETE用データパッケージ.開始基準日
           MOVE  WK-KAISI-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX12)
             TO  H-KAISI-KJN-YMD        OF  H-TKMZGZ00-D(WK-IDX12)
      *----------  DELETE用データパッケージ.基準日
           MOVE  WK-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX12)
             TO  H-KJN-YMD              OF  H-TKMZGZ00-D(WK-IDX12)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX12  =["WK-IDX12"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD    OF  H-TKMZGZ00-D  =["
      D             H-RIYO-CMP-CD       OF  H-TKMZGZ00-D(WK-IDX12)"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD    OF  H-TKMZGZ00-D      =["
      D             H-FUND-CD           OF  H-TKMZGZ00-D(WK-IDX12)"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD     OF  H-TKMZGZ00-D       =["
      D             H-PTF-CD            OF  H-TKMZGZ00-D(WK-IDX12)"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD    OF  H-TKMZGZ00-D =["
      D             H-KAISI-KJN-YMD     OF  H-TKMZGZ00-D(WK-IDX12)"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD          OF  H-TKMZGZ00-D =["
      D             H-KJN-YMD           OF  H-TKMZGZ00-D(WK-IDX12)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZGZ00-D SET処理   END  ***"
      *-----------------------------------------------------------------
      *----------  WK-IDX12 + 1
             COMPUTE   WK-IDX12 = WK-IDX12 + 1
           CONTINUE.
       H-TKMZGZ00-DEL-EXT.
           EXIT.
      ******************************************************************
      *     WK-MSG-1-12  SET処理
      ******************************************************************
       WK-MSG-1-12-EDIT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-12 SET処理  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  元本残高TBL
           MOVE  WK-TBL-TKMZGZ00
             TO  WK-TKMZGZ00            OF  WK-MSG-1-12
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZGZ00-D(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-12
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZGZ00-D(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-12
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZGZ00-D(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-12
      *----------  DELETE用データパッケージ.開始基準日
      *    MOVE  H-KAISI-KJN-YMD        OF  H-TKMZGZ00-D(SQLERRD(3) + 1)
      *      TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-12
      *----------  DELETE用データパッケージ.基準日
      *    MOVE  H-KJN-YMD              OF  H-TKMZGZ00-D(SQLERRD(3) + 1)
      *      TO  WK-KJN-YMD             OF  WK-MSG-1-12
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-12  =["WK-MSG-1-12"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-12 SET処理   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-12-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    元本残高を物理削除する
      ******************************************************************
       TKMZGZ00-DAT-DEL-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  元本残高を物理削除する  START  ***"
      *-----------------------------------------------------------------@3212SEINO@@
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
      *    MOVE  SQL-DELETE-1-12        TO  SQLSTMT                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT12-ARR                                    @3212SEINO@@
           MOVE  1                      TO  SQLSTMT12-LEN               @3212SEINO@@
           STRING  SQL-DELETE-1-12                                      @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT12-ARR                                  @3212SEINO@@
                   WITH  POINTER  SQLSTMT12-LEN                         @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT12-ARR=["SQLSTMT12-ARR"]"        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZGZ00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZGZ00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-TKMZGZ00-CR-1-1-FLG  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC SQL
                 PREPARE S12 FROM :SQLSTMT12
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-12-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-067
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-12      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE S12
           USING  :H-TKMZGZ00-D-O
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  WK-TKMZGZ00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZGZ00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZGZ00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  WK-TKMZGZ00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZGZ00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZGZ00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
             PERFORM  WK-MSG-1-12-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-068
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-12        DELIMITED    BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高を物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  元本残高を物理削除する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZGZ00-DAT-DEL-EXT.
           EXIT.
      ******************************************************************
      *     H-TKMZKZ00-D  SET処理
      ******************************************************************
       H-TKMZKZ00-DEL-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZKZ00-D SET処理  START ***"
      *-----------------------------------------------------------------
      *----------  勘定残高TBL
           MOVE  WK-TBL-TKMZKZ00
             TO  SQL-TKMZKZ00           OF  SQL-DELETE-1-13
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             OF  WK-DELETE-DATA-PAKAGE2(WK-IDX13)
             TO  H-RIYO-CMP-CD          OF  H-TKMZKZ00-D(WK-IDX13)
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             OF  WK-DELETE-DATA-PAKAGE2(WK-IDX13)
             TO  H-FUND-CD              OF  H-TKMZKZ00-D(WK-IDX13)
      *----------  評価系列コード
      *    MOVE  WK-HYK-KRTU-CD
      *      OF  WK-DELETE-DATA-PAKAGE2(WK-IDX13)
      *      TO  H-HYK-KRTU-CD          OF  H-TKMZKZ00-D(WK-IDX13)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             OF  WK-DELETE-DATA-PAKAGE2(WK-IDX13)
             TO  H-PTF-CD               OF  H-TKMZKZ00-D(WK-IDX13)
      *----------  DELETE用データパッケージ.開始基準日
           MOVE  WK-KAISI-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE2(WK-IDX13)
             TO  H-KAISI-KJN-YMD        OF  H-TKMZKZ00-D(WK-IDX13)
      *----------  DELETE用データパッケージ.基準日
           MOVE  WK-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE2(WK-IDX13)
             TO  H-KJN-YMD              OF  H-TKMZKZ00-D(WK-IDX13)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX13  =["WK-IDX13"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD    OF  H-TKMZKZ00-D  =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKZ00-D(WK-IDX13)"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD        OF  H-TKMZKZ00-D   =["
      D             H-FUND-CD           OF  H-TKMZKZ00-D(WK-IDX13)"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD     OF  H-TKMZKZ00-D       =["
      D             H-PTF-CD            OF  H-TKMZKZ00-D(WK-IDX13)"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD    OF  H-TKMZKZ00-D =["
      D             H-KAISI-KJN-YMD     OF  H-TKMZKZ00-D(WK-IDX13)"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD          OF  H-TKMZKZ00-D =["
      D             H-KJN-YMD           OF  H-TKMZKZ00-D(WK-IDX13)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZKZ00-D SET処理   END  ***"
      *-----------------------------------------------------------------
      *----------  WK-IDX13 + 1
             COMPUTE   WK-IDX13 = WK-IDX13 + 1
           CONTINUE.
       H-TKMZKZ00-DEL-EXT.
           EXIT.
      ******************************************************************
      *     WK-MSG-1-13  SET処理
      ******************************************************************
       WK-MSG-1-13-EDIT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-13 SET処理  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  勘定残高TBL
           MOVE  WK-TBL-TKMZKZ00
             TO  WK-TKMZKZ00            OF  WK-MSG-1-13
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZKZ00-D(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-13
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZKZ00-D(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-13
      *----------  評価系列コード
      *    MOVE  H-HYK-KRTU-CD          OF  H-TKMZKZ00-D(SQLERRD(3) + 1)
      *      TO  WK-HYK-KRTU-CD         OF  WK-MSG-1-13
      *----------  ポートフォリオコード
      *    MOVE  H-PTF-CD               OF  H-TKMZKZ00-D(SQLERRD(3) + 1)
      *      TO  WK-PTF-CD              OF  WK-MSG-1-13
      *----------  DELETE用データパッケージ.開始基準日
      *    MOVE  H-KAISI-KJN-YMD        OF  H-TKMZKZ00-D(SQLERRD(3) + 1)
      *      TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-13
      *----------  DELETE用データパッケージ.基準日
      *    MOVE  H-KJN-YMD              OF  H-TKMZKZ00-D(SQLERRD(3) + 1)
      *      TO  WK-KJN-YMD             OF  WK-MSG-1-13
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-13  =["WK-MSG-1-13"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-13 SET処理   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-13-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    勘定残高を物理削除する
      ******************************************************************
       TKMZKZ00-DAT-DEL-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定残高を物理削除する  START  ***"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEION@@
      *    MOVE  SQL-DELETE-1-13        TO  SQLSTMT                     @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEION@@
      *-----------------------------------------------------------------@3212SEION@@
           INITIALIZE  SQLSTMT13-ARR                                    @3212SEION@@
           MOVE  1                      TO  SQLSTMT13-LEN               @3212SEION@@
           STRING  SQL-DELETE-1-13                                      @3212SEION@@
                   DELIMITED BY SIZE                                    @3212SEION@@
                   INTO  SQLSTMT13-ARR                                  @3212SEION@@
                   WITH  POINTER  SQLSTMT13-LEN                         @3212SEION@@
           END-STRING                                                   @3212SEION@@
      *-------------------<DEBUG>---------------------------------------@3212SEION@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT13-ARR=["SQLSTMT13-ARR"]"        @3212SEION@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKZ00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZKZ00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEION@@
           IF  WK-TKMZKZ00-CR-1-1-FLG  =  CNS-OFF                       @3212SEION@@
           THEN                                                         @3212SEION@@
             EXEC SQL                                                   @3212SEION@@
                 PREPARE S13 FROM :SQLSTMT13                            @3212SEION@@
             END-EXEC                                                   @3212SEION@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-13-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-069
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-13      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE S13
           USING  :H-TKMZKZ00-D-O
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  WK-TKMZKZ00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKZ00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZKZ00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  WK-TKMZKZ00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKZ00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZKZ00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
             PERFORM  WK-MSG-1-13-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-070
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-13        DELIMITED    BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高を物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定残高を物理削除する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-DAT-DEL-EXT.
           EXIT.
      ******************************************************************
      *     H-TKMZKK00-D  SET処理
      ******************************************************************
       H-TKMZKK00-DEL-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZKK00-D SET処理  START ***"
      *-----------------------------------------------------------------
      *----------  基準日計算情報TBL
           MOVE  WK-TBL-TKMZKK00
             TO  SQL-TKMZKK00           OF  SQL-DELETE-1-15
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX14)
             TO  H-RIYO-CMP-CD          OF  H-TKMZKK00-D(WK-IDX14)
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX14)
             TO  H-FUND-CD              OF  H-TKMZKK00-D(WK-IDX14)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX14)
             TO  H-PTF-CD               OF  H-TKMZKK00-D(WK-IDX14)
      *----------  DELETE用データパッケージ.開始基準日
           MOVE  WK-KAISI-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX14)
             TO  H-KAISI-KJN-YMD        OF  H-TKMZKK00-D(WK-IDX14)
      *----------  DELETE用データパッケージ.基準日
           MOVE  WK-KJN-YMD
             OF  WK-DELETE-DATA-PAKAGE1(WK-IDX14)
             TO  H-KJN-YMD              OF  H-TKMZKK00-D(WK-IDX14)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX10  =["WK-IDX14"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD    OF  H-TKMZKK00-D=["
      D             H-RIYO-CMP-CD       OF  H-TKMZKK00-D(WK-IDX14)"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD        OF  H-TKMZKK00-D=["
      D             H-FUND-CD           OF  H-TKMZKK00-D(WK-IDX14)"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD         OF  H-TKMZKK00-D=["
      D             H-PTF-CD            OF  H-TKMZKK00-D(WK-IDX14)"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD  OF  H-TKMZKK00-D=["
      D             H-KAISI-KJN-YMD     OF  H-TKMZKK00-D(WK-IDX14)"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD        OF  H-TKMZKK00-D=["
      D             H-KJN-YMD           OF  H-TKMZKK00-D(WK-IDX14)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  H-TKMZKK00-D SET処理   END  ***"
      *-----------------------------------------------------------------
      *----------  WK-IDX14 + 1
             COMPUTE   WK-IDX14 = WK-IDX14 + 1
           CONTINUE.
       H-TKMZKK00-DEL-EXT.
           EXIT.
      ******************************************************************
      *     WK-MSG-1-15  SET処理
      ******************************************************************
       WK-MSG-1-15-EDIT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-15 SET処理  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  基準日計算情報TBL
           MOVE  WK-TBL-TKMZKK00
             TO  WK-TKMZKK00            OF  WK-MSG-1-15
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZKK00-D(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-15
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZKK00-D(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-15
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZKK00-D(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-15
      *----------  DELETE用データパッケージ.開始基準日
           MOVE  H-KAISI-KJN-YMD        OF  H-TKMZKK00-D(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-15
      *----------  DELETE用データパッケージ.基準日
           MOVE  H-KJN-YMD              OF  H-TKMZKK00-D(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-15
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-15  =["WK-MSG-1-15"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK-MSG-1-15 SET処理   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-15-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    基準日計算情報を物理削除する
      ******************************************************************
       TKMZKK00-DAT-DEL-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  基準日計算情報を物理削除する  START  ***"
      *-----------------------------------------------------------------@3212SEINO@@
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
      *    MOVE  SQL-DELETE-1-15        TO  SQLSTMT                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":SQLSTMT    =["SQLSTMT"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT15-ARR                                    @3212SEINO@@
           MOVE  1                      TO  SQLSTMT15-LEN               @3212SEINO@@
           STRING  SQL-DELETE-1-15                                      @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT15-ARR                                  @3212SEINO@@
                   WITH  POINTER  SQLSTMT15-LEN                         @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT15-ARR=["SQLSTMT15-ARR"]"        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKK00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZKK00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  WK-TKMZKK00-CR-1-1-FLG  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC SQL                                                   @3212SEINO@@
                 PREPARE S15 FROM :SQLSTMT15                            @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-15-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-071
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-15      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE  回数削減"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE S15
           USING  :H-TKMZKK00-D-O
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  WK-TKMZKK00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKK00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZKK00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  WK-TKMZKK00-CR-1-1-FLG      @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKK00-CR-1-1-FLG=["               @3212SEINO@@
      D             WK-TKMZKK00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
             PERFORM  WK-MSG-1-15-EDIT-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-072
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-15        DELIMITED    BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日計算情報を物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  基準日計算情報を物理削除する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKK00-DAT-DEL-EXT.
           EXIT.
      ******************************************************************
      *    CALL SCZY1020 処理
      ******************************************************************
       CALL-SCZY1020-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1020 処理  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1020"             USING  PARM-SCZY1020-INOUT
                                                PARM-SCZY1020-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1020-RTNPKG=["
      D             PARM-SCZY1020-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)=["
      D             RTN-CD              OF  PARM-SCZY1020-RTNPKG(
      D                         COUNTER OF  PARM-SCZY1020-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-SCZY1020-RTNPKG=["
      D                         COUNTER OF  PARM-SCZY1020-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                   OF  PARM-SCZY1020-RTNPKG(COUNTER
                                        OF  PARM-SCZY1020-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY1020 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY1020  異常"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-SCZY1020-RTNPKG
               TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS4
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-SCZY1020-RTNPKG (
                                COUNTER OF  PARM-SCZY1020-RTNPKG )
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1020 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY1020-EXT.
           EXIT.
      ******************************************************************
      *    CALL SCZY4007 処理
      ******************************************************************
       CALL-SCZY4007-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4007 処理  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY4007"            USING  PARM-SCZY4007-INOUT
                                               PARM-SCZY4007-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4007-RTNPKG=["
      D             PARM-SCZY4007-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4007)=["
      D             RTN-CD              OF  PARM-SCZY4007-RTNPKG(
      D                         COUNTER OF  PARM-SCZY4007-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-SCZY4007-RTNPKG=["
      D             COUNTER             OF  PARM-SCZY4007-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                   OF  PARM-SCZY4007-RTNPKG(COUNTER
                                        OF  PARM-SCZY4007-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4007 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
             IF  RTN-CD  OF  PARM-SCZY4007-RTNPKG(COUNTER
                                        OF  PARM-SCZY4007-RTNPKG)
              =  CNS-RTN-900
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4007 異常"
      *-----------------------------------------------------------------
      *----------  エラー
               MOVE  PARM-SCZY4007-RTNPKG
                 TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS1
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-SCZY4007-RTNPKG (
                                COUNTER OF  PARM-SCZY4007-RTNPKG )
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4007 異常"
      *-----------------------------------------------------------------
      *----------  エラー
               MOVE  PARM-SCZY4007-RTNPKG
                 TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-SCZY4007-RTNPKG (
                                COUNTER OF  PARM-SCZY4007-RTNPKG )
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4007 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY4007-EXT.
           EXIT.
      ******************************************************************
      *    CALL SCZY4017 処理
      ******************************************************************
       CALL-SCZY4017-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4017 処理  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY4017"            USING  PARM-SCZY4017-INOUT
                                               PARM-SCZY4017-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4017-RTNPKG=["
      D             PARM-SCZY4017-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4017)=["
      D             RTN-CD              OF  PARM-SCZY4017-RTNPKG(
      D                         COUNTER OF  PARM-SCZY4017-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-SCZY4017-RTNPKG=["
      D                         COUNTER OF  PARM-SCZY4017-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD  OF  PARM-SCZY4017-RTNPKG(COUNTER
                                        OF  PARM-SCZY4017-RTNPKG)
             WHEN  CNS-RTN-000
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4017 正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-RTN-110
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4017  データなし"
      *-----------------------------------------------------------------
      *----------  エラー
               MOVE  PARM-SCZY4017-RTNPKG
                 TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS5
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-113
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-SCZY4017-RTNPKG (
                                COUNTER OF  PARM-SCZY4017-RTNPKG )
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4017 異常"
      *-----------------------------------------------------------------
      *----------  エラー
               MOVE  PARM-SCZY4017-RTNPKG
                 TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS5
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-SCZY4017-RTNPKG (
                                COUNTER OF  PARM-SCZY4017-RTNPKG )
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4017 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY4017-EXT.
           EXIT.
      ******************************************************************
      *    CALL SCZY4026 処理
      ******************************************************************
       SCZY4026-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4026 処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SCZY4026-INOUT
                        PARM-SCZY4026-RTNPKG
      *----------  決算日情報区分
           MOVE  CNS-KESSAN-JYOUHOU-KBN-1
             TO  KESSAN-JYOUHOU-KBN     OF  PARM-SCZY4026-ARG1
      *----------  決算日情報エリア.休日処理区分
           MOVE  WK-KESSAN-QJT-SYRI     OF  WK-PTF-SHOSAI-PACKAGE
             TO  KESSAN-QJT-SYRI        OF  KESSAN-JYOUHOU-AREA
             OF  PARM-SCZY4026-ARG1
      *----------  決算日情報エリア.決算回数
           MOVE  WK-KESSAN-TIMES        OF  WK-PTF-SHOSAI-PACKAGE
             TO  KESSAN-TIMES           OF  KESSAN-JYOUHOU-AREA
             OF  PARM-SCZY4026-ARG1
      *----------  決算日情報エリア.本決算月日
           MOVE  WK-HON-KESSAN-MMDD     OF  WK-PTF-SHOSAI-PACKAGE
             TO  HON-KESSAN-MMDD        OF  KESSAN-JYOUHOU-AREA
             OF  PARM-SCZY4026-ARG1
      *----------  決算日情報エリア.決算月日１
           MOVE  WK-KESSAN-MMDD1        OF  WK-PTF-SHOSAI-PACKAGE
             TO  KESSAN-MMDD1           OF  KESSAN-JYOUHOU-AREA
             OF  PARM-SCZY4026-ARG1
      *----------  決算日情報エリア.決算月日２
           MOVE  WK-KESSAN-MMDD2        OF  WK-PTF-SHOSAI-PACKAGE
             TO  KESSAN-MMDD2           OF  KESSAN-JYOUHOU-AREA
             OF  PARM-SCZY4026-ARG1
      *----------  決算日情報エリア.決算月日３
           MOVE  WK-KESSAN-MMDD3        OF  WK-PTF-SHOSAI-PACKAGE
             TO  KESSAN-MMDD3           OF  KESSAN-JYOUHOU-AREA
             OF  PARM-SCZY4026-ARG1
      *----------  決算日情報エリア.決算月日４
           MOVE  WK-KESSAN-MMDD4        OF  WK-PTF-SHOSAI-PACKAGE
             TO  KESSAN-MMDD4           OF  KESSAN-JYOUHOU-AREA
             OF  PARM-SCZY4026-ARG1
      *----------  計算日From
           MOVE  WK-CALC-FROM           OF  WK-KESSAN-YMD-PACKAGE
             TO  CALC-FROM              OF  PARM-SCZY4026-ARG1
      *----------  計算日To
           MOVE  WK-CALC-TO             OF  WK-KESSAN-YMD-PACKAGE
             TO  CALC-TO                OF  PARM-SCZY4026-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":決算日情報区分=["
      D             KESSAN-JYOUHOU-KBN  OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日情報エリア.休日処理区分=["
      D             KESSAN-QJT-SYRI      OF  KESSAN-JYOUHOU-AREA
      D             OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日情報エリア.決算回数=["
      D             KESSAN-TIMES        OF  KESSAN-JYOUHOU-AREA
      D             OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日情報エリア.本決算月日=["
      D             HON-KESSAN-MMDD     OF  KESSAN-JYOUHOU-AREA
      D             OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日情報エリア.決算月日１=["
      D             KESSAN-MMDD1        OF  KESSAN-JYOUHOU-AREA
      D             OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日情報エリア.決算月日２=["
      D             KESSAN-MMDD2        OF  KESSAN-JYOUHOU-AREA
      D             OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日情報エリア.決算月日３=["
      D             KESSAN-MMDD3        OF  KESSAN-JYOUHOU-AREA
      D             OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日情報エリア.決算月日４=["
      D             KESSAN-MMDD4        OF  KESSAN-JYOUHOU-AREA
      D             OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":計算日From=["
      D             CALC-FROM           OF  PARM-SCZY4026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":計算日To=["
      D             CALC-TO             OF  PARM-SCZY4026-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY4026"            USING  PARM-SCZY4026-INOUT
                                               PARM-SCZY4026-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4026-RTNPKG=["
      D             PARM-SCZY4026-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4026)=["
      D             RTN-CD              OF  PARM-SCZY4026-RTNPKG(
      D                         COUNTER OF  PARM-SCZY4026-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-SCZY4026-RTNPKG=["
      D                         COUNTER OF  PARM-SCZY4026-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD  OF  PARM-SCZY4026-RTNPKG(COUNTER
                                        OF PARM-SCZY4026-RTNPKG)
             WHEN  CNS-RTN-000
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4026 正常"
      *-----------------------------------------------------------------
      *----------  ワーク決算日算出パッケージ.決算日数
               MOVE  CALC-KENSU         OF  PARM-SCZY4026-ARG2
                 TO  WK-KESSAN-NISU     OF  WK-KESSAN-YMD-PACKAGE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ.決算日数=["
      D             WK-KESSAN-NISU      OF  WK-KESSAN-YMD-PACKAGE"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SCZY4026-RTN]"                GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM   VARYING WK-CNT FROM 1 BY 1 UNTIL WK-CNT > 500
      *----------  ワーク決算日算出パッケージ.決算日詳細
                 MOVE  KESSAN-YMD       OF  PARM-SCZY4026-ARG2(WK-CNT)
                   TO  WK-KESSAN-YMD   OF  WK-KESSAN-YMD-PACKAGE(WK-CNT)
                 MOVE  SHIFT-KBN        OF  PARM-SCZY4026-ARG2(WK-CNT)
                   TO  WK-SHIFT-KBN    OF  WK-KESSAN-YMD-PACKAGE(WK-CNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ."
      D            "決算日詳細("WK-CNT").決算日     =["
      D             WK-KESSAN-YMD  OF WK-KESSAN-YMD-PACKAGE(WK-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク決算日算出パッケージ."
      D            "決算日詳細("WK-CNT").シフト区分 =["
      D             WK-SHIFT-KBN   OF WK-KESSAN-YMD-PACKAGE(WK-CNT)"]"
      *-----------------------------------------------------------------
               END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SCZY4026-RTN]"                GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4026 データなし"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY4026 異常"
      *-----------------------------------------------------------------
      *----------  エラー
               MOVE  PARM-SCZY4026-RTNPKG
                 TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS5
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-SCZY4026-RTNPKG (
                                COUNTER OF  PARM-SCZY4026-RTNPKG )
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4026 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4026-EXT.
           EXIT.
      ******************************************************************
      *    CALL SCZY1180 処理
      ******************************************************************
       CALL-SCZY1180-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1180 処理  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1180"            USING  PARM-SCZY1180-INOUT
                                               PARM-SCZY1180-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1180-RTNPKG=["
      D             PARM-SCZY1180-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1180)=["
      D             RTN-CD              OF  PARM-SCZY1180-RTNPKG(
      D                         COUNTER OF  PARM-SCZY1180-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-SCZY1180-RTNPKG=["
      D             COUNTER             OF  PARM-SCZY1180-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-SCZY1180-RTNPKG(COUNTER
                                        OF PARM-SCZY1180-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY1180 正常"
      *-----------------------------------------------------------------
      *----------  3.2.8.ＤＢコミット処理
               PERFORM  DB-COMMIT-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL SCZY1180 異常"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-SCZY1180-RTNPKG
               TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS6
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-SCZY1180-RTNPKG
                              (COUNTER  OF  PARM-SCZY1180-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1180 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY1180-EXT.
           EXIT.
      ******************************************************************
      *    3.2.8.ＤＢコミット処理
      ******************************************************************
       DB-COMMIT-RTN          SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DB-COMMIT-RTN ]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ＤＢコミット処理
           EXEC SQL
             COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)   = [" SQLCODE "]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック処理
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-075
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-COMMIT-ERR
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラーパッケージ："
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID        = ["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS           = ["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD            = ["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD     = ["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG = ["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG          = ["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DB-COMMIT-RTN]"               GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT-EXT.
           EXIT.
      ******************************************************************
      *                 3.3後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   後処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1210-ARG1=["
      D             PARM-SMZJ1210-ARG1       OF PARM-SMZJ1210-INOUT"]"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"                  USING  PARM-SCZY1170-IN
                                                    PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG           TO  PARM-SMZJ1210-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ1210-ARG2     = ["
      D      PARM-SMZJ1210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ1210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ1210-ARG2(COUNTER   OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ1210-ARG2(COUNTER   OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ1210-ARG2(COUNTER   OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ1210-ARG2(COUNTER   OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ1210-ARG2(COUNTER   OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ1210-ARG2(COUNTER   OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID":***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           GOBACK.
      ******************************************************************
      *                 3.4 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-1-FLG=["
      D             WK-TKDYAA40-CR-1-1-FLG"]"
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-2-FLG=["
      D             WK-TKDYAA40-CR-1-2-FLG"]"
      D    DISPLAY  CNS-PGM-ID":WK-TKMXXX00-CR-1-3-FLG=["
      D             WK-TKMXXX00-CR-1-3-FLG"]"
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKK00-CR-1-4-FLG=["
      D             WK-TKMZKK00-CR-1-4-FLG"]"
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-5-FLG=["
      D             WK-TKDYAA40-CR-1-5-FLG"]"
      D    DISPLAY  CNS-PGM-ID":WK-TKMXTR00-CR-1-6-FLG=["
      D             WK-TKMXTR00-CR-1-6-FLG"]"
      D    DISPLAY  CNS-PGM-ID":WK-TKMXTR00-CR-1-7-FLG=["
      D             WK-TKMXTR00-CR-1-7-FLG"]"
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-8-FLG=["
      D             WK-TKDYAA40-CR-1-8-FLG"]"
      *-----------------------------------------------------------------
      *----------  SQL1-1 CURSOR CLOSE処理
           IF  WK-TKDYAA40-CR-1-1-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKDYAA40_CURSOR"
      *-----------------------------------------------------------------
               EXEC SQL
                   CLOSE TKDYAA40_CURSOR
               END-EXEC
               MOVE  CNS-OFF            TO  WK-TKDYAA40-CR-1-1-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-1-FLG=["
      D             WK-TKDYAA40-CR-1-1-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKDYAA40_CURSOR CLOSE処理を行かない"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *----------  SQL1-2 CURSOR CLOSE処理
           IF  WK-TKDYAA40-CR-1-2-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKDYAA40_1_CURSOR"
      *-----------------------------------------------------------------
               EXEC SQL
                   CLOSE TKDYAA40_1_CURSOR
               END-EXEC
               MOVE  CNS-OFF            TO  WK-TKDYAA40-CR-1-2-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-2-FLG=["
      D             WK-TKDYAA40-CR-1-2-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKDYAA40_1_CURSOR CLOSE処理を行かない"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *----------  SQL1-3 CURSOR CLOSE処理
           IF  WK-TKMXXX00-CR-1-3-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMXTR00_CURSOR"
      *-----------------------------------------------------------------
               EXEC SQL
                   CLOSE TKMXXX00_CURSOR
               END-EXEC
               MOVE  CNS-OFF            TO  WK-TKMXXX00-CR-1-3-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TKMXXX00-CR-1-3-FLG=["
      D             WK-TKMXXX00-CR-1-3-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00_CURSOR CLOSE処理を行かない"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *----------  基準日計算情報データカーソルオープンフラグ
           IF  WK-TKMZKK00-CR-1-4-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZKK00_CURSOR"
      *-----------------------------------------------------------------
               EXEC SQL
                   CLOSE TKMZKK00_CURSOR
               END-EXEC
               MOVE  CNS-OFF            TO  WK-TKMZKK00-CR-1-4-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TKMZKK00-CR-1-4-FLG=["
      D             WK-TKMZKK00-CR-1-4-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKK00_CURSOR CLOSE処理を行かない"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *----------  SQL1-5 CURSOR CLOSE処理
           IF  WK-TKDYAA40-CR-1-5-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKDYAA40_2_CURSOR"
      *-----------------------------------------------------------------
               EXEC SQL
                   CLOSE TKDYAA40_2_CURSOR
               END-EXEC
               MOVE  CNS-OFF            TO  WK-TKDYAA40-CR-1-5-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-5-FLG=["
      D             WK-TKDYAA40-CR-1-5-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKDYAA40_2_CURSOR CLOSE処理を行かない"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *----------  取引情報データカーソルオープンフラグ
           IF  WK-TKMXTR00-CR-1-6-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TTKMXTR00_CURSOR"
      *-----------------------------------------------------------------
               EXEC SQL
                   CLOSE TKMXTR00_1_CURSOR
               END-EXEC
               MOVE  CNS-OFF            TO  WK-TKMXTR00-CR-1-6-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TKMXTR00-CR-1-6-FLG=["
      D             WK-TKMXTR00-CR-1-6-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00_1_CURSOR CLOSE処理を行かない"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *----------  SQL1-7 CURSOR CLOSE処理
           IF  WK-TKMXTR00-CR-1-7-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMXTR00_2_CURSOR"
      *-----------------------------------------------------------------
               EXEC SQL
                   CLOSE TKMXTR00_2_CURSOR
               END-EXEC
               MOVE  CNS-OFF            TO  WK-TKMXTR00-CR-1-7-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TKMXTR00-CR-1-7-FLG=["
      D             WK-TKMXTR00-CR-1-7-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00_2_CURSOR CLOSE処理を行かない"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *----------  SQL1-8 CURSOR CLOSE処理
           IF  WK-TKDYAA40-CR-1-8-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKDYAA40_3_CURSOR"
      *-----------------------------------------------------------------
               EXEC SQL
                   CLOSE TKDYAA40_3_CURSOR
               END-EXEC
               MOVE  CNS-OFF            TO  WK-TKDYAA40-CR-1-8-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":WK-TKDYAA40-CR-1-8-FLG=["
      D             WK-TKDYAA40-CR-1-8-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKDYAA40_3_CURSOR CLOSE処理を行かない"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF
      *----------  カーソル1-9フラグ                                    @3212SEINO@@
           MOVE  CNS-OFF                TO  WK-TKMZBW02-CR-1-9-FLG      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":カーソル1-9フラグ=["                    @3212SEINO@@
      D             WK-TKMZBW02-CR-1-9-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  カーソル1-10フラグ                                   @3212SEINO@@
           MOVE  CNS-OFF                TO  WK-TKMZZR00-CR-1-1-FLG      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":カーソル1-10フラグ=["                   @3212SEINO@@
      D             WK-TKMZZR00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  カーソル1-11フラグ                                   @3212SEINO@@
           MOVE  CNS-OFF                TO  WK-TKMZSR00-CR-1-1-FLG      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":カーソル1-11フラグ=["                   @3212SEINO@@
      D             WK-TKMZSR00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  カーソル1-12フラグ                                   @3212SEINO@@
           MOVE  CNS-OFF                TO  WK-TKMZGZ00-CR-1-1-FLG      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":カーソル1-12フラグ=["                   @3212SEINO@@
      D             WK-TKMZGZ00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  カーソル1-13フラグ                                   @3212SEINO@@
           MOVE  CNS-OFF                TO  WK-TKMZKZ00-CR-1-1-FLG      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":カーソル1-13フラグ=["                   @3212SEINO@@
      D             WK-TKMZKZ00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  カーソル1-15フラグ                                   @3212SEINO@@
           MOVE  CNS-OFF                TO  WK-TKMZKK00-CR-1-1-FLG      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":カーソル1-15フラグ=["                   @3212SEINO@@
      D             WK-TKMZKK00-CR-1-1-FLG"]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1210-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ1210-ARG2     = ["
      D             PARM-SMZJ1210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D             COUNTER          OF PARM-SMZJ1210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D       ERR-PGM-ID
      D          OF PARM-SMZJ1210-ARG2(COUNTER OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D       ERR-POS
      D          OF PARM-SMZJ1210-ARG2(COUNTER OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D       RTN-CD
      D          OF PARM-SMZJ1210-ARG2(COUNTER OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D       DETAIL-RTN-CD
      D          OF PARM-SMZJ1210-ARG2(COUNTER OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D       DETAIL-RTN-CD-FLG
      D          OF PARM-SMZJ1210-ARG2(COUNTER OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D       FREE-MSG
      D          OF PARM-SMZJ1210-ARG2(COUNTER OF PARM-SMZJ1210-ARG2)"]"
      D    DISPLAY  CNS-PGM-ID
      D           ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1210処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
