      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ2610
      * プログラム名称 : 断面別残高計算
      * 処理概要       : 残高履歴計算データ、勘定異動、勘定異動計算データ、
      *                  勘定残高より、勘定残高計算データを作成する
      * 参照ＤＢ       : 勘定残高（TKMZKZ00）
      *                : 勘定科目（TKCMKJ00）
      *                : 勘定異動（TKMZKI00）
      *                : 勘定異動計算データ（TKMZBW15）
      * 更新ＤＢ       : 勘定残高（TKMZKZ00）
      * 引数           : IN   基準日断面情報
      *                : OUT  RTNパッケージ
      * 改訂履歴
      * 年月日        区分     所属    担当      内容
      * ------------  ----    ------  -------  -------------
      * 20080423      新規     SCS     楊超     新規作成
      * 20080910      修正     SCS     楊超
      * 20090205      修正     SCS     顧建鋒   修正
      * 20090211      修正     SCS     顧建鋒   全面見直し
      * 20090316      修正     SCS     徐曉俊   残タスク201対応
      * 20090330      修正     SCS     王  粒   0001616
      * 20090420      修正     SCS     顧建鋒   総合障害285
      * 20090806      修正     SCS     何傑文   性能改善
      * 20090818      修正     SCS     王飛     テーマ982
      * 20091028      修正     SCS     王飛     テーマ1739 テーマ1763
      *                                         テーマ1784 テーマ1557
      * 20091119      修正     SCS     王飛     テーマNo1784の再テスト
      * 20091127      修正     SCS     王飛     テーマ2147
      * 20110425      修正     SCS     孫炯     テーマ3212-1性能改善対応
      * 20130312      修正     SCS     孫炯     テーマ3467
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ2610.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-04-23.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *                 作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
      *----------  共通コンスタント定義の宣言
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
      *---------- プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ2610".
      *---------- 勘定残高（TKMZKZ00）
         05  CNS-TBL-TKMZKZ00      PIC  X(08)  VALUE  "TKMZKZ00".
      *---------- 勘定科目（TKCMKJ00）
         05  CNS-TBL-TKCMKJ00      PIC  X(08)  VALUE  "TKCMKJ00".
      *---------- 勘定異動（TKMZKI00）
         05  CNS-TBL-TKMZKI00      PIC  X(08)  VALUE  "TKMZKI00".
      *---------- 勘定異動計算データ（TKMZBW15）
         05  CNS-TBL-TKMZBW15      PIC  X(08)  VALUE  "TKMZBW15".
      *---------- 勘定残高計算データ（TKMZBW16）
         05  CNS-TBL-TKMZBW16      PIC  X(08)  VALUE  "TKMZBW16".
      *---------- 基準日種類
         05  CNS-KJN-YMD-SHRU-0    PIC  X(01)  VALUE  "0".
         05  CNS-KJN-YMD-SHRU-1    PIC  X(01)  VALUE  "1".
         05  CNS-KJN-YMD-SHRU-2    PIC  X(01)  VALUE  "2".
         05  CNS-KJN-YMD-SHRU-3    PIC  X(01)  VALUE  "3".
         05  CNS-KJN-YMD-SHRU-4    PIC  X(01)  VALUE  "4".
         05  CNS-KJN-YMD-SHRU-5    PIC  X(01)  VALUE  "5".
      *---------- 基準日断面作成区分
         05  CNS-KY-DMN-SK-KBN-1   PIC  X(01)  VALUE  "1".
         05  CNS-KY-DMN-SK-KBN-2   PIC  X(01)  VALUE  "2".
      *---------- 貸借区分 "1":借方
         05  CNS-TAISHK-KBN-1      PIC  X(01)  VALUE  "1".
      *---------- 貸借区分 "2":貸方
         05  CNS-TAISHK-KBN-2      PIC  X(01)  VALUE  "2".
      *---------- 処理フラグ "1":処理する
         05  CNS-SYORI-FLG-1       PIC  X(01)  VALUE  "1".
      *---------- 証券種別コード
         05  CNS-SEC-CD-PRI        PIC  X(04)  VALUE  "PRI ".
      *---------- 勘定科目コード
         05  CNS-05000000-KKM-CD   PIC  X(08)  VALUE  "05000000".
         05  CNS-04000000-KKM-CD   PIC  X(08)  VALUE  "04000000".
         05  CNS-03002001-KKM-CD   PIC  X(08)  VALUE  "03002001".
         05  CNS-03003001-KKM-CD   PIC  X(08)  VALUE  "03003001".
      *---------- 勘定科目処理フラグ "2":勘定科目Ⅱ
         05  CNS-SQL-MSG-DELETE    PIC  X(17)  VALUE
                                               " SQL-MSG(DELETE):".
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-SQL-MSG-INSERT    PIC  X(17)  VALUE
                                               " SQL-MSG(INSERT):".
      *----------  NRIコード
         05  CNS-SQL-KBN-11        PIC  9(02)  VALUE  11.
         05  CNS-SQL-KBN-12        PIC  9(02)  VALUE  12.
      *----------  未処分利益発行
         05  CNS-SQL-KBN-SYUEKI    PIC  9(02)  VALUE  15.
      *----------  未処分損失発行
         05  CNS-SQL-KBN-SONSITU   PIC  9(02)  VALUE  17.
         05  CNS-X-0               PIC  X(01)  VALUE  "0".
         05  CNS-X-1               PIC  X(01)  VALUE  "1".
         05  CNS-X-2               PIC  X(01)  VALUE  "2".
         05  CNS-X-01              PIC  X(02)  VALUE  "01".
         05  CNS-X-02              PIC  X(02)  VALUE  "02".
         05  CNS-X-03              PIC  X(02)  VALUE  "03".
         05  CNS-1                 PIC  9(01)  VALUE  1.
      *----------  複数回起動チェック用スイッチ
       01  FIRST-SW                PIC  X(03)  VALUE  'YES'.            @3212SEINO@@
      ******************************************************************
      *                   フラグ  エリア
      ******************************************************************
       01  FLG-AREA.
      *----------  FETCH終了フラグ (別紙1-3)
         05  FLG-FETCH-SYUURYOU3   PIC  9(01).
      *----------  FETCH終了フラグ (別紙1-7)
         05  FLG-FETCH-TKMZBW16    PIC  9(01).
      *----------  FETCH終了フラグ (別紙1-9)
         05  FLG-FETCH-TKMZBW16-1  PIC  9(01).
      ******************************************************************
      *                   フラグ  エリア
      ******************************************************************
       01  FLG-AREA2.
      *----------  残高履歴計算データ_カーソルオープンフラグ (別紙1-3)
         05  FLG-SEC-SBT-CD-CR-OPEN
                                   PIC  9(01).
      *----------  勘定残高カーソルオープンフラグ (別紙1-4)
         05  FLG-TKMZKZ00-CR-OPEN  PIC  9(01).
      *----------  勘定残高計算データ_2カーソルオープンフラグ (別紙1-7)
         05  FLG-TKMZBW16-OPEN     PIC  9(01).
      *----------  勘定残高計算データ_3カーソルオープンフラグ (別紙1-9)
         05  FLG-TKMZBW16-OPEN-1   PIC  9(01).
      *----------  カーソルオープンフラグ (別紙1-11,別紙1-12)
         05  FLG-TKMZKZ00-OPEN-1   PIC  9(01).
      *----------  カーソルオープンフラグ (別紙1-13,別紙1-14)
         05  FLG-TKCMKJ00-OPEN-1   PIC  9(01).
      *----------  カーソルオープンフラグ (別紙1-15)
         05  FLG-TKMZKZ00-OPEN-15  PIC  9(01).
      *----------  カーソルオープンフラグ (別紙1-16)
         05  FLG-TKMZKZ00-OPEN-16  PIC  9(01).
      *----------  該当基準日の勘定残高データを物理削除フラグ           @3212SEINO@@
         05  FLG-TKMZKZ00-DEL-1    PIC  9(01).                          @3212SEINO@@
      *----------  勘定残高計算データINSERT処理フラグ                   @3212SEINO@@
         05  FLG-TKMZBW16-INS-8    PIC  9(01).                          @3212SEINO@@
      *----------  勘定残高計算データINSERT処理フラグ                   @3212SEINO@@
         05  FLG-TKMZBW16-INS-10   PIC  9(01).                          @3212SEINO@@
      ******************************************************************
      *                 ワ－ク  エリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      *----------  処理実行日
         05  WK-SYORI-YMD          PIC  S9(08).
      *----------  起動ID
         05  WK-KIDOU-ID           PIC  X(04).
      *----------  利用会社コード
         05  WK-RIYO-CMP-CD        PIC  X(04).
      *----------  ファンドコード
         05  WK-FUND-CD            PIC  X(12).
      *----------  ポートフォリオコード
         05  WK-PTF-CD             PIC  X(04).
      *----------  基準日
         05  WK-KJN-YMD            PIC  S9(08).
      *---------- 運用通貨コード
         05  WK-CAPITAL-TUKA-CD    PIC  X(04).
      *----------  開始基準日
         05  WK-KAISI-KJN-YMD      PIC  S9(08).
      *----------  開始基準日の翌日
         05  WK-KAISI-KJN-YMD-NEXT PIC  S9(08).
      *----------  基準日種類
         05  WK-KJN-YMD-SHRU       PIC  X(01).
      *----------  基準日断面作成区分
         05  WK-KJN-YMD-DMN-SK-KBN PIC  X(01).
      *----------  ワークテーブル勘定残高
         05  WK-TBL-TKMZKZ00       PIC  X(13).
      *----------  ワークテーブル勘定科目
         05  WK-TBL-TKCMKJ00       PIC  X(13).
      *----------  ワークテーブル勘定異動
         05  WK-TBL-TKMZKI00       PIC  X(13).
      *----------  ワークテーブル勘定異動計算データ
         05  WK-TBL-TKMZBW15       PIC  X(13).
      *----------  ワークテーブル勘定残高計算データ
         05  WK-TBL-TKMZBW16       PIC  X(13).
      *----------  ワーク.勘定科目コード
         05  WK-KNJ-KAMK-CD        PIC  X(08).
      *----------  ワーク.貸借区分
         05  WK-TAISHK-KBN         PIC  X(01).
      *----------  ワーク.基準日断面作成区分
         05  WK-KY-DMN-SK-KBN      PIC  X(01).
      *----------  ワーク.決算断面以外
         05  WK-KSN-DMN-GAI.
      *---------- 処理フラグ
           10  WK-SYORI-FLG        PIC  X(01).
      *---------- 勘定異動額(当日・借方)
           10  WK-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(当日・貸方)
           10  WK-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・借方)
           10  WK-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・貸方)
           10  WK-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定残高
           10  WK-KNJZN            PIC  S9(15)V9(03).
      *----------  ワーク.決算前
         05  WK-KSN-MAE.
      *---------- 処理フラグ
           10  WK-SYORI-FLG        PIC  X(01).
      *---------- 勘定異動額(当日・借方)
           10  WK-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(当日・貸方)
           10  WK-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・借方)
           10  WK-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・貸方)
           10  WK-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定残高
           10  WK-KNJZN            PIC  S9(15)V9(03).
      *----------  ワーク.決算後
         05  WK-KSN-ATO.
      *---------- 処理フラグ
           10  WK-SYORI-FLG        PIC  X(01).
      *---------- 勘定異動額(当日・借方)
           10  WK-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(当日・貸方)
           10  WK-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・借方)
           10  WK-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・貸方)
           10  WK-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定残高
           10  WK-KNJZN            PIC  S9(15)V9(03).
      *---------- ワーク.未処分損益グループ
         05  WK-SYUEKI-SONSITU-G.
      *---------- 勘定異動額(当日・借方)
           10  WK-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(当日・貸方)
           10  WK-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・借方)
           10  WK-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・貸方)
           10  WK-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定残高
           10  WK-KNJZN            PIC  S9(15)V9(03).
      *---------- ワーク.未処分利益
         05  WK-SYUEKI-G.
      *---------- 勘定異動額(当日・借方)
           10  WK-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(当日・貸方)
           10  WK-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・借方)
           10  WK-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・貸方)
           10  WK-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定残高
           10  WK-KNJZN            PIC  S9(15)V9(03).
      *---------- ワーク.未処分損失
         05  WK-SONSITU-G.
      *---------- 勘定異動額(当日・借方)
           10  WK-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(当日・貸方)
           10  WK-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・借方)
           10  WK-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額(期間・貸方)
           10  WK-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定残高
           10  WK-KNJZN            PIC  S9(15)V9(03).
      *---------- ワーク.未処分利益フラグ
         05  WK-SYUEKI-FLG         PIC  X(01).
      *---------- ワーク.未処分損失フラグ
         05  WK-SONSITU-FLG        PIC  X(01).
      *---------- ワーク.COUNT(決算日断面区分)
         05  WK-COUNT-KYDK         PIC  9(08).
      *---------- 別紙1-4.勘定異動額（期間・借方）
         05  WK-KNJ-IDOK-KKN-DEBIT-4
                                   PIC  S9(15)V9(03).
      *---------- 別紙1-4.勘定異動額（期間・貸方）
         05  WK-KNJ-IDOK-KKN-CREDIT-4
                                   PIC  S9(15)V9(03).
      *---------- ワーク.証券種別コード
         05  WK-SEC-SBT-CD         PIC  X(04).
      *---------- ワーク.勘定残高(収益)
         05  WK-KNJZN-SYUEKI       PIC  S9(15)V9(03).
      *---------- ワーク.勘定残高(損失)
         05  WK-KNJZN-SONSITU      PIC  S9(15)V9(03).
      *---------- ワーク.貸借区分(収益)
         05  WK-TAISHK-KBN-SYUEKI  PIC  X(01).
      *---------- ワーク.貸借区分(損失)
         05  WK-TAISHK-KBN-SONSITU PIC  X(01).
      *---------- ワーク.未処分損益
         05  WK-SYUEKI-SONSITU     PIC  S9(15)V9(03).
      *---------- ワーク中間値
         05  WK-CHUKAN-CHI         PIC  S9(15)V9(03).
      *----------  ポジション
         05  WK-ERR-POS            PIC  X(04).
         05  WK-SQL-KBN            PIC  9(02).
      *----------  WK-POS
         05  WK-POS-1              PIC  X(04).
         05  WK-POS-2              PIC  X(04).
         05  WK-POS-3              PIC  X(04).
         05  WK-POS-4              PIC  X(04).
      ******************************************************************
      *                ORACLE ホスト変数定義
      ******************************************************************
      *----------ＳＱＬコミュニケーション領域
           EXEC  SQL      INCLUDE   SQLCA        END-EXEC.
           EXEC  SQL      INCLUDE   ORACA        END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
      *----------ORACLE宣言文（ホスト変数定義）
       01  HOST-AREA.
      *---------- 勘定残高条件(別紙1-1)
         05  H-TKMZKZ00-D.
      *------  利用会社コード
      *    10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *------  評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *---------- 勘定科目(別紙1-2)
         05  H-TKCMKJ00-2.
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *------  貸借区分
           10  H-TAISHK-KBN        PIC  X(01).
      *---------- 勘定異動 UNION 勘定異動計算データ 条件(別紙1-3)
         05  H-UNION-S3.
      *------  利用会社コード
           10  H-RIYO-CMP-CD1      PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD1          PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD1           PIC  X(04).
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD1      PIC  X(08).
      *------  基準日
           10  H-KJN-YMD1          PIC  S9(08).
      *------  開始基準日の翌日
           10  H-KAISI-KY-NEXT1    PIC  S9(08).
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  利用会社コード
           10  H-RIYO-CMP-CD2      PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD2          PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD2           PIC  X(04).
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD2      PIC  X(08).
      *------  基準日
           10  H-KJN-YMD2          PIC  S9(08).
      *------  開始基準日の翌日
           10  H-KAISI-KY-NEXT2    PIC  S9(08).
      *------  利用会社コード
           10  H-RIYO-CMP-CD3      PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD3          PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD3           PIC  X(04).
      *------  基準日
           10  H-KAISI-KJN-YMD3    PIC  S9(08).
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD3      PIC  X(08).
      *------  貸借区分
           10  H-TAISHK-KBN3       PIC  X(01).
      *---------- 勘定異動 UNION 勘定異動計算データ (別紙1-3)
         05  H-UNION-3.
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *---------- 勘定残高条件(別紙1-4)
         05  H-TKMZKZ00-S4.
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  基準日
           10  H-KAISI-KJN-YMD     PIC  S9(08).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *------  貸借区分
           10  H-TAISHK-KBN        PIC  X(01).
      *---------- 勘定残高(別紙1-4)
         05  H-TKMZKZ00-4.
      *------  勘定残高
           10  H-KNJZN             PIC  S9(15)V9(03).
      *------  勘定異動額（期間・借方）
           10  H-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *------  勘定異動額（期間・貸方）
           10  H-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定残高計算データ(別紙1-7)
         05  H-TKMZBW16-S.
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *---------- 勘定残高計算データ(別紙1-7)
         05  H-TKMZBW16.
      *------  決算日断面区分
           10  H-KSN-YMD-DMN-KBN   PIC  X(01).
      *------  勘定科目_中分類
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *------  貸借区分
           10  H-TAISHK-KBN        PIC  X(01).
      *------  勘定残高_目標
           10  H-KNJZN             PIC  S9(18)V9(03).
      *------  勘定異動額（期間・借方）_目標
           10  H-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(18)V9(03).
      *------  勘定異動額（期間・貸方）_目標
           10  H-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(18)V9(03).
      *------  勘定異動額（当日・借方）_目標
           10  H-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(18)V9(03).
      *------  勘定異動額（当日・貸方）_目標
           10  H-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(18)V9(03).
      *---------- 勘定残高計算データ(別紙1-8)
         05  H-TKMZBW16-INSERT.
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *------  決算日断面区分
           10  H-KSN-YMD-DMN-KBN   PIC  X(01).
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *------  貸借区分
           10  H-TAISHK-KBN        PIC  X(01).
      *------  勘定残高
           10  H-KNJZN             PIC  S9(15)V9(03).
      *---------- 勘定異動額（期間・借方）
           10  H-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額（期間・貸方）
           10  H-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額（当日・借方）
           10  H-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額（当日・貸方）
           10  H-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
      *------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *---------- 勘定残高計算データ(別紙1-9)
         05  H-TKMZBW16-S-1.
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *---------- 勘定残高計算データ(別紙1-9)
         05  H-TKMZBW16-1.
      *------  決算日断面区分
           10  H-KSN-YMD-DMN-KBN   PIC  X(01).
      *------  勘定科目_中分類
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *------  貸借区分
           10  H-TAISHK-KBN        PIC  X(01).
      *------  勘定残高_目標
           10  H-KNJZN             PIC  S9(18)V9(03).
      *------  勘定異動額（期間・借方）_目標
           10  H-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(18)V9(03).
      *------  勘定異動額（期間・貸方）_目標
           10  H-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(18)V9(03).
      *------  勘定異動額（当日・借方）_目標
           10  H-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(18)V9(03).
      *------  勘定異動額（当日・貸方）_目標
           10  H-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(18)V9(03).
      *---------- 勘定残高計算データ(別紙1-10)
         05  H-TKMZBW16-INSERT-1.
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *------  決算日断面区分
           10  H-KSN-YMD-DMN-KBN   PIC  X(01).
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *------  貸借区分
           10  H-TAISHK-KBN        PIC  X(01).
      *------  勘定残高
           10  H-KNJZN             PIC  S9(15)V9(03).
      *---------- 勘定異動額（期間・借方）
           10  H-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額（期間・貸方）
           10  H-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額（当日・借方）
           10  H-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *---------- 勘定異動額（当日・貸方）
           10  H-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
      *------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *---------- 勘定残高(別紙1-11,別紙1-12)
         05  H-TKMZKZ00-S-11.
           10  H-KNJZN             PIC  S9(15)V9(03).
           10  H-TAISHK-KBN        PIC  X(01).
         05  H-TKMZKZ00-11.
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *---------- 勘定科目(別紙1-13,別紙1-14)
         05  H-TKCMKJ00-S-13.
      *---------- 貸借区分
           10  H-TAISHK-KBN        PIC  X(01).
         05  H-TKCMKJ00-13.
      *------  勘定科目コード
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *---------- 勘定残高(別紙1-15)
         05  H-TKMZKZ00-S-15.
      *---------- 勘定残高
           10  H-KNJZN             PIC  S9(15)V9(03).
      *----------  勘定異動額（期間・借方）
           10  H-KNJ-IDOK-KKN-DEBIT
                                   PIC  S9(15)V9(03).
      *----------  勘定異動額（期間・貸方）
           10  H-KNJ-IDOK-KKN-CREDIT
                                   PIC  S9(15)V9(03).
      *----------  勘定異動額（当日・借方）
           10  H-KNJ-IDOK-TJT-DEBIT
                                   PIC  S9(15)V9(03).
      *----------  勘定異動額（当日・貸方）
           10  H-KNJ-IDOK-TJT-CREDIT
                                   PIC  S9(15)V9(03).
         05  H-TKMZKZ00-15.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD     PIC  S9(08).
      *----------  勘定科目コード
           10  H-KNJ-KAMK-CD       PIC  X(08).
      *----------  勘定残高(別紙1-16)
         05  H-TKMZKZ00-S-16.
      *----------  COUNT(決算日断面区分)
           10  H-COUNT-KYDK        PIC  9(08).
         05  H-TKMZKZ00-16.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD     PIC  S9(08).
         05  SQLSTMT1              PIC  X(200).                         @3212SEINO@@
         05  SQLSTMT3              PIC  X(1300).                        @3212SEINO@@
         05  SQLSTMT4              PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT7              PIC  X(650).                         @3212SEINO@@
         05  SQLSTMT8              PIC  X(750).                         @3212SEINO@@
         05  SQLSTMT9              PIC  X(700).                         @3212SEINO@@
         05  SQLSTMT10             PIC  X(750).                         @3212SEINO@@
         05  SQLSTMT11             PIC  X(450).                         @3212SEINO@@
         05  SQLSTMT13             PIC  X(100).                         @3212SEINO@@
         05  SQLSTMT15             PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT16             PIC  X(250).                         @3212SEINO@@
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *                ミドル
      ******************************************************************
       01  SQL-TBL.
      *---------- DELETE SQL文(別紙1-1)
      *---------- 勘定残高 DELETE 処理
         05  SQL-DELETE-1-1.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE "DELETE FROM ".
             15  SQL-TKMZKZ00      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *---------- 利用会社コード
      *      15  FILLER            PIC  X(28)  VALUE
      *          "RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *---------- ファンドコード
             15  FILLER            PIC  X(21)  VALUE
                 " FUND_CD = :P_FUND_CD".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *---------- 基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND KJN_YMD = :P_KJN_YMD".
      *---------- 評価系列コード
             15  FILLER            PIC  X(33)  VALUE
                 " AND HYK_KRTU_CD = :P_HYK_KRTU_CD".
      *---------- SELECT SQL文(別紙1-3)
      *---------- 勘定異動 FETCH 処理
         05  SQL-SELECT-1-3.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
             15  FILLER            PIC  X(27)  VALUE
                 "DISTINCT WKVIEW.SEC_SBT_CD,".
             15  FILLER            PIC  X(14)  VALUE
                 "A.KNJ_KAMK_CD,".
             15  FILLER            PIC  X(12)  VALUE
                 "A.TAISHK_KBN".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKCMKJ00      PIC  X(13).
             15  FILLER            PIC  X(04)  VALUE
                 " A,(".
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
             15  FILLER            PIC  X(23)  VALUE
                 "SEC_SBT_CD, KNJ_KAMK_CD".
             15  FILLER            PIC  X(21)  VALUE
                 ",'X' AS WK_TAISHK_KBN".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKMZKI00      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE " WHERE".
      *---------- 利用会社コード
             15  FILLER            PIC  X(29)  VALUE
                 " RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *---------- ファンドコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND FUND_CD = :P_FUND_CD".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *---------- 計上基準日
             15  FILLER            PIC  X(33)  VALUE
                 " AND KEIJOU_KIJUNBI <= :P_KJN_YMD".
      *---------- 計上基準日
             15  FILLER            PIC  X(44)  VALUE
                 " AND KEIJOU_KIJUNBI >= :P_KAISI_KJN_YMD_NEXT".
      *---------- UNION
             15  FILLER            PIC  X(07)  VALUE " UNION ".
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *---------- 証券種別コード
             15  FILLER            PIC  X(23)  VALUE
                 "SEC_SBT_CD, KNJ_KAMK_CD".
             15  FILLER            PIC  X(21)  VALUE
                 ",'X' AS WK_TAISHK_KBN".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKMZBW15      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE " WHERE".
      *---------- 処理実行日
             15  FILLER            PIC  X(25)  VALUE
                 " SYORI_YMD = :P_SYORI_YMD".
      *---------- 起動ID
             15  FILLER            PIC  X(27)  VALUE
                 " AND KIDOU_ID = :P_KIDOU_ID".
      *---------- 利用会社コード
             15  FILLER            PIC  X(33)  VALUE
                 " AND RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *---------- ファンドコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND FUND_CD = :P_FUND_CD".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *---------- 計上基準日
             15  FILLER            PIC  X(33)  VALUE
                 " AND KEIJOU_KIJUNBI <= :P_KJN_YMD".
      *---------- 計上基準日
             15  FILLER            PIC  X(44)  VALUE
                 " AND KEIJOU_KIJUNBI >= :P_KAISI_KJN_YMD_NEXT".
      *---------- UNION
             15  FILLER            PIC  X(07)  VALUE " UNION ".
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
             15  FILLER            PIC  X(23)  VALUE
                 "SEC_SBT_CD, KNJ_KAMK_CD".
             15  FILLER            PIC  X(28)  VALUE
                 ",TAISHK_KBN AS WK_TAISHK_KBN".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKMZKZ00      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *---------- 利用会社コード
             15  FILLER            PIC  X(28)  VALUE
                 "RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *---------- ファンドコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND FUND_CD = :P_FUND_CD".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *---------- 評価系列コード
             15  FILLER            PIC  X(22)  VALUE
                 " AND HYK_KRTU_CD = ' '".
      *---------- 基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND KJN_YMD = :P_KJN_YMD".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(07)  VALUE
                 " AND ( ".
             15  FILLER            PIC  X(45)  VALUE
                 "(SUBSTR(KNJ_KAMK_CD,1,2) IN ('01','02','03') ".
             15  FILLER            PIC  X(36)  VALUE
                 "AND KSN_YMD_DMN_KBN IN('0','2')) OR ".
             15  FILLER            PIC  X(40)  VALUE
                 "(SUBSTR(KNJ_KAMK_CD,1,2) IN ('04','05') ".
             15  FILLER            PIC  X(28)  VALUE
                 "AND KSN_YMD_DMN_KBN  = '0') ".
             15  FILLER            PIC  X(02)  VALUE
                 ") ".
      *---------- 証券種別コード
             15  FILLER            PIC  X(22)  VALUE
                 " AND SEC_SBT_CD <> ' '".
             15  FILLER            PIC  X(08)  VALUE
                 ") WKVIEW".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(40)  VALUE
                 "( WK_TAISHK_KBN = DECODE(WK_TAISHK_KBN, ".
             15  FILLER            PIC  X(31)  VALUE
                 "'X',WK_TAISHK_KBN,A.TAISHK_KBN)".
             15  FILLER            PIC  X(39)  VALUE
                 " AND A.KNJ_KAMK_CD = WKVIEW.KNJ_KAMK_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.RIYO_CMP_CD = '4999'".
             15  FILLER            PIC  X(35)  VALUE
                 " AND SUBSTR(A.KNJ_KAMK_CD, 1, 2) IN".
             15  FILLER            PIC  X(33)  VALUE
                 " ('01', '02', '03', '04', '05')) ".
             15  FILLER            PIC  X(36)  VALUE
                 "ORDER BY A.KNJ_KAMK_CD ,A.TAISHK_KBN".
      *---------- SELECT SQL文(別紙1-4)
      *---------- 勘定残高 FETCH 処理
         05  SQL-SELECT-1-4.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *---------- 勘定残高
             15  FILLER            PIC  X(06)  VALUE "KNJZN,".
      *---------- 勘定異動額（期間・借方）
             15  FILLER            PIC  X(19)  VALUE
                 "KNJ_IDOK_KKN_DEBIT,".
      *---------- 勘定異動額（期間・貸方）
             15  FILLER            PIC  X(20)  VALUE
                 "KNJ_IDOK_KKN_CREDIT ".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKMZKZ00      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *---------- 利用会社コード
             15  FILLER            PIC  X(28)  VALUE
                 "RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *---------- ファンドコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND FUND_CD = :P_FUND_CD".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *---------- 評価系列コード
             15  FILLER            PIC  X(22)  VALUE
                 " AND HYK_KRTU_CD = ' '".
      *---------- 基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND KJN_YMD = :P_KJN_YMD".
      *---------- 証券種別コード
             15  FILLER            PIC  X(31)  VALUE
                 " AND SEC_SBT_CD = :P_SEC_SBT_CD".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(33)  VALUE
                 " AND KNJ_KAMK_CD = :P_KNJ_KAMK_CD".
      *---------- 貸借区分
             15  FILLER            PIC  X(31)  VALUE
                 " AND TAISHK_KBN = :P_TAISHK_KBN".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(07)  VALUE
                 " AND ( ".
             15  FILLER            PIC  X(45)  VALUE
                 "(SUBSTR(KNJ_KAMK_CD,1,2) IN ('01','02','03') ".
             15  FILLER            PIC  X(36)  VALUE
                 "AND KSN_YMD_DMN_KBN IN('0','2')) OR ".
             15  FILLER            PIC  X(40)  VALUE
                 "(SUBSTR(KNJ_KAMK_CD,1,2) IN ('04','05') ".
             15  FILLER            PIC  X(28)  VALUE
                 "AND KSN_YMD_DMN_KBN  = '0') ".
             15  FILLER            PIC  X(02)  VALUE
                 ") ".
      *---------- SELECT SQL文(別紙1-7)
         05  SQL-SELECT-1-7.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(16)  VALUE "KSN_YMD_DMN_KBN,".
      *---------- 勘定科目_中分類
             15  FILLER            PIC  X(13)  VALUE "KNJ_KAMK_MID,".
      *---------- 貸借区分
             15  FILLER            PIC  X(11)  VALUE "TAISHK_KBN,".
      *----------  SUM(勘定残高)
             15  FILLER            PIC  X(11)  VALUE "SUM(KNJZN),".
      *----------  SUM(勘定異動額（期間・借方）)
             15  FILLER            PIC  X(24)
                                   VALUE "SUM(KNJ_IDOK_KKN_DEBIT),".
      *----------  SUM(勘定異動額（期間・貸方）)
             15  FILLER            PIC  X(25)
                                   VALUE "SUM(KNJ_IDOK_KKN_CREDIT),".
      *----------  SUM(勘定異動額（当日・借方）)
             15  FILLER            PIC  X(24)
                                   VALUE "SUM(KNJ_IDOK_TJT_DEBIT),".
      *----------  SUM(勘定異動額（当日・貸方）)
             15  FILLER            PIC  X(24)
                                   VALUE "SUM(KNJ_IDOK_TJT_CREDIT)".
           10  SQL-FROM.
             15  FILLER            PIC  X(07)  VALUE " FROM (".
           10  SQL-SELECT-1.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(16)  VALUE "KSN_YMD_DMN_KBN,".
      *---------- 勘定科目_中分類
             15  FILLER            PIC  X(47)
               VALUE "SUBSTR(KNJ_KAMK_CD,1,5)||'000' AS KNJ_KAMK_MID,".
      *---------- 貸借区分
             15  FILLER            PIC  X(11)  VALUE "TAISHK_KBN,".
      *----------  勘定残高
             15  FILLER            PIC  X(06)  VALUE "KNJZN,".
      *----------  勘定異動額（期間・借方）
             15  FILLER            PIC  X(19)
                                   VALUE "KNJ_IDOK_KKN_DEBIT,".
      *----------  勘定異動額（期間・貸方）
             15  FILLER            PIC  X(20)
                                   VALUE "KNJ_IDOK_KKN_CREDIT,".
      *----------  勘定異動額（当日・借方）
             15  FILLER            PIC  X(19)
                                   VALUE "KNJ_IDOK_TJT_DEBIT,".
      *----------  勘定異動額（当日・貸方）
             15  FILLER            PIC  X(19)
                                   VALUE "KNJ_IDOK_TJT_CREDIT".
           10  SQL-FROM-1.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKMZBW16      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE " WHERE".
      *---------- 処理実行日
             15  FILLER            PIC  X(25)  VALUE
                 " SYORI_YMD = :P_SYORI_YMD".
      *---------- 起動ID
             15  FILLER            PIC  X(27)  VALUE
                 " AND KIDOU_ID = :P_KIDOU_ID".
      *---------- 利用会社コード
             15  FILLER            PIC  X(33)  VALUE
                 " AND RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *---------- ファンドコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND FUND_CD = :P_FUND_CD".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *---------- 評価系列コード
             15  FILLER            PIC  X(25)  VALUE
                 " AND HYK_KRTU_CD = '    '".
      *---------- 基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND KJN_YMD = :P_KJN_YMD".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(39)  VALUE
                 " AND SUBSTR(KNJ_KAMK_CD,6,8) <> '000')".
      *---------- GROUP BY
           10  SQL-GROUPBY.
             15  FILLER            PIC  X(09)  VALUE " GROUP BY".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(40)  VALUE
                 " KSN_YMD_DMN_KBN,KNJ_KAMK_MID,TAISHK_KBN".
      *----------  勘定残高計算データINSERT処理 (「別紙1-8 SQL説明」を参照)
         05  SQL-INSERT-1-8.
           10  S-INSERT-1-8.
             15  FILLER            PIC  X(12)  VALUE "INSERT INTO ".
             15  SQL-TKMZBW16      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE " (".
      *----------  処理実行日
             15  FILLER            PIC  X(11)  VALUE " SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(10)  VALUE " KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE " RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE " FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE " PTF_CD,".
      *----------  評価系列コード
             15  FILLER            PIC  X(13)  VALUE " HYK_KRTU_CD,".
      *----------  基準日
             15  FILLER            PIC  X(09)  VALUE " KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(17) VALUE " KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE " SEC_SBT_CD,".
      *----------  勘定科目コード
             15  FILLER            PIC  X(13)  VALUE " KNJ_KAMK_CD,".
      *----------  貸借区分
             15  FILLER            PIC  X(12)  VALUE " TAISHK_KBN,".
      *----------  勘定残高
             15  FILLER            PIC  X(07)  VALUE " KNJZN,".
      *----------  勘定異動額（期間・借方）
             15  FILLER            PIC  X(20)
                                   VALUE " KNJ_IDOK_KKN_DEBIT,".
      *----------  勘定異動額（期間・貸方）
             15  FILLER            PIC  X(21)
                                   VALUE " KNJ_IDOK_KKN_CREDIT,".
      *----------  勘定異動額（当日・借方）
             15  FILLER            PIC  X(20)
                                   VALUE " KNJ_IDOK_TJT_DEBIT,".
      *----------  勘定異動額（当日・貸方）
             15  FILLER            PIC  X(21)
                                   VALUE " KNJ_IDOK_TJT_CREDIT,".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE " SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE " SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                                   VALUE " SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE " SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE " SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE " UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)
                                   VALUE " UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE " UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE " UPD_PGMID)".
           10  S-VALUES-1-8.
             15  FILLER            PIC  X(07)  VALUE " VALUES".
             15  FILLER            PIC  X(03)  VALUE " ( ".
      *----------  処理実行日
             15  FILLER            PIC  X(14)  VALUE " :P_SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(13)  VALUE " :P_KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(16)  VALUE " :P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(12)  VALUE " :P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(11)  VALUE " :P_PTF_CD,".
      *----------  評価系列コード
             15  FILLER            PIC  X(08)  VALUE " '    ',".
      *----------  基準日
             15  FILLER            PIC  X(12)  VALUE " :P_KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(20)
                                   VALUE " :P_KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(08)  VALUE " '    ',".
      *----------  勘定科目コード
             15  FILLER            PIC  X(16)  VALUE " :P_KNJ_KAMK_CD,".
      *----------  貸借区分
             15  FILLER            PIC  X(15)  VALUE " :P_TAISHK_KBN,".
      *----------  勘定残高
             15  FILLER            PIC  X(10)  VALUE " :P_KNJZN,".
      *----------  勘定異動額（期間・借方）
             15  FILLER            PIC  X(23)
                                   VALUE " :P_KNJ_IDOK_KKN_DEBIT,".
      *----------  勘定異動額（期間・貸方）
             15  FILLER            PIC  X(24)
                                   VALUE " :P_KNJ_IDOK_KKN_CREDIT,".
      *----------  勘定異動額（当日・借方）
             15  FILLER            PIC  X(23)
                                   VALUE " :P_KNJ_IDOK_TJT_DEBIT,".
      *----------  勘定異動額（当日・貸方）
             15  FILLER            PIC  X(24)
                                   VALUE " :P_KNJ_IDOK_TJT_CREDIT,".
      *----------  削除区分
             15  FILLER            PIC  X(15)  VALUE " :P_SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE " SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)
                                   VALUE " :P_RIYO_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(05)  VALUE " ' ',".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE " 'SMZJ2610',".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE " SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(16)
                                   VALUE " :P_RIYO_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(05)  VALUE " ' ',".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE " 'SMZJ2610')".
      *---------- SELECT SQL文(別紙1-9)
         05  SQL-SELECT-1-9.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(16)  VALUE "KSN_YMD_DMN_KBN,".
      *---------- 勘定科目_大分類
             15  FILLER            PIC  X(13)  VALUE "KNJ_KAMK_BIG,".
      *---------- 貸借区分
             15  FILLER            PIC  X(11)  VALUE "TAISHK_KBN,".
      *----------  SUM(勘定残高)
             15  FILLER            PIC  X(11)  VALUE "SUM(KNJZN),".
      *----------  SUM(勘定異動額（期間・借方）)
             15  FILLER            PIC  X(24)
                                   VALUE "SUM(KNJ_IDOK_KKN_DEBIT),".
      *----------  SUM(勘定異動額（期間・貸方）)
             15  FILLER            PIC  X(25)
                                   VALUE "SUM(KNJ_IDOK_KKN_CREDIT),".
      *----------  SUM(勘定異動額（当日・借方）)
             15  FILLER            PIC  X(24)
                                   VALUE "SUM(KNJ_IDOK_TJT_DEBIT),".
      *----------  SUM(勘定異動額（当日・貸方）)
             15  FILLER            PIC  X(24)
                                   VALUE "SUM(KNJ_IDOK_TJT_CREDIT)".
           10  SQL-FROM.
             15  FILLER            PIC  X(07)  VALUE " FROM (".
           10  SQL-SELECT-1.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(16)  VALUE "KSN_YMD_DMN_KBN,".
      *---------- 勘定科目_大分類
             15  FILLER            PIC  X(50)
             VALUE "SUBSTR(KNJ_KAMK_CD,1,2)||'000000' AS KNJ_KAMK_BIG,".
      *---------- 貸借区分
             15  FILLER            PIC  X(11)  VALUE "TAISHK_KBN,".
      *----------  勘定残高
             15  FILLER            PIC  X(06)  VALUE "KNJZN,".
      *----------  勘定異動額（期間・借方）
             15  FILLER            PIC  X(19)
                                   VALUE "KNJ_IDOK_KKN_DEBIT,".
      *----------  勘定異動額（期間・貸方）
             15  FILLER            PIC  X(20)
                                   VALUE "KNJ_IDOK_KKN_CREDIT,".
      *----------  勘定異動額（当日・借方）
             15  FILLER            PIC  X(19)
                                   VALUE "KNJ_IDOK_TJT_DEBIT,".
      *----------  勘定異動額（当日・貸方）
             15  FILLER            PIC  X(19)
                                   VALUE "KNJ_IDOK_TJT_CREDIT".
           10  SQL-FROM-1.
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKMZBW16      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE " WHERE".
      *---------- 処理実行日
             15  FILLER            PIC  X(25)  VALUE
                 " SYORI_YMD = :P_SYORI_YMD".
      *---------- 起動ID
             15  FILLER            PIC  X(27)  VALUE
                 " AND KIDOU_ID = :P_KIDOU_ID".
      *---------- 利用会社コード
             15  FILLER            PIC  X(33)  VALUE
                 " AND RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *---------- ファンドコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND FUND_CD = :P_FUND_CD".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *---------- 評価系列コード
             15  FILLER            PIC  X(25)  VALUE
                 " AND HYK_KRTU_CD = '    '".
      *---------- 基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND KJN_YMD = :P_KJN_YMD".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(36)  VALUE
                 " AND SUBSTR(KNJ_KAMK_CD,6,8) = '000'".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(38)  VALUE
                 " AND SUBSTR(KNJ_KAMK_CD,3,5) <> '000')".
      *---------- GROUP BY
           10  SQL-GROUPBY.
             15  FILLER            PIC  X(09)  VALUE " GROUP BY".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(40)  VALUE
                 " KSN_YMD_DMN_KBN,KNJ_KAMK_BIG,TAISHK_KBN".
      *----------  勘定残高計算データINSERT処理 (「別紙1-10 SQL説明」を参照)
         05  SQL-INSERT-1-10.
           10  S-INSERT-1-10.
             15  FILLER            PIC  X(12)  VALUE "INSERT INTO ".
             15  SQL-TKMZBW16      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE " (".
      *----------  処理実行日
             15  FILLER            PIC  X(11)  VALUE " SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(10)  VALUE " KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE " RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE " FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE " PTF_CD,".
      *----------  評価系列コード
             15  FILLER            PIC  X(13)  VALUE " HYK_KRTU_CD,".
      *----------  基準日
             15  FILLER            PIC  X(09)  VALUE " KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(17) VALUE " KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE " SEC_SBT_CD,".
      *----------  勘定科目コード
             15  FILLER            PIC  X(13)  VALUE " KNJ_KAMK_CD,".
      *----------  貸借区分
             15  FILLER            PIC  X(12)  VALUE " TAISHK_KBN,".
      *----------  勘定残高
             15  FILLER            PIC  X(07)  VALUE " KNJZN,".
      *----------  勘定異動額（期間・借方）
             15  FILLER            PIC  X(20)
                                   VALUE " KNJ_IDOK_KKN_DEBIT,".
      *----------  勘定異動額（期間・貸方）
             15  FILLER            PIC  X(21)
                                   VALUE " KNJ_IDOK_KKN_CREDIT,".
      *----------  勘定異動額（当日・借方）
             15  FILLER            PIC  X(20)
                                   VALUE " KNJ_IDOK_TJT_DEBIT,".
      *----------  勘定異動額（当日・貸方）
             15  FILLER            PIC  X(21)
                                   VALUE " KNJ_IDOK_TJT_CREDIT,".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE " SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE " SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(17)
                                   VALUE " SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE " SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE " SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE " UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)
                                   VALUE " UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE " UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE " UPD_PGMID)".
           10  S-VALUES-1-10.
             15  FILLER            PIC  X(07)  VALUE " VALUES".
             15  FILLER            PIC  X(03)  VALUE " ( ".
      *----------  処理実行日
             15  FILLER            PIC  X(14)  VALUE " :P_SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(13)  VALUE " :P_KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(16)  VALUE " :P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(12)  VALUE " :P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(11)  VALUE " :P_PTF_CD,".
      *----------  評価系列コード
             15  FILLER            PIC  X(08)  VALUE " '    ',".
      *----------  基準日
             15  FILLER            PIC  X(12)  VALUE " :P_KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(20)
                                   VALUE " :P_KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(08)  VALUE " '    ',".
      *----------  勘定科目コード
             15  FILLER            PIC  X(16)  VALUE " :P_KNJ_KAMK_CD,".
      *----------  貸借区分
             15  FILLER            PIC  X(15)  VALUE " :P_TAISHK_KBN,".
      *----------  勘定残高
             15  FILLER            PIC  X(10)  VALUE " :P_KNJZN,".
      *----------  勘定異動額（期間・借方）
             15  FILLER            PIC  X(23)
                                   VALUE " :P_KNJ_IDOK_KKN_DEBIT,".
      *----------  勘定異動額（期間・貸方）
             15  FILLER            PIC  X(24)
                                   VALUE " :P_KNJ_IDOK_KKN_CREDIT,".
      *----------  勘定異動額（当日・借方）
             15  FILLER            PIC  X(23)
                                   VALUE " :P_KNJ_IDOK_TJT_DEBIT,".
      *----------  勘定異動額（当日・貸方）
             15  FILLER            PIC  X(24)
                                   VALUE " :P_KNJ_IDOK_TJT_CREDIT,".
      *----------  削除区分
             15  FILLER            PIC  X(15)  VALUE " :P_SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(09)  VALUE " SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)
                                   VALUE " :P_RIYO_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(05)  VALUE " ' ',".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE " 'SMZJ2610',".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE " SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(16)
                                   VALUE " :P_RIYO_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(05)  VALUE " ' ',".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE " 'SMZJ2610')".
      *---------- SELECT SQL文(別紙1-11,別紙1-12)
         05  SQL-SELECT-1-11.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *---------- 勘定残高
             15  FILLER            PIC  X(09)  VALUE "A.KNJZN, ".
      *---------- 貸借区分
             15  FILLER            PIC  X(12)  VALUE "A.TAISHK_KBN".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKMZKZ00      PIC  X(13).
             15  FILLER            PIC  X(04)  VALUE " A, ".
             15  SQL-TKCMKJ00      PIC  X(13).
             15  FILLER            PIC  X(03)  VALUE " B ".
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *---------- 利用会社コード
             15  FILLER            PIC  X(35)  VALUE
                 "A.RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *---------- ファンドコード
             15  FILLER            PIC  X(27)  VALUE
                 "AND A.FUND_CD = :P_FUND_CD ".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(25)  VALUE
                 "AND A.PTF_CD = :P_PTF_CD ".
      *---------- 評価系列コード
             15  FILLER            PIC  X(27)  VALUE
                 "AND A.HYK_KRTU_CD = ' ' ".
      *---------- 基準日
             15  FILLER            PIC  X(27)  VALUE
                 "AND A.KJN_YMD = :P_KJN_YMD ".
      *---------- 証券種別コード
             15  FILLER            PIC  X(33)  VALUE
                 "AND A.SEC_SBT_CD = ' ' ".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(35)  VALUE
                 "AND A.KNJ_KAMK_CD = :P_KNJ_KAMK_CD ".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(28)  VALUE
                 "AND A.KSN_YMD_DMN_KBN = '2' ".
      *---------- 貸借区分
             15  FILLER            PIC  X(32)  VALUE
                 "AND A.TAISHK_KBN = B.TAISHK_KBN ".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(34)  VALUE
                 "AND A.KNJ_KAMK_CD = B.KNJ_KAMK_CD ".
             15  FILLER            PIC  X(26)  VALUE
                 "AND B.RIYO_CMP_CD = '4999'".
      *---------- SELECT SQL文(別紙1-13,別紙1-14)
         05  SQL-SELECT-1-13.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *---------- 貸借区分
             15  FILLER            PIC  X(10)  VALUE "TAISHK_KBN".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKCMKJ00      PIC  X(13).
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *---------- 利用会社コード
             15  FILLER            PIC  X(21)  VALUE
                 "RIYO_CMP_CD = '4999' ".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(32)  VALUE
                 "AND KNJ_KAMK_CD = :P_KNJ_KAMK_CD".
      *---------- SELECT SQL文(別紙1-15)
         05  SQL-SELECT-1-15.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
             15  FILLER            PIC  X(07)  VALUE "KNJZN, ".
             15  FILLER            PIC  X(20)  VALUE
                 "KNJ_IDOK_KKN_DEBIT, ".
             15  FILLER            PIC  X(21)  VALUE
                 "KNJ_IDOK_KKN_CREDIT, ".
             15  FILLER            PIC  X(20)  VALUE
                 "KNJ_IDOK_TJT_DEBIT, ".
             15  FILLER            PIC  X(19)  VALUE
                 "KNJ_IDOK_TJT_CREDIT".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TKMZKZ00      PIC  X(13).
             15  FILLER            PIC  X(04)  VALUE " A, ".
             15  SQL-TKCMKJ00      PIC  X(13).
             15  FILLER            PIC  X(03)  VALUE " B ".
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *---------- 利用会社コード
             15  FILLER            PIC  X(35)  VALUE
                 "A.RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *---------- ファンドコード
             15  FILLER            PIC  X(27)  VALUE
                 "AND A.FUND_CD = :P_FUND_CD ".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(25)  VALUE
                 "AND A.PTF_CD = :P_PTF_CD ".
      *---------- 評価系列コード
             15  FILLER            PIC  X(27)  VALUE
                 "AND A.HYK_KRTU_CD = ' ' ".
      *---------- 基準日
             15  FILLER            PIC  X(27)  VALUE
                 "AND A.KJN_YMD = :P_KJN_YMD ".
      *---------- 証券種別コード
             15  FILLER            PIC  X(26)  VALUE
                 "AND A.SEC_SBT_CD = 'PRI ' ".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(35)  VALUE
                 "AND A.KNJ_KAMK_CD = :P_KNJ_KAMK_CD ".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(28)  VALUE
                 "AND A.KSN_YMD_DMN_KBN = '2' ".
      *---------- 貸借区分
             15  FILLER            PIC  X(32)  VALUE
                 "AND A.TAISHK_KBN = B.TAISHK_KBN ".
      *---------- 勘定科目コード
             15  FILLER            PIC  X(34)  VALUE
                 "AND A.KNJ_KAMK_CD = B.KNJ_KAMK_CD ".
             15  FILLER            PIC  X(26)  VALUE
                 "AND B.RIYO_CMP_CD = '4999'".
      *---------- SELECT SQL文(別紙1-16)
         05  SQL-SELECT-1-16.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
             15  FILLER            PIC  X(22)  VALUE
                 "COUNT(KSN_YMD_DMN_KBN)".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
      *---------- 勘定残高（TKMZKZ00）
             15  SQL-TKMZKZ00      PIC  X(13).
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *---------- 利用会社コード
             15  FILLER            PIC  X(29)  VALUE
                 "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
      *---------- ファンドコード
             15  FILLER            PIC  X(25)  VALUE
                 "AND FUND_CD = :P_FUND_CD ".
      *---------- ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 "AND PTF_CD = :P_PTF_CD ".
      *---------- 評価系列コード
             15  FILLER            PIC  X(22)  VALUE
                 "AND HYK_KRTU_CD = ' ' ".
      *---------- 基準日
             15  FILLER            PIC  X(25)  VALUE
                 "AND KJN_YMD = :P_KJN_YMD ".
      *---------- 決算日断面区分
             15  FILLER            PIC  X(25)  VALUE
                 "AND KSN_YMD_DMN_KBN = '2'".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- DELETE SQL文(別紙1-1)
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKZ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *    10  FILLER              PIC  X(15)  VALUE
      *        " RIYO_CMP_CD ='".
      *    10  WK-RIYO-CMP-CD-D    PIC  X(04).
           10  FILLER              PIC  X(11)  VALUE
               " FUND_CD ='".
           10  WK-FUND-CD-D        PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD-D         PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND KJN_YMD =".
           10  WK-KJN-YMD-D        PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               " AND HYK_KRTU_CD ='".
           10  WK-HYK-KRTU-CD-D    PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *---------- SELECT SQL文(別紙1-3)
         05  WK-MSG-1-3.
           10  WK-MSG-TKMZKI00-1-3.
             15  FILLER            PIC  X(08)  VALUE
               " TBL-ID(".
             15  WK-TKMZKI00       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(15)  VALUE
                 " RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD-S1 PIC  X(04).
             15  FILLER            PIC  X(16)  VALUE
                 "' AND FUND_CD ='".
             15  WK-FUND-CD-S1     PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-PTF-CD-S1      PIC  X(04).
             15  FILLER            PIC  X(23)  VALUE
                 "' AND KEIJOU_KIJUNBI <=".
             15  WK-KJN-YMD-S1     PIC  S9(08).
             15  FILLER            PIC  X(22)  VALUE
                 " AND KEIJOU_KIJUNBI >=".
             15  WK-KAISI-KY-NEXT-S1
                                   PIC  S9(08).
           10  WK-MSG-TKMZBW15-1-3.
             15  FILLER            PIC  X(08)  VALUE
               " TBL-ID(".
             15  WK-TKMZBW15       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(12)  VALUE
                 " SYORI_YMD =".
             15  WK-SYORI-YMD-S    PIC  S9(08).
             15  FILLER            PIC  X(16)  VALUE
                 " AND KIDOU_ID ='".
             15  WK-KIDOU-ID-S     PIC  X(04).
             15  FILLER            PIC  X(20)  VALUE
                 "' AND RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD-S2 PIC  X(04).
             15  FILLER            PIC  X(16)  VALUE
                 "' AND FUND_CD ='".
             15  WK-FUND-CD-S2     PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-PTF-CD-S2      PIC  X(04).
             15  FILLER            PIC  X(23)  VALUE
                 "' AND KEIJOU_KIJUNBI <=".
             15  WK-KJN-YMD-S2     PIC  S9(08).
             15  FILLER            PIC  X(22)  VALUE
                 " AND KEIJOU_KIJUNBI >=".
             15  WK-KAISI-KY-NEXT-S2
                                   PIC  S9(08).
           10  WK-MSG-TKMZKZ00-1-3.
             15  FILLER            PIC  X(08)  VALUE
                 " TBL-ID(".
             15  WK-TKMZKZ00       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(15)  VALUE
                 " RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD-S3 PIC  X(04).
             15  FILLER            PIC  X(16)  VALUE
                 "' AND FUND_CD ='".
             15  WK-FUND-CD-S3     PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-PTF-CD-S3      PIC  X(04).
             15  FILLER            PIC  X(23)  VALUE
                 "' AND HYK_KRTU_CD = ' '".
             15  FILLER            PIC  X(14)  VALUE
                 " AND KJN_YMD =".
             15  WK-KJN-YMD-S3     PIC  S9(08).
             15  FILLER            PIC  X(19)  VALUE
                 "' AND TAISHK_KBN ='".
             15  WK-TAISHK-KBN-S3  PIC  X(01).
             15  FILLER            PIC  X(08)  VALUE
                 "' AND ( ".
             15  FILLER            PIC  X(45)  VALUE
                 "(SUBSTR(KNJ_KAMK_CD,1,2) IN ('01','02','03') ".
             15  FILLER            PIC  X(36)  VALUE
                 "AND KSN_YMD_DMN_KBN IN('0','2')) OR ".
             15  FILLER            PIC  X(40)  VALUE
                 "(SUBSTR(KNJ_KAMK_CD,1,2) IN ('04','05') ".
             15  FILLER            PIC  X(28)  VALUE
                 "AND KSN_YMD_DMN_KBN  = '0') ".
             15  FILLER            PIC  X(02)  VALUE
                 ") ".
             15  FILLER            PIC  X(22)  VALUE
                 " AND SEC_SBT_CD <> ' '".
      *---------- SELECT SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKZ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(23)  VALUE
               "' AND HYK_KRTU_CD = ' '".
           10  FILLER              PIC  X(14)  VALUE
               " AND KJN_YMD =".
           10  WK-KJN-YMD-S        PIC  S9(08).
           10  FILLER              PIC  X(18)  VALUE
               " AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD-S     PIC  X(04).
           10  FILLER              PIC  X(20)  VALUE
               "' AND KNJ_KAMK_CD ='".
           10  WK-KNJ-KAMK-CD-S    PIC  X(08).
           10  FILLER              PIC  X(19)  VALUE
               "' AND TAISHK_KBN ='".
           10  WK-TAISHK-KBN-S     PIC  X(01).
           10  FILLER              PIC  X(08)  VALUE
               "' AND ( ".
           10  FILLER              PIC  X(45)  VALUE
               "(SUBSTR(KNJ_KAMK_CD,1,2) IN ('01','02','03') ".
           10  FILLER              PIC  X(36)  VALUE
               "AND KSN_YMD_DMN_KBN IN('0','2')) OR ".
           10  FILLER              PIC  X(40)  VALUE
               "(SUBSTR(KNJ_KAMK_CD,1,2) IN ('04','05') ".
           10  FILLER              PIC  X(28)  VALUE
               "AND KSN_YMD_DMN_KBN  = '0') ".
           10  FILLER              PIC  X(02)  VALUE
               ") ".
      *---------- SQL文(別紙1-7)
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW16         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(12)  VALUE
               " SYORI_YMD =".
           10  WK-SYORI-YMD-S      PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID-S       PIC  X(04).
           10  FILLER              PIC  X(20)  VALUE
               "' AND RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(26)  VALUE
               "' AND HYK_KRTU_CD = '    '".
           10  FILLER              PIC  X(15)  VALUE
               "  AND KJN_YMD =".
           10  WK-KJN-YMD-S        PIC  S9(08).
           10  FILLER              PIC  X(39)  VALUE
               "  AND SUBSTR(KNJ_KAMK_CD,6,8) <> '000')".
      *---------- INSERT SQL文(別紙1-7)
         05  WK-MSG-1-8-INSERT.
           10  FILLER              PIC  X(09)  VALUE
               "  VALUES ".
           10  FILLER              PIC  X(02)  VALUE
               "( ".
           10  WK-SYORI-YMD-I      PIC  S9(08).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-KIDOU-ID-I       PIC  X(04).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-RIYO-CMP-CD-I    PIC  X(04).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-FUND-CD-I        PIC  X(12).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-PTF-CD-I         PIC  X(04).
           10  FILLER              PIC  X(10)  VALUE
               "', '    ',".
           10  WK-KJN-YMD-I        PIC  S9(08).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-KSN-YMD-DMN-KBN-I
                                   PIC  X(01).
           10  FILLER              PIC  X(12)  VALUE
               "', '    ', '".
           10  WK-KNJ-KAMK-CD-I    PIC  X(08).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-TAISHK-KBN-I     PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  WK-KNJZN-I          PIC  S9(15)V9(03).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KNJ-IDOK-KKN-DEBIT-I
                                   PIC  S9(15)V9(03).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KNJ-IDOK-KKN-CREDIT-I
                                   PIC  S9(15)V9(03).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KNJ-IDOK-TJT-DEBIT-I
                                   PIC  S9(15)V9(03).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KNJ-IDOK-TJT-CREDIT-I
                                   PIC  S9(15)V9(03).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-SAKUJO-KBN-I     PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
           10  FILLER              PIC  X(02)  VALUE
               " '".
           10  WK-SK-LOGIN-CMP-CD-I
                                   PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  FILLER              PIC  X(15)  VALUE
               "' ','SMZJ2610',".
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
           10  FILLER              PIC  X(02)  VALUE
               " '".
           10  WK-UPD-LOGIN-CMP-CD-I
                                   PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  FILLER              PIC  X(15)  VALUE
               "' ','SMZJ2610')".
      *---------- SQL文(別紙1-9)
         05  WK-MSG-1-9.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW16         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(12)  VALUE
               " SYORI_YMD =".
           10  WK-SYORI-YMD-S      PIC  S9(08).
           10  FILLER              PIC  X(17)  VALUE
               "  AND KIDOU_ID ='".
           10  WK-KIDOU-ID-S       PIC  X(04).
           10  FILLER              PIC  X(20)  VALUE
               "' AND RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(26)  VALUE
               "' AND HYK_KRTU_CD = '    '".
           10  FILLER              PIC  X(15)  VALUE
               "  AND KJN_YMD =".
           10  WK-KJN-YMD-S        PIC  S9(08).
           10  FILLER              PIC  X(37)  VALUE
               "  AND SUBSTR(KNJ_KAMK_CD,6,8) = '000'".
           10  FILLER              PIC  X(39)  VALUE
               "  AND SUBSTR(KNJ_KAMK_CD,3,5) <> '000')".
      *---------- INSERT SQL文(別紙1-10)
         05  WK-MSG-1-10-INSERT.
           10  FILLER              PIC  X(09)  VALUE
               "  VALUES ".
           10  FILLER              PIC  X(02)  VALUE
               "( ".
           10  WK-SYORI-YMD-I      PIC  S9(08).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-KIDOU-ID-I       PIC  X(04).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-RIYO-CMP-CD-I    PIC  X(04).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-FUND-CD-I        PIC  X(12).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-PTF-CD-I         PIC  X(04).
           10  FILLER              PIC  X(10)  VALUE
               "', '    ',".
           10  WK-KJN-YMD-I        PIC  S9(08).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-KSN-YMD-DMN-KBN-I
                                   PIC  X(01).
           10  FILLER              PIC  X(12)  VALUE
               "', '    ', '".
           10  WK-KNJ-KAMK-CD-I    PIC  X(08).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-TAISHK-KBN-I     PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  WK-KNJZN-I          PIC  S9(15)V9(03).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KNJ-IDOK-KKN-DEBIT-I
                                   PIC  S9(15)V9(03).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KNJ-IDOK-KKN-CREDIT-I
                                   PIC  S9(15)V9(03).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KNJ-IDOK-TJT-DEBIT-I
                                   PIC  S9(15)V9(03).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KNJ-IDOK-TJT-CREDIT-I
                                   PIC  S9(15)V9(03).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-SAKUJO-KBN-I     PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
           10  FILLER              PIC  X(02)  VALUE
               " '".
           10  WK-SK-LOGIN-CMP-CD-I
                                   PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  FILLER              PIC  X(15)  VALUE
               "' ','SMZJ2610',".
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
           10  FILLER              PIC  X(02)  VALUE
               " '".
           10  WK-UPD-LOGIN-CMP-CD-I
                                   PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  FILLER              PIC  X(15)  VALUE
               "' ','SMZJ2610')".
      *---------- SQL文(別紙1-11,別紙1-12)
         05  WK-MSG-1-11.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKZ00         PIC  X(13).
           10  FILLER              PIC  X(03)  VALUE
               " , ".
           10  WK-TKCMKJ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(23)  VALUE
               "' AND HYK_KRTU_CD = ' '".
           10  FILLER              PIC  X(15)  VALUE
               " AND KJN_YMD = ".
           10  WK-KJN-YMD-S        PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               " AND SEC_SBT_CD = ' ' ".
           10  FILLER              PIC  X(20)  VALUE
               " AND KNJ_KAMK_CD = '".
           10  WK-KNJ-KAMK-CD-S    PIC  X(08).
           10  FILLER              PIC  X(27)  VALUE
               "' AND KSN_YMD_DMN_KBN = '2'".
           10  FILLER              PIC  X(32)  VALUE
               " AND A.TAISHK_KBN = B.TAISHK_KBN".
      *---------- 勘定科目コード
           10  FILLER              PIC  X(34)  VALUE
               " AND A.KNJ_KAMK_CD = B.KNJ_KAMK_CD".
           10  FILLER              PIC  X(27)  VALUE
               " AND B.RIYO_CMP_CD = '4999'".
      *---------- SQL文(別紙1-13,別紙1-14)
         05  WK-MSG-1-13.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKCMKJ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(21)  VALUE
               "RIYO_CMP_CD = '4999' ".
           10  FILLER              PIC  X(19)  VALUE
               "AND KNJ_KAMK_CD = '".
           10  WK-KNJ-KAMK-CD-S    PIC  X(08).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SQL文(別紙1-15)
         05  WK-MSG-1-15.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKZ00         PIC  X(13).
           10  FILLER              PIC  X(03)  VALUE
               " , ".
           10  WK-TKCMKJ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(23)  VALUE
               "' AND HYK_KRTU_CD = ' '".
           10  FILLER              PIC  X(15)  VALUE
               " AND KJN_YMD = ".
           10  WK-KJN-YMD-S        PIC  S9(08).
           10  FILLER              PIC  X(25)  VALUE
               " AND SEC_SBT_CD = 'PRI ' ".
           10  FILLER              PIC  X(20)  VALUE
               " AND KNJ_KAMK_CD = '".
           10  WK-KNJ-KAMK-CD-S    PIC  X(08).
           10  FILLER              PIC  X(27)  VALUE
               "' AND KSN_YMD_DMN_KBN = '2'".
           10  FILLER              PIC  X(32)  VALUE
               " AND A.TAISHK_KBN = B.TAISHK_KBN".
      *---------- 勘定科目コード
           10  FILLER              PIC  X(34)  VALUE
               " AND A.KNJ_KAMK_CD = B.KNJ_KAMK_CD".
           10  FILLER              PIC  X(27)  VALUE
               " AND B.RIYO_CMP_CD = '4999'".
      *---------- SQL文(別紙1-16)
         05  WK-MSG-1-16.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKZ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD-S    PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND FUND_CD = '".
           10  WK-FUND-CD-S        PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' AND PTF_CD = '".
           10  WK-PTF-CD-S         PIC  X(04).
           10  FILLER              PIC  X(23)  VALUE
               "' AND HYK_KRTU_CD = ' '".
           10  FILLER              PIC  X(15)  VALUE
               " AND KJN_YMD = ".
           10  WK-KJN-YMD-S        PIC  S9(08).
           10  FILLER              PIC  X(27)  VALUE
               "' AND KSN_YMD_DMN_KBN = '2'".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------【SMZJ2611】勘定異動額計算ルーチン
       01  PARM-SMZJ2611-INOUT.
           COPY  "SMZJ2611.cpy".
      *----------【SMZJ2612】勘定残高データ編集・更新ルーチン
       01  PARM-SMZJ2612-INOUT.
           COPY  "SMZJ2612.cpy".
      *---------- テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *---------- SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ2610-INOUT.
           COPY  "SMZJ2610.cpy".
       01  PARM-SMZJ2610-RTNPKG.
         05  PARM-SMZJ2610-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ2610-INOUT
                  PARM-SMZJ2610-RTNPKG.
      ******************************************************************
      *     断面別残高計算
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  SMZJ2610  START  ****"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  SMZJ2610  END  ****"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *    3.1  前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  前処理  START  ****"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 決算日断面パタンを決める
           PERFORM  KSN-YMD-DMN-PTN-RTN
      *----------  3.1.3 テーブルID取得処理
           PERFORM  TBLID-GET-RTN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  前処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1  初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  初期化処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  FLG-AREA
                       WORK-AREA
                       HOST-AREA
                       SQL-TBL
                       E-MSG-TBL
                       PARM-SMZJ2611-INOUT
                       PARM-SMZJ2612-INOUT
                       PARM-SCZY1160-INOUT
                       PARM-SCZY1170-IN
                       PARM-SCZY1170-RTNPKG
                       PARM-RTNPKG
                       PARM-SMZJ2610-ARG3
      *----初回コール時のみFLG-AREAを初期化する                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FIRST-SW = ["FIRST-SW"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FIRST-SW = 'YES'                                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
             INITIALIZE  FLG-AREA2                                      @3212SEINO@@
             MOVE  'NO '                TO  FIRST-SW                    @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FIRST-SW = ["FIRST-SW"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           MOVE  CNS-RTN-000
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-AREA =["FLG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":WORK-AREA =["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HOST-AREA =["HOST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-TBL   =["SQL-TBL  "]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL =["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2611-INOUT =["
      D             PARM-SMZJ2611-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2612-INOUT =["
      D             PARM-SMZJ2612-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT =["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN    =["
      D             PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG=["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2610-ARG3  =["
      D             PARM-SMZJ2610-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD  OF  PARM-SCZY1170-ARG1 =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- 処理実行日
           MOVE  SYORI-YMD              OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-SYORI-YMD
      *---------- 起動ID
           MOVE  KIDOU-ID               OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-KIDOU-ID
      *---------- 利用会社コード
           MOVE  RIYO-CMP-CD            OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-RIYO-CMP-CD
      *---------- ファンドコード
           MOVE  FUND-CD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-FUND-CD
      *---------- ポートフォリオコード
           MOVE  PTF-CD                 OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-PTF-CD
      *---------- 基準日
           MOVE  KJN-YMD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-KJN-YMD
      *---------- 運用通貨コード
           MOVE  CAPITAL-TUKA-CD        OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-CAPITAL-TUKA-CD
      *---------- 開始基準日
           MOVE  KAISI-KJN-YMD          OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-KAISI-KJN-YMD
      *---------- 開始基準日の翌日
           MOVE  KAISI-KJN-YMD-NEXT     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-KAISI-KJN-YMD-NEXT
      *---------- 基準日種類
           MOVE  KJN-YMD-SHRU           OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-KJN-YMD-SHRU
      *---------- 基準日断面作成区分
           MOVE  KJN-YMD-DMN-SK-KBN     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2610-ARG1
             TO  WK-KJN-YMD-DMN-SK-KBN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["WK-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["WK-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["WK-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨コード =["WK-CAPITAL-TUKA-CD"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日 =["WK-KAISI-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日 =["
      D             WK-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":基準日種類 =["WK-KJN-YMD-SHRU"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面作成区分 =["
      D             WK-KJN-YMD-DMN-SK-KBN"]"
      D    DISPLAY  CNS-PGM-ID":****  初期化処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 決算日断面パタンを決める
      ******************************************************************
       KSN-YMD-DMN-PTN-RTN    SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":****  決算日断面パタンを決める処理  START  ****"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.基準日種類=["
      D             WK-KJN-YMD-SHRU"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.基準日断面作成区分"
      D             "=["WK-KJN-YMD-DMN-SK-KBN"]"
      *-----------------------------------------------------------------
      *---------- ①ARG1.基準日断面情報.基準日種類＝'1' or '2' or '3'(決算日)の場合
           IF  WK-KJN-YMD-SHRU  =  CNS-KJN-YMD-SHRU-1
           OR  WK-KJN-YMD-SHRU  =  CNS-KJN-YMD-SHRU-2
           OR  WK-KJN-YMD-SHRU  =  CNS-KJN-YMD-SHRU-3
           THEN
             MOVE  CNS-KY-DMN-SK-KBN-2  TO  WK-KY-DMN-SK-KBN
           ELSE
             CONTINUE
           END-IF
      *---------- ②ARG1.基準日断面情報.基準日種類＝0：決算日以外 or '4' or '5'の場合
           IF  WK-KJN-YMD-SHRU  =  CNS-KJN-YMD-SHRU-0
           OR  WK-KJN-YMD-SHRU  =  CNS-KJN-YMD-SHRU-4
           OR  WK-KJN-YMD-SHRU  =  CNS-KJN-YMD-SHRU-5
           THEN
             MOVE  CNS-KY-DMN-SK-KBN-1  TO  WK-KY-DMN-SK-KBN
           ELSE
             CONTINUE
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.基準日断面作成区分=["
      D             WK-KY-DMN-SK-KBN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":****  決算日断面パタンを決める処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       KSN-YMD-DMN-PTN-EXT.
           EXIT.
      ******************************************************************
      *    3.1.3 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  テーブルID取得処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *---------- 勘定残高（TKMZKZ00）
           MOVE  CNS-TBL-TKMZKZ00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *---------- 勘定科目（TKCMKJ00）
           MOVE  CNS-TBL-TKCMKJ00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *---------- 勘定異動（TKMZKI00）
           MOVE  CNS-TBL-TKMZKI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *---------- 勘定異動計算データ（TKMZBW15）
           MOVE  CNS-TBL-TKMZBW15
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *---------- 勘定残高計算データ（TKMZBW16）
           MOVE  CNS-TBL-TKMZBW16
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":勘定残高テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動計算データテーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データテーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(5)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ワークテーブル勘定残高
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKMZKZ00
      *----------  ワークテーブル勘定科目
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TBL-TKCMKJ00
      *----------  ワークテーブル勘定異動
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TBL-TKMZKI00
      *----------  ワークテーブル勘定異動計算データ
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TBL-TKMZBW15
      *----------  ワークテーブル勘定残高計算データ
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TBL-TKMZBW16
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークテーブル勘定残高 =["
      D             WK-TBL-TKMZKZ00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル勘定科目 =["
      D             WK-TBL-TKCMKJ00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル勘定異動 =["
      D             WK-TBL-TKMZKI00"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル勘定異動計算データ =["
      D             WK-TBL-TKMZBW15"]"
      D    DISPLAY  CNS-PGM-ID":ワークテーブル勘定残高計算データ =["
      D             WK-TBL-TKMZBW16"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得 エラー"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  テーブルID取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2  主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  主処理  START  ****"
      *-----------------------------------------------------------------
      *----------  3.2.1.当断面の勘定残高削除処理
           PERFORM  KNJZN-DELETE-RTN
      *----------  3.2.2.勘定残高データ計算
           PERFORM  KNJZN-CALC-RTN
      *----------  3.2.3.2 中分類集計
           PERFORM  MID-SYUKEI-RTN
      *----------  3.2.3.3 大分類集計
           PERFORM  BIG-SYUKEI-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  主処理   END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.当断面の勘定残高削除処理
      ******************************************************************
       KNJZN-DELETE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 当断面の勘定残高削除処理  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZKZ00-D
      *---------- 利用会社コード
      *    MOVE  WK-RIYO-CMP-CD
      *      TO  H-RIYO-CMP-CD          OF  H-TKMZKZ00-D,
      *          WK-RIYO-CMP-CD-D       OF  WK-MSG-1-1
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZKZ00-D,
                 WK-FUND-CD-D           OF  WK-MSG-1-1
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZKZ00-D,
                 WK-PTF-CD-D            OF  WK-MSG-1-1
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZKZ00-D,
                 WK-KJN-YMD-D           OF  WK-MSG-1-1
      *---------- 評価系列コード
           MOVE  SPACE
             TO  H-HYK-KRTU-CD          OF  H-TKMZKZ00-D,
                 WK-HYK-KRTU-CD-D       OF  WK-MSG-1-1
      *---------- テーブルID
           MOVE  WK-TBL-TKMZKZ00
             TO  SQL-TKMZKZ00           OF  SQL-DELETE-1-1,
                 WK-TKMZKZ00            OF  WK-MSG-1-1
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      *D             H-RIYO-CMP-CD       OF  H-TKMZKZ00-D"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD           OF  H-TKMZKZ00-D"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD            OF  H-TKMZKZ00-D"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KJN-YMD           OF  H-TKMZKZ00-D"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード =["
      D             H-HYK-KRTU-CD       OF  H-TKMZKZ00-D"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT1                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-DELETE-1-1         TO  SQLSTMT1                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-DEL-1 = ["                 @3212SEINO@@
      D                          FLG-TKMZKZ00-DEL-1"]"                  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKZ00-DEL-1 = CNS-OFF                             @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S1 FROM :SQLSTMT1                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-DELETE,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S1
                 USING :H-TKMZKZ00-D
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DELETE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":DELETE 処理 正常"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON               TO  FLG-TKMZKZ00-DEL-1        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-DEL-1=["                   @3212SEINO@@
      D             FLG-TKMZKZ00-DEL-1"]"                               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":該当 DELETE データなし "
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON               TO  FLG-TKMZKZ00-DEL-1        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-DEL-1=["                   @3212SEINO@@
      D             FLG-TKMZKZ00-DEL-1"]"                               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":DELETE 処理エラー（OTHER)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-003
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-DELETE,
                       WK-MSG-1-1       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 当断面の勘定残高削除処理 END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       KNJZN-DELETE-EXT.
           EXIT.
      ******************************************************************
      *    勘定残高TBLから前回断面の決算日断面区分を取得する
      ******************************************************************
       KYDK-GET-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  勘定残高TBLから前回断面の決算日"
      D             "断面区分を取得する  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZKZ00-DEC-3-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZKZ00-OPEN-3-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZKZ00-FET-3-RTN
      *-----------  カーソルクローズ処理
      *    PERFORM  TKMZKZ00-CLOSE-3-RTN                                @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  勘定残高TBLから前回断面の決算日"
      D             "断面区分を取得する  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KYDK-GET-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZKZ00-DEC-3-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  カーソル定義処理  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZKZ00-16
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZKZ00-16,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-16
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZKZ00-16,
                 WK-FUND-CD-S           OF  WK-MSG-1-16
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZKZ00-16,
                 WK-PTF-CD-S            OF  WK-MSG-1-16
      *---------- 基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KAISI-KJN-YMD        OF  H-TKMZKZ00-16,
                 WK-KJN-YMD-S           OF  WK-MSG-1-16
      *---------- テーブルID
           MOVE  WK-TBL-TKMZKZ00
             TO  SQL-TKMZKZ00           OF  SQL-SELECT-1-16,
                 WK-TKMZKZ00            OF  WK-MSG-1-16
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKZ00-16"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD           OF  H-TKMZKZ00-16"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD            OF  H-TKMZKZ00-16"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KAISI-KJN-YMD     OF  H-TKMZKZ00-16"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT16                                        @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-16         TO  SQLSTMT16                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT16=["SQLSTMT16"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-16=["WK-MSG-1-16"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-16 = ["               @3212SEINO@@
      D                          FLG-TKMZKZ00-OPEN-16"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKZ00-OPEN-16  = CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S16 FROM :SQLSTMT16                              @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-004
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-16         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
               DECLARE  TKMZKZ00_CUR16  CURSOR  FOR S16
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-DEC-3-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMZKZ00-OPEN-3-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   カーソルオープン処理  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZKZ00_CUR16
                 USING :H-TKMZKZ00-16
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZKZ00-OPEN-16
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FLG-TKMZKZ00-OPEN-16=["FLG-TKMZKZ00-OPEN-16"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-005
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-16         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-OPEN-3-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       TKMZKZ00-FET-3-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   カーソルフェッチ処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZKZ00-S-16
           EXEC  SQL
               FETCH
                    TKMZKZ00_CUR16
               INTO :H-TKMZKZ00-S-16
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-COUNT-KYDK       OF  H-TKMZKZ00-S-16
                 TO  WK-COUNT-KYDK
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-KYDK=["WK-COUNT-KYDK"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-006
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-16       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-FET-3-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      * TKMZKZ00-CLOSE-3-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***   カーソルクローズ処理  START  ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZKZ00_CUR16
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZKZ00-OPEN-16
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-16=["
      *D             FLG-TKMZKZ00-OPEN-16"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-POS-007
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-16         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZKZ00-CLOSE-3-EXT.
      *     EXIT.
      ******************************************************************
      *    3.2.2.勘定残高データ計算
      ******************************************************************
       KNJZN-CALC-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 3.2.2 勘定残高データ計算"
      D             "処理  START ***"
      *-----------------------------------------------------------------
      *-----------  3.2.2.0 前回断面の決算日断面区分を取得
           PERFORM  KYDK-GET-RTN
           IF  WK-COUNT-KYDK  >=  CNS-1
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":別紙1-16.COUNT(決算日断面区分) >= 1の場合"
      *-----------------------------------------------------------------
      *-----------  3.2.2.1 ワーク.勘定残高(収益)を取得する
             MOVE  CNS-SQL-KBN-11         TO  WK-SQL-KBN
             MOVE  CNS-POS-008            TO  WK-POS-1
             MOVE  CNS-POS-009            TO  WK-POS-2
             MOVE  CNS-POS-010            TO  WK-POS-3
             MOVE  CNS-POS-011            TO  WK-POS-4
             PERFORM  KNJZN-GET-1-RTN
      *-----------  3.2.2.2 ワーク.勘定残高(損失)を取得する
             MOVE  CNS-SQL-KBN-12         TO  WK-SQL-KBN
             MOVE  CNS-POS-012            TO  WK-POS-1
             MOVE  CNS-POS-013            TO  WK-POS-2
             MOVE  CNS-POS-014            TO  WK-POS-3
             MOVE  CNS-POS-015            TO  WK-POS-4
             PERFORM  KNJZN-GET-1-RTN
      *-----------  3.2.2.3 未処分損益を作成する
             PERFORM  SS-CRE-RTN
      *-----------  3.2.2.4 既存の未処分利益と未処分損失の抽出
      *-----------  1) 未処分利益を勘定残高TBLから取得する
             MOVE  CNS-SQL-KBN-SYUEKI     TO  WK-SQL-KBN
             MOVE  CNS-POS-016            TO  WK-POS-1
             MOVE  CNS-POS-017            TO  WK-POS-2
             MOVE  CNS-POS-018            TO  WK-POS-3
             MOVE  CNS-POS-019            TO  WK-POS-4
             PERFORM  SYUEKI-SONSITU-RTN
      *-----------  2) 未処分損失を勘定残高TBLから取得する
             MOVE  CNS-SQL-KBN-SONSITU    TO  WK-SQL-KBN
             MOVE  CNS-POS-020            TO  WK-POS-1
             MOVE  CNS-POS-021            TO  WK-POS-2
             MOVE  CNS-POS-022            TO  WK-POS-3
             MOVE  CNS-POS-023            TO  WK-POS-4
             PERFORM  SYUEKI-SONSITU-RTN
      *-----------  3.2.2.5 未処分損益を未処分収益か未処分損失に加える
             PERFORM  SS-ADD-RTN
      *-----------  3.2.2.6 未処分収益・未処分損失各自の相殺処理
             PERFORM  SS-OFFSET-SELF-RTN
      *-----------  3.2.2.7 未処分収益・未処分損失間の相殺処理
             PERFORM  SS-OFFSET-BET-RTN
      *-----------  3.2.2.8 未処分利益の更新
             PERFORM  SYUEKI-UPDATE-RTN
      *-----------  3.2.2.9 未処分損失の更新
             PERFORM  SONSITU-UPDATE-RTN
           ELSE
             CONTINUE
           END-IF
      *-----------  3.2.2.10 処理対象の証券種別コードを取得する
           PERFORM  SEC-SBT-CD-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.2 勘定残高データ計算"
      D             "処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KNJZN-CALC-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.3 未処分損益を作成する
      ******************************************************************
       SS-CRE-RTN             SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":3.2.2.3 未処分損益を作成する START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(収益)  = ["
      D             WK-KNJZN-SYUEKI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(損失)  = ["
      D             WK-KNJZN-SONSITU"]"
      *-----------------------------------------------------------------
      *----------  1）
           INITIALIZE                   WK-KSN-DMN-GAI
                                        WK-KSN-MAE
                                        WK-KSN-ATO
                                        WK-SYUEKI-SONSITU-G
                                        WK-SYUEKI-G
                                        WK-SONSITU-G
           MOVE  CNS-X-0                TO  WK-SYUEKI-FLG
           MOVE  CNS-X-0                TO  WK-SONSITU-FLG
           COMPUTE  WK-SYUEKI-SONSITU
                 =  FUNCTION ABS(WK-KNJZN-SYUEKI
                 -  WK-KNJZN-SONSITU)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外       = ["
      D             WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前             = ["
      D             WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後             = ["
      D             WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損益グループ = ["
      D             WK-SYUEKI-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益         = ["
      D             WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失         = ["
      D             WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益フラグ   = ["
      D             WK-SYUEKI-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失フラグ   = ["
      D             WK-SONSITU-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損益         = ["
      D             WK-SYUEKI-SONSITU"]"
      *-----------------------------------------------------------------
      *----------  2）
           COMPUTE  WK-CHUKAN-CHI
                 =  WK-KNJZN-SYUEKI - WK-KNJZN-SONSITU
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク中間値 = ["WK-CHUKAN-CHI"]"
      *-----------------------------------------------------------------
           IF  WK-CHUKAN-CHI > ZERO
           THEN
      *----------  ワーク.未処分損益グループ.勘定残高
             MOVE  WK-SYUEKI-SONSITU
               TO  WK-KNJZN                  OF  WK-SYUEKI-SONSITU-G
      *----------  ワーク.未処分損益グループ.勘定異動額(当日・借方)
             MOVE  ZERO
               TO  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SYUEKI-SONSITU-G
      *----------  ワーク.未処分損益グループ.勘定異動額(当日・貸方)
             MOVE  WK-SYUEKI-SONSITU
               TO  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SYUEKI-SONSITU-G
      *----------  ワーク.未処分損益グループ.勘定異動額(期間・借方)
             MOVE  ZERO
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SYUEKI-SONSITU-G
      *----------  ワーク.未処分損益グループ.勘定異動額(期間・貸方)
             MOVE  WK-SYUEKI-SONSITU
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SYUEKI-SONSITU-G
           ELSE
             CONTINUE
           END-IF
           IF  WK-CHUKAN-CHI < ZERO
           THEN
      *----------  ワーク.未処分損益グループ.勘定残高
             MOVE  WK-SYUEKI-SONSITU
               TO  WK-KNJZN                  OF  WK-SYUEKI-SONSITU-G
      *----------  ワーク.未処分損益グループ.勘定異動額(当日・借方)
             MOVE  WK-SYUEKI-SONSITU
               TO  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SYUEKI-SONSITU-G
      *----------  ワーク.未処分損益グループ.勘定異動額(当日・貸方)
             MOVE  ZERO
               TO  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SYUEKI-SONSITU-G
      *----------  ワーク.未処分損益グループ.勘定異動額(期間・借方)
             MOVE  WK-SYUEKI-SONSITU
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SYUEKI-SONSITU-G
      *----------  ワーク.未処分損益グループ.勘定異動額(期間・貸方)
             MOVE  ZERO
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SYUEKI-SONSITU-G
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損益グループ.勘定残高  "
      D             "             = ["
      D             WK-KNJZN                  OF  WK-SYUEKI-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損益グループ.勘定異動額"
      D             "(当日・貸方) = ["
      D             WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SYUEKI-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損益グループ.勘定異動額"
      D             "(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SYUEKI-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損益グループ.勘定異動額"
      D             "(当日・借方) = ["
      D             WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SYUEKI-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損益グループ.勘定異動額"
      D             "(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SYUEKI-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":3.2.2.3 未処分損益を作成する END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SS-CRE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.5 未処分損益を未処分収益か未処分損失に加える
      ******************************************************************
       SS-ADD-RTN             SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":3.2.2.5 未処分損益を未処分収益か未処分"
      D             "損失に加える START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(収益)  = ["
      D             WK-KNJZN-SYUEKI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(損失)  = ["
      D             WK-KNJZN-SONSITU"]"
      *-----------------------------------------------------------------
           COMPUTE  WK-CHUKAN-CHI
                 =  WK-KNJZN-SYUEKI - WK-KNJZN-SONSITU
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク中間値 = ["WK-CHUKAN-CHI"]"
      *-----------------------------------------------------------------
           IF  WK-CHUKAN-CHI  >  ZERO
           THEN
      *-----------  ワーク.未処分利益.勘定残高
             COMPUTE  WK-KNJZN               OF  WK-SYUEKI-G
                   =  WK-KNJZN               OF  WK-SYUEKI-G
                   +  WK-KNJZN               OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（当日・借方）
             COMPUTE  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G
                   +  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（当日・貸方）
             COMPUTE  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G
                   +  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（期間・借方）
             COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
                   +  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（期間・貸方）
             COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                   +  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分利益フラグ
             MOVE  CNS-X-1                   TO  WK-SYUEKI-FLG
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定残高          "
      D             "      = ["WK-KNJZN               OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（当日・"
      D             "借方）= ["WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（当日・"
      D             "貸方）= ["WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益フラグ             "
      D             "      = ["WK-SYUEKI-FLG"]"
      *-----------------------------------------------------------------
           ELSE
             IF  WK-CHUKAN-CHI  <  ZERO
             THEN
      *-----------  ワーク.未処分損失.勘定残高
               COMPUTE  WK-KNJZN               OF  WK-SONSITU-G
                     =  WK-KNJZN               OF  WK-SONSITU-G
                     +  WK-KNJZN               OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分損失.勘定異動額（当日・借方）
               COMPUTE  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SONSITU-G
                     =  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SONSITU-G
                     +  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分損失.勘定異動額（当日・貸方）
               COMPUTE  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SONSITU-G
                     =  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SONSITU-G
                     +  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分損失.勘定異動額（期間・借方）
               COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                     =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                     +  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分損失.勘定異動額（期間・貸方）
               COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
                     =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
                     +  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-SONSITU-G
      *-----------  ワーク.未処分損失フラグ
               MOVE  CNS-X-1                   TO  WK-SONSITU-FLG
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定残高          "
      D             "      = ["WK-KNJZN               OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（当日・"
      D             "借方）= ["WK-KNJ-IDOK-TJT-DEBIT  OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（当日・"
      D             "貸方）= ["WK-KNJ-IDOK-TJT-CREDIT OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失フラグ             "
      D             "      = ["WK-SONSITU-FLG"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":3.2.2.5 未処分損益を未処分収益か未処分"
      D             "損失に加える END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SS-ADD-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.6 未処分収益・未処分損失各自の相殺処理
      ******************************************************************
       SS-OFFSET-SELF-RTN     SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":3.2.2.6 未処分収益・未処分損失各自"
      D             "の相殺処理  START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "貸方）=["WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "借方）=["WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G"]"
      *-----------------------------------------------------------------
      *-----------  1)  未処分利益の異動期間の相殺処理
           IF  WK-KNJ-IDOK-KKN-CREDIT        OF  WK-SYUEKI-G -
               WK-KNJ-IDOK-KKN-DEBIT         OF  WK-SYUEKI-G < ZERO
           THEN
      *-----------  ワーク.未処分利益.勘定異動額（期間・借方）
             COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
                   =  FUNCTION ABS(
                      WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                   -  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G)
      *-----------  ワーク.未処分利益.勘定異動額（期間・貸方）
             MOVE  ZERO
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SYUEKI-G
           ELSE
      *-----------  ワーク.未処分利益.勘定異動額（期間・貸方）
             COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                   -  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
      *-----------  ワーク.未処分利益.勘定異動額（期間・借方）
             MOVE  ZERO
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SYUEKI-G
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-SONSITU-G"]"
      *-----------------------------------------------------------------
      *-----------  2)  未処分損失の異動期間の相殺処理
           IF  WK-KNJ-IDOK-KKN-DEBIT         OF  WK-SONSITU-G -
               WK-KNJ-IDOK-KKN-CREDIT        OF  WK-SONSITU-G >= ZERO
           THEN
      *-----------  ワーク.未処分損失.勘定異動額（期間・借方）
             COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                   =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                   -  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
      *-----------  ワーク.未処分損失.勘定異動額（期間・貸方）
             MOVE  ZERO
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SONSITU-G
           ELSE
      *-----------  ワーク.未処分損失.勘定異動額（期間・貸方）
             COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
                   =  FUNCTION ABS(
                      WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                   -  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G)
      *-----------  ワーク.未処分損失.勘定異動額（期間・借方）
             MOVE  ZERO
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SONSITU-G
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":3.2.2.6 未処分収益・未処分損失各自"
      D             "の相殺処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SS-OFFSET-SELF-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.7 未処分収益・未処分損失間の相殺処理
      ******************************************************************
       SS-OFFSET-BET-RTN      SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":3.2.2.7 未処分収益・未処分損失間"
      D             "の相殺処理  START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定残高 = ["
      D             WK-KNJZN                 OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定残高 = ["
      D             WK-KNJZN                 OF  WK-SONSITU-G"]"
      *-----------------------------------------------------------------
           IF  WK-KNJZN                      OF  WK-SYUEKI-G  -
               WK-KNJZN                      OF  WK-SONSITU-G > ZERO
           THEN
      *-----------  ワーク.未処分利益.勘定残高
             COMPUTE  WK-KNJZN               OF  WK-SYUEKI-G
                   =  WK-KNJZN               OF  WK-SYUEKI-G
                   -  WK-KNJZN               OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（当日・借方）
             COMPUTE  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G
                   +  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（当日・貸方）
             COMPUTE  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G
                   +  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（期間・借方）
             COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
                   +  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（期間・貸方）
             COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                   =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                   +  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益フラグ
             MOVE  CNS-X-1                   TO  WK-SYUEKI-FLG
      *-----------  ワーク.未処分損失
             INITIALIZE                      WK-SONSITU-G
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定残高          "
      D             "      = ["WK-KNJZN               OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（当日・"
      D             "借方）= ["WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（当日・"
      D             "貸方）= ["WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益フラグ             "
      D             "      = ["WK-SYUEKI-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失 = ["WK-SONSITU-G"]"
      *-----------------------------------------------------------------
           ELSE
             IF  WK-KNJZN                      OF  WK-SYUEKI-G  -
                 WK-KNJZN                      OF  WK-SONSITU-G < ZERO
             THEN
      *-----------  ワーク.未処分損失.勘定残高
               COMPUTE  WK-KNJZN               OF  WK-SONSITU-G
                     =  WK-KNJZN               OF  WK-SONSITU-G
                     -  WK-KNJZN               OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失.勘定異動額（当日・借方）
               COMPUTE  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SONSITU-G
                     =  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SONSITU-G
                     +  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失.勘定異動額（当日・貸方）
               COMPUTE  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SONSITU-G
                     =  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SONSITU-G
                     +  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失.勘定異動額（期間・借方）
               COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                     =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                     +  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失.勘定異動額（期間・貸方）
               COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
                     =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
                     +  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失フラグ
               MOVE  CNS-X-1                   TO  WK-SONSITU-FLG
      *-----------  ワーク.未処分利益
               INITIALIZE                      WK-SYUEKI-G
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定残高          "
      D             "      = ["WK-KNJZN               OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（当日・"
      D             "借方）= ["WK-KNJ-IDOK-TJT-DEBIT  OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（当日・"
      D             "貸方）= ["WK-KNJ-IDOK-TJT-CREDIT OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失フラグ             "
      D             "      = ["WK-SONSITU-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益 = ["WK-SYUEKI-G"]"
      *-----------------------------------------------------------------
             ELSE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(収益) = ["
      D             WK-KNJZN-SYUEKI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(損失) = ["
      D             WK-KNJZN-SONSITU"]"
      *-----------------------------------------------------------------
               IF  WK-KNJZN-SYUEKI - WK-KNJZN-SONSITU > ZERO
               THEN
      *-----------  ワーク.未処分利益.勘定残高
                 COMPUTE  WK-KNJZN               OF  WK-SYUEKI-G
                       =  WK-KNJZN               OF  WK-SYUEKI-G
                       -  WK-KNJZN               OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（当日・借方）
                 COMPUTE  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G
                       =  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G
                       +  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（当日・貸方）
                 COMPUTE  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G
                       =  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G
                       +  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（期間・借方）
                 COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
                       =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
                       +  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
      *-----------  ワーク.未処分利益.勘定異動額（期間・貸方）
                 COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                       =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
                       +  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
      *-----------  ワーク.未処分損失
                 INITIALIZE                      WK-SONSITU-G
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失 = ["WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定残高          "
      D             "      = ["WK-KNJZN               OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（当日・"
      D             "借方）= ["WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（当日・"
      D             "貸方）= ["WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G"]"
      *-----------------------------------------------------------------
               ELSE
                 IF  WK-KNJZN-SYUEKI - WK-KNJZN-SONSITU < ZERO
                 THEN
      *-----------  ワーク.未処分損失.勘定残高
                   COMPUTE  WK-KNJZN               OF  WK-SONSITU-G
                         =  WK-KNJZN               OF  WK-SONSITU-G
                         -  WK-KNJZN               OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失.勘定異動額（当日・借方）
                   COMPUTE  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SONSITU-G
                         =  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SONSITU-G
                         +  WK-KNJ-IDOK-TJT-DEBIT  OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失.勘定異動額（当日・貸方）
                   COMPUTE  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SONSITU-G
                         =  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SONSITU-G
                         +  WK-KNJ-IDOK-TJT-CREDIT OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失.勘定異動額（期間・借方）
                   COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                         =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SONSITU-G
                         +  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-SYUEKI-G
      *-----------  ワーク.未処分損失.勘定異動額（期間・貸方）
                   COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
                         =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SONSITU-G
                         +  WK-KNJ-IDOK-KKN-CREDIT OF  WK-SYUEKI-G
      *-----------  ワーク.未処分利益
                   INITIALIZE                      WK-SYUEKI-G
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益 = ["WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定残高          "
      D             "      = ["WK-KNJZN               OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（当日・"
      D             "借方）= ["WK-KNJ-IDOK-TJT-DEBIT  OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（当日・"
      D             "貸方）= ["WK-KNJ-IDOK-TJT-CREDIT OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失.勘定異動額（期間・"
      D             "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-SONSITU-G"]"
      *-----------------------------------------------------------------
                 ELSE
                   INITIALIZE   WK-SYUEKI-G
                                WK-SONSITU-G
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分利益 = ["WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.未処分損失 = ["WK-SONSITU-G"]"
      *-----------------------------------------------------------------
                 END-IF
               END-IF
             END-IF
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":3.2.2.7 未処分収益・未処分損失間"
      D             "の相殺処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SS-OFFSET-BET-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.8 未処分利益の更新
      ******************************************************************
       SYUEKI-UPDATE-RTN      SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  3.2.2.8 未処分利益の更新"
      D             " 処理  START  ****"
      D    DISPLAY  CNS-PGM-ID":ワーク.基準日断面作成区分 = ["
      D             WK-KY-DMN-SK-KBN"]"
      *-----------------------------------------------------------------
      *-----------  1) 未処分利益レコード編集
           IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-1
           THEN
      *-----------  ワーク.決算断面以外.処理フラグ
             MOVE  CNS-SYORI-FLG-1
               TO  WK-SYORI-FLG              OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定残高
             MOVE  WK-KNJZN                  OF  WK-SYUEKI-G
               TO  WK-KNJZN                  OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定異動額(当日・借方)
             MOVE  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定異動額(当日・貸方)
             MOVE  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定異動額(期間・借方)
             MOVE  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定異動額(期間・貸方)
             MOVE  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-DMN-GAI
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外"
      D    DISPLAY  CNS-PGM-ID": 処理フラグ             = ["
      D             WK-SYORI-FLG             OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定残高               = ["
      D             WK-KNJZN                 OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・借方) = ["
      D             WK-KNJ-IDOK-TJT-DEBIT    OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・貸方) = ["
      D             WK-KNJ-IDOK-TJT-CREDIT   OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT    OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT   OF  WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------  ワーク.決算前.処理フラグ
             MOVE  CNS-SYORI-FLG-1
               TO  WK-SYORI-FLG              OF  WK-KSN-MAE
      *-----------  ワーク.決算後.処理フラグ
             MOVE  CNS-SYORI-FLG-1
               TO  WK-SYORI-FLG              OF  WK-KSN-ATO
      *-----------  ワーク.決算前.勘定残高
             MOVE  WK-KNJZN                  OF  WK-SYUEKI-G
               TO  WK-KNJZN                  OF  WK-KSN-MAE
      *-----------  ワーク.決算前.勘定異動額(当日・借方)
             MOVE  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-KSN-MAE
      *-----------  ワーク.決算前.勘定異動額(当日・貸方)
             MOVE  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-KSN-MAE
      *-----------  ワーク.決算前.勘定異動額(期間・借方)
             MOVE  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-MAE
      *-----------  ワーク.決算前.勘定異動額(期間・貸方)
             MOVE  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-MAE
      *-----------  ワーク.決算後.勘定残高
             MOVE  WK-KNJZN                  OF  WK-SYUEKI-G
               TO  WK-KNJZN                  OF  WK-KSN-ATO
      *-----------  ワーク.決算後.勘定異動額(当日・借方)
             MOVE  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-KSN-ATO
      *-----------  ワーク.決算後.勘定異動額(当日・貸方)
             MOVE  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-KSN-ATO
      *-----------  ワーク.決算後.勘定異動額(期間・借方)
             MOVE  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-ATO
      *-----------  ワーク.決算後.勘定異動額(期間・貸方)
             MOVE  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SYUEKI-G
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-ATO
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前"
      D    DISPLAY  CNS-PGM-ID": 処理フラグ             = ["
      D             WK-SYORI-FLG             OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定残高               = ["
      D             WK-KNJZN                 OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・借方) = ["
      D             WK-KNJ-IDOK-TJT-DEBIT    OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・貸方) = ["
      D             WK-KNJ-IDOK-TJT-CREDIT   OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT    OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT   OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後"
      D    DISPLAY  CNS-PGM-ID": 処理フラグ             = ["
      D             WK-SYORI-FLG             OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定残高               = ["
      D             WK-KNJZN                 OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・借方) = ["
      D             WK-KNJ-IDOK-TJT-DEBIT    OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・貸方) = ["
      D             WK-KNJ-IDOK-TJT-CREDIT   OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT    OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT   OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
           END-IF
      *-----------  2)勘定残高計算データを作成する
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"ワーク.未処分利益フラグ = ["
      D             WK-SYUEKI-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-SYUEKI-FLG = CNS-X-1
           THEN
             INITIALIZE                 PARM-SMZJ2612-INOUT
                                        PARM-RTNPKG
      *---------- 勘定科目コード
             MOVE  CNS-03002001-KKM-CD
               TO  KNJ-KAMK-CD          OF  PARM-SMZJ2612-ARG1
      *---------- 貸借区分
             MOVE  CNS-TAISHK-KBN-2
               TO  TAISHK-KBN           OF  PARM-SMZJ2612-ARG1
             MOVE  CNS-POS-024          TO  WK-ERR-POS
             PERFORM  SMZJ2612-1-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  3.2.2.8 未処分利益の更新"
      D             " 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SYUEKI-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.9 未処分損失の更新
      ******************************************************************
       SONSITU-UPDATE-RTN     SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  3.2.2.9 未処分損失の更新"
      D             " 処理  START  ****"
      *-----------------------------------------------------------------
      *---------- 1) ワークグループのクリア処理
           INITIALIZE                   WK-KSN-DMN-GAI
                                        WK-KSN-MAE
                                        WK-KSN-ATO
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外= ["WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前      = ["WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後      = ["WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.基準日断面作成区分 = ["
      D             WK-KY-DMN-SK-KBN"]"
      *-----------------------------------------------------------------
      *---------- 2) 未処分損失レコード編集
           IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-1
           THEN
      *-----------  ワーク.決算断面以外.処理フラグ
             MOVE  CNS-SYORI-FLG-1
               TO  WK-SYORI-FLG              OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定残高
             MOVE  WK-KNJZN                  OF  WK-SONSITU-G
               TO  WK-KNJZN                  OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定異動額(当日・借方)
             MOVE  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定異動額(当日・貸方)
             MOVE  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定異動額(期間・借方)
             MOVE  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-DMN-GAI
      *-----------  ワーク.決算断面以外.勘定異動額(期間・貸方)
             MOVE  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-DMN-GAI
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外"
      D    DISPLAY  CNS-PGM-ID": 処理フラグ             = ["
      D             WK-SYORI-FLG             OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定残高               = ["
      D             WK-KNJZN                 OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・借方) = ["
      D             WK-KNJ-IDOK-TJT-DEBIT    OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・貸方) = ["
      D             WK-KNJ-IDOK-TJT-CREDIT   OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT    OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT   OF  WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------  ワーク.決算前.処理フラグ
             MOVE  CNS-SYORI-FLG-1
               TO  WK-SYORI-FLG              OF  WK-KSN-MAE
      *-----------  ワーク.決算後.処理フラグ
             MOVE  CNS-SYORI-FLG-1
               TO  WK-SYORI-FLG              OF  WK-KSN-ATO
      *-----------  ワーク.決算前.勘定残高
             MOVE  WK-KNJZN                  OF  WK-SONSITU-G
               TO  WK-KNJZN                  OF  WK-KSN-MAE
      *-----------  ワーク.決算前.勘定異動額(当日・借方)
             MOVE  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-KSN-MAE
      *-----------  ワーク.決算前.勘定異動額(当日・貸方)
             MOVE  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-KSN-MAE
      *-----------  ワーク.決算前.勘定異動額(期間・借方)
             MOVE  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-MAE
      *-----------  ワーク.決算前.勘定異動額(期間・貸方)
             MOVE  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-MAE
      *-----------  ワーク.決算後.勘定残高
             MOVE  WK-KNJZN                  OF  WK-SONSITU-G
               TO  WK-KNJZN                  OF  WK-KSN-ATO
      *-----------  ワーク.決算後.勘定異動額(当日・借方)
             MOVE  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-TJT-DEBIT     OF  WK-KSN-ATO
      *-----------  ワーク.決算後.勘定異動額(当日・貸方)
             MOVE  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-TJT-CREDIT    OF  WK-KSN-ATO
      *-----------  ワーク.決算後.勘定異動額(期間・借方)
             MOVE  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-ATO
      *-----------  ワーク.決算後.勘定異動額(期間・貸方)
             MOVE  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-SONSITU-G
               TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-ATO
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前"
      D    DISPLAY  CNS-PGM-ID": 処理フラグ             = ["
      D             WK-SYORI-FLG             OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定残高               = ["
      D             WK-KNJZN                 OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・借方) = ["
      D             WK-KNJ-IDOK-TJT-DEBIT    OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・貸方) = ["
      D             WK-KNJ-IDOK-TJT-CREDIT   OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT    OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT   OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後"
      D    DISPLAY  CNS-PGM-ID": 処理フラグ             = ["
      D             WK-SYORI-FLG             OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定残高               = ["
      D             WK-KNJZN                 OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・借方) = ["
      D             WK-KNJ-IDOK-TJT-DEBIT    OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(当日・貸方) = ["
      D             WK-KNJ-IDOK-TJT-CREDIT   OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT    OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": 勘定異動額(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT   OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
           END-IF
      *---------- 3) 勘定残高計算データを作成する
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"ワーク.未処分損失フラグ = ["
      D             WK-SONSITU-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-SONSITU-FLG = CNS-X-1
           THEN
             INITIALIZE                 PARM-SMZJ2612-INOUT
                                        PARM-RTNPKG
      *---------- 勘定科目コード
             MOVE  CNS-03003001-KKM-CD
               TO  KNJ-KAMK-CD          OF  PARM-SMZJ2612-ARG1
      *---------- 貸借区分
             MOVE  CNS-TAISHK-KBN-1
               TO  TAISHK-KBN           OF  PARM-SMZJ2612-ARG1
             MOVE  CNS-POS-025          TO  WK-ERR-POS
             PERFORM  SMZJ2612-1-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  3.2.2.9 未処分損失の更新"
      D             " 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SONSITU-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *    勘定残高計算データを作成する
      ******************************************************************
       SMZJ2612-1-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  勘定残高計算データを作成する 処理"
      D             " START  ***"
      *-----------------------------------------------------------------
      *---------- 処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 開始基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  KAISI-KJN-YMD          OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT
             TO  KAISI-KJN-YMD-NEXT     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 基準日種類
           MOVE  WK-KJN-YMD-SHRU
             TO  KJN-YMD-SHRU           OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 基準日断面作成区分
           MOVE  WK-KJN-YMD-DMN-SK-KBN
             TO  KJN-YMD-DMN-SK-KBN     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 証券種別コード
           MOVE  CNS-SEC-CD-PRI
             TO  SEC-SBT-CD             OF  PARM-SMZJ2612-ARG1
      *---------- ワーク.決算断面以外
           MOVE  WK-KSN-DMN-GAI
             TO  KSN-DMN-GAI-PARM       OF  PARM-SMZJ2612-ARG1
      *---------- ワーク.決算前
           MOVE  WK-KSN-MAE
             TO  KSN-MAE-PARM           OF  PARM-SMZJ2612-ARG1
      *---------- ワーク.決算後
           MOVE  WK-KSN-ATO
             TO  KSN-ATO-PARM           OF  PARM-SMZJ2612-ARG1
      *---------- 更新フラグ
             MOVE  CNS-X-2
               TO  UPD-FLG              OF  PARM-SMZJ2612-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             SYORI-YMD           OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             KIDOU-ID            OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             RIYO-CMP-CD         OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             FUND-CD             OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             PTF-CD              OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             KJN-YMD             OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日 =["
      D             KAISI-KJN-YMD       OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日 =["
      D             KAISI-KJN-YMD-NEXT  OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日種類 =["
      D             KJN-YMD-SHRU        OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面作成区分 =["
      D             KJN-YMD-DMN-SK-KBN  OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             KNJ-KAMK-CD         OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":貸借区分 =["
      D             TAISHK-KBN          OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード =["
      D             SEC-SBT-CD          OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外 =["
      D             KSN-DMN-GAI-PARM    OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前 =["
      D             KSN-MAE-PARM        OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後 =["
      D             KSN-ATO-PARM        OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新フラグ    = ["
      D             UPD-FLG             OF  PARM-SMZJ2612-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ2612"             USING  PARM-SMZJ2612-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ2612)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             CONTINUE
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  勘定残高計算データを作成する 処理 "
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ2612-1-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.2.2 処理対象の証券種別コードを取得する
      ******************************************************************
       SEC-SBT-CD-GET-RTN     SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  処理対象の証券種別コードを取得"
      D             " 処理  START  ****"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  UNION-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  UNION-OPEN-RTN
           MOVE  CNS-OFF                TO  FLG-FETCH-SYUURYOU3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU3=["
      D             FLG-FETCH-SYUURYOU3"]"
      *-----------------------------------------------------------------
      *-----------  カーソルフェッチ処理
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SEC-SBT-CD-GET-RTN]"          GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  UNION-FET-RTN
             UNTIL  FLG-FETCH-SYUURYOU3 = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SEC-SBT-CD-GET-RTN]"          GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------  カーソルクローズ処理
      *    PERFORM  UNION-CLOSE-RTN                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  処理対象の証券種別コードを取得"
      D             " 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SEC-SBT-CD-GET-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       UNION-DEC-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD1         OF  H-UNION-S3,
                 WK-RIYO-CMP-CD-S1      OF  WK-MSG-1-3
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD1             OF  H-UNION-S3,
                 WK-FUND-CD-S1          OF  WK-MSG-1-3
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD1              OF  H-UNION-S3,
                 WK-PTF-CD-S1           OF  WK-MSG-1-3
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD1             OF  H-UNION-S3,
                 WK-KJN-YMD-S1          OF  WK-MSG-1-3
      *---------- 開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT
             TO  H-KAISI-KY-NEXT1       OF  H-UNION-S3,
                 WK-KAISI-KY-NEXT-S1    OF  WK-MSG-1-3
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-UNION-S3,
                 WK-SYORI-YMD-S         OF  WK-MSG-1-3
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-UNION-S3,
                 WK-KIDOU-ID-S          OF  WK-MSG-1-3
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD2         OF  H-UNION-S3,
                 WK-RIYO-CMP-CD-S2      OF  WK-MSG-1-3
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD2             OF  H-UNION-S3,
                 WK-FUND-CD-S2          OF  WK-MSG-1-3
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD2              OF  H-UNION-S3,
                 WK-PTF-CD-S2           OF  WK-MSG-1-3
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD2             OF  H-UNION-S3,
                 WK-KJN-YMD-S2          OF  WK-MSG-1-3
      *---------- 開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT
             TO  H-KAISI-KY-NEXT2       OF  H-UNION-S3,
                 WK-KAISI-KY-NEXT-S2    OF  WK-MSG-1-3
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD3         OF  H-UNION-S3,
                 WK-RIYO-CMP-CD-S3      OF  WK-MSG-1-3
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD3             OF  H-UNION-S3,
                 WK-FUND-CD-S3          OF  WK-MSG-1-3
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD3              OF  H-UNION-S3,
                 WK-PTF-CD-S3           OF  WK-MSG-1-3
      *---------- 基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KAISI-KJN-YMD3       OF  H-UNION-S3,
                 WK-KJN-YMD-S3          OF  WK-MSG-1-3
      *---------- 貸借区分
           MOVE  WK-TAISHK-KBN
             TO  H-TAISHK-KBN3           OF  H-UNION-S3,
                 WK-TAISHK-KBN-S3        OF  WK-MSG-1-3
      *---------- テーブルID
           MOVE  WK-TBL-TKCMKJ00
             TO  SQL-TKCMKJ00           OF  SQL-SELECT-1-3,
           MOVE  WK-TBL-TKMZKI00
             TO  SQL-TKMZKI00           OF  SQL-SELECT-1-3,
                 WK-TKMZKI00            OF  WK-MSG-1-3
           MOVE  WK-TBL-TKMZBW15
             TO  SQL-TKMZBW15           OF  SQL-SELECT-1-3,
                 WK-TKMZBW15            OF  WK-MSG-1-3
           MOVE  WK-TBL-TKMZKZ00
             TO  SQL-TKMZKZ00           OF  SQL-SELECT-1-3,
                 WK-TKMZKZ00            OF  WK-MSG-1-3
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD1      OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD1          OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD1           OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             H-KNJ-KAMK-CD1      OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KJN-YMD1          OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日 =["
      D             H-KAISI-KY-NEXT1    OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             H-SYORI-YMD         OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             H-KIDOU-ID          OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD2      OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD2          OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD2           OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             H-KNJ-KAMK-CD2      OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KJN-YMD2          OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日 =["
      D             H-KAISI-KY-NEXT2    OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD3      OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD3          OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD3           OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KAISI-KJN-YMD3    OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             H-KNJ-KAMK-CD3      OF  H-UNION-S3"]"
      D    DISPLAY  CNS-PGM-ID":貸借区分 =["
      D             H-TAISHK-KBN3       OF  H-UNION-S3"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT3                                         @3212SEINO@@
      *---------- ＳＱＬ文
           MOVE  SQL-SELECT-1-3        TO  SQLSTMT3                     @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT3=["SQLSTMT3"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-3=["WK-MSG-1-3"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-SEC-SBT-CD-CR-OPEN = ["             @3212SEINO@@
      D                          FLG-SEC-SBT-CD-CR-OPEN"]"              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-SEC-SBT-CD-CR-OPEN  = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL
               PREPARE  S3  FROM :SQLSTMT3                              @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-026
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
               DECLARE  TKMZKI00_CURSOR  CURSOR  FOR S3
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UNION-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       UNION-OPEN-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZKI00_CURSOR
                 USING :H-UNION-S3.H-RIYO-CMP-CD1,
                       :H-UNION-S3.H-FUND-CD1,
                       :H-UNION-S3.H-PTF-CD1,
                       :H-UNION-S3.H-KJN-YMD1,
                       :H-UNION-S3.H-KAISI-KY-NEXT1,
                       :H-UNION-S3.H-SYORI-YMD,
                       :H-UNION-S3.H-KIDOU-ID,
                       :H-UNION-S3.H-RIYO-CMP-CD2,
                       :H-UNION-S3.H-FUND-CD2,
                       :H-UNION-S3.H-PTF-CD2,
                       :H-UNION-S3.H-KJN-YMD2,
                       :H-UNION-S3.H-KAISI-KY-NEXT2,
                       :H-UNION-S3.H-RIYO-CMP-CD3,
                       :H-UNION-S3.H-FUND-CD3,
                       :H-UNION-S3.H-PTF-CD3,
                       :H-UNION-S3.H-KAISI-KJN-YMD3
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-SEC-SBT-CD-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-SEC-SBT-CD-CR-OPEN=["
      D             FLG-SEC-SBT-CD-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-027
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UNION-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       UNION-FET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-UNION-3
                                        H-TKCMKJ00-2
           EXEC  SQL
               FETCH
                    TKMZKI00_CURSOR
               INTO :H-UNION-3.H-SEC-SBT-CD,
                    :H-TKCMKJ00-2.H-KNJ-KAMK-CD,
                    :H-TKCMKJ00-2.H-TAISHK-KBN
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  ア）ワーク.証券種別コード ← 別紙1-3.証券種別コード
               MOVE  H-SEC-SBT-CD       OF  H-UNION-3
                 TO  WK-SEC-SBT-CD
      *---------- ワーク.勘定科目コード
               MOVE  H-KNJ-KAMK-CD      OF  H-TKCMKJ00-2
                 TO  WK-KNJ-KAMK-CD
      *---------- ワーク.貸借区分
               MOVE  H-TAISHK-KBN       OF  H-TKCMKJ00-2
                 TO  WK-TAISHK-KBN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.証券種別コード=["WK-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定科目コード=["
      D             WK-KNJ-KAMK-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.貸借区分      =["
      D             WK-TAISHK-KBN"]"
      *-----------------------------------------------------------------
               INITIALIZE  WK-KSN-DMN-GAI
                           WK-KSN-MAE
                           WK-KSN-ATO
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外                  =["
      D             WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前                        =["
      D             WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後                        =["
      D             WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.基準日断面作成区分            =["
      D             WK-KY-DMN-SK-KBN"]"
      *-----------------------------------------------------------------
      *---------- ワーク.基準日断面作成区分＝"1":一つ断面作成の場合
               IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-1
               THEN
      *----------  ワーク.決算断面以外.処理フラグ
                 MOVE  CNS-SYORI-FLG-1
                 TO  WK-SYORI-FLG       OF  WK-KSN-DMN-GAI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.処理フラグ       =["
      D             WK-SYORI-FLG        OF  WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
      *---------- ワーク.基準日断面作成区分＝"2":二つ断面作成の場合
               ELSE
      *----------  ワーク.決算前.処理フラグ
                 MOVE  CNS-SYORI-FLG-1
                   TO  WK-SYORI-FLG     OF  WK-KSN-MAE
      *----------  ワーク.決算後.処理フラグ
                 MOVE  CNS-SYORI-FLG-1
                   TO  WK-SYORI-FLG     OF  WK-KSN-ATO
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.処理フラグ             =["
      D             WK-SYORI-FLG        OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.処理フラグ             =["
      D             WK-SYORI-FLG        OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
               END-IF
      *----------- イ）勘定異動額データを取得する
               MOVE  CNS-POS-028        TO  WK-ERR-POS
               PERFORM  SMZJ2611-RTN
      *----------- ウ）開始基準日の勘定残高を取得する
               PERFORM  KNJZN-GET-RTN
      *----------- エ) 資産・負債・元本、且つ、初期断面の場合、異動額を相殺する
               PERFORM  SISAN-HUSAI-RTN
      *----------- オ）勘定異動額（期間）データを取得する
               PERFORM  KNJ-IDOK-KKN-GET-RTN
      *----------- カ）勘定異動額（当日）を相殺して勘定残高を計算する
               PERFORM  KNJ-IDOK-TJT-GET-RTN
      *----------- キ）勘定残高計算データを作成する
               PERFORM  SMZJ2612-RTN
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-FETCH-SYUURYOU3
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU3=["
      D             FLG-FETCH-SYUURYOU3"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-029
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UNION-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      * UNION-CLOSE-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZKI00_CURSOR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-SEC-SBT-CD-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-SEC-SBT-CD-CR-OPEN=["
      *D             FLG-SEC-SBT-CD-CR-OPEN"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-POS-030
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-3        DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * UNION-CLOSE-EXT.
      *     EXIT.
      ******************************************************************
      *    イ）勘定異動額データを取得する
      ******************************************************************
       SMZJ2611-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  イ）勘定異動額データを取得 処理"
      D             " START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ2611-INOUT
                       PARM-RTNPKG
      *---------- 処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- 起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- 開始基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  KAISI-KJN-YMD          OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- 開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT
             TO  KAISI-KJN-YMD-NEXT     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- 基準日種類
           MOVE  WK-KJN-YMD-SHRU
             TO  KJN-YMD-SHRU           OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- 基準日断面作成区分
           MOVE  WK-KJN-YMD-DMN-SK-KBN
             TO  KJN-YMD-DMN-SK-KBN     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2611-ARG1
      *---------- 勘定科目コード
           MOVE  WK-KNJ-KAMK-CD
             TO  KNJ-KAMK-CD            OF  PARM-SMZJ2611-ARG1
      *---------- 基準日断面作成区分
           MOVE  WK-KY-DMN-SK-KBN
             TO  KJN-YMD-DS-KBN         OF  PARM-SMZJ2611-ARG1
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  SEC-SBT-CD             OF  PARM-SMZJ2611-ARG1
      *---------- ワーク.決算断面以外
           MOVE  WK-KSN-DMN-GAI
             TO  KSN-DMN-GAI-PARM       OF  PARM-SMZJ2611-ARG1
      *---------- ワーク.決算前
           MOVE  WK-KSN-MAE
             TO  KSN-MAE-PARM           OF  PARM-SMZJ2611-ARG1
      *---------- ワーク.決算後
           MOVE  WK-KSN-ATO
             TO  KSN-ATO-PARM           OF  PARM-SMZJ2611-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             SYORI-YMD           OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             KIDOU-ID            OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             RIYO-CMP-CD         OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             FUND-CD             OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             PTF-CD              OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             KJN-YMD             OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日 =["
      D             KAISI-KJN-YMD       OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日 =["
      D             KAISI-KJN-YMD-NEXT  OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日種類 =["
      D             KJN-YMD-SHRU        OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面作成区分 =["
      D             KJN-YMD-DMN-SK-KBN  OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             KNJ-KAMK-CD         OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面作成区分 =["
      D             KJN-YMD-DS-KBN      OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード =["
      D             SEC-SBT-CD          OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外 =["
      D             KSN-DMN-GAI-PARM    OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前 =["
      D             KSN-MAE-PARM        OF  PARM-SMZJ2611-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後 =["
      D             KSN-ATO-PARM        OF  PARM-SMZJ2611-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ2611"             USING  PARM-SMZJ2611-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ2611)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             INITIALIZE  WK-KSN-DMN-GAI
                         WK-KSN-MAE
                         WK-KSN-ATO
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":初期化"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外 =["WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前 =["WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後 =["WK-KSN-ATO"]"
      *-----------------------------------------------------------------
      *----------ワーク.決算断面以外 ← SMZJ2611.決算断面以外
             MOVE  KSN-DMN-GAI-PARM     OF  PARM-SMZJ2611-ARG2
               TO  WK-KSN-DMN-GAI
      *----------ワーク.決算前 ← SMZJ2611.決算前
             MOVE  KSN-MAE-PARM         OF  PARM-SMZJ2611-ARG2
               TO  WK-KSN-MAE
      *----------ワーク.決算後 ← SMZJ2611.決算後
             MOVE  KSN-ATO-PARM         OF  PARM-SMZJ2611-ARG2
               TO  WK-KSN-ATO
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外 =["WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前 =["WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後 =["WK-KSN-ATO"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** イ）勘定異動額データを取得 処理 "
      D                       "END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ2611-EXT.
           EXIT.
      ******************************************************************
      *    ウ）開始基準日の勘定残高を取得する
      ******************************************************************
       KNJZN-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ウ）開始基準日の勘定残高"
      D             "を取得する 処理 START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZKZ00-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZKZ00-OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZKZ00-FET-RTN
      *-----------  カーソルクローズ処理
      *    PERFORM  TKMZKZ00-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ウ）開始基準日の勘定残高"
      D             "を取得する 処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KNJZN-GET-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZKZ00-DEC-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定科目コード = ["
      D             WK-KNJ-KAMK-CD"]"
      *-----------------------------------------------------------------
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZKZ00-S4,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-4
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZKZ00-S4,
                 WK-FUND-CD-S           OF  WK-MSG-1-4
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZKZ00-S4,
                 WK-PTF-CD-S            OF  WK-MSG-1-4
      *---------- 基準日
           IF  (WK-KNJ-KAMK-CD   =   CNS-03002001-KKM-CD
           OR  WK-KNJ-KAMK-CD    =   CNS-03003001-KKM-CD)
           AND WK-COUNT-KYDK    >=   CNS-1
           THEN
             MOVE  WK-KJN-YMD
               TO  H-KAISI-KJN-YMD        OF  H-TKMZKZ00-S4,
                   WK-KJN-YMD-S           OF  WK-MSG-1-4
           ELSE
             MOVE  WK-KAISI-KJN-YMD
               TO  H-KAISI-KJN-YMD        OF  H-TKMZKZ00-S4,
                   WK-KJN-YMD-S           OF  WK-MSG-1-4
           END-IF
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZKZ00-S4,
                 WK-SEC-SBT-CD-S        OF  WK-MSG-1-4
      *---------- 勘定科目コード
           MOVE  WK-KNJ-KAMK-CD
             TO  H-KNJ-KAMK-CD          OF  H-TKMZKZ00-S4,
                 WK-KNJ-KAMK-CD-S       OF  WK-MSG-1-4
      *---------- 貸借区分
           MOVE  WK-TAISHK-KBN
             TO  H-TAISHK-KBN           OF  H-TKMZKZ00-S4,
                 WK-TAISHK-KBN-S        OF  WK-MSG-1-4
      *---------- テーブルID
           MOVE  WK-TBL-TKMZKZ00
             TO  SQL-TKMZKZ00           OF  SQL-SELECT-1-4,
                 WK-TKMZKZ00            OF  WK-MSG-1-4
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKZ00-S4"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD           OF  H-TKMZKZ00-S4"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD            OF  H-TKMZKZ00-S4"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KAISI-KJN-YMD     OF  H-TKMZKZ00-S4"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード =["
      D             H-SEC-SBT-CD        OF  H-TKMZKZ00-S4"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             H-KNJ-KAMK-CD       OF  H-TKMZKZ00-S4"]"
      D    DISPLAY  CNS-PGM-ID":貸借区分 =["
      D             H-TAISHK-KBN        OF  H-TKMZKZ00-S4"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
      *---------- ＳＱＬ文
           MOVE  SQL-SELECT-1-4         TO  SQLSTMT4                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT4=["SQLSTMT4"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-4=["WK-MSG-1-4"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-CR-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZKZ00-CR-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKZ00-CR-OPEN  = CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL
               PREPARE  S4   FROM :SQLSTMT4                             @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-031
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZKZ00_CURSOR  CURSOR  FOR S4
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMZKZ00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZKZ00_CURSOR
                 USING :H-TKMZKZ00-S4.H-RIYO-CMP-CD,
                       :H-TKMZKZ00-S4.H-FUND-CD,
                       :H-TKMZKZ00-S4.H-PTF-CD,
                       :H-TKMZKZ00-S4.H-KAISI-KJN-YMD,
                       :H-TKMZKZ00-S4.H-SEC-SBT-CD,
                       :H-TKMZKZ00-S4.H-KNJ-KAMK-CD,
                       :H-TKMZKZ00-S4.H-TAISHK-KBN
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZKZ00-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-CR-OPEN=["
      D             FLG-TKMZKZ00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-032
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       TKMZKZ00-FET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZKZ00-4
                                        WK-KNJ-IDOK-KKN-DEBIT-4
                                        WK-KNJ-IDOK-KKN-CREDIT-4
           EXEC  SQL
               FETCH
                    TKMZKZ00_CURSOR
               INTO :H-TKMZKZ00-4.H-KNJZN,
                    :H-TKMZKZ00-4.H-KNJ-IDOK-KKN-DEBIT,
                    :H-TKMZKZ00-4.H-KNJ-IDOK-KKN-CREDIT
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高                  =["
      D             H-KNJZN               OF  H-TKMZKZ00-4"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・借方）  =["
      D             H-KNJ-IDOK-KKN-DEBIT  OF  H-TKMZKZ00-4"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・貸方）  =["
      D             H-KNJ-IDOK-KKN-CREDIT OF  H-TKMZKZ00-4"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.基準日断面作成区分 =["
      D             WK-KY-DMN-SK-KBN"]"
      *-----------------------------------------------------------------
      *---------- ワーク.基準日断面作成区分＝"1":一つ断面作成の場合
               IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-1
               THEN
      *---------- ワーク.決算断面以外.勘定残高
                 MOVE  H-KNJZN            OF  H-TKMZKZ00-4
                   TO  WK-KNJZN           OF  WK-KSN-DMN-GAI
      *---------- ワーク.決算断面以外.勘定異動額(期間・借方)
                 MOVE  H-KNJ-IDOK-KKN-DEBIT
                                          OF  H-TKMZKZ00-4
                   TO  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-DMN-GAI
      *---------- ワーク.決算断面以外.勘定異動額(期間・貸方)
                 MOVE  H-KNJ-IDOK-KKN-CREDIT
                                          OF  H-TKMZKZ00-4
                   TO  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-DMN-GAI
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定残高  "
      D                       "                =["
      D             WK-KNJZN               OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（期間・借方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *---------- ワーク.基準日断面作成区分＝"2":二つ断面作成の場合
               IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-2
               THEN
      *---------- ワーク.決算前.勘定残高
                 MOVE  H-KNJZN            OF  H-TKMZKZ00-4
                   TO  WK-KNJZN           OF  WK-KSN-MAE
      *---------- ワーク.決算前.勘定異動額(期間・借方)
                 MOVE  H-KNJ-IDOK-KKN-DEBIT
                                          OF  H-TKMZKZ00-4
                   TO  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-MAE
      *---------- ワーク.決算前.勘定異動額(期間・貸方)
                 MOVE  H-KNJ-IDOK-KKN-CREDIT
                                          OF  H-TKMZKZ00-4
                   TO  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-MAE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定残高  "
      D                       "                =["
      D             WK-KNJZN               OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（期間・借方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE"]"
      *-----------------------------------------------------------------
      *---------- ワーク.決算後.勘定残高
                 MOVE  H-KNJZN            OF  H-TKMZKZ00-4
                   TO  WK-KNJZN           OF  WK-KSN-ATO
      *---------- ワーク.決算後.勘定異動額(期間・借方)
                 MOVE  H-KNJ-IDOK-KKN-DEBIT
                                          OF  H-TKMZKZ00-4
                   TO  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-ATO
      *---------- ワーク.決算後.勘定異動額(期間・貸方)
                 MOVE  H-KNJ-IDOK-KKN-CREDIT
                                          OF  H-TKMZKZ00-4
                   TO  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-ATO
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定残高  "
      D                       "                =["
      D             WK-KNJZN               OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（期間・借方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *---------- 別紙1-4.勘定異動額（期間・借方）
               MOVE  H-KNJ-IDOK-KKN-DEBIT  OF  H-TKMZKZ00-4
                 TO  WK-KNJ-IDOK-KKN-DEBIT-4
      *---------- 別紙1-4.勘定異動額（期間・貸方）
               MOVE  H-KNJ-IDOK-KKN-CREDIT OF  H-TKMZKZ00-4
                 TO  WK-KNJ-IDOK-KKN-CREDIT-4
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":別紙1-4.勘定異動額（期間・借方）= ["
      D             WK-KNJ-IDOK-KKN-DEBIT-4"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-4.勘定異動額（期間・貸方）= ["
      D             WK-KNJ-IDOK-KKN-CREDIT-4"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":該当 勘定残高 なし"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-033
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-4      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      * TKMZKZ00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZKZ00_CURSOR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZKZ00-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-CR-OPEN=["
      *D             FLG-TKMZKZ00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-POS-034
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-4        DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZKZ00-CLOSE-EXT.
      *     EXIT.
      ******************************************************************
      *    エ) 資産・負債・元本、且つ、初期断面の場合、異動額を相殺する
      ******************************************************************
       SISAN-HUSAI-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** エ) 資産・負債・元本、且つ、"
      D             "初期断面の場合、異動額を相殺する  START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定科目コード     = ["
      D             WK-KNJ-KAMK-CD"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-16.COUNT(決算日断面区分)  = ["
      D             WK-COUNT-KYDK"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.基準日断面作成区分 = ["
      D             WK-KY-DMN-SK-KBN"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-4.勘定異動額（期間・借方）= ["
      D             WK-KNJ-IDOK-KKN-DEBIT-4"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-4.勘定異動額（期間・貸方）= ["
      D             WK-KNJ-IDOK-KKN-CREDIT-4"]"
      *-----------------------------------------------------------------
           IF  (WK-KNJ-KAMK-CD(1:2)   =  CNS-X-01
           OR  WK-KNJ-KAMK-CD(1:2)    =  CNS-X-02
           OR  WK-KNJ-KAMK-CD(1:2)    =  CNS-X-03)
           AND WK-COUNT-KYDK         >=  CNS-1
           THEN
             IF  WK-KNJ-KAMK-CD(1:2)  =  CNS-X-01
             THEN
               IF  WK-KY-DMN-SK-KBN   =  CNS-KY-DMN-SK-KBN-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.勘定異動額（期間・"
      D           "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.勘定異動額（期間・"
      D           "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
                 IF  WK-KNJ-IDOK-KKN-DEBIT-4  -
                     WK-KNJ-IDOK-KKN-CREDIT-4 >= ZERO
                 THEN
                   COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI
                         =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI
                         -  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-DMN-GAI
                 ELSE
                   COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI
                         =  FUNCTION ABS(
                            WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI
                         -  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI)
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-DMN-GAI
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.勘定異動額（期間・"
      D           "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.勘定異動額（期間・"
      D           "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
               IF  WK-KY-DMN-SK-KBN   =  CNS-KY-DMN-SK-KBN-2
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.勘定異動額（期間・借方）"
      D             "= ["WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.勘定異動額（期間・貸方）"
      D             "= ["WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.勘定異動額（期間・借方）"
      D             "= ["WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.勘定異動額（期間・貸方）"
      D             "= ["WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
                 IF  WK-KNJ-IDOK-KKN-DEBIT-4 -
                     WK-KNJ-IDOK-KKN-CREDIT-4 >= ZERO
                 THEN
                   COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE
                         =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE
                         -  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE
                   COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO
                         =  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO
                         -  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-MAE
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-ATO
                 ELSE
                   COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE
                         =  FUNCTION ABS(
                            WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE
                         -  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE)
                   COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO
                         =  FUNCTION ABS(
                            WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO
                         -  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO)
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-MAE
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-ATO
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.勘定異動額（期間・借方）"
      D             "= ["WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.勘定異動額（期間・貸方）"
      D             "= ["WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.勘定異動額（期間・借方）"
      D             "= ["WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.勘定異動額（期間・貸方）"
      D             "= ["WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             ELSE
               CONTINUE
             END-IF
             IF  (WK-KNJ-KAMK-CD(1:2) =  CNS-X-02
             OR  WK-KNJ-KAMK-CD(1:2)  =  CNS-X-03)
             AND WK-KNJ-KAMK-CD   NOT =  CNS-03002001-KKM-CD
             AND WK-KNJ-KAMK-CD   NOT =  CNS-03003001-KKM-CD
             THEN
               IF  WK-KY-DMN-SK-KBN   =  CNS-KY-DMN-SK-KBN-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.勘定異動額（期間・"
      D           "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.勘定異動額（期間・"
      D           "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
                 IF  WK-KNJ-IDOK-KKN-CREDIT-4 -
                     WK-KNJ-IDOK-KKN-DEBIT-4  <  ZERO
                 THEN
                   COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI
                         =  FUNCTION ABS(
                            WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI
                         -  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI)
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-DMN-GAI
                 ELSE
                   COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI
                         =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI
                         -  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-DMN-GAI
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.勘定異動額（期間・"
      D           "借方）= ["WK-KNJ-IDOK-KKN-DEBIT  OF WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外.勘定異動額（期間・"
      D           "貸方）= ["WK-KNJ-IDOK-KKN-CREDIT OF WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
               IF  WK-KY-DMN-SK-KBN   =  CNS-KY-DMN-SK-KBN-2
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.勘定異動額（期間・借方）"
      D             "= ["WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.勘定異動額（期間・貸方）"
      D             "= ["WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.勘定異動額（期間・借方）"
      D             "= ["WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.勘定異動額（期間・貸方）"
      D             "= ["WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
                 IF  WK-KNJ-IDOK-KKN-CREDIT-4 -
                     WK-KNJ-IDOK-KKN-DEBIT-4  <  ZERO
                 THEN
                   COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE
                         =  FUNCTION ABS(
                            WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE
                         -  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE)
                   COMPUTE  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO
                         =  FUNCTION ABS(
                            WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO
                         -  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO)
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-MAE
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-ATO
                 ELSE
                   COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE
                         =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE
                         -  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE
                   COMPUTE  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO
                         =  WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO
                         -  WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-MAE
                   MOVE  ZERO
                     TO  WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-ATO
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.勘定異動額（期間・借方）"
      D             "= ["WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前.勘定異動額（期間・貸方）"
      D             "= ["WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.勘定異動額（期間・借方）"
      D             "= ["WK-KNJ-IDOK-KKN-DEBIT     OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後.勘定異動額（期間・貸方）"
      D             "= ["WK-KNJ-IDOK-KKN-CREDIT    OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** エ) 資産・負債・元本、且つ、"
      D             "初期断面の場合、異動額を相殺する  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SISAN-HUSAI-EXT.
           EXIT.
      ******************************************************************
      *    オ）勘定異動額（期間）データを取得する
      ******************************************************************
       KNJ-IDOK-KKN-GET-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** オ）勘定異動額（期間）データ"
      D             "を取得する 処理 START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク.基準日断面作成区分 =["
      D             WK-KY-DMN-SK-KBN"]"
      *-----------------------------------------------------------------
      *---------- ワーク.基準日断面作成区分＝"1":一つ断面作成の場合
               IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-1
               THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（期間・借方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（当日・借方）  =["
      D             WK-KNJ-IDOK-TJT-DEBIT  OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（当日・貸方）  =["
      D             WK-KNJ-IDOK-TJT-CREDIT OF  WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
      *---------- ワーク.決算断面以外.勘定異動額(期間・借方)
                 COMPUTE  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-DMN-GAI
                       =  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-DMN-GAI
                       +  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-DMN-GAI
      *---------- ワーク.決算断面以外.勘定異動額(期間・貸方)
                 COMPUTE  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-DMN-GAI
                       =  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-DMN-GAI
                       +  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-DMN-GAI
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（期間・借方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *---------- ワーク.基準日断面作成区分＝"2":二つ断面作成の場合
               IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-2
               THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（期間・借方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（当日・借方）  =["
      D             WK-KNJ-IDOK-TJT-DEBIT  OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（当日・貸方）  =["
      D             WK-KNJ-IDOK-TJT-CREDIT OF  WK-KSN-MAE"]"
      *-----------------------------------------------------------------
      *---------- ワーク.決算前.勘定異動額(期間・借方)
                 COMPUTE  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-MAE
                       =  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-MAE
                       +  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-MAE
      *---------- ワーク.決算前.勘定異動額(期間・貸方)
                 COMPUTE  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-MAE
                       =  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-MAE
                       +  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-MAE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（期間・借方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID":---------------------------------------"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（当日・借方）  =["
      D             WK-KNJ-IDOK-TJT-DEBIT  OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（当日・貸方）  =["
      D             WK-KNJ-IDOK-TJT-CREDIT OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
      *---------- ワーク.決算後.勘定異動額(期間・借方)
                 COMPUTE  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-ATO
                       =  WK-KNJ-IDOK-KKN-DEBIT
                                          OF  WK-KSN-ATO
                       +  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-ATO
      *---------- ワーク.決算後.勘定異動額(期間・貸方)
                 COMPUTE  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-ATO
                       =  WK-KNJ-IDOK-KKN-CREDIT
                                          OF  WK-KSN-ATO
                       +  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-ATO
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定残高  "
      D                       "                =["
      D             WK-KNJZN               OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（期間・借方）  =["
      D             WK-KNJ-IDOK-KKN-DEBIT  OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（期間・貸方）  =["
      D             WK-KNJ-IDOK-KKN-CREDIT OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** オ）勘定異動額（期間）データ"
      D             "を取得する 処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KNJ-IDOK-KKN-GET-EXT.
           EXIT.
      ******************************************************************
      *    カ）勘定異動額（当日）を相殺して勘定残高を計算する
      ******************************************************************
       KNJ-IDOK-TJT-GET-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カ）勘定異動額（当日）を相殺して"
      D             "勘定残高を計算する 処理  START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク.基準日断面作成区分 =["
      D             WK-KY-DMN-SK-KBN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.貸借区分 =["WK-TAISHK-KBN"]"
      *-----------------------------------------------------------------
      *---------- ワーク.基準日断面作成区分＝"1":一つ断面作成の場合
               IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定残高  "
      D                       "                =["
      D             WK-KNJZN              OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（当日・借方）  =["
      D             WK-KNJ-IDOK-TJT-DEBIT  OF  WK-KSN-DMN-GAI"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定異動額"
      D                       "（当日・貸方）  =["
      D             WK-KNJ-IDOK-TJT-CREDIT OF  WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
                 IF  WK-TAISHK-KBN = CNS-TAISHK-KBN-1
                 THEN
      *---------- ワーク.決算断面以外.勘定残高
                   COMPUTE  WK-KNJZN      OF  WK-KSN-DMN-GAI
                         =  WK-KNJZN      OF  WK-KSN-DMN-GAI
                         +  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-DMN-GAI
                         -  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-DMN-GAI
                 ELSE
                   CONTINUE
                 END-IF
                 IF  WK-TAISHK-KBN = CNS-TAISHK-KBN-2
                 THEN
      *---------- ワーク.決算断面以外.勘定残高
                   COMPUTE  WK-KNJZN      OF  WK-KSN-DMN-GAI
                         =  WK-KNJZN      OF  WK-KSN-DMN-GAI
                         +  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-DMN-GAI
                         -  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-DMN-GAI
                 ELSE
                   CONTINUE
                 END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算断面以外.勘定残高        =["
      D             WK-KNJZN              OF  WK-KSN-DMN-GAI"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *---------- ワーク.基準日断面作成区分＝"2":二つ断面作成の場合
               IF  WK-KY-DMN-SK-KBN = CNS-KY-DMN-SK-KBN-2
               THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定残高  "
      D                       "                =["
      D             WK-KNJZN              OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定残高  "
      D                       "                =["
      D             WK-KNJZN              OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（当日・借方）  =["
      D             WK-KNJ-IDOK-TJT-DEBIT  OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定異動額"
      D                       "（当日・貸方）  =["
      D             WK-KNJ-IDOK-TJT-CREDIT OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（当日・借方） =["
      D             WK-KNJ-IDOK-TJT-DEBIT  OF  WK-KSN-ATO"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定異動額"
      D                       "（当日・貸方）  =["
      D             WK-KNJ-IDOK-TJT-CREDIT OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
                 IF  WK-TAISHK-KBN = CNS-TAISHK-KBN-1
                 THEN
      *---------- ワーク.決算前.勘定残高
                   COMPUTE  WK-KNJZN      OF  WK-KSN-MAE
                         =  WK-KNJZN      OF  WK-KSN-MAE
                         +  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-MAE
                         -  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-MAE
      *---------- ワーク.決算後.勘定残高
                   COMPUTE  WK-KNJZN      OF  WK-KSN-ATO
                         =  WK-KNJZN      OF  WK-KSN-ATO
                         +  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-ATO
                         -  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-ATO
                 ELSE
                   CONTINUE
                 END-IF
                 IF  WK-TAISHK-KBN = CNS-TAISHK-KBN-2
                 THEN
      *---------- ワーク.決算前.勘定残高
                   COMPUTE  WK-KNJZN      OF  WK-KSN-MAE
                         =  WK-KNJZN      OF  WK-KSN-MAE
                         +  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-MAE
                         -  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-MAE
      *---------- ワーク.決算後.勘定残高
                   COMPUTE  WK-KNJZN      OF  WK-KSN-ATO
                         =  WK-KNJZN      OF  WK-KSN-ATO
                         +  WK-KNJ-IDOK-TJT-CREDIT
                                          OF  WK-KSN-ATO
                         -  WK-KNJ-IDOK-TJT-DEBIT
                                          OF  WK-KSN-ATO
                 ELSE
                   CONTINUE
                 END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": ワーク.決算前.勘定残高        =["
      D             WK-KNJZN              OF  WK-KSN-MAE"]"
      D    DISPLAY  CNS-PGM-ID": ワーク.決算後.勘定残高        =["
      D             WK-KNJZN              OF  WK-KSN-ATO"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カ）勘定異動額（当日）を相殺して"
      D             "勘定残高を計算する処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KNJ-IDOK-TJT-GET-EXT.
           EXIT.
      ******************************************************************
      *    キ）勘定残高計算データを作成する
      ******************************************************************
       SMZJ2612-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  キ）勘定残高計算データを作成 処理"
      D             " START  ***"
      D    DISPLAY  CNS-PGM-ID ":ワーク.勘定科目コード = ["
      D             WK-KNJ-KAMK-CD"]"
      *-----------------------------------------------------------------
           INITIALIZE                   PARM-SMZJ2612-INOUT
                                        PARM-RTNPKG
      *---------- 処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 開始基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  KAISI-KJN-YMD          OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT
             TO  KAISI-KJN-YMD-NEXT     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 基準日種類
           MOVE  WK-KJN-YMD-SHRU
             TO  KJN-YMD-SHRU           OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 基準日断面作成区分
           MOVE  WK-KJN-YMD-DMN-SK-KBN
             TO  KJN-YMD-DMN-SK-KBN     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2612-ARG1
      *---------- 勘定科目コード
           MOVE  WK-KNJ-KAMK-CD
             TO  KNJ-KAMK-CD            OF  PARM-SMZJ2612-ARG1
      *---------- 貸借区分
           MOVE  WK-TAISHK-KBN
             TO  TAISHK-KBN             OF  PARM-SMZJ2612-ARG1
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  SEC-SBT-CD             OF  PARM-SMZJ2612-ARG1
      *---------- ワーク.決算断面以外
           MOVE  WK-KSN-DMN-GAI
             TO  KSN-DMN-GAI-PARM       OF  PARM-SMZJ2612-ARG1
      *---------- ワーク.決算前
           MOVE  WK-KSN-MAE
             TO  KSN-MAE-PARM           OF  PARM-SMZJ2612-ARG1
      *---------- ワーク.決算後
           MOVE  WK-KSN-ATO
             TO  KSN-ATO-PARM           OF  PARM-SMZJ2612-ARG1
      *---------- 更新フラグ
           IF  WK-KNJ-KAMK-CD           =   CNS-03002001-KKM-CD
           OR  WK-KNJ-KAMK-CD           =   CNS-03003001-KKM-CD
           THEN
             MOVE  CNS-X-2
               TO  UPD-FLG              OF  PARM-SMZJ2612-ARG1
           ELSE
             MOVE  CNS-X-1
               TO  UPD-FLG              OF  PARM-SMZJ2612-ARG1
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             SYORI-YMD           OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             KIDOU-ID            OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             RIYO-CMP-CD         OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             FUND-CD             OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             PTF-CD              OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             KJN-YMD             OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日 =["
      D             KAISI-KJN-YMD       OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日 =["
      D             KAISI-KJN-YMD-NEXT  OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日種類 =["
      D             KJN-YMD-SHRU        OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面作成区分 =["
      D             KJN-YMD-DMN-SK-KBN  OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             KNJ-KAMK-CD         OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":貸借区分 =["
      D             TAISHK-KBN          OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード =["
      D             SEC-SBT-CD          OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算断面以外 =["
      D             KSN-DMN-GAI-PARM    OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算前 =["
      D             KSN-MAE-PARM        OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.決算後 =["
      D             KSN-ATO-PARM        OF  PARM-SMZJ2612-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新フラグ    = ["
      D             UPD-FLG             OF  PARM-SMZJ2612-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ2612"             USING  PARM-SMZJ2612-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ2612)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             CONTINUE
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-035
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  キ）勘定残高計算データを作成 処理 "
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ2612-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.2 中分類集計
      ******************************************************************
       MID-SYUKEI-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.3.2 中分類集計 処理  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZBW16-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZBW16-OPEN-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF                TO  FLG-FETCH-TKMZBW16
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-TKMZBW16=["
      D             FLG-FETCH-TKMZBW16"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MID-SYUKEI-RTN]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW16-FET-RTN
             UNTIL  FLG-FETCH-TKMZBW16 = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MID-SYUKEI-RTN]"              GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------  カーソルクローズ処理
      *    PERFORM  TKMZBW16-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.3.2 中分類集計 処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MID-SYUKEI-EXT.
           EXIT.
      ******************************************************************
      *    勘定残高TBLから勘定残高を取得する
      ******************************************************************
       KNJZN-GET-1-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定残高TBLから勘定残高を取得する  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZKZ00-DEC-1-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZKZ00-OPEN-1-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZKZ00-FET-1-RTN
      *-----------  カーソルクローズ処理
      *    PERFORM  TKMZKZ00-CLOSE-1-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定残高TBLから勘定残高を取得する  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KNJZN-GET-1-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZKZ00-DEC-1-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  カーソル定義処理  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZKZ00-11
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZKZ00-11,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-11
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZKZ00-11,
                 WK-FUND-CD-S           OF  WK-MSG-1-11
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZKZ00-11,
                 WK-PTF-CD-S            OF  WK-MSG-1-11
      *---------- 基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZKZ00-11,
                 WK-KJN-YMD-S           OF  WK-MSG-1-11
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-SQL-KBN = ["                         @3212SEINO@@
      D                          WK-SQL-KBN"]"                          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *---------- 勘定科目コード
           IF  WK-SQL-KBN               =   CNS-SQL-KBN-11
           THEN
             MOVE  CNS-05000000-KKM-CD
               TO  H-KNJ-KAMK-CD        OF  H-TKMZKZ00-11,
                   WK-KNJ-KAMK-CD-S     OF  WK-MSG-1-11
           ELSE
             MOVE  CNS-04000000-KKM-CD
               TO  H-KNJ-KAMK-CD        OF  H-TKMZKZ00-11,
                   WK-KNJ-KAMK-CD-S     OF  WK-MSG-1-11
           END-IF
      *---------- テーブルID
           MOVE  WK-TBL-TKMZKZ00
             TO  SQL-TKMZKZ00           OF  SQL-SELECT-1-11,
                 WK-TKMZKZ00            OF  WK-MSG-1-11
           MOVE  WK-TBL-TKCMKJ00
             TO  SQL-TKCMKJ00           OF  SQL-SELECT-1-11,
                 WK-TKCMKJ00            OF  WK-MSG-1-11
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKZ00-11"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD           OF  H-TKMZKZ00-11"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD            OF  H-TKMZKZ00-11"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KJN-YMD           OF  H-TKMZKZ00-11"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             H-KNJ-KAMK-CD       OF  H-TKMZKZ00-11"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT11                                        @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-11         TO  SQLSTMT11                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT11=["SQLSTMT11"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-11=["WK-MSG-1-11"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-1 = ["                @3212SEINO@@
      D                          FLG-TKMZKZ00-OPEN-1"]"                 @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKZ00-OPEN-1  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S11 FROM :SQLSTMT11                              @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  WK-POS-1
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
               DECLARE  TKMZKZ00_CUR  CURSOR  FOR S11
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-DEC-1-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMZKZ00-OPEN-1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   カーソルオープン処理  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZKZ00_CUR
                 USING :H-TKMZKZ00-11
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZKZ00-OPEN-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FLG-TKMZKZ00-OPEN-1=["FLG-TKMZKZ00-OPEN-1"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  WK-POS-2
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-OPEN-1-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       TKMZKZ00-FET-1-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   カーソルフェッチ処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZKZ00-S-11
           EXEC  SQL
               FETCH
                    TKMZKZ00_CUR
               INTO :H-TKMZKZ00-S-11
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               IF  WK-SQL-KBN               =   CNS-SQL-KBN-11
               THEN
      *----------  ワーク.勘定残高(収益)
                 MOVE  H-KNJZN          OF  H-TKMZKZ00-S-11
                   TO  WK-KNJZN-SYUEKI
      *----------  ワーク.貸借区分(収益)
                 MOVE  H-TAISHK-KBN     OF  H-TKMZKZ00-S-11
                   TO  WK-TAISHK-KBN-SYUEKI
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(収益) = ["
      D             WK-KNJZN-SYUEKI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.貸借区分(収益) = ["
      D             WK-TAISHK-KBN-SYUEKI"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  ワーク.勘定残高(損失)
                 MOVE  H-KNJZN          OF  H-TKMZKZ00-S-11
                   TO  WK-KNJZN-SONSITU
      *----------  ワーク.貸借区分(損失)
                 MOVE  H-TAISHK-KBN     OF  H-TKMZKZ00-S-11
                   TO  WK-TAISHK-KBN-SONSITU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(損失) = ["
      D             WK-KNJZN-SONSITU"]"
      D    DISPLAY  CNS-PGM-ID":ワーク.貸借区分(損失) = ["
      D             WK-TAISHK-KBN-SONSITU"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *----------  勘定科目TBLから貸借区分を取得する
               PERFORM  TS-KBN-GET-RTN
               IF  WK-SQL-KBN           =   CNS-SQL-KBN-11
               THEN
      *----------  ワーク.勘定残高(収益)
                 MOVE  ZERO             TO  WK-KNJZN-SYUEKI
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(収益) = ["
      D             WK-KNJZN-SYUEKI"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  ワーク.勘定残高(損失)
                 MOVE  ZERO             TO  WK-KNJZN-SONSITU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.勘定残高(損失) = ["
      D             WK-KNJZN-SONSITU"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  WK-POS-3
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-11       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-FET-1-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      * TKMZKZ00-CLOSE-1-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***   カーソルクローズ処理  START  ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZKZ00_CUR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZKZ00-OPEN-1
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-1=["
      *D             FLG-TKMZKZ00-OPEN-1"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *       MOVE  WK-POS-4
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-11         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZKZ00-CLOSE-1-EXT.
      *     EXIT.
      ******************************************************************
      *    勘定科目TBLから貸借区分を取得する
      ******************************************************************
       TS-KBN-GET-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定科目TBLから貸借区分を取得する  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKCMKJ00-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKCMKJ00-OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKCMKJ00-FET-RTN
      *-----------  カーソルクローズ処理
      *    PERFORM  TKCMKJ00-CLOSE-RTN                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定科目TBLから貸借区分を取得する  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TS-KBN-GET-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKCMKJ00-DEC-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  カーソル定義処理  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKCMKJ00-13
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-SQL-KBN = ["                         @3212SEINO@@
      D                          WK-SQL-KBN"]"                          @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *---------- 勘定科目コード
           IF  WK-SQL-KBN               =   CNS-SQL-KBN-11
           THEN
             MOVE  CNS-05000000-KKM-CD
               TO  H-KNJ-KAMK-CD        OF  H-TKCMKJ00-13,
                   WK-KNJ-KAMK-CD-S     OF  WK-MSG-1-13
           ELSE
             MOVE  CNS-04000000-KKM-CD
               TO  H-KNJ-KAMK-CD        OF  H-TKCMKJ00-13,
                   WK-KNJ-KAMK-CD-S     OF  WK-MSG-1-13
           END-IF
      *---------- テーブルID
           MOVE  WK-TBL-TKCMKJ00
             TO  SQL-TKCMKJ00           OF  SQL-SELECT-1-13,
                 WK-TKCMKJ00            OF  WK-MSG-1-13
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             H-KNJ-KAMK-CD       OF  H-TKCMKJ00-13"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT13                                        @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-13         TO  SQLSTMT13                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT13=["SQLSTMT13"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-13=["WK-MSG-1-13"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKCMKJ00-OPEN-1 = ["                @3212SEINO@@
      D                          FLG-TKCMKJ00-OPEN-1"]"                 @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKCMKJ00-OPEN-1  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S13 FROM :SQLSTMT13                              @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-036
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-13         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
               DECLARE  TKCMKJ00_CUR  CURSOR  FOR S13
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKCMKJ00-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKCMKJ00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   カーソルオープン処理  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKCMKJ00_CUR
                 USING :H-TKCMKJ00-13
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKCMKJ00-OPEN-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FLG-TKCMKJ00-OPEN-1=["FLG-TKCMKJ00-OPEN-1"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-037
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-13         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKCMKJ00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       TKCMKJ00-FET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   カーソルフェッチ処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKCMKJ00-S-13
           EXEC  SQL
               FETCH
                    TKCMKJ00_CUR
               INTO :H-TKCMKJ00-S-13
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               IF  WK-SQL-KBN           =   CNS-SQL-KBN-11
               THEN
      *----------  ワーク.貸借区分(収益)
                 MOVE  H-TAISHK-KBN     OF  H-TKCMKJ00-S-13
                   TO  WK-TAISHK-KBN-SYUEKI
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.貸借区分(収益) = ["
      D             WK-TAISHK-KBN-SYUEKI"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  ワーク.貸借区分(損失)
                 MOVE  H-TAISHK-KBN     OF  H-TKCMKJ00-S-13
                   TO  WK-TAISHK-KBN-SONSITU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.貸借区分(損失) = ["
      D             WK-TAISHK-KBN-SONSITU"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               IF  WK-SQL-KBN           =   CNS-SQL-KBN-11
               THEN
      *----------  ワーク.貸借区分(収益)
                 MOVE  CNS-TAISHK-KBN-2 TO  WK-TAISHK-KBN-SYUEKI
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.貸借区分(収益) = ["
      D             WK-TAISHK-KBN-SYUEKI"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  ワーク.貸借区分(損失)
                 MOVE  CNS-TAISHK-KBN-1 TO  WK-TAISHK-KBN-SONSITU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.貸借区分(損失) = ["
      D             WK-TAISHK-KBN-SONSITU"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-038
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-13       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKCMKJ00-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      * TKCMKJ00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***   カーソルクローズ処理  START  ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKCMKJ00_CUR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKCMKJ00-OPEN-1
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKCMKJ00-OPEN-1=["
      *D             FLG-TKCMKJ00-OPEN-1"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-POS-039
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-13         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKCMKJ00-CLOSE-EXT.
      *     EXIT.
      ******************************************************************
      *    既存の未処分利益と未処分損失の抽出
      ******************************************************************
       SYUEKI-SONSITU-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":***  既存の未処分利益と未処分損失の抽出  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZKZ00-DEC-2-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZKZ00-OPEN-2-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZKZ00-FET-2-RTN
      *-----------  カーソルクローズ処理
      *    PERFORM  TKMZKZ00-CLOSE-2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  既存の未処分利益と未処分損失の抽出  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SYUEKI-SONSITU-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZKZ00-DEC-2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  カーソル定義処理  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZKZ00-15
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZKZ00-15,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-15
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZKZ00-15,
                 WK-FUND-CD-S           OF  WK-MSG-1-15
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZKZ00-15,
                 WK-PTF-CD-S            OF  WK-MSG-1-15
      *---------- 基準日
           MOVE  WK-KAISI-KJN-YMD
             TO  H-KAISI-KJN-YMD        OF  H-TKMZKZ00-15,
                 WK-KJN-YMD-S           OF  WK-MSG-1-15
      *---------- 勘定科目コード
           IF  WK-SQL-KBN               =   CNS-SQL-KBN-SYUEKI
           THEN
             MOVE  CNS-03002001-KKM-CD
               TO  H-KNJ-KAMK-CD        OF  H-TKMZKZ00-15,
                   WK-KNJ-KAMK-CD-S     OF  WK-MSG-1-15
           ELSE
             MOVE  CNS-03003001-KKM-CD
               TO  H-KNJ-KAMK-CD        OF  H-TKMZKZ00-15,
                   WK-KNJ-KAMK-CD-S     OF  WK-MSG-1-15
           END-IF
      *---------- テーブルID
           MOVE  WK-TBL-TKMZKZ00
             TO  SQL-TKMZKZ00           OF  SQL-SELECT-1-15,
                 WK-TKMZKZ00            OF  WK-MSG-1-15
           MOVE  WK-TBL-TKCMKJ00
             TO  SQL-TKCMKJ00           OF  SQL-SELECT-1-15,
                 WK-TKCMKJ00            OF  WK-MSG-1-15
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKZ00-15"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD           OF  H-TKMZKZ00-15"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD            OF  H-TKMZKZ00-15"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KAISI-KJN-YMD     OF  H-TKMZKZ00-15"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード =["
      D             H-KNJ-KAMK-CD       OF  H-TKMZKZ00-15"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT15                                        @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-15         TO  SQLSTMT15                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT15=["SQLSTMT15"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-15=["WK-MSG-1-15"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-15 = ["               @3212SEINO@@
      D                          FLG-TKMZKZ00-OPEN-15"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKZ00-OPEN-15  = CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S15 FROM :SQLSTMT15                              @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  WK-POS-1
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-15         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
               DECLARE  TKMZKZ00_CUR15  CURSOR  FOR S15
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-DEC-2-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMZKZ00-OPEN-2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   カーソルオープン処理  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZKZ00_CUR15
                 USING :H-TKMZKZ00-15
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZKZ00-OPEN-15
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FLG-TKMZKZ00-OPEN-15=["FLG-TKMZKZ00-OPEN-15"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  WK-POS-2
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-15         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-OPEN-2-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       TKMZKZ00-FET-2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   カーソルフェッチ処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZKZ00-S-15
           EXEC  SQL
               FETCH
                    TKMZKZ00_CUR15
               INTO :H-TKMZKZ00-S-15
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               IF  WK-SQL-KBN                  =   CNS-SQL-KBN-SYUEKI
               THEN
      *----------  ワーク.未処分利益.勘定残高
                 MOVE  H-KNJZN                 OF  H-TKMZKZ00-S-15
                   TO  WK-KNJZN                OF  WK-SYUEKI-G
      *----------  ワーク.未処分利益.勘定異動額(期間・借方)
                 MOVE  H-KNJ-IDOK-KKN-DEBIT    OF  H-TKMZKZ00-S-15
                   TO  WK-KNJ-IDOK-KKN-DEBIT   OF  WK-SYUEKI-G
      *----------  ワーク.未処分利益.勘定異動額(期間・貸方)
                 MOVE  H-KNJ-IDOK-KKN-CREDIT   OF  H-TKMZKZ00-S-15
                   TO  WK-KNJ-IDOK-KKN-CREDIT  OF  WK-SYUEKI-G
      *----------  ワーク.未処分利益フラグ
                 MOVE  CNS-X-1                 TO  WK-SYUEKI-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":未処分利益.勘定残高               = ["
      D             WK-KNJZN                   OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":未処分利益.勘定異動額(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT      OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":未処分利益.勘定異動額(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT     OF  WK-SYUEKI-G"]"
      D    DISPLAY  CNS-PGM-ID":未処分利益フラグ                  = ["
      D             WK-SYUEKI-FLG"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  ワーク.未処分損失.勘定残高
                 MOVE  H-KNJZN                 OF  H-TKMZKZ00-S-15
                   TO  WK-KNJZN                OF  WK-SONSITU-G
      *----------  ワーク.未処分損失.勘定異動額(期間・借方)
                 MOVE  H-KNJ-IDOK-KKN-DEBIT    OF  H-TKMZKZ00-S-15
                   TO  WK-KNJ-IDOK-KKN-DEBIT   OF  WK-SONSITU-G
      *----------  ワーク.未処分損失.勘定異動額(期間・貸方)
                 MOVE  H-KNJ-IDOK-KKN-CREDIT   OF  H-TKMZKZ00-S-15
                   TO  WK-KNJ-IDOK-KKN-CREDIT  OF  WK-SONSITU-G
      *----------  ワーク.未処分損失フラグ
                 MOVE  CNS-X-1                 TO  WK-SONSITU-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":未処分損失.勘定残高               = ["
      D             WK-KNJZN                   OF  WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":未処分損失.勘定異動額(期間・借方) = ["
      D             WK-KNJ-IDOK-KKN-DEBIT      OF  WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":未処分損失.勘定異動額(期間・貸方) = ["
      D             WK-KNJ-IDOK-KKN-CREDIT     OF  WK-SONSITU-G"]"
      D    DISPLAY  CNS-PGM-ID":未処分損失フラグ                  = ["
      D             WK-SONSITU-FLG"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  WK-POS-3
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-15       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-FET-2-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      * TKMZKZ00-CLOSE-2-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***   カーソルクローズ処理  START  ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZKZ00_CUR15
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZKZ00-OPEN-15
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-15=["
      *D             FLG-TKMZKZ00-OPEN-15"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *       MOVE  WK-POS-4
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-15         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZKZ00-CLOSE-2-EXT.
      *     EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZBW16-DEC-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  TKMZBW16カーソル定義処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW16-S
      *---------- 処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW16-S,
                 WK-SYORI-YMD-S         OF  WK-MSG-1-7
      *---------- 起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW16-S,
                 WK-KIDOU-ID-S          OF  WK-MSG-1-7
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW16-S,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-7
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW16-S,
                 WK-FUND-CD-S           OF  WK-MSG-1-7
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW16-S,
                 WK-PTF-CD-S            OF  WK-MSG-1-7
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZBW16-S,
                 WK-KJN-YMD-S           OF  WK-MSG-1-7
      *---------- テーブルID
           MOVE  WK-TBL-TKMZBW16
             TO  SQL-TKMZBW16           OF  SQL-SELECT-1-7,
                 WK-TKMZBW16            OF  WK-MSG-1-7
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             H-SYORI-YMD         OF  H-TKMZBW16-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             H-KIDOU-ID          OF  H-TKMZBW16-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW16-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD           OF  H-TKMZBW16-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD            OF  H-TKMZBW16-S"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KJN-YMD           OF  H-TKMZBW16-S"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT7                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-7         TO  SQLSTMT7                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT7=["SQLSTMT7"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-7=["WK-MSG-1-7"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN = ["                  @3212SEINO@@
      D                          FLG-TKMZBW16-OPEN"]"                   @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW16-OPEN  = CNS-OFF                             @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S7 FROM :SQLSTMT7                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-040
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-7         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
               DECLARE  TKMZBW16_CURSOR  CURSOR  FOR S7
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW16-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMZBW16-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  TKMZBW16カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZBW16_CURSOR
                 USING :H-TKMZBW16-S
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW16-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN=["FLG-TKMZBW16-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-041
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-7         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW16-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       TKMZBW16-FET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  TKMZBW16カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZBW16
           EXEC  SQL
               FETCH
                    TKMZBW16_CURSOR
               INTO :H-TKMZBW16
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":決算日断面区分 =["
      D             H-KSN-YMD-DMN-KBN        OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目_中分類 =["
      D             H-KNJ-KAMK-CD            OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":貸借区分 =["
      D             H-TAISHK-KBN             OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":勘定残高_目標 =["
      D             H-KNJZN                  OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・借方）_目標=["
      D             H-KNJ-IDOK-KKN-DEBIT     OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・貸方）_目標 =["
      D             H-KNJ-IDOK-KKN-CREDIT    OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（当日・借方）_目標 =["
      D             H-KNJ-IDOK-TJT-DEBIT     OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（当日・貸方）_目標 =["
      D             H-KNJ-IDOK-TJT-CREDIT    OF  H-TKMZBW16"]"
      *-----------------------------------------------------------------
      *-----------  勘定残高計算データINSERT処理 (「別紙1-8 SQL説明」を参照)
               PERFORM  TKMZBW16-INSERT-RTN
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-FETCH-TKMZBW16
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-TKMZBW16=["
      D             FLG-FETCH-TKMZBW16"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-042
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-7       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW16-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      * TKMZBW16-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D                 ":***  TKMZBW16カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZBW16_CURSOR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZBW16-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN=["
      *D             FLG-TKMZBW16-OPEN"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-POS-043
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-7         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D                   ":***  TKMZBW16カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZBW16-CLOSE-EXT.
      *     EXIT.
      ******************************************************************
      *    勘定残高計算データにINSERTする
      ******************************************************************
       TKMZBW16-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":*** 勘定残高計算データINSERT処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZBW16-INSERT
                                        WK-MSG-1-8-INSERT
      *---------- 処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW16-INSERT,
                 WK-SYORI-YMD-I         OF  WK-MSG-1-8-INSERT
      *---------- 起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW16-INSERT,
                 WK-KIDOU-ID-I          OF  WK-MSG-1-8-INSERT
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW16-INSERT,
                 WK-RIYO-CMP-CD-I       OF  WK-MSG-1-8-INSERT
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW16-INSERT,
                 WK-FUND-CD-I           OF  WK-MSG-1-8-INSERT
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW16-INSERT,
                 WK-PTF-CD-I            OF  WK-MSG-1-8-INSERT
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZBW16-INSERT,
                 WK-KJN-YMD-I           OF  WK-MSG-1-8-INSERT
      *---------- 決算日断面区分
           MOVE  H-KSN-YMD-DMN-KBN      OF  H-TKMZBW16
             TO  H-KSN-YMD-DMN-KBN      OF  H-TKMZBW16-INSERT,
                 WK-KSN-YMD-DMN-KBN-I   OF  WK-MSG-1-8-INSERT
      *---------- 勘定科目コード
           MOVE  H-KNJ-KAMK-CD          OF  H-TKMZBW16
             TO  H-KNJ-KAMK-CD          OF  H-TKMZBW16-INSERT,
                 WK-KNJ-KAMK-CD-I       OF  WK-MSG-1-8-INSERT
      *---------- 貸借区分
           MOVE  H-TAISHK-KBN           OF  H-TKMZBW16
             TO  H-TAISHK-KBN           OF  H-TKMZBW16-INSERT,
                 WK-TAISHK-KBN-I        OF  WK-MSG-1-8-INSERT
      *---------- 勘定残高
           MOVE  H-KNJZN                OF  H-TKMZBW16
             TO  H-KNJZN                OF  H-TKMZBW16-INSERT,
                 WK-KNJZN-I             OF  WK-MSG-1-8-INSERT
      *---------- 勘定異動額（期間・借方）
           MOVE  H-KNJ-IDOK-KKN-DEBIT   OF  H-TKMZBW16
             TO  H-KNJ-IDOK-KKN-DEBIT   OF  H-TKMZBW16-INSERT,
                 WK-KNJ-IDOK-KKN-DEBIT-I
                                        OF  WK-MSG-1-8-INSERT
      *---------- 勘定異動額（期間・貸方）
           MOVE  H-KNJ-IDOK-KKN-CREDIT  OF  H-TKMZBW16
             TO  H-KNJ-IDOK-KKN-CREDIT  OF  H-TKMZBW16-INSERT,
                 WK-KNJ-IDOK-KKN-CREDIT-I
                                        OF  WK-MSG-1-8-INSERT
      *---------- 勘定異動額（当日・借方）
           MOVE  H-KNJ-IDOK-TJT-DEBIT   OF  H-TKMZBW16
             TO  H-KNJ-IDOK-TJT-DEBIT   OF  H-TKMZBW16-INSERT,
                 WK-KNJ-IDOK-TJT-DEBIT-I
                                        OF  WK-MSG-1-8-INSERT
      *---------- 勘定異動額（当日・貸方）
           MOVE  H-KNJ-IDOK-TJT-CREDIT  OF  H-TKMZBW16
             TO  H-KNJ-IDOK-TJT-CREDIT  OF  H-TKMZBW16-INSERT,
                 WK-KNJ-IDOK-TJT-CREDIT-I
                                        OF  WK-MSG-1-8-INSERT
      *---------- 削除区分
           MOVE  SPACE
             TO  H-SAKUJO-KBN           OF  H-TKMZBW16-INSERT,
                 WK-SAKUJO-KBN-I        OF  WK-MSG-1-8-INSERT
      *---------- 作成ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW16-INSERT,
                 WK-SK-LOGIN-CMP-CD-I   OF  WK-MSG-1-8-INSERT
      *---------- 更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW16-INSERT,
                 WK-UPD-LOGIN-CMP-CD-I  OF  WK-MSG-1-8-INSERT
      *---------- テーブルID
           MOVE  WK-TBL-TKMZBW16
             TO  SQL-TKMZBW16           OF  SQL-INSERT-1-8
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日  =["
      D               H-SYORI-YMD         OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":起動ID  =["
      D               H-KIDOU-ID          OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード  =["
      D               H-RIYO-CMP-CD       OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード  =["
      D               H-FUND-CD           OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D               H-PTF-CD            OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":基準日  =["
      D               H-KJN-YMD           OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分  =["
      D               H-KSN-YMD-DMN-KBN   OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード  =["
      D               H-KNJ-KAMK-CD       OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":貸借区分  =["
      D               H-TAISHK-KBN        OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":勘定残高  =["
      D               H-KNJZN             OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・借方）  =["
      D               H-KNJ-IDOK-KKN-DEBIT  OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・貸方）  =["
      D               H-KNJ-IDOK-KKN-CREDIT OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（当日・借方）  =["
      D               H-KNJ-IDOK-TJT-DEBIT OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（当日・貸方）  =["
      D               H-KNJ-IDOK-TJT-CREDIT OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":削除区分  =["
      D               H-SAKUJO-KBN  OF  H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード  =["
      D               H-RIYO-CMP-CD       OF H-TKMZBW16-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード  =["
      D               H-RIYO-CMP-CD       OF H-TKMZBW16-INSERT"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT8                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-INSERT-1-8     TO  SQLSTMT8                        @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT8=["SQLSTMT8"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-8-INSERT=["WK-MSG-1-8-INSERT"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-INS-8 = ["                 @3212SEINO@@
      D                          FLG-TKMZBW16-INS-8"]"                  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW16-INS-8 = CNS-OFF                             @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S8 FROM :SQLSTMT8                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ"
      D             "PREPARE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ PREPARE  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ PREPARE  異常"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-044
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-8-INSERT   DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S8
                 USING :H-TKMZBW16-INSERT
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ"
      D             " INSERT SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ INSERT  正常"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON               TO  FLG-TKMZBW16-INS-8        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-INS-8=["                   @3212SEINO@@
      D             FLG-TKMZBW16-INS-8"]"                               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":勘定残高計算データ INSERT 一意制約違反"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-045
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-300
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-8-INSERT DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ INSERT  異常"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-046
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-8-INSERT   DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":*** 勘定残高計算データにINSERTする END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW16-INSERT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.3 大分類集計
      ******************************************************************
       BIG-SYUKEI-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.3.3 大分類集計 処理  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZBW16-DEC-1-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZBW16-OPEN-1-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF                TO  FLG-FETCH-TKMZBW16-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-TKMZBW16-1=["
      D             FLG-FETCH-TKMZBW16-1"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BIG-SYUKEI-RTN]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW16-FET-1-RTN
             UNTIL  FLG-FETCH-TKMZBW16-1 = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BIG-SYUKEI-RTN]"              GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------  カーソルクローズ処理
      *    PERFORM  TKMZBW16-CLOSE-1-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.3.3 大分類集計 処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BIG-SYUKEI-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZBW16-DEC-1-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  TKMZBW16カーソル定義処理(2) START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW16-S-1
      *---------- 処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW16-S-1,
                 WK-SYORI-YMD-S         OF  WK-MSG-1-9
      *---------- 起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW16-S-1,
                 WK-KIDOU-ID-S          OF  WK-MSG-1-9
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW16-S-1,
                 WK-RIYO-CMP-CD-S       OF  WK-MSG-1-9
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW16-S-1,
                 WK-FUND-CD-S           OF  WK-MSG-1-9
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW16-S-1,
                 WK-PTF-CD-S            OF  WK-MSG-1-9
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZBW16-S-1,
                 WK-KJN-YMD-S           OF  WK-MSG-1-9
      *---------- テーブルID
           MOVE  WK-TBL-TKMZBW16
             TO  SQL-TKMZBW16           OF  SQL-SELECT-1-9,
                 WK-TKMZBW16            OF  WK-MSG-1-9
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             H-SYORI-YMD         OF  H-TKMZBW16-S-1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             H-KIDOU-ID          OF  H-TKMZBW16-S-1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW16-S-1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             H-FUND-CD           OF  H-TKMZBW16-S-1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             H-PTF-CD            OF  H-TKMZBW16-S-1"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D             H-KJN-YMD           OF  H-TKMZBW16-S-1"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT9                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-9         TO  SQLSTMT9                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT9=["SQLSTMT9"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-9=["WK-MSG-1-9"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN-1 = ["                @3212SEINO@@
      D                          FLG-TKMZBW16-OPEN-1"]"                 @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW16-OPEN-1  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S9 FROM :SQLSTMT9                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-047
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
               DECLARE  TKMZBW16_CURSOR_1  CURSOR  FOR S9
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW16-DEC-1-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMZBW16-OPEN-1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  TKMZBW16カーソルオープン処理(2) START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZBW16_CURSOR_1
                 USING :H-TKMZBW16-S-1
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW16-OPEN-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FLG-TKMZBW16-OPEN-1=["FLG-TKMZBW16-OPEN-1"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-048
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW16-OPEN-1-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       TKMZBW16-FET-1-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  TKMZBW16カーソルフェッチ処理(2) START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZBW16-1
           EXEC  SQL
               FETCH
                    TKMZBW16_CURSOR_1
               INTO :H-TKMZBW16-1
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":決算日断面区分 =["
      D             H-KSN-YMD-DMN-KBN        OF  H-TKMZBW16-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目_中分類 =["
      D             H-KNJ-KAMK-CD            OF  H-TKMZBW16-1"]"
      D    DISPLAY  CNS-PGM-ID":貸借区分 =["
      D             H-TAISHK-KBN             OF  H-TKMZBW16-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定残高_目標 =["
      D             H-KNJZN                  OF  H-TKMZBW16-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・借方）_目標=["
      D             H-KNJ-IDOK-KKN-DEBIT     OF  H-TKMZBW16-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・貸方）_目標 =["
      D             H-KNJ-IDOK-KKN-CREDIT    OF  H-TKMZBW16-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（当日・借方）_目標 =["
      D             H-KNJ-IDOK-TJT-DEBIT     OF  H-TKMZBW16-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（当日・貸方）_目標 =["
      D             H-KNJ-IDOK-TJT-CREDIT    OF  H-TKMZBW16-1"]"
      *-----------------------------------------------------------------
      *-----------  勘定残高計算データINSERT処理 (「別紙1-10 SQL説明」を参照)
               PERFORM  TKMZBW16-INSERT-1-RTN
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-FETCH-TKMZBW16-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-TKMZBW16-1=["
      D             FLG-FETCH-TKMZBW16-1"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-049
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW16-FET-1-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      * TKMZBW16-CLOSE-1-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D              ":***  TKMZBW16カーソルクローズ処理(2) START  ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZBW16_CURSOR_1
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZBW16-OPEN-1
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN-1=["
      *D             FLG-TKMZBW16-OPEN-1"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-POS-050
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-9         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D                   ":***  TKMZBW16カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZBW16-CLOSE-1-EXT.
      *     EXIT.
      ******************************************************************
      *    勘定残高計算データにINSERTする
      ******************************************************************
       TKMZBW16-INSERT-1-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D     ":*** 勘定残高計算データINSERT処理 (2)START ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZBW16-INSERT-1
                                        WK-MSG-1-10-INSERT
      *---------- 処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW16-INSERT-1,
                 WK-SYORI-YMD-I         OF  WK-MSG-1-10-INSERT
      *---------- 起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW16-INSERT-1,
                 WK-KIDOU-ID-I          OF  WK-MSG-1-10-INSERT
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW16-INSERT-1,
                 WK-RIYO-CMP-CD-I       OF  WK-MSG-1-10-INSERT
      *---------- ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW16-INSERT-1,
                 WK-FUND-CD-I           OF  WK-MSG-1-10-INSERT
      *---------- ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW16-INSERT-1,
                 WK-PTF-CD-I            OF  WK-MSG-1-10-INSERT
      *---------- 基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZBW16-INSERT-1,
                 WK-KJN-YMD-I           OF  WK-MSG-1-10-INSERT
      *---------- 決算日断面区分
           MOVE  H-KSN-YMD-DMN-KBN      OF  H-TKMZBW16-1
             TO  H-KSN-YMD-DMN-KBN      OF  H-TKMZBW16-INSERT-1,
                 WK-KSN-YMD-DMN-KBN-I   OF  WK-MSG-1-10-INSERT
      *---------- 勘定科目コード
           MOVE  H-KNJ-KAMK-CD          OF  H-TKMZBW16-1
             TO  H-KNJ-KAMK-CD          OF  H-TKMZBW16-INSERT-1,
                 WK-KNJ-KAMK-CD-I       OF  WK-MSG-1-10-INSERT
      *---------- 貸借区分
           MOVE  H-TAISHK-KBN           OF  H-TKMZBW16-1
             TO  H-TAISHK-KBN           OF  H-TKMZBW16-INSERT-1,
                 WK-TAISHK-KBN-I        OF  WK-MSG-1-10-INSERT
      *---------- 勘定残高
           MOVE  H-KNJZN                OF  H-TKMZBW16-1
             TO  H-KNJZN                OF  H-TKMZBW16-INSERT-1,
                 WK-KNJZN-I             OF  WK-MSG-1-10-INSERT
      *---------- 勘定異動額（期間・借方）
           MOVE  H-KNJ-IDOK-KKN-DEBIT   OF  H-TKMZBW16-1
             TO  H-KNJ-IDOK-KKN-DEBIT   OF  H-TKMZBW16-INSERT-1,
                 WK-KNJ-IDOK-KKN-DEBIT-I
                                        OF  WK-MSG-1-10-INSERT
      *---------- 勘定異動額（期間・貸方）
           MOVE  H-KNJ-IDOK-KKN-CREDIT  OF  H-TKMZBW16-1
             TO  H-KNJ-IDOK-KKN-CREDIT  OF  H-TKMZBW16-INSERT-1,
                 WK-KNJ-IDOK-KKN-CREDIT-I
                                        OF  WK-MSG-1-10-INSERT
      *---------- 勘定異動額（当日・借方）
           MOVE  H-KNJ-IDOK-TJT-DEBIT   OF  H-TKMZBW16-1
             TO  H-KNJ-IDOK-TJT-DEBIT   OF  H-TKMZBW16-INSERT-1,
                 WK-KNJ-IDOK-TJT-DEBIT-I
                                        OF  WK-MSG-1-10-INSERT
      *---------- 勘定異動額（当日・貸方）
           MOVE  H-KNJ-IDOK-TJT-CREDIT  OF  H-TKMZBW16-1
             TO  H-KNJ-IDOK-TJT-CREDIT  OF  H-TKMZBW16-INSERT-1,
                 WK-KNJ-IDOK-TJT-CREDIT-I
                                        OF  WK-MSG-1-10-INSERT
      *---------- 削除区分
           MOVE  SPACE
             TO  H-SAKUJO-KBN           OF  H-TKMZBW16-INSERT-1,
                 WK-SAKUJO-KBN-I        OF  WK-MSG-1-10-INSERT
      *---------- 作成ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW16-INSERT-1,
                 WK-SK-LOGIN-CMP-CD-I   OF  WK-MSG-1-10-INSERT
      *---------- 更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW16-INSERT-1,
                 WK-UPD-LOGIN-CMP-CD-I  OF  WK-MSG-1-10-INSERT
      *---------- テーブルID
           MOVE  WK-TBL-TKMZBW16
             TO  SQL-TKMZBW16           OF  SQL-INSERT-1-10
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日  =["
      D               H-SYORI-YMD         OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID  =["
      D               H-KIDOU-ID          OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード  =["
      D               H-RIYO-CMP-CD       OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード  =["
      D               H-FUND-CD           OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D               H-PTF-CD            OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":基準日  =["
      D               H-KJN-YMD           OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分  =["
      D               H-KSN-YMD-DMN-KBN   OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定科目コード  =["
      D               H-KNJ-KAMK-CD       OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":貸借区分  =["
      D               H-TAISHK-KBN        OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定残高  =["
      D               H-KNJZN             OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・借方）  =["
      D               H-KNJ-IDOK-KKN-DEBIT  OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（期間・貸方）  =["
      D               H-KNJ-IDOK-KKN-CREDIT OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（当日・借方）  =["
      D               H-KNJ-IDOK-TJT-DEBIT OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動額（当日・貸方）  =["
      D               H-KNJ-IDOK-TJT-CREDIT OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":削除区分  =["
      D               H-SAKUJO-KBN  OF  H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード  =["
      D               H-RIYO-CMP-CD       OF H-TKMZBW16-INSERT-1"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード  =["
      D               H-RIYO-CMP-CD       OF H-TKMZBW16-INSERT-1"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT10                                        @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-INSERT-1-10     TO  SQLSTMT10                      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT10=["SQLSTMT10"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-10-INSERT=["
      D                        WK-MSG-1-10-INSERT"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-INS-10 = ["                @3212SEINO@@
      D                          FLG-TKMZBW16-INS-10"]"                 @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW16-INS-10 = CNS-OFF                            @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S10 FROM :SQLSTMT10                              @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ"
      D             "PREPARE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ PREPARE  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ PREPARE  異常"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-051
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-10-INSERT   DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S10
                 USING :H-TKMZBW16-INSERT-1
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ"
      D             " INSERT SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ INSERT  正常"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON               TO  FLG-TKMZBW16-INS-10       @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-INS-10=["                  @3212SEINO@@
      D             FLG-TKMZBW16-INS-10"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":勘定残高計算データ INSERT 一意制約違反"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-052
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-300
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-10-INSERT DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定残高計算データ INSERT  異常"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-053
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-10-INSERT  DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":*** 勘定残高計算データにINSERTする END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW16-INSERT-1-EXT.
           EXIT.
      ******************************************************************
      *    3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***   後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD  OF  PARM-SCZY1170-ARG1 = ["
      D                         RTN-CD  OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ2610-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG   = ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2610-ARG3 = ["
      D             PARM-SMZJ2610-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":COUNT = ["
      D                       COUNTER          OF PARM-SMZJ2610-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 = ["
      D       ERR-PGM-ID
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":ポジション = ["
      D       ERR-POS
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード = ["
      D       RTN-CD
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード = ["
      D       DETAIL-RTN-CD
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ = ["
      D       DETAIL-RTN-CD-FLG
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ = ["
      D       FREE-MSG
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *    3.4.1 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-DEL-1 =["                  @3212SEINO@@
      D             FLG-TKMZKZ00-DEL-1"]"                               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-15 = ["
      D             FLG-TKMZKZ00-OPEN-15"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-16 = ["
      D             FLG-TKMZKZ00-OPEN-16"]"
      D    DISPLAY  CNS-PGM-ID":FLG-SEC-SBT-CD-CR-OPEN=["
      D             FLG-SEC-SBT-CD-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-CR-OPEN=["
      D             FLG-TKMZKZ00-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN=["
      D             FLG-TKMZBW16-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN-1=["
      D             FLG-TKMZBW16-OPEN-1"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-1=["
      D             FLG-TKMZKZ00-OPEN-1"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKCMKJ00-OPEN-1=["
      D             FLG-TKCMKJ00-OPEN-1"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-INS-8 =["                  @3212SEINO@@
      D             FLG-TKMZBW16-INS-8"]"                               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-INS-10 =["                 @3212SEINO@@
      D             FLG-TKMZBW16-INS-10"]"                              @3212SEINO@@
      *-----------------------------------------------------------------
           MOVE  CNS-OFF               TO  FLG-TKMZBW16-INS-10          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-INS-10 =["                 @3212SEINO@@
      D             FLG-TKMZBW16-INS-10"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  カーソルオープンフラグ (別紙1-15)
           IF  FLG-TKMZKZ00-OPEN-15  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZKZ00_CUR15"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZKZ00_CUR15
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZKZ00-OPEN-15
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-15 =["
      D             FLG-TKMZKZ00-OPEN-15"]"
      *-----------------------------------------------------------------
      *----------  カーソルオープンフラグ (別紙1-16)
           IF  FLG-TKMZKZ00-OPEN-16  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZKZ00_CUR16"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZKZ00_CUR16
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZKZ00-OPEN-16
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-16 =["
      D             FLG-TKMZKZ00-OPEN-16"]"
      *-----------------------------------------------------------------
      *----------  残高履歴計算データ_カーソルオープンフラグ (別紙1-4)
           IF  FLG-TKMZKZ00-CR-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW11_CURSOR"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZKZ00_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZKZ00-CR-OPEN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-CR-OPEN =["
      D             FLG-TKMZKZ00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *----------  勘定科目_2カーソルオープンフラグ (別紙1-3)
           IF  FLG-SEC-SBT-CD-CR-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZKI00_CURSOR"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZKI00_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-SEC-SBT-CD-CR-OPEN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-SEC-SBT-CD-CR-OPEN =["
      D             FLG-SEC-SBT-CD-CR-OPEN"]"
      *-----------------------------------------------------------------
               MOVE  CNS-OFF            TO  FLG-TKMZBW16-INS-8          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-INS-8 =["                  @3212SEINO@@
      D             FLG-TKMZBW16-INS-8"]"                               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  勘定残高計算データ_カーソルオープンフラグ (別紙1-7)
           IF  FLG-TKMZBW16-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW16_CURSOR"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZBW16_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZBW16-OPEN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN =["
      D             FLG-TKMZBW16-OPEN"]"
      *-----------------------------------------------------------------
      *----------  勘定残高計算データ_カーソルオープンフラグ (別紙1-9)
           IF  FLG-TKMZBW16-OPEN-1  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW16_CURSOR_1"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZBW16_CURSOR_1
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZBW16-OPEN-1
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-OPEN-1 =["
      D             FLG-TKMZBW16-OPEN-1"]"
      *-----------------------------------------------------------------
      *----------  カーソルオープンフラグ (別紙1-13,別紙1-14)
           IF  FLG-TKCMKJ00-OPEN-1  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW16_CURSOR"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKCMKJ00_CUR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKCMKJ00-OPEN-1
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKCMKJ00-OPEN-1 =["
      D             FLG-TKCMKJ00-OPEN-1"]"
      *-----------------------------------------------------------------
      *----------  カーソルオープンフラグ (別紙1-11,別紙1-12)
           IF  FLG-TKMZKZ00-OPEN-1  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW16_CURSOR"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZKZ00_CUR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZKZ00-OPEN-1
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-OPEN-1 =["
      D             FLG-TKMZKZ00-OPEN-1"]"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                TO  FLG-TKMZKZ00-DEL-1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKZ00-DEL-1 =["                  @3212SEINO@@
      D             FLG-TKMZKZ00-DEL-1"]"                               @3212SEINO@@
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ2610-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG   = ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2610-ARG3 = ["
      D             PARM-SMZJ2610-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":COUNT = ["
      D                       COUNTER          OF PARM-SMZJ2610-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 = ["
      D       ERR-PGM-ID
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":ポジション = ["
      D       ERR-POS
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード = ["
      D       RTN-CD
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード = ["
      D       DETAIL-RTN-CD
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ = ["
      D       DETAIL-RTN-CD-FLG
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ = ["
      D       FREE-MSG
      D          OF PARM-SMZJ2610-ARG3(COUNTER OF PARM-SMZJ2610-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D           ":リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ2610処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
