      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ2310
      * プログラム名称 : DB更新
      * 処理概要       : 各ワークTBLより、関連TBLへ最新化する。
      * 参照ＤＢ       : 未収収益計算データ（TKMZBW08）
      *                : 未収収益（TKMZMS00）
      *                : 債券過去経過利息計算データ（TKMZBW09）
      *                : 債券過去経過利息（TKMZKR00）
      *                : 前払金計算データ（TKMZBW10）
      *                : 残高異動計算データ（TKMZBW06）
      *                : 残高履歴計算データ（TKMZBW11）
      *                : 元本残高計算データ（TKMZBW13）
      *                : 資金簿価異動計算データ（TKMZBW07）
      *                : 資金残履歴計算データ（TKMZBW12）
      *                : 勘定異動計算データ（TKMZBW15）
      *                : 勘定残高計算データ（TKMZBW16）
      * 更新ＤＢ       : 未収収益（TKMZMS00）
      *                : 債券過去経過利息（TKMZKR00）
      *                : 前払金管理(TKMZMB00)
      *                : 残高異動(TKMZZI00)
      *                : 残高履歴(TKMZZR00)
      *                : 元本残高(TKMZGZ00)
      *                : 資金簿価異動(TKMZSI00)
      *                : 資金残履歴(TKMZSR00)
      *                : 勘定異動(TKMZKI00)
      *                : 勘定残高(TKMZKZ00)
      *                : 基準日計算情報（TKMZKK00）
      * 引数           : OUT     RTNパッケージ
      * VERSION  1.00
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- ----  ---------  ------  ------------------------
      * 20080212   新規  SCS        張克    新規作成
      * 20080819   修正  SCS        趙迎慶  残タスク71:TBL共通項目への更新対応
      * 20080825   修正  SCS        趙迎慶  更新日時、作成日時 編集追加
      * 20081208   修正  SCS        張凌翔  連結障害対応0000771
      * 20081223   修正  SCS        徐曉俊  連結障害対応0000918
      * 20090805   修正  SCS        何傑文  総合障害1552対応
      * 20090810   修正  SCS        何傑文  総合障害1084対応
      * 20090810   修正  SCS        何傑文  総合障害1679対応
      * 20100112   修正  SCS        王飛    テ2085
      * 20110419   修正  SCS        孫炯    テーマ3212-1性能改善対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ2310.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-02-12.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ2310".
         05  CNS-TBL-TKMZMS00      PIC  X(08)  VALUE  "TKMZMS00".
         05  CNS-TBL-TKMZKR00      PIC  X(08)  VALUE  "TKMZKR00".
         05  CNS-TBL-TKMZMB00      PIC  X(08)  VALUE  "TKMZMB00".
         05  CNS-TBL-TKMZZI00      PIC  X(08)  VALUE  "TKMZZI00".
         05  CNS-TBL-TKMZZR00      PIC  X(08)  VALUE  "TKMZZR00".
         05  CNS-TBL-TKMZGZ00      PIC  X(08)  VALUE  "TKMZGZ00".
         05  CNS-TBL-TKMZSI00      PIC  X(08)  VALUE  "TKMZSI00".
         05  CNS-TBL-TKMZSR00      PIC  X(08)  VALUE  "TKMZSR00".
         05  CNS-TBL-TKMZKI00      PIC  X(08)  VALUE  "TKMZKI00".
         05  CNS-TBL-TKMZKZ00      PIC  X(08)  VALUE  "TKMZKZ00".
         05  CNS-TBL-TKMZKK00      PIC  X(08)  VALUE  "TKMZKK00".
      *----------  計算データ系列
         05  CNS-TBL-TKMZBW08      PIC  X(08)  VALUE  "TKMZBW08".
         05  CNS-TBL-TKMZBW09      PIC  X(08)  VALUE  "TKMZBW09".
         05  CNS-TBL-TKMZBW10      PIC  X(08)  VALUE  "TKMZBW10".
         05  CNS-TBL-TKMZBW06      PIC  X(08)  VALUE  "TKMZBW06".
         05  CNS-TBL-TKMZBW11      PIC  X(08)  VALUE  "TKMZBW11".
         05  CNS-TBL-TKMZBW13      PIC  X(08)  VALUE  "TKMZBW13".
         05  CNS-TBL-TKMZBW07      PIC  X(08)  VALUE  "TKMZBW07".
         05  CNS-TBL-TKMZBW12      PIC  X(08)  VALUE  "TKMZBW12".
         05  CNS-TBL-TKMZBW15      PIC  X(08)  VALUE  "TKMZBW15".
         05  CNS-TBL-TKMZBW16      PIC  X(08)  VALUE  "TKMZBW16".
         05  CNS-1                 PIC  9(01)  VALUE  1.
         05  CNS-3                 PIC  9(01)  VALUE  3.
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
             " SQL-MSG(SELECT):".
         05  CNS-SQL-MSG-INSERT    PIC  X(17)  VALUE
             " SQL-MSG(INSERT):".
         05  CNS-SQL-MSG-UPDATE    PIC  X(17)  VALUE
             " SQL-MSG(UPDATE):".
      *----------  処理区分'1':基準日断面以外削除
         05  CNS-KBN-1             PIC  X(01)  VALUE  "1".
      *----------  処理フラグ:1
         05  CNS-SYRI-FLG-1        PIC  X(01)  VALUE  "1".
      *----------  複数回起動チェック用スイッチ
       01  FIRST-SW                PIC  X(03)  VALUE  'YES'.            @3212SEINO@@
      ******************************************************************
      *    フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  未収収益計算循環フラグ
         05  FLG-TKMZBW08-FE-OPEN  PIC  9(01).
      *----------  債券過去経過利息計算データ循環フラグ
         05  FLG-TKMZBW09-FE-OPEN  PIC  9(01).
      ******************************************************************
      *    フラグエリア
      ******************************************************************
       01  FLG-AREA2.
      *----------  未収収益計算データカーソルオープンフラグ
         05  FLG-TKMZBW08-CR-OPEN  PIC  9(01).
      *----------  未収収益カーソルオープンフラグ
         05  FLG-TKMZMS00-CR-OPEN  PIC  9(01).
      *----------  債券過去経過利息計算データカーソルオープンフラグ
         05  FLG-TKMZBW09-CR-OPEN  PIC  9(01).
      *----------  債券過去経過利息カーソルオープンフラグ
         05  FLG-TKMZKR00-CR-OPEN  PIC  9(01).
      *----------  該当レコードを未収収益TBLへ更新フラグ                @SEINO@
         05  FLG-TKMZMS00-UP-OPEN  PIC  9(01).                          @SEINO@
      *----------  該当レコードを未収収益TBLへ追加フラグ                @SEINO@
         05  FLG-TKMZMS00-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  該当DBにデータを更新フラグ                           @SEINO@
         05  FLG-TKMZKR00-UP-OPEN  PIC  9(01).                          @SEINO@
      *----------  該当DBにデータを追加フラグ                           @SEINO@
         05  FLG-TKMZKR00-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  前払金管理TBLへ追加フラグ                            @SEINO@
         05  FLG-TKMZBW10-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  残高異動TBLへ更新フラグ                              @SEINO@
         05  FLG-TKMZZI00-UP-OPEN  PIC  9(01).                          @SEINO@
      *----------  残高異動TBLへ追加フラグ                              @SEINO@
         05  FLG-TKMZBW06-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  残高履歴データ追加フラグ                             @SEINO@
         05  FLG-TKMZBW11-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  元本残高計算データ追加フラグ                         @SEINO@
         05  FLG-TKMZBW13-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  資金簿価異動計算データ追加フラグ                     @SEINO@
         05  FLG-TKMZBW07-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  資金残履歴計算データ追加フラグ                       @SEINO@
         05  FLG-TKMZBW12-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  勘定異動計算データ追加フラグ                         @SEINO@
         05  FLG-TKMZBW15-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  勘定残高計算データ追加フラグ                         @SEINO@
         05  FLG-TKMZBW16-IN-OPEN  PIC  9(01).                          @SEINO@
      *----------  基準日計算情報データ更新処理フラグ                   @SEINO@
         05  FLG-TKMZKK00-UP-OPEN  PIC  9(01).                          @SEINO@
      *----------  基準日計算情報データINSERT処理フラグ                 @SEINO@
         05  FLG-TKMZKK00-IN-OPEN  PIC  9(01).                          @SEINO@
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      *----------  基準日断面情報のコピー句
         05  WK-KYJ-YMD-DMN-INFO.
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
      *----------  基準日
           10  WK-KJN-YMD          PIC  S9(08).
      *----------  仕訳基準パターンコード
           10  WK-SWK-KJN-PTN-CD   PIC  X(08).
      *----------  異動計算パターンコード
           10  WK-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
      *----------  開始基準日の翌日
           10  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  起動ログインユーザ会社コード
         05  WK-KIDOU-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  起動ユーザーID
         05  WK-KIDOU-SID          PIC  X(20).
      *----------  更新件数
         05  WK-KOUSIN-COUNT.
      *----------  更新件数.未収収益_件数
           10  WK-MS-SHEKI-COUNT   PIC  9(09).
      *----------  更新件数.債券過去経過利息_件数
           10  WK-PAST-BOND-KEKA-RSK-COUNT
                                   PIC  9(09).
      *----------  新規件数
         05  WK-SINKI-COUNT.
      *----------  新規件数.未収収益_件数
           10  WK-MS-SHEKI-COUNT   PIC  9(09).
      *----------  新規件数.債券過去経過利息_件数
           10  WK-PAST-BOND-KEKA-RSK-COUNT
                                   PIC  9(09).
      *----------  TABLEＩＤ
         05  WK-TABLE-TKMZMS00     PIC  X(13).
         05  WK-TABLE-TKMZKR00     PIC  X(13).
         05  WK-TABLE-TKMZMB00     PIC  X(13).
         05  WK-TABLE-TKMZZI00     PIC  X(13).
         05  WK-TABLE-TKMZZR00     PIC  X(13).
         05  WK-TABLE-TKMZGZ00     PIC  X(13).
         05  WK-TABLE-TKMZSI00     PIC  X(13).
         05  WK-TABLE-TKMZSR00     PIC  X(13).
         05  WK-TABLE-TKMZKI00     PIC  X(13).
         05  WK-TABLE-TKMZKZ00     PIC  X(13).
         05  WK-TABLE-TKMZKK00     PIC  X(13).
         05  WK-TABLE-TKMZBW08     PIC  X(13).
         05  WK-TABLE-TKMZBW09     PIC  X(13).
         05  WK-TABLE-TKMZBW10     PIC  X(13).
         05  WK-TABLE-TKMZBW06     PIC  X(13).
         05  WK-TABLE-TKMZBW11     PIC  X(13).
         05  WK-TABLE-TKMZBW13     PIC  X(13).
         05  WK-TABLE-TKMZBW07     PIC  X(13).
         05  WK-TABLE-TKMZBW12     PIC  X(13).
         05  WK-TABLE-TKMZBW15     PIC  X(13).
         05  WK-TABLE-TKMZBW16     PIC  X(13).
      ******************************************************************
      *    ＯＲＡＣＬＥホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  未収収益計算データTBL(別紙1-1)
         05  H-TKMZBW08.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  権利付数量
           10  H-RIT-SRY           PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  H-SJTK-MS-SHEKI     PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  未入金対象数量残高
           10  H-MNK-TSHO-SRYZN    PIC  S9(12)V9(06).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *----------  更新日時
           10  H-UPD-DATE          PIC  X(14).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  更新プログラムＩＤ
           10  H-UPD-PGMID         PIC  X(16).
      *----------  未収収益計算データTBL(別紙1-1)
         05  H-TKMZBW08-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  未収収益TBL(別紙1-2)
         05  H-TKMZMS00.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  未収収益TBL(別紙1-2)
         05  H-TKMZMS00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  未収収益TBL(別紙1-3)
         05  H-TKMZMS00-1.
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  権利付数量
           10  H-RIT-SRY           PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  H-SJTK-MS-SHEKI     PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  未入金対象数量残高
           10  H-MNK-TSHO-SRYZN    PIC  S9(12)V9(06).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  未収収益TBL(別紙1-3)
         05  H-TKMZMS00-U-1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  未収収益TBL(別紙1-4)
         05  H-TKMZMS00-I.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  権利付数量
           10  H-RIT-SRY           PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  H-SJTK-MS-SHEKI     PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  未入金対象数量残高
           10  H-MNK-TSHO-SRYZN    PIC  S9(12)V9(06).
      *----------  発行国コード
           10  H-HAKO-CD           PIC  X(04).
      *----------  投資対象国コード
           10  H-TSTSK-CD          PIC  X(04).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  SPACE
         05  H-SPACE               PIC  X(01).
      *----------  債券過去経過利息計算データ(別紙1-6)
         05  H-TKMZBW09.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  利払対象額面
           10  H-RIB-TSHO-FACE     PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  H-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  H-MNK-TSHO-FACE-ZAN PIC  S9(12)V9(06).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *----------  更新日時
           10  H-UPD-DATE          PIC  X(14).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  更新プログラムＩＤ
           10  H-UPD-PGMID         PIC  X(16).
      *----------  債券過去経過利息計算データ(別紙1-6)
         05  H-TKMZBW09-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  債券過去経過利息データ(別紙1-7)
         05  H-TKMZKR00.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  債券過去経過利息データ(別紙1-7)
         05  H-TKMZKR00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  債券過去経過利息データ(別紙1-8)
         05  H-TKMZKR00-1.
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  利払対象額面
           10  H-RIB-TSHO-FACE     PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  未入金対象額面残高
           10  H-MNK-TSHO-FACE-ZAN PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  H-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  債券過去経過利息データ(別紙1-8)
         05  H-TKMZKR00-U-1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  債券過去経過利息データ(別紙1-9)
         05  H-TKMZKR00-I.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  利払日
           10  H-RIB-YMD           PIC  S9(08).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  利払対象額面
           10  H-RIB-TSHO-FACE     PIC  S9(12)V9(06).
      *----------  市場通貨経過利息
           10  H-SJTK-KEKA-RSK     PIC  S9(12)V9(06).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  ファクター・連動係数
           10  H-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
      *----------  未入金対象額面残高
           10  H-MNK-TSHO-FACE-ZAN PIC  S9(12)V9(06).
      *----------  発行国コード
           10  H-HAKO-CD           PIC  X(04).
      *----------  投資対象国コード
           10  H-TSTSK-CD          PIC  X(04).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  前払金計算データ(別紙1-11)
         05  H-TKMZBW10.
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  前払金計算データ(別紙1-11)
         05  H-TKMZBW10-S.
      *----------  処理フラグ
           10  H-SYRI-FLG          PIC  X(01).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  残高異動計算データ(別紙1-13)
         05  H-TKMZBW06.
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  残高異動計算データ(別紙1-13)
         05  H-TKMZBW06-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  残高履歴計算データ(別紙1-15)
         05  H-TKMZBW11.
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  残高履歴計算データ(別紙1-15)
         05  H-TKMZBW11-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  元本残高計算データ(別紙1-17)
         05  H-TKMZBW13.
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  元本残高計算データ(別紙1-17)
         05  H-TKMZBW13-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  資金簿価異動計算データ(別紙1-19)
         05  H-TKMZBW07.
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  資金簿価異動計算データ(別紙1-19)
         05  H-TKMZBW07-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  資金残履歴計算データ(別紙1-21)
         05  H-TKMZBW12.
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  資金残履歴計算データ(別紙1-21)
         05  H-TKMZBW12-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  勘定異動計算データ(別紙1-23)
         05  H-TKMZBW15.
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  勘定異動計算データ(別紙1-23)
         05  H-TKMZBW15-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  勘定残高計算データ(別紙1-25)
         05  H-TKMZBW16.
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  異動計上開始日
           10  H-IDO-KJY-FROM      PIC  S9(08).
      *----------  勘定残高計算データ(別紙1-25)
         05  H-TKMZBW16-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  基準日計算情報(別紙1-30)
         05  H-TKMZKK00.
      *----------  仕訳基準パターンコード
           10  H-SWK-KJN-PTN-CD    PIC  X(08).
      *----------  異動計算パターンコード
           10  H-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  基準日計算情報(別紙1-30)
         05  H-TKMZKK00-U.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  基準日計算情報(別紙1-31)
         05  H-TKMZKK00-I.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  仕訳基準パターンコード
           10  H-SWK-KJN-PTN-CD    PIC  X(08).
      *----------  異動計算パターンコード
           10  H-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  残高異動SQL文(別紙1-32)
         05  H-TKMZZI00-U.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
         05  SQLSTMT1              PIC  X(350).                         @3212SEINO@@
         05  SQLSTMT2              PIC  X(300).                         @3212SEINO@@
         05  SQLSTMT3              PIC  X(550).                         @3212SEINO@@
         05  SQLSTMT4              PIC  X(950).                         @3212SEINO@@
         05  SQLSTMT6              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT7              PIC  X(300).                         @3212SEINO@@
         05  SQLSTMT8              PIC  X(600).                         @3212SEINO@@
         05  SQLSTMT9              PIC  X(1050).                        @3212SEINO@@
         05  SQLSTMT11             PIC  X(1150).                        @3212SEINO@@
         05  SQLSTMT13             PIC  X(3550).                        @3212SEINO@@
         05  SQLSTMT15             PIC  X(2400).                        @3212SEINO@@
         05  SQLSTMT17             PIC  X(550).                         @3212SEINO@@
         05  SQLSTMT19             PIC  X(1350).                        @3212SEINO@@
         05  SQLSTMT21             PIC  X(1100).                        @3212SEINO@@
         05  SQLSTMT23             PIC  X(750).                         @3212SEINO@@
         05  SQLSTMT25             PIC  X(750).                         @3212SEINO@@
         05  SQLSTMT30             PIC  X(300).                         @3212SEINO@@
         05  SQLSTMT31             PIC  X(450).                         @3212SEINO@@
         05  SQLSTMT32             PIC  X(150).                         @3212SEINO@@
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *            SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  未収収益計算データSQL文(別紙1-1)
         05  SQL-SELECT-1-1.
           10  S-SELECT-1-1.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  処理実行日
             15  FILLER            PIC  X(10)  VALUE
               "SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(09)  VALUE
               "KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  適用開始日
             15  FILLER            PIC  X(12)  VALUE
               "TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(14)  VALUE
               "KENRI_OTI_YMD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  権利付数量
             15  FILLER            PIC  X(08)  VALUE
               "RIT_SRY,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(15)  VALUE
               "MNK_TSHO_SRYZN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID1       PIC  X(13).
           10  S-WHERE-1-1.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
      *----------  未収収益SQL文(別紙1-2)
         05  SQL-SELECT-1-2.
           10  S-SELECT-1-2.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID2       PIC  X(13).
           10  S-WHERE-1-2.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(23)  VALUE
               " AND FUND_CD=:P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(21)  VALUE
               " AND PTF_CD=:P_PTF_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(29)  VALUE
               " AND SEC_SBT_CD=:P_SEC_SBT_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(21)  VALUE
               " AND MEG_CD=:P_MEG_CD".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(25)  VALUE
               " AND TATE_FLG=:P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(25)  VALUE
               " AND GYOKU_ID=:P_GYOKU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(31)  VALUE
               " AND TEKIYO_FROM=:P_TEKIYO_FROM".
      *----------  権利落日
             15  FILLER            PIC  X(35)  VALUE
               " AND KENRI_OTI_YMD=:P_KENRI_OTI_YMD".
      *----------  未収収益SQL文(別紙1-3)
         05  SQL-UPDATE-1-3.
           10  S-UPDATE-1-3.
             15  FILLER            PIC  X(07)  VALUE
               "UPDATE ".
             15  SQL-TBL-ID3       PIC  X(13).
             15  FILLER            PIC  X(05)  VALUE
               " SET ".
      *----------  市場通貨コード
             15  FILLER            PIC  X(29)  VALUE
               "SIJO_TUKA_CD=:P_SIJO_TUKA_CD,".
      *----------  権利付数量
             15  FILLER            PIC  X(19)  VALUE
               "RIT_SRY=:P_RIT_SRY,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(31)  VALUE
               "SJTK_MS_SHEKI=:P_SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(35)  VALUE
               "SJTK_GENSEN_TAX=:P_SJTK_GENSEN_TAX,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(33)  VALUE
               "MNK_TSHO_SRYZN=:P_MNK_TSHO_SRYZN,".
      *----------  更新フラグ
             15  FILLER            PIC  X(12)  VALUE
               "UPD_FLG='3',".
      *----------  更新日時
             15  FILLER            PIC  X(17)  VALUE
               "UPD_DATE=SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(32)  VALUE
               "UPD_LOGIN_CMP_CD=:P_RIYO_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(19)  VALUE
               "UPD_SID=:P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(20)  VALUE
               "UPD_PGMID='SMZJ2310'".
           10  S-WHERE-1-3.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(23)  VALUE
               " AND FUND_CD=:P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(21)  VALUE
               " AND PTF_CD=:P_PTF_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(29)  VALUE
               " AND SEC_SBT_CD=:P_SEC_SBT_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(21)  VALUE
               " AND MEG_CD=:P_MEG_CD".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(25)  VALUE
               " AND TATE_FLG=:P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(25)  VALUE
               " AND GYOKU_ID=:P_GYOKU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(31)  VALUE
               " AND TEKIYO_FROM=:P_TEKIYO_FROM".
      *----------  権利落日
             15  FILLER            PIC  X(35)  VALUE
               " AND KENRI_OTI_YMD=:P_KENRI_OTI_YMD".
      *----------  未収収益SQL文(別紙1-4)
         05  SQL-INSERT-1-4.
           10  S-INSERT-1-4.
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID4       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  適用開始日
             15  FILLER            PIC  X(12)  VALUE
               "TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(14)  VALUE
               "KENRI_OTI_YMD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  権利付数量
             15  FILLER            PIC  X(08)  VALUE
               "RIT_SRY,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_MS_SHEKI,".
      *----------  市場通貨未収収益（入力値）
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_MS_SHEKI_IN,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  市場通貨源泉税（入力値）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_GENSEN_TAX_IN,".
      *----------  運用通貨未収収益（入力値）
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_MS_SHEKI_IN,".
      *----------  運用通貨源泉税（入力値）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_GENSEN_TAX_IN,".
      *----------  評価為替レート（入力値）
             15  FILLER            PIC  X(11)  VALUE
               "HYK_KWS_IN,".
      *----------  源泉税評価為替レート（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "GENS_TAX_HYK_KWS_IN,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(15)  VALUE
               "MNK_TSHO_SRYZN,".
      *----------  未入金対象数量残高（入力値）
             15  FILLER            PIC  X(18)  VALUE
               "MNK_TSHO_SRYZN_IN,".
      *----------  発行国コード
             15  FILLER            PIC  X(08)  VALUE
               "HAKO_CD,".
      *----------  投資対象国コード
             15  FILLER            PIC  X(09)  VALUE
               "TSTSK_CD,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成フラグ
             15  FILLER            PIC  X(07)  VALUE
               "SK_FLG,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新フラグ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
      *----------  INSERT DATA
             15  FILLER            PIC  X(07)  VALUE  "VALUES(".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE
               ":P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE
               ":P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE
               ":P_PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(14)  VALUE
               ":P_SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(10)  VALUE
               ":P_MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE
               ":P_TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(12)  VALUE
               ":P_GYOKU_ID,".
      *----------  適用開始日
             15  FILLER            PIC  X(15)  VALUE
               ":P_TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(17)  VALUE
               ":P_KENRI_OTI_YMD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(16)  VALUE
               ":P_SIJO_TUKA_CD,".
      *----------  権利付数量
             15  FILLER            PIC  X(11)  VALUE
               ":P_RIT_SRY,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(17)  VALUE
               ":P_SJTK_MS_SHEKI,".
      *----------  市場通貨未収収益（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999999.999,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(19)  VALUE
               ":P_SJTK_GENSEN_TAX,".
      *----------  市場通貨源泉税（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999999.999,".
      *----------  運用通貨未収収益（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999999.999,".
      *----------  運用通貨源泉税（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999999.999,".
      *----------  評価為替レート（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "99999999.9999999999,".
      *----------  源泉税評価為替レート（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "99999999.9999999999,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(18)  VALUE
               ":P_MNK_TSHO_SRYZN,".
      *----------  未入金対象数量残高（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999.999999,".
      *----------  発行国コード
             15  FILLER            PIC  X(09)  VALUE
               ":P_SPACE,".
      *----------  投資対象国コード
             15  FILLER            PIC  X(09)  VALUE
               ":P_SPACE,".
      *----------  削除区分
             15  FILLER            PIC  X(14)  VALUE
               ":P_SAKUJO_KBN,".
      *----------  作成フラグ
             15  FILLER            PIC  X(04)  VALUE
               "'3',".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "'SMZJ2310',".
      *----------  更新フラグ
             15  FILLER            PIC  X(04)  VALUE
               "'3',".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "'SMZJ2310')".
      *----------  債券過去経過利息計算データSQL文(別紙1-6)
         05  SQL-SELECT-1-6.
           10  S-SELECT-1-6.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  処理実行日
             15  FILLER            PIC  X(10)  VALUE
               "SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(09)  VALUE
               "KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  適用開始日
             15  FILLER            PIC  X(12)  VALUE
               "TEKIYO_FROM,".
      *----------  利払日
             15  FILLER            PIC  X(08)  VALUE
               "RIB_YMD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  利払対象額面
             15  FILLER            PIC  X(14)  VALUE
               "RIB_TSHO_FACE,".
      *----------  市場通貨経過利息
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_KEKA_RSK,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  ファクター・連動係数
             15  FILLER            PIC  X(19)  VALUE
               "FACTOR_RENDOU_KESU,".
      *----------  未入金対象額面残高
             15  FILLER            PIC  X(18)  VALUE
               "MNK_TSHO_FACE_ZAN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID6       PIC  X(13).
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
      *----------  債券過去経過利息SQL文(別紙1-7)
         05  SQL-SELECT-1-7.
           10  S-SELECT-1-7.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID7       PIC  X(13).
           10  S-WHERE-1-7.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(23)  VALUE
               " AND FUND_CD=:P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(21)  VALUE
               " AND PTF_CD=:P_PTF_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(29)  VALUE
               " AND SEC_SBT_CD=:P_SEC_SBT_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(21)  VALUE
               " AND MEG_CD=:P_MEG_CD".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(25)  VALUE
               " AND TATE_FLG=:P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(25)  VALUE
               " AND GYOKU_ID=:P_GYOKU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(31)  VALUE
               " AND TEKIYO_FROM=:P_TEKIYO_FROM".
      *----------  利払日
             15  FILLER            PIC  X(23)  VALUE
               " AND RIB_YMD=:P_RIB_YMD".
      *----------  債券過去経過利息SQL文(別紙1-8)
         05  SQL-UPDATE-1-8.
           10  S-UPDATE-1-8.
             15  FILLER            PIC  X(07)  VALUE
               "UPDATE ".
             15  SQL-TBL-ID8       PIC  X(13).
             15  FILLER            PIC  X(05)  VALUE
               " SET ".
      *----------  市場通貨コード
             15  FILLER            PIC  X(29)  VALUE
               "SIJO_TUKA_CD=:P_SIJO_TUKA_CD,".
      *----------  利払対象額面
             15  FILLER            PIC  X(31)  VALUE
               "RIB_TSHO_FACE=:P_RIB_TSHO_FACE,".
      *----------  市場通貨経過利息
             15  FILLER            PIC  X(31)  VALUE
               "SJTK_KEKA_RSK=:P_SJTK_KEKA_RSK,".
      *----------  未入金対象額面残高
             15  FILLER            PIC  X(39)  VALUE
               "MNK_TSHO_FACE_ZAN=:P_MNK_TSHO_FACE_ZAN,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(35)  VALUE
               "SJTK_GENSEN_TAX=:P_SJTK_GENSEN_TAX,".
      *----------  ファクター・連動係数
             15  FILLER            PIC  X(41)  VALUE
               "FACTOR_RENDOU_KESU=:P_FACTOR_RENDOU_KESU,".
      *----------  更新フラグ
             15  FILLER            PIC  X(12)  VALUE
               "UPD_FLG='3',".
      *----------  更新日時
             15  FILLER            PIC  X(17)  VALUE
               "UPD_DATE=SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(32)  VALUE
               "UPD_LOGIN_CMP_CD=:P_RIYO_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(19)  VALUE
               "UPD_SID=:P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(20)  VALUE
               "UPD_PGMID='SMZJ2310'".
           10  S-WHERE-1-8.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(23)  VALUE
               " AND FUND_CD=:P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(21)  VALUE
               " AND PTF_CD=:P_PTF_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(29)  VALUE
               " AND SEC_SBT_CD=:P_SEC_SBT_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(21)  VALUE
               " AND MEG_CD=:P_MEG_CD".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(25)  VALUE
               " AND TATE_FLG=:P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(25)  VALUE
               " AND GYOKU_ID=:P_GYOKU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(31)  VALUE
               " AND TEKIYO_FROM=:P_TEKIYO_FROM".
      *----------  利払日
             15  FILLER            PIC  X(23)  VALUE
               " AND RIB_YMD=:P_RIB_YMD".
      *----------  債券過去経過利息SQL文(別紙1-9)
         05  SQL-INSERT-1-9.
           10  S-INSERT-1-9.
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID9       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  適用開始日
             15  FILLER            PIC  X(12)  VALUE
               "TEKIYO_FROM,".
      *----------  利払日
             15  FILLER            PIC  X(08)  VALUE
               "RIB_YMD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  利払対象額面
             15  FILLER            PIC  X(14)  VALUE
               "RIB_TSHO_FACE,".
      *----------  市場通貨経過利息金額
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_KEKA_RSK,".
      *----------  市場通貨経過利息金額（入力値）
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_KEKA_RSK_IN,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  市場通貨源泉税（入力値）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_GENSEN_TAX_IN,".
      *----------  運用通貨経過利息金額（入力値）
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_KEKA_RSK_IN,".
      *----------  運用通貨源泉税（入力値）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_GENSEN_TAX_IN,".
      *----------  評価為替レート（入力値）
             15  FILLER            PIC  X(11)  VALUE
               "HYK_KWS_IN,".
      *----------  源泉税評価為替レート（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "GENS_TAX_HYK_KWS_IN,".
      *----------  ファクター・連動係数
             15  FILLER            PIC  X(19)  VALUE
               "FACTOR_RENDOU_KESU,".
      *----------  ファクター・連動係数（入力値）
             15  FILLER            PIC  X(22)  VALUE
               "FACTOR_RENDOU_KESU_IN,".
      *----------  未入金対象額面残高
             15  FILLER            PIC  X(18)  VALUE
               "MNK_TSHO_FACE_ZAN,".
      *----------  未入金対象額面残高（入力値）
             15  FILLER            PIC  X(21)  VALUE
               "MNK_TSHO_FACE_ZAN_IN,".
      *----------  発行国コード
             15  FILLER            PIC  X(08)  VALUE
               "HAKO_CD,".
      *----------  投資対象国コード
             15  FILLER            PIC  X(09)  VALUE
               "TSTSK_CD,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成フラグ
             15  FILLER            PIC  X(07)  VALUE
               "SK_FLG,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新フラグ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
      *----------  INSERT DATA
             15  FILLER            PIC  X(07)  VALUE  "VALUES(".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE
               ":P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE
               ":P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE
               ":P_PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(14)  VALUE
               ":P_SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(10)  VALUE
               ":P_MEG_CD,".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(12)  VALUE
               ":P_TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(12)  VALUE
               ":P_GYOKU_ID,".
      *----------  適用開始日
             15  FILLER            PIC  X(15)  VALUE
               ":P_TEKIYO_FROM,".
      *----------  利払日
             15  FILLER            PIC  X(11)  VALUE
               ":P_RIB_YMD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(16)  VALUE
               ":P_SIJO_TUKA_CD,".
      *----------  利払対象額面
             15  FILLER            PIC  X(17)  VALUE
               ":P_RIB_TSHO_FACE,".
      *----------  市場通貨経過利息金額
             15  FILLER            PIC  X(17)  VALUE
               ":P_SJTK_KEKA_RSK,".
      *----------  市場通貨経過利息金額（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999.999999,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(19)  VALUE
               ":P_SJTK_GENSEN_TAX,".
      *----------  市場通貨源泉税（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999999.999,".
      *----------  運用通貨経過利息金額（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999.999999,".
      *----------  運用通貨源泉税（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999999.999,".
      *----------  評価為替レート（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "99999999.9999999999,".
      *----------  源泉税評価為替レート（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "99999999.9999999999,".
      *----------  ファクター・連動係数
             15  FILLER            PIC  X(22)  VALUE
               ":P_FACTOR_RENDOU_KESU,".
      *----------  ファクター・連動係数（入力値）
             15  FILLER            PIC  X(22)  VALUE
               "99999999.9999999999,".
      *----------  未入金対象額面残高
             15  FILLER            PIC  X(21)  VALUE
               ":P_MNK_TSHO_FACE_ZAN,".
      *----------  未入金対象額面残高（入力値）
             15  FILLER            PIC  X(20)  VALUE
               "999999999999.999999,".
      *----------  発行国コード
             15  FILLER            PIC  X(09)  VALUE
               ":P_SPACE,".
      *----------  投資対象国コード
             15  FILLER            PIC  X(09)  VALUE
               ":P_SPACE,".
      *----------  削除区分
             15  FILLER            PIC  X(14)  VALUE
               ":P_SAKUJO_KBN,".
      *----------  作成フラグ
             15  FILLER            PIC  X(04)  VALUE
               "'3',".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "'SMZJ2310',".
      *----------  更新フラグ
             15  FILLER            PIC  X(04)  VALUE
               "'3',".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "'SMZJ2310')".
      *----------  前払金計算データSQL文(別紙1-11)
         05  SQL-INSERT-1-11.
           10  S-INSERT-1-11.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID11      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  利払日
             15  FILLER            PIC  X(08)  VALUE
               "RIB_YMD,".
      *----------  積み取引ＩＤ
             15  FILLER            PIC  X(13)  VALUE
               "TUMI_TORI_ID,".
      *----------  償却取引ＩＤ
             15  FILLER            PIC  X(16)  VALUE
               "SHOUKYK_TORI_ID,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  積み／償却フラグ
             15  FILLER            PIC  X(17)  VALUE
               "TUMI_SHOUKYK_FLG,".
      *----------  積み計上日
             15  FILLER            PIC  X(13)  VALUE
               "TUMI_KJY_YMD,".
      *----------  積み順番
             15  FILLER            PIC  X(12)  VALUE
               "TUMI_JUNBAN,".
      *----------  償却計上日
             15  FILLER            PIC  X(16)  VALUE
               "SHOUKYK_KJY_YMD,".
      *----------  償却順番
             15  FILLER            PIC  X(15)  VALUE
               "SHOUKYK_JUNBAN,".
      *----------  計上基準日
             15  FILLER            PIC  X(15)  VALUE
               "KEIJOU_KIJUNBI,".
      *----------  利払日毎順番
             15  FILLER            PIC  X(13)  VALUE
               "RIBAR_JUNBAN,".
      *----------  未償却数量
             15  FILLER            PIC  X(09)  VALUE
               "MSKK_SRY,".
      *----------  未償却数量（期間）
             15  FILLER            PIC  X(15)  VALUE
               "MSKK_SRY_KIKAN,".
      *----------  未償却数量（利金）
             15  FILLER            PIC  X(15)  VALUE
               "MSKK_SRY_RIKIN,".
      *----------  未償却数量サマリ
             15  FILLER            PIC  X(13)  VALUE
               "MSKK_SRY_SUM,".
      *----------  未償却数量サマリ（期間）
             15  FILLER            PIC  X(19)  VALUE
               "MSKK_SRY_KIKAN_SUM,".
      *----------  未償却数量サマリ（利金）
             15  FILLER            PIC  X(19)  VALUE
               "MSKK_SRY_RIKIN_SUM,".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_PPAYZN,".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_PPAYZN,".
      *----------  市場通貨前払金残高サマリ
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_PPAYZN_SUM,".
      *----------  運用通貨前払金残高サマリ
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_PPAYZN_SUM,".
      *----------  前払金償却方法
             15  FILLER            PIC  X(19)  VALUE
               "MAEKIN_SHOUKYK_HOU,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
           10  S-SELECT-1-11.
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  利払日
             15  FILLER            PIC  X(08)  VALUE
               "RIB_YMD,".
      *----------  積み取引ＩＤ
             15  FILLER            PIC  X(13)  VALUE
               "TUMI_TORI_ID,".
      *----------  償却取引ＩＤ
             15  FILLER            PIC  X(16)  VALUE
               "SHOUKYK_TORI_ID,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  積み／償却フラグ
             15  FILLER            PIC  X(17)  VALUE
               "TUMI_SHOUKYK_FLG,".
      *----------  積み計上日
             15  FILLER            PIC  X(13)  VALUE
               "TUMI_KJY_YMD,".
      *----------  積み順番
             15  FILLER            PIC  X(12)  VALUE
               "TUMI_JUNBAN,".
      *----------  償却計上日
             15  FILLER            PIC  X(16)  VALUE
               "SHOUKYK_KJY_YMD,".
      *----------  償却順番
             15  FILLER            PIC  X(15)  VALUE
               "SHOUKYK_JUNBAN,".
      *----------  計上基準日
             15  FILLER            PIC  X(15)  VALUE
               "KEIJOU_KIJUNBI,".
      *----------  利払日毎順番
             15  FILLER            PIC  X(13)  VALUE
               "RIBAR_JUNBAN,".
      *----------  未償却数量
             15  FILLER            PIC  X(09)  VALUE
               "MSKK_SRY,".
      *----------  未償却数量（期間）
             15  FILLER            PIC  X(15)  VALUE
               "MSKK_SRY_KIKAN,".
      *----------  未償却数量（利金）
             15  FILLER            PIC  X(15)  VALUE
               "MSKK_SRY_RIKIN,".
      *----------  未償却数量サマリ
             15  FILLER            PIC  X(13)  VALUE
               "MSKK_SRY_SUM,".
      *----------  未償却数量サマリ（期間）
             15  FILLER            PIC  X(19)  VALUE
               "MSKK_SRY_KIKAN_SUM,".
      *----------  未償却数量サマリ（利金）
             15  FILLER            PIC  X(19)  VALUE
               "MSKK_SRY_RIKIN_SUM,".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_PPAYZN,".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_PPAYZN,".
      *----------  市場通貨前払金残高サマリ
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_PPAYZN_SUM,".
      *----------  運用通貨前払金残高サマリ
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_PPAYZN_SUM,".
      *----------  前払金償却方法
             15  FILLER            PIC  X(19)  VALUE
               "MAEKIN_SHOUKYK_HOU,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID11-1    PIC  X(13).
           10  S-WHERE-1-11.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理フラグ
             15  FILLER            PIC  X(12)  VALUE
               "SYRI_FLG='1'".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(02)  VALUE
               " )".
      *----------  残高異動計算データSQL文(別紙1-13)
         05  SQL-INSERT-1-13.
           10  S-INSERT-1-13.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID13      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  計上基準日
             15  FILLER            PIC  X(15)  VALUE
               "KEIJOU_KIJUNBI,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  誤計上№
             15  FILLER            PIC  X(11)  VALUE
               "ERR_KJY_NO,".
      *----------  誤計上区分
             15  FILLER            PIC  X(12)  VALUE
               "ERR_KJY_KBN,".
      *----------  取引連関ID
             15  FILLER            PIC  X(08)  VALUE
               "THRK_ID,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  取引内容
             15  FILLER            PIC  X(10)  VALUE
               "TORI_NAIY,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  約定日
             15  FILLER            PIC  X(08)  VALUE
               "YKJ_YMD,".
      *----------  受渡日
             15  FILLER            PIC  X(08)  VALUE
               "UKE_YMD,".
      *----------  市場通貨異動簿価
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_IDO_BOKA,".
      *----------  運用通貨異動簿価
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_IDO_BOKA,".
      *----------  市場通貨簿価単価
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_BOKA_TNK,".
      *----------  運用通貨簿価単価
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_BOKA_TNK,".
      *----------  簿価為替レート
             15  FILLER            PIC  X(09)  VALUE
               "BOKA_KWS,".
      *----------  市場通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_H_BOKA,".
      *----------  運用通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_H_BOKA,".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "SJTK_H_TNK,".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "UYTK_H_TNK,".
      *----------  異動数量
             15  FILLER            PIC  X(10)  VALUE
               "IDO_SURYO,".
      *----------  異動数量（利付）
             15  FILLER            PIC  X(14)  VALUE
               "IDO_SURYO_RIT,".
      *----------  市場通貨異動後簿価残高
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_BOKAZN,".
      *----------  運用通貨異動後簿価残高
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_BOKAZN,".
      *----------  異動後数量残高
             15  FILLER            PIC  X(11)  VALUE
               "IDOG_SRYZN,".
      *----------  異動後数量残高（利付）
             15  FILLER            PIC  X(15)  VALUE
               "IDOG_SRYZN_RIT,".
      *----------  市場通貨前払金異動額
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_PPAYIDOG,".
      *----------  運用通貨前払金異動額
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_PPAYIDOG,".
      *----------  市場通貨異動後前払金残
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_PPAYZN,".
      *----------  運用通貨異動後前払金残
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_PPAYZN,".
      *----------  市場通貨異動後前受金残
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_ARECZN,".
      *----------  運用通貨異動後前受金残
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_ARECZN,".
      *----------  市場通貨異動後仮払金残
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_SPAYZN,".
      *----------  運用通貨異動後仮払金残
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_SPAYZN,".
      *----------  市場通貨売買損益
             15  FILLER            PIC  X(13)  VALUE
               "SJTK_BBSNEKI,".
      *----------  運用通貨売買損益
             15  FILLER            PIC  X(13)  VALUE
               "UYTK_BBSNEKI,".
      *----------  為替差損益
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_KWS_SNEKI,".
      *----------  為替差損益（利金）
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_KWS_SNEKI_RK,".
      *----------  為替差損益（市場）
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_KWS_SNEKI_SJ,".
      *----------  市場通貨手数料
             15  FILLER            PIC  X(09)  VALUE
               "SJTK_TSR,".
      *----------  運用通貨手数料
             15  FILLER            PIC  X(09)  VALUE
               "UYTK_TSR,".
      *----------  市場通貨消費税
             15  FILLER            PIC  X(11)  VALUE
               "SJTK_S_TAX,".
      *----------  運用通貨消費税
             15  FILLER            PIC  X(11)  VALUE
               "UYTK_S_TAX,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  運用通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_GENSEN_TAX,".
      *----------  市場通貨その他損益
             15  FILLER            PIC  X(15)  VALUE
               "SJTK_ELS_SNEKI,".
      *----------  運用通貨その他損益
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_ELS_SNEKI,".
      *----------  市場通貨利金等損益勘定
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_RKSEKJ,".
      *----------  運用通貨利金等損益勘定
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_RKSEKJ,".
      *----------  異動計上順序
             15  FILLER            PIC  X(12)  VALUE
               "IDO_KJY_JUN,".
      *----------  建玉単価
             15  FILLER            PIC  X(11)  VALUE
               "TGYOKU_TNK,".
      *----------  建玉為替レート
             15  FILLER            PIC  X(16)  VALUE
               "TGYOKU_KWS_RATE,".
      *----------  建玉ブローカー
             15  FILLER            PIC  X(11)  VALUE
               "TGYOKU_BRK,".
      *----------  建玉約定日
             15  FILLER            PIC  X(15)  VALUE
               "TGYOKU_YKJ_YMD,".
      *----------  市場通貨異動後建玉約定金額残
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_TG_YJKNZN,".
      *----------  運用通貨異動後建玉約定金額残
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_TG_YJKNZN,".
      *----------  市場通貨建玉手数料
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_TG_TSR,".
      *----------  運用通貨建玉手数料
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_TG_TSR,".
      *----------  市場通貨異動後建玉手数料残
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_IDOG_TG_TSRZN,".
      *----------  運用通貨異動後建玉手数料残
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_IDOG_TG_TSRZN,".
      *----------  市場通貨建玉消費税
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_TG_S_TAX,".
      *----------  運用通貨建玉消費税
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_TG_S_TAX,".
      *----------  市場通貨異動後建玉消費税残
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_TG_S_TAXZN,".
      *----------  運用通貨異動後建玉消費税残
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_TG_S_TAXZN,".
      *----------  市場通貨建玉その他費用
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_TG_ELS_HIYO,".
      *----------  運用通貨建玉その他費用
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_TG_ELS_HIYO,".
      *----------  市場通貨異動後建玉その他費用残
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_TG_ELS_HZN,".
      *----------  運用通貨異動後建玉その他費用残
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_TG_ELS_HZN,".
      *----------  市場通貨建玉精算金額
             15  FILLER            PIC  X(13)  VALUE
               "SJTK_TG_SSKG,".
      *----------  運用通貨建玉精算金額
             15  FILLER            PIC  X(13)  VALUE
               "UYTK_TG_SSKG,".
      *----------  市場通貨異動後建玉精算金額残
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_TG_SSKGZN,".
      *----------  運用通貨異動後建玉精算金額残
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_TG_SSKGZN,".
      *----------  市場通貨決済時引継前受・前払プレミアム
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_HT_PPAR_PMM,".
      *----------  運用通貨決済時引継前受・前払プレミアム
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_HT_PPAR_PMM,".
      *----------  ＯＰ資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE
               "OP_TATE_FLG,".
      *----------  市場通貨源泉税還付予定異動額
             15  FILLER            PIC  X(18)  VALUE
               "SJTK_GSZKP_YTIDOG,".
      *----------  運用通貨源泉税還付予定異動額
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_GSZKP_YTIDOG,".
      *----------  決済通貨源泉税還付予定異動額
             15  FILLER            PIC  X(18)  VALUE
               "KSTK_GSZKP_YTIDOG,".
      *----------  市場通貨異動後源泉税還付予定額残高
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_GSZKP_YTZN,".
      *----------  運用通貨異動後源泉税還付予定額残高
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_GSZKP_YTZN,".
      *----------  決済通貨異動後源泉税還付予定額残高
             15  FILLER            PIC  X(21)  VALUE
               "KSTK_IDOG_GSZKP_YTZN,".
      *----------  市場通貨異動後ノンカバー未収金残高
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_NOCV_MSKZN,".
      *----------  運用通貨異動後ノンカバー未収金残高
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_NOCV_MSKZN,".
      *----------  市場通貨異動後ノンカバー未払金残高
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_NOCV_MBKZN,".
      *----------  運用通貨異動後ノンカバー未払金残高
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_NOCV_MBKZN,".
      *----------  短期スタート・エンド経過利息
             15  FILLER            PIC  X(20)  VALUE
               "SHORT_STEN_KEKA_RSK,".
      *----------  短期スタート日
             15  FILLER            PIC  X(16)  VALUE
               "SHORT_START_YMD,".
      *----------  短期エンド日
             15  FILLER            PIC  X(14)  VALUE
               "SHORT_END_YMD,".
      *----------  投資対象国コード
             15  FILLER            PIC  X(09)  VALUE
               "TSTSK_CD,".
      *----------  発行国コード
             15  FILLER            PIC  X(08)  VALUE
               "HAKO_CD,".
      *----------  数量単位
             15  FILLER            PIC  X(11)  VALUE
               "SURYO_TANI,".
      *----------  市場通貨異動後未払費用残
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_MBHYZN,".
      *----------  運用通貨異動後未払費用残
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_MBHYZN,".
      *----------  市場通貨異動後未払消費税残
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_MB_S_TAXZN,".
      *----------  運用通貨異動後未払消費税残
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_MB_S_TAXZN,".
      *----------  市場通貨異動後移管評価損益残
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_IK_HKSEZN,".
      *----------  運用通貨異動後移管評価損益残
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_IK_HKSEZN,".
      *----------  市場通貨異動後移管未収収益
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_IK_MSSHEKI,".
      *----------  運用通貨異動後移管未収収益
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_IK_MSSHEKI,".
      *----------  運用通貨異動後移管前払金評価損益残
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_IK_PPHKZN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成フラグ
             15  FILLER            PIC  X(07)  VALUE
               "SK_FLG,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新フラグ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
           10  S-SELECT-1-13.
      *----------  SELECT
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  計上基準日
             15  FILLER            PIC  X(15)  VALUE
               "KEIJOU_KIJUNBI,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  誤計上№
             15  FILLER            PIC  X(11)  VALUE
               "ERR_KJY_NO,".
      *----------  誤計上区分
             15  FILLER            PIC  X(12)  VALUE
               "ERR_KJY_KBN,".
      *----------  取引連関ID
             15  FILLER            PIC  X(08)  VALUE
               "THRK_ID,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  取引内容
             15  FILLER            PIC  X(10)  VALUE
               "TORI_NAIY,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  約定日
             15  FILLER            PIC  X(08)  VALUE
               "YKJ_YMD,".
      *----------  受渡日
             15  FILLER            PIC  X(08)  VALUE
               "UKE_YMD,".
      *----------  市場通貨異動簿価
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_IDO_BOKA,".
      *----------  運用通貨異動簿価
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_IDO_BOKA,".
      *----------  市場通貨簿価単価
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_BOKA_TNK,".
      *----------  運用通貨簿価単価
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_BOKA_TNK,".
      *----------  簿価為替レート
             15  FILLER            PIC  X(09)  VALUE
               "BOKA_KWS,".
      *----------  市場通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_H_BOKA,".
      *----------  運用通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_H_BOKA,".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "SJTK_H_TNK,".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "UYTK_H_TNK,".
      *----------  異動数量
             15  FILLER            PIC  X(10)  VALUE
               "IDO_SURYO,".
      *----------  異動数量（利付）
             15  FILLER            PIC  X(14)  VALUE
               "IDO_SURYO_RIT,".
      *----------  市場通貨異動後簿価残高
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_BOKAZN,".
      *----------  運用通貨異動後簿価残高
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_BOKAZN,".
      *----------  異動後数量残高
             15  FILLER            PIC  X(11)  VALUE
               "IDOG_SRYZN,".
      *----------  異動後数量残高（利付）
             15  FILLER            PIC  X(15)  VALUE
               "IDOG_SRYZN_RIT,".
      *----------  市場通貨前払金異動額
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_PPAYIDOG,".
      *----------  運用通貨前払金異動額
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_PPAYIDOG,".
      *----------  市場通貨異動後前払金残
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_PPAYZN,".
      *----------  運用通貨異動後前払金残
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_PPAYZN,".
      *----------  市場通貨異動後前受金残
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_ARECZN,".
      *----------  運用通貨異動後前受金残
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_ARECZN,".
      *----------  市場通貨異動後仮払金残
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_SPAYZN,".
      *----------  運用通貨異動後仮払金残
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_SPAYZN,".
      *----------  市場通貨売買損益
             15  FILLER            PIC  X(13)  VALUE
               "SJTK_BBSNEKI,".
      *----------  運用通貨売買損益
             15  FILLER            PIC  X(13)  VALUE
               "UYTK_BBSNEKI,".
      *----------  為替差損益
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_KWS_SNEKI,".
      *----------  為替差損益（利金）
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_KWS_SNEKI_RK,".
      *----------  為替差損益（市場）
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_KWS_SNEKI_SJ,".
      *----------  市場通貨手数料
             15  FILLER            PIC  X(09)  VALUE
               "SJTK_TSR,".
      *----------  運用通貨手数料
             15  FILLER            PIC  X(09)  VALUE
               "UYTK_TSR,".
      *----------  市場通貨消費税
             15  FILLER            PIC  X(11)  VALUE
               "SJTK_S_TAX,".
      *----------  運用通貨消費税
             15  FILLER            PIC  X(11)  VALUE
               "UYTK_S_TAX,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  運用通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_GENSEN_TAX,".
      *----------  市場通貨その他損益
             15  FILLER            PIC  X(15)  VALUE
               "SJTK_ELS_SNEKI,".
      *----------  運用通貨その他損益
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_ELS_SNEKI,".
      *----------  市場通貨利金等損益勘定
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_RKSEKJ,".
      *----------  運用通貨利金等損益勘定
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_RKSEKJ,".
      *----------  異動計上順序
             15  FILLER            PIC  X(12)  VALUE
               "IDO_KJY_JUN,".
      *----------  建玉単価
             15  FILLER            PIC  X(11)  VALUE
               "TGYOKU_TNK,".
      *----------  建玉為替レート
             15  FILLER            PIC  X(16)  VALUE
               "TGYOKU_KWS_RATE,".
      *----------  建玉ブローカー
             15  FILLER            PIC  X(11)  VALUE
               "TGYOKU_BRK,".
      *----------  建玉約定日
             15  FILLER            PIC  X(15)  VALUE
               "TGYOKU_YKJ_YMD,".
      *----------  市場通貨異動後建玉約定金額残
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_TG_YJKNZN,".
      *----------  運用通貨異動後建玉約定金額残
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_TG_YJKNZN,".
      *----------  市場通貨建玉手数料
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_TG_TSR,".
      *----------  運用通貨建玉手数料
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_TG_TSR,".
      *----------  市場通貨異動後建玉手数料残
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_IDOG_TG_TSRZN,".
      *----------  運用通貨異動後建玉手数料残
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_IDOG_TG_TSRZN,".
      *----------  市場通貨建玉消費税
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_TG_S_TAX,".
      *----------  運用通貨建玉消費税
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_TG_S_TAX,".
      *----------  市場通貨異動後建玉消費税残
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_TG_S_TAXZN,".
      *----------  運用通貨異動後建玉消費税残
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_TG_S_TAXZN,".
      *----------  市場通貨建玉その他費用
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_TG_ELS_HIYO,".
      *----------  運用通貨建玉その他費用
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_TG_ELS_HIYO,".
      *----------  市場通貨異動後建玉その他費用残
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_TG_ELS_HZN,".
      *----------  運用通貨異動後建玉その他費用残
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_TG_ELS_HZN,".
      *----------  市場通貨建玉精算金額
             15  FILLER            PIC  X(13)  VALUE
               "SJTK_TG_SSKG,".
      *----------  運用通貨建玉精算金額
             15  FILLER            PIC  X(13)  VALUE
               "UYTK_TG_SSKG,".
      *----------  市場通貨異動後建玉精算金額残
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_TG_SSKGZN,".
      *----------  運用通貨異動後建玉精算金額残
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_TG_SSKGZN,".
      *----------  市場通貨決済時引継前受・前払プレミアム
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_HT_PPAR_PMM,".
      *----------  運用通貨決済時引継前受・前払プレミアム
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_HT_PPAR_PMM,".
      *----------  ＯＰ資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE
               "OP_TATE_FLG,".
      *----------  市場通貨源泉税還付予定異動額
             15  FILLER            PIC  X(18)  VALUE
               "SJTK_GSZKP_YTIDOG,".
      *----------  運用通貨源泉税還付予定異動額
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_GSZKP_YTIDOG,".
      *----------  決済通貨源泉税還付予定異動額
             15  FILLER            PIC  X(18)  VALUE
               "KSTK_GSZKP_YTIDOG,".
      *----------  市場通貨異動後源泉税還付予定額残高
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_GSZKP_YTZN,".
      *----------  運用通貨異動後源泉税還付予定額残高
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_GSZKP_YTZN,".
      *----------  決済通貨異動後源泉税還付予定額残高
             15  FILLER            PIC  X(21)  VALUE
               "KSTK_IDOG_GSZKP_YTZN,".
      *----------  市場通貨異動後ノンカバー未収金残高
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_NOCV_MSKZN,".
      *----------  運用通貨異動後ノンカバー未収金残高
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_NOCV_MSKZN,".
      *----------  市場通貨異動後ノンカバー未払金残高
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_NOCV_MBKZN,".
      *----------  運用通貨異動後ノンカバー未払金残高
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_NOCV_MBKZN,".
      *----------  短期スタート・エンド経過利息
             15  FILLER            PIC  X(20)  VALUE
               "SHORT_STEN_KEKA_RSK,".
      *----------  短期スタート日
             15  FILLER            PIC  X(16)  VALUE
               "SHORT_START_YMD,".
      *----------  短期エンド日
             15  FILLER            PIC  X(14)  VALUE
               "SHORT_END_YMD,".
      *----------  投資対象国コード
             15  FILLER            PIC  X(09)  VALUE
               "TSTSK_CD,".
      *----------  発行国コード
             15  FILLER            PIC  X(08)  VALUE
               "HAKO_CD,".
      *----------  数量単位
             15  FILLER            PIC  X(11)  VALUE
               "SURYO_TANI,".
      *----------  市場通貨異動後未払費用残
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_IDOG_MBHYZN,".
      *----------  運用通貨異動後未払費用残
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_IDOG_MBHYZN,".
      *----------  市場通貨異動後未払消費税残
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_MB_S_TAXZN,".
      *----------  運用通貨異動後未払消費税残
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_MB_S_TAXZN,".
      *----------  市場通貨異動後移管評価損益残
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_IK_HKSEZN,".
      *----------  運用通貨異動後移管評価損益残
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_IK_HKSEZN,".
      *----------  市場通貨異動後移管未収収益
             15  FILLER            PIC  X(21)  VALUE
               "SJTK_IDOG_IK_MSSHEKI,".
      *----------  運用通貨異動後移管未収収益
             15  FILLER            PIC  X(21)  VALUE
               "UYTK_IDOG_IK_MSSHEKI,".
      *----------  運用通貨異動後移管前払金評価損益残
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_IK_PPHKZN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成フラグ
             15  FILLER            PIC  X(07)  VALUE
               "SK_FLG,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新フラグ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID13-1    PIC  X(13).
           10  S-WHERE-1-13.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(02)  VALUE
               " )".
      *----------  残高履歴計算データSQL文(別紙1-15)
         05  SQL-INSERT-1-15.
           10  S-INSERT-1-15.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID15      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)  VALUE
               "KSN_YMD_DMN_KBN,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  数量残高
             15  FILLER            PIC  X(06)  VALUE
               "SRYZN,".
      *----------  市場通貨簿価残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_BOKAZN,".
      *----------  運用通貨簿価残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_BOKAZN,".
      *----------  市場通貨簿価単価
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_BOKA_TNK,".
      *----------  運用通貨簿価単価
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_BOKA_TNK,".
      *----------  簿価為替レート
             15  FILLER            PIC  X(09)  VALUE
               "BOKA_KWS,".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_PPAYZN,".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_PPAYZN,".
      *----------  市場通貨前受金残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_ARECZN,".
      *----------  運用通貨前受金残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_ARECZN,".
      *----------  市場通貨仮払金残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_SPAYZN,".
      *----------  運用通貨仮払金残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_SPAYZN,".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "SJTK_H_TNK,".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "UYTK_H_TNK,".
      *----------  同一コスト継続フラグ
             15  FILLER            PIC  X(18)  VALUE
               "SAME_COST_KZK_FLG,".
      *----------  市場通貨経過利息
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_KEKA_RSK,".
      *----------  運用通貨経過利息
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_KEKA_RSK,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_MS_SHEKI,".
      *----------  運用通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  運用通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_GENSEN_TAX,".
      *----------  評価為替レート
             15  FILLER            PIC  X(08)  VALUE
               "HYK_KWS,".
      *----------  源泉税評価為替レート
             15  FILLER            PIC  X(17)  VALUE
               "GENS_TAX_HYK_KWS,".
      *----------  ファクター・連動係数
             15  FILLER            PIC  X(19)  VALUE
               "FACTOR_RENDOU_KESU,".
      *----------   市場通貨未収収益計上・戻入額
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_MSSE_KJMIG, ".
      *----------  運用通貨未収収益計上・戻入額
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_MSSE_KJMIG, ".
      *----------  数量残高（利付）
             15  FILLER            PIC  X(10)  VALUE
               "SRYZN_RIT,".
      *----------  建玉単価
             15  FILLER            PIC  X(11)  VALUE
               "TGYOKU_TNK,".
      *----------  建玉為替レート
             15  FILLER            PIC  X(16)  VALUE
               "TGYOKU_KWS_RATE,".
      *----------  建玉ブローカー
             15  FILLER            PIC  X(11)  VALUE
               "TGYOKU_BRK,".
      *----------  建玉約定日
             15  FILLER            PIC  X(15)  VALUE
               "TGYOKU_YKJ_YMD,".
      *----------  市場通貨建玉約定金額残
             15  FILLER            PIC  X(15)  VALUE
               "SJTK_TG_YJKNZN,".
      *----------  運用通貨建玉約定金額残
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_TG_YJKNZN,".
      *----------  市場通貨建玉手数料残
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_TG_TSRZN,".
      *----------  運用通貨建玉手数料残
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_TG_TSRZN,".
      *----------  市場通貨建玉消費税残
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_TG_S_TAXZN,".
      *----------  運用通貨建玉消費税残
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_TG_S_TAXZN,".
      *----------  市場通貨建玉その他費用残
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_TG_ELS_HIYOZN,".
      *----------  運用通貨建玉その他費用残
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_TG_ELS_HIYOZN,".
      *----------  市場通貨建玉精算金額残
             15  FILLER            PIC  X(15)  VALUE
               "SJTK_TG_SSKGZN,".
      *----------  運用通貨建玉精算金額残
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_TG_SSKGZN,".
      *----------  ＯＰ資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE
               "OP_TATE_FLG,".
      *----------  市場通貨源泉税還付予定額残高
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GSZKP_YTZN,".
      *----------  運用通貨源泉税還付予定額残高
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_GSZKP_YTZN,".
      *----------  決済通貨源泉税還付予定額残高
             15  FILLER            PIC  X(16)  VALUE
               "KSTK_GSZKP_YTZN,".
      *----------  市場通貨ノンカバー未収金残高
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_NOCV_MSKZN,".
      *----------  運用通貨ノンカバー未収金残高
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_NOCV_MSKZN,".
      *----------  市場通貨ノンカバー未払金残高
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_NOCV_MBKZN,".
      *----------  運用通貨ノンカバー未払金残高
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_NOCV_MBKZN,".
      *----------  短期スタート・エンド経過利息
             15  FILLER            PIC  X(20)  VALUE
               "SHORT_STEN_KEKA_RSK,".
      *----------  短期スタート日
             15  FILLER            PIC  X(16)  VALUE
               "SHORT_START_YMD,".
      *----------  短期エンド日
             15  FILLER            PIC  X(14)  VALUE
               "SHORT_END_YMD,".
      *----------  基本会計ベースフラグ
             15  FILLER            PIC  X(19)  VALUE
               "KH_KAIKEI_BASE_FLG,".
      *----------  投資対象国コード
             15  FILLER            PIC  X(09)  VALUE
               "TSTSK_CD,".
      *----------  発行国コード
             15  FILLER            PIC  X(08)  VALUE
               "HAKO_CD,".
      *----------  数量単位
             15  FILLER            PIC  X(11)  VALUE
               "SURYO_TANI,".
      *----------  市場通貨未払費用残
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_MBHYZN,".
      *----------  運用通貨未払費用残
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_MBHYZN,".
      *----------  市場通貨未払消費税残
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_MB_S_TAXZN,".
      *----------  運用通貨未払消費税残
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_MB_S_TAXZN,".
      *----------  市場通貨移管評価損益残
             15  FILLER            PIC  X(15)  VALUE
               "SJTK_IK_HKSEZN,".
      *----------  運用通貨移管評価損益残
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_IK_HKSEZN,".
      *----------  市場通貨移管未収収益
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_IK_MSSHEKI,".
      *----------  運用通貨移管未収収益
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_IK_MSSHEKI,".
      *----------  運用通貨移管前払金評価損益残
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_IK_PPHKZN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
           10  S-SELECT-1-15.
      *----------  SELECT
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)  VALUE
               "KSN_YMD_DMN_KBN,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  数量残高
             15  FILLER            PIC  X(06)  VALUE
               "SRYZN,".
      *----------  市場通貨簿価残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_BOKAZN,".
      *----------  運用通貨簿価残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_BOKAZN,".
      *----------  市場通貨簿価単価
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_BOKA_TNK,".
      *----------  運用通貨簿価単価
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_BOKA_TNK,".
      *----------  簿価為替レート
             15  FILLER            PIC  X(09)  VALUE
               "BOKA_KWS,".
      *----------  市場通貨前払金残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_PPAYZN,".
      *----------  運用通貨前払金残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_PPAYZN,".
      *----------  市場通貨前受金残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_ARECZN,".
      *----------  運用通貨前受金残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_ARECZN,".
      *----------  市場通貨仮払金残高
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_SPAYZN,".
      *----------  運用通貨仮払金残高
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_SPAYZN,".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "SJTK_H_TNK,".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "UYTK_H_TNK,".
      *----------  同一コスト継続フラグ
             15  FILLER            PIC  X(18)  VALUE
               "SAME_COST_KZK_FLG,".
      *----------  市場通貨経過利息
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_KEKA_RSK,".
      *----------  運用通貨経過利息
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_KEKA_RSK,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_MS_SHEKI,".
      *----------  運用通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  運用通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_GENSEN_TAX,".
      *----------  評価為替レート
             15  FILLER            PIC  X(08)  VALUE
               "HYK_KWS,".
      *----------  源泉税評価為替レート
             15  FILLER            PIC  X(17)  VALUE
               "GENS_TAX_HYK_KWS,".
      *----------  ファクター・連動係数
             15  FILLER            PIC  X(19)  VALUE
               "FACTOR_RENDOU_KESU,".
      *----------   市場通貨未収収益計上・戻入額
             15  FILLER            PIC  X(17)  VALUE
               "SJTK_MSSE_KJMIG, ".
      *----------  運用通貨未収収益計上・戻入額
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_MSSE_KJMIG, ".
      *----------  数量残高（利付）
             15  FILLER            PIC  X(10)  VALUE
               "SRYZN_RIT,".
      *----------  建玉単価
             15  FILLER            PIC  X(11)  VALUE
               "TGYOKU_TNK,".
      *----------  建玉為替レート
             15  FILLER            PIC  X(16)  VALUE
               "TGYOKU_KWS_RATE,".
      *----------  建玉ブローカー
             15  FILLER            PIC  X(11)  VALUE
               "TGYOKU_BRK,".
      *----------  建玉約定日
             15  FILLER            PIC  X(15)  VALUE
               "TGYOKU_YKJ_YMD,".
      *----------  市場通貨建玉約定金額残
             15  FILLER            PIC  X(15)  VALUE
               "SJTK_TG_YJKNZN,".
      *----------  運用通貨建玉約定金額残
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_TG_YJKNZN,".
      *----------  市場通貨建玉手数料残
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_TG_TSRZN,".
      *----------  運用通貨建玉手数料残
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_TG_TSRZN,".
      *----------  市場通貨建玉消費税残
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_TG_S_TAXZN,".
      *----------  運用通貨建玉消費税残
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_TG_S_TAXZN,".
      *----------  市場通貨建玉その他費用残
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_TG_ELS_HIYOZN,".
      *----------  運用通貨建玉その他費用残
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_TG_ELS_HIYOZN,".
      *----------  市場通貨建玉精算金額残
             15  FILLER            PIC  X(15)  VALUE
               "SJTK_TG_SSKGZN,".
      *----------  運用通貨建玉精算金額残
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_TG_SSKGZN,".
      *----------  ＯＰ資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE
               "OP_TATE_FLG,".
      *----------  市場通貨源泉税還付予定額残高
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GSZKP_YTZN,".
      *----------  運用通貨源泉税還付予定額残高
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_GSZKP_YTZN,".
      *----------  決済通貨源泉税還付予定額残高
             15  FILLER            PIC  X(16)  VALUE
               "KSTK_GSZKP_YTZN,".
      *----------  市場通貨ノンカバー未収金残高
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_NOCV_MSKZN,".
      *----------  運用通貨ノンカバー未収金残高
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_NOCV_MSKZN,".
      *----------  市場通貨ノンカバー未払金残高
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_NOCV_MBKZN,".
      *----------  運用通貨ノンカバー未払金残高
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_NOCV_MBKZN,".
      *----------  短期スタート・エンド経過利息
             15  FILLER            PIC  X(20)  VALUE
               "SHORT_STEN_KEKA_RSK,".
      *----------  短期スタート日
             15  FILLER            PIC  X(16)  VALUE
               "SHORT_START_YMD,".
      *----------  短期エンド日
             15  FILLER            PIC  X(14)  VALUE
               "SHORT_END_YMD,".
      *----------  基本会計ベースフラグ
             15  FILLER            PIC  X(19)  VALUE
               "KH_KAIKEI_BASE_FLG,".
      *----------  投資対象国コード
             15  FILLER            PIC  X(09)  VALUE
               "TSTSK_CD,".
      *----------  発行国コード
             15  FILLER            PIC  X(08)  VALUE
               "HAKO_CD,".
      *----------  数量単位
             15  FILLER            PIC  X(11)  VALUE
               "SURYO_TANI,".
      *----------  市場通貨未払費用残
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_MBHYZN,".
      *----------  運用通貨未払費用残
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_MBHYZN,".
      *----------  市場通貨未払消費税残
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_MB_S_TAXZN,".
      *----------  運用通貨未払消費税残
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_MB_S_TAXZN,".
      *----------  市場通貨移管評価損益残
             15  FILLER            PIC  X(15)  VALUE
               "SJTK_IK_HKSEZN,".
      *----------  運用通貨移管評価損益残
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_IK_HKSEZN,".
      *----------  市場通貨移管未収収益
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_IK_MSSHEKI,".
      *----------  運用通貨移管未収収益
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_IK_MSSHEKI,".
      *----------  運用通貨移管前払金評価損益残
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_IK_PPHKZN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID15-1    PIC  X(13).
           10  S-WHERE-1-15.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(02)  VALUE
               " )".
      *----------  元本残高計算データSQL文(別紙1-17)
         05  SQL-INSERT-1-17.
           10  S-INSERT-1-17.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID17      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)  VALUE
               "KSN_YMD_DMN_KBN,".
      *----------  元本数量残高
             15  FILLER            PIC  X(10)  VALUE
               "GNP_SRYZN,".
      *----------  元本簿価残高
             15  FILLER            PIC  X(11)  VALUE
               "GNP_BOKAZN,".
      *----------  総投入金額
             15  FILLER            PIC  X(10)  VALUE
               "SO_TN_KGK,".
      *----------  初期設定金額
             15  FILLER            PIC  X(14)  VALUE
               "SHOKI_SET_KGK,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
           10  S-SELECT-1-17.
      *----------  SELECT
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)  VALUE
               "KSN_YMD_DMN_KBN,".
      *----------  元本数量残高
             15  FILLER            PIC  X(10)  VALUE
               "GNP_SRYZN,".
      *----------  元本簿価残高
             15  FILLER            PIC  X(11)  VALUE
               "GNP_BOKAZN,".
      *----------  総投入金額
             15  FILLER            PIC  X(10)  VALUE
               "SO_TN_KGK,".
      *----------  初期設定金額
             15  FILLER            PIC  X(14)  VALUE
               "SHOKI_SET_KGK,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID17-1    PIC  X(13).
           10  S-WHERE-1-17.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(02)  VALUE
               " )".
      *----------  資金簿価異動計算データSQL文(別紙1-19)
         05  SQL-INSERT-1-19.
           10  S-INSERT-1-19.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID19      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  決済口座番号
             15  FILLER            PIC  X(11)  VALUE
               "KS_KOZA_NO,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  誤計上№
             15  FILLER            PIC  X(11)  VALUE
               "ERR_KJY_NO,".
      *----------  誤計上区分
             15  FILLER            PIC  X(12)  VALUE
               "ERR_KJY_KBN,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  取引連関ID
             15  FILLER            PIC  X(08)  VALUE
               "THRK_ID,".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "KOZA_TUKA_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  市場通貨資金簿価異動額
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_SK_BOKA_IDOGK,".
      *----------  運用通貨資金簿価異動額
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_SK_BOKA_IDOGK,".
      *----------  市場通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_H_BOKA,".
      *----------  運用通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_H_BOKA,".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "SJTK_H_TNK,".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "UYTK_H_TNK,".
      *----------  簿価為替レート
             15  FILLER            PIC  X(09)  VALUE
               "BOKA_KWS,".
      *----------  市場通貨異動後ＣＡＳＨ残高
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_SK_BOKAZN,".
      *----------  運用通貨異動後ＣＡＳＨ残高
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_SK_BOKAZN,".
      *----------  市場通貨異動後未収入金残高（内物）
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_MSNKZN_UM,".
      *----------  運用通貨異動後未収入金残高（内物）
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_MSNKZN_UM,".
      *----------  市場通貨異動後未収入金残高（外物）
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_MSNKZN_SM,".
      *----------  運用通貨異動後未収入金残高（外物）
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_MSNKZN_SM,".
      *----------  市場通貨異動後未払金残高（内物）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_IDOG_MBKZN_UM,".
      *----------  運用通貨異動後未払金残高（内物）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_IDOG_MBKZN_UM,".
      *----------  市場通貨異動後未払金残高（外物）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_IDOG_MBKZN_SM,".
      *----------  運用通貨異動後未払金残高（外物）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_IDOG_MBKZN_SM,".
      *----------  為替差損益
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_KWS_SNEKI,".
      *----------  市場通貨利金等損益勘定
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_RKSEKJ,".
      *----------  運用通貨利金等損益勘定
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_RKSEKJ,".
      *----------  異動計上順序
             15  FILLER            PIC  X(12)  VALUE
               "IDO_KJY_JUN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成フラグ
             15  FILLER            PIC  X(07)  VALUE
               "SK_FLG,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新フラグ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
           10  S-SELECT-1-19.
      *----------  SELECT
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  決済口座番号
             15  FILLER            PIC  X(11)  VALUE
               "KS_KOZA_NO,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  誤計上№
             15  FILLER            PIC  X(11)  VALUE
               "ERR_KJY_NO,".
      *----------  誤計上区分
             15  FILLER            PIC  X(12)  VALUE
               "ERR_KJY_KBN,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  取引連関ID
             15  FILLER            PIC  X(08)  VALUE
               "THRK_ID,".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "KOZA_TUKA_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  市場通貨資金簿価異動額
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_SK_BOKA_IDOGK,".
      *----------  運用通貨資金簿価異動額
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_SK_BOKA_IDOGK,".
      *----------  市場通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_H_BOKA,".
      *----------  運用通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_H_BOKA,".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "SJTK_H_TNK,".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(11)  VALUE
               "UYTK_H_TNK,".
      *----------  簿価為替レート
             15  FILLER            PIC  X(09)  VALUE
               "BOKA_KWS,".
      *----------  市場通貨異動後ＣＡＳＨ残高
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_SK_BOKAZN,".
      *----------  運用通貨異動後ＣＡＳＨ残高
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_SK_BOKAZN,".
      *----------  市場通貨異動後未収入金残高（内物）
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_MSNKZN_UM,".
      *----------  運用通貨異動後未収入金残高（内物）
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_MSNKZN_UM,".
      *----------  市場通貨異動後未収入金残高（外物）
             15  FILLER            PIC  X(20)  VALUE
               "SJTK_IDOG_MSNKZN_SM,".
      *----------  運用通貨異動後未収入金残高（外物）
             15  FILLER            PIC  X(20)  VALUE
               "UYTK_IDOG_MSNKZN_SM,".
      *----------  市場通貨異動後未払金残高（内物）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_IDOG_MBKZN_UM,".
      *----------  運用通貨異動後未払金残高（内物）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_IDOG_MBKZN_UM,".
      *----------  市場通貨異動後未払金残高（外物）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_IDOG_MBKZN_SM,".
      *----------  運用通貨異動後未払金残高（外物）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_IDOG_MBKZN_SM,".
      *----------  為替差損益
             15  FILLER            PIC  X(15)  VALUE
               "UYTK_KWS_SNEKI,".
      *----------  市場通貨利金等損益勘定
             15  FILLER            PIC  X(12)  VALUE
               "SJTK_RKSEKJ,".
      *----------  運用通貨利金等損益勘定
             15  FILLER            PIC  X(12)  VALUE
               "UYTK_RKSEKJ,".
      *----------  異動計上順序
             15  FILLER            PIC  X(12)  VALUE
               "IDO_KJY_JUN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成フラグ
             15  FILLER            PIC  X(07)  VALUE
               "SK_FLG,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新フラグ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID19-1    PIC  X(13).
           10  S-WHERE-1-19.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(02)  VALUE
               " )".
      *----------  資金残履歴計算データSQL文(別紙1-21)
         05  SQL-INSERT-1-21.
           10  S-INSERT-1-21.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID21      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  決済口座番号
             15  FILLER            PIC  X(11)  VALUE
               "KS_KOZA_NO,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)  VALUE
               "KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "KOZA_TUKA_CD,".
      *----------  市場通貨当日ＣＡＳＨ残高
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_TJT_CASHZN,".
      *----------  運用通貨当日ＣＡＳＨ残高
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_TJT_CASHZN,".
      *----------  市場通貨当日未収入金残高（内物）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_TJT_MSNKZN_UM,".
      *----------  運用通貨当日未収入金残高（内物）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_TJT_MSNKZN_UM,".
      *----------  市場通貨当日未収入金残高（外物）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_TJT_MSNKZN_SM,".
      *----------  運用通貨当日未収入金残高（外物）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_TJT_MSNKZN_SM,".
      *----------  市場通貨当日未払金残高（内物）
             15  FILLER            PIC  X(18)  VALUE
               "SJTK_TJT_MBKZN_UM,".
      *----------  運用通貨当日未払金残高（内物）
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_TJT_MBKZN_UM,".
      *----------  市場通貨当日未払金残高（外物）
             15  FILLER            PIC  X(18)  VALUE
               "SJTK_TJT_MBKZN_SM,".
      *----------  運用通貨当日未払金残高（外物）
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_TJT_MBKZN_SM,".
      *----------  簿価為替レート
             15  FILLER            PIC  X(09)  VALUE
               "BOKA_KWS,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_MS_SHEKI,".
      *----------  運用通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  運用通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_GENSEN_TAX,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID, ".
      *----------  市場通貨未収収益計上・戻入額
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_MSSE_KJMIG,".
      *----------  運用通貨未収収益計上・戻入額
             15  FILLER            PIC  X(17)  VALUE
               "UYTK_MSSE_KJMIG) ".
           10  S-SELECT-1-21.
      *----------  SELECT
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  決済口座番号
             15  FILLER            PIC  X(11)  VALUE
               "KS_KOZA_NO,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)  VALUE
               "KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "KOZA_TUKA_CD,".
      *----------  市場通貨当日ＣＡＳＨ残高
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_TJT_CASHZN,".
      *----------  運用通貨当日ＣＡＳＨ残高
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_TJT_CASHZN,".
      *----------  市場通貨当日未収入金残高（内物）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_TJT_MSNKZN_UM,".
      *----------  運用通貨当日未収入金残高（内物）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_TJT_MSNKZN_UM,".
      *----------  市場通貨当日未収入金残高（外物）
             15  FILLER            PIC  X(19)  VALUE
               "SJTK_TJT_MSNKZN_SM,".
      *----------  運用通貨当日未収入金残高（外物）
             15  FILLER            PIC  X(19)  VALUE
               "UYTK_TJT_MSNKZN_SM,".
      *----------  市場通貨当日未払金残高（内物）
             15  FILLER            PIC  X(18)  VALUE
               "SJTK_TJT_MBKZN_UM,".
      *----------  運用通貨当日未払金残高（内物）
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_TJT_MBKZN_UM,".
      *----------  市場通貨当日未払金残高（外物）
             15  FILLER            PIC  X(18)  VALUE
               "SJTK_TJT_MBKZN_SM,".
      *----------  運用通貨当日未払金残高（外物）
             15  FILLER            PIC  X(18)  VALUE
               "UYTK_TJT_MBKZN_SM,".
      *----------  簿価為替レート
             15  FILLER            PIC  X(09)  VALUE
               "BOKA_KWS,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "SJTK_MS_SHEKI,".
      *----------  運用通貨未収収益
             15  FILLER            PIC  X(14)  VALUE
               "UYTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX,".
      *----------  運用通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_GENSEN_TAX,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID, ".
      *----------  市場通貨未収収益計上・戻入額
             15  FILLER            PIC  X(16)  VALUE
               "SJTK_MSSE_KJMIG,".
      *----------  運用通貨未収収益計上・戻入額
             15  FILLER            PIC  X(16)  VALUE
               "UYTK_MSSE_KJMIG ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID21-1    PIC  X(13).
           10  S-WHERE-1-21.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(02)  VALUE
               " )".
      *----------  勘定異動計算データSQL文(別紙1-23)
         05  SQL-INSERT-1-23.
           10  S-INSERT-1-23.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID23      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  仕訳№
             15  FILLER            PIC  X(07)  VALUE
               "SWK_NO,".
      *----------  計上基準日
             15  FILLER            PIC  X(15)  VALUE
               "KEIJOU_KIJUNBI,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  勘定科目コード
             15  FILLER            PIC  X(12)  VALUE
               "KNJ_KAMK_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  誤計上№
             15  FILLER            PIC  X(11)  VALUE
               "ERR_KJY_NO,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  関連計上日
             15  FILLER            PIC  X(16)  VALUE
               "KANREN_KEIJOUBI,".
      *----------  取引連関ID
             15  FILLER            PIC  X(08)  VALUE
               "THRK_ID,".
      *----------  取引内容
             15  FILLER            PIC  X(10)  VALUE
               "TORI_NAIY,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  計上額
             15  FILLER            PIC  X(07)  VALUE
               "KJY_GK,".
      *----------  誤計上区分
             15  FILLER            PIC  X(12)  VALUE
               "ERR_KJY_KBN,".
      *----------  貸借区分
             15  FILLER            PIC  X(11)  VALUE
               "TAISHK_KBN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
           10  S-SELECT-1-23.
      *----------  SELECT
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  仕訳№
             15  FILLER            PIC  X(07)  VALUE
               "SWK_NO,".
      *----------  計上基準日
             15  FILLER            PIC  X(15)  VALUE
               "KEIJOU_KIJUNBI,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  勘定科目コード
             15  FILLER            PIC  X(12)  VALUE
               "KNJ_KAMK_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  誤計上№
             15  FILLER            PIC  X(11)  VALUE
               "ERR_KJY_NO,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  関連計上日
             15  FILLER            PIC  X(16)  VALUE
               "KANREN_KEIJOUBI,".
      *----------  取引連関ID
             15  FILLER            PIC  X(08)  VALUE
               "THRK_ID,".
      *----------  取引内容
             15  FILLER            PIC  X(10)  VALUE
               "TORI_NAIY,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  計上額
             15  FILLER            PIC  X(07)  VALUE
               "KJY_GK,".
      *----------  誤計上区分
             15  FILLER            PIC  X(12)  VALUE
               "ERR_KJY_KBN,".
      *----------  貸借区分
             15  FILLER            PIC  X(11)  VALUE
               "TAISHK_KBN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID23-1    PIC  X(13).
           10  S-WHERE-1-23.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(02)  VALUE
               " )".
      *----------  勘定残高計算データSQL文(別紙1-25)
         05  SQL-INSERT-1-25.
           10  S-INSERT-1-25.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID25      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  評価系列コード
             15  FILLER            PIC  X(12)  VALUE
               "HYK_KRTU_CD,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)  VALUE
               "KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  勘定科目コード
             15  FILLER            PIC  X(12)  VALUE
               "KNJ_KAMK_CD,".
      *----------  貸借区分
             15  FILLER            PIC  X(11)  VALUE
               "TAISHK_KBN,".
      *----------  勘定残高
             15  FILLER            PIC  X(06)  VALUE
               "KNJZN,".
      *----------  勘定異動額（期間・借方）
             15  FILLER            PIC  X(19)  VALUE
               "KNJ_IDOK_KKN_DEBIT,".
      *----------  勘定異動額（期間・貸方）
             15  FILLER            PIC  X(20)  VALUE
               "KNJ_IDOK_KKN_CREDIT,".
      *----------  勘定異動額（当日・借方）
             15  FILLER            PIC  X(19)  VALUE
               "KNJ_IDOK_TJT_DEBIT,".
      *----------  勘定異動額（当日・貸方）
             15  FILLER            PIC  X(20)  VALUE
               "KNJ_IDOK_TJT_CREDIT,".
      *----------  異動計上開始日
             15  FILLER            PIC  X(13)  VALUE
               "IDO_KJY_FROM,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID )".
           10  S-SELECT-1-23.
      *----------  SELECT
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  評価系列コード
             15  FILLER            PIC  X(12)  VALUE
               "HYK_KRTU_CD,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  決算日断面区分
             15  FILLER            PIC  X(16)  VALUE
               "KSN_YMD_DMN_KBN,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  勘定科目コード
             15  FILLER            PIC  X(12)  VALUE
               "KNJ_KAMK_CD,".
      *----------  貸借区分
             15  FILLER            PIC  X(11)  VALUE
               "TAISHK_KBN,".
      *----------  勘定残高
             15  FILLER            PIC  X(06)  VALUE
               "KNJZN,".
      *----------  勘定異動額（期間・借方）
             15  FILLER            PIC  X(19)  VALUE
               "KNJ_IDOK_KKN_DEBIT,".
      *----------  勘定異動額（期間・貸方）
             15  FILLER            PIC  X(20)  VALUE
               "KNJ_IDOK_KKN_CREDIT,".
      *----------  勘定異動額（当日・借方）
             15  FILLER            PIC  X(19)  VALUE
               "KNJ_IDOK_TJT_DEBIT,".
      *----------  勘定異動額（当日・貸方）
             15  FILLER            PIC  X(20)  VALUE
               "KNJ_IDOK_TJT_CREDIT,".
      *----------  異動計上開始日
             15  FILLER            PIC  X(16)  VALUE
               ":P_IDO_KJY_FROM,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID25-1    PIC  X(13).
           10  S-WHERE-1-25.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(02)  VALUE
               " )".
      *----------  基準日計算情報SQL文(別紙1-30)
         05  SQL-UPDATE-1-30.
           10  S-UPDATE-1-30.
             15  FILLER            PIC  X(07)  VALUE
               "UPDATE ".
             15  SQL-TBL-ID30      PIC  X(13).
             15  FILLER            PIC  X(05)  VALUE
               " SET ".
      *----------  仕訳基準パターンコード
             15  FILLER            PIC  X(33)  VALUE
               "SWK_KJN_PTN_CD=:P_SWK_KJN_PTN_CD,".
      *----------  異動計算パターンコード
             15  FILLER            PIC  X(43)  VALUE
               "IDO_CALC_PATTERN_CD=:P_IDO_CALC_PATTERN_CD,".
      *----------  更新日時
             15  FILLER            PIC  X(17)  VALUE
               "UPD_DATE=SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(32)  VALUE
               "UPD_LOGIN_CMP_CD=:P_RIYO_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(19)  VALUE
               "UPD_SID=:P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(20)  VALUE
               "UPD_PGMID='SMZJ2310'".
           10  S-WHERE-1-30.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(23)  VALUE
               " AND FUND_CD=:P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(21)  VALUE
               " AND PTF_CD=:P_PTF_CD".
      *----------  基準日
             15  FILLER            PIC  X(23)  VALUE
               " AND KJN_YMD=:P_KJN_YMD".
      *----------  基準日計算情報SQL文(別紙1-31)
         05  SQL-INSERT-1-31.
           10  S-INSERT-1-31.
      *---------- INSERT
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID31      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  仕訳基準パターンコード
             15  FILLER            PIC  X(15)  VALUE
               "SWK_KJN_PTN_CD,".
      *----------  異動計算パターンコード
             15  FILLER            PIC  X(20)  VALUE
               "IDO_CALC_PATTERN_CD,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SK_DATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(16)  VALUE
               "SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(07)  VALUE
               "SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(09)  VALUE
               "SK_PGMID,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
      *----------  VALUES
             15  FILLER            PIC  X(09)  VALUE
               "VALUES ( ".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE
               ":P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE
               ":P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE
               ":P_PTF_CD,".
      *----------  基準日
             15  FILLER            PIC  X(11)  VALUE
               ":P_KJN_YMD,".
      *----------  仕訳基準パターンコード
             15  FILLER            PIC  X(18)  VALUE
               ":P_SWK_KJN_PTN_CD,".
      *----------  異動計算パターンコード
             15  FILLER            PIC  X(23)  VALUE
               ":P_IDO_CALC_PATTERN_CD,".
      *----------  削除区分
             15  FILLER            PIC  X(14)  VALUE
               ":P_SAKUJO_KBN,".
      *----------  作成日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
             15  FILLER            PIC  X(19)  VALUE
               ":P_SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
             15  FILLER            PIC  X(10)  VALUE
               ":P_SK_SID,".
      *----------  作成プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "'SMZJ2310',".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(11)  VALUE
               ":P_UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "'SMZJ2310')".
      *----------  残高異動SQL文(別紙1-32)
         05  SQL-UPDATE-1-32.
           10  S-UPDATE-1-32.
             15  FILLER            PIC  X(07)  VALUE
               "UPDATE ".
             15  SQL-TBL-ID32      PIC  X(13).
             15  FILLER            PIC  X(05)  VALUE
               " SET ".
      *----------  赤黒区分
             15  FILLER            PIC  X(11)  VALUE
               "AKA_KBN=' '".
           10  S-WHERE-1-32.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(23)  VALUE
               " AND FUND_CD=:P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(21)  VALUE
               " AND PTF_CD=:P_PTF_CD".
      *----------  赤黒区分
             15  FILLER            PIC  X(16)  VALUE
               " AND AKA_KBN='9'".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- SELECT SQL文(別紙1-1)
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW08         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SELECT SQL文(別紙1-2)
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMS00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *---------- ファンドコード
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
      *---------- ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
      *---------- 証券種別コード
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
      *---------- 銘柄コード
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
      *---------- 資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
      *---------- 玉ＩＤ
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
      *---------- 適用開始日
           10  FILLER              PIC  X(20)  VALUE
               "' AND TEKIYO_FROM = ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *---------- 権利落日
           10  FILLER              PIC  X(20)  VALUE
               " AND KENRI_OTI_YMD =".
           10  WK-KENRI-OTI-YMD    PIC  S9(08).
      *---------- UPDATE SQL文(別紙1-3)
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMS00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *---------- 市場通貨コード
           10  FILLER              PIC  X(18)  VALUE
               "SET SIJO_TUKA_CD='".
           10  WK-SIJO-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 権利付数量
           10  FILLER              PIC  X(08)  VALUE
               "RIT_SRY=".
           10  WK-RIT-SRY          PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨未収収益
           10  FILLER              PIC  X(14)  VALUE
               "SJTK_MS_SHEKI=".
           10  WK-SJTK-MS-SHEKI    PIC  S9(15)V9(03).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨源泉税
           10  FILLER              PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX=".
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 未入金対象数量残高
           10  FILLER              PIC  X(16)  VALUE
               "MNK_TSHO_SRYZN='".
           10  WK-MNK-TSHO-SRYZN   PIC  S9(12)V9(06).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新フラグ
           10  FILLER              PIC  X(12)  VALUE
               "UPD_FLG='3',".
      *---------- 更新日時
           10  FILLER              PIC  X(17)  VALUE
               "UPD_DATE=SYSDATE,".
      *---------- 更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)  VALUE
               "UPD_LOGIN_CMP_CD='".
           10  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新ユーザＩＤ
           10  FILLER              PIC  X(09)  VALUE
               "UPD_SID='".
           10  WK-UPD-SID          PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新プログラムＩＤ
           10  FILLER              PIC  X(20)  VALUE
               "UPD_PGMID='SMZJ2310'".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *---------- ファンドコード
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
      *---------- ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
      *---------- 証券種別コード
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
      *---------- 銘柄コード
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
      *---------- 資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
      *---------- 玉ＩＤ
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
      *---------- 適用開始日
           10  FILLER              PIC  X(20)  VALUE
               "' AND TEKIYO_FROM = ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *---------- 権利落日
           10  FILLER              PIC  X(20)  VALUE
               " AND KENRI_OTI_YMD =".
           10  WK-KENRI-OTI-YMD    PIC  S9(08).
      *----------  INSERT  SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMS00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(12)  VALUE
               "INSERT DATA ".
      *---------- 利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- ファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 銘柄コード
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 資産/負債・買建/売建フラグ
           10  WK-TATE-FLG         PIC  X(01).
      *---------- 玉ＩＤ
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 適用開始日
           10  WK-TEKIYO-FROM      PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 権利落日
           10  WK-KENRI-OTI-YMD    PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 権利付数量
           10  WK-RIT-SRY          PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨未収収益
           10  WK-SJTK-MS-SHEKI    PIC  S9(15)V9(03).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨未収収益（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999999.999,".
      *---------- 市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨源泉税（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999999.999,".
      *---------- 運用通貨未収収益（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999999.999,".
      *---------- 運用通貨源泉税（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999999.999,".
      *---------- 評価為替レート（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "99999999.9999999999,".
      *---------- 源泉税評価為替レート（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "99999999.9999999999,".
      *---------- 未入金対象数量残高
           10  WK-MNK-TSHO-SRYZN   PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 未入金対象数量残高（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999.999999,".
      *---------- 発行国コード
           10  FILLER              PIC  X(02)  VALUE
               " ,".
      *---------- 投資対象国コード
           10  FILLER              PIC  X(02)  VALUE
               " ,".
      *---------- 削除区分
           10  WK-SAKUJO-KBN       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 作成フラグ
           10  FILLER              PIC  X(04)  VALUE
               "'3',".
      *---------- 作成日時
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- 作成ログインユーザ会社コード
           10  WK-SK-LOGIN-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *---------- 作成ユーザＩＤ
           10  WK-SK-SID           PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 作成プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE
               "'SMZJ2310',".
      *---------- 更新フラグ
           10  FILLER              PIC  X(04)  VALUE
               "'3',".
      *---------- 更新日時
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
      *---------- 更新ログインユーザ会社コード
           10  FILLER              PIC  X(01)  VALUE
               "'".
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *---------- 更新ユーザＩＤ
           10  WK-UPD-SID          PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新プログラムＩＤ
           10  FILLER              PIC  X(10)  VALUE
               "'SMZJ2310'".
      *---------- SELECT SQL文(別紙1-6)
         05  WK-MSG-1-6.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW09         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SELECT SQL文(別紙1-7)
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *---------- ファンドコード
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
      *---------- ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
      *---------- 証券種別コード
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
      *---------- 銘柄コード
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
      *---------- 資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
      *---------- 玉ＩＤ
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
      *---------- 適用開始日
           10  FILLER              PIC  X(20)  VALUE
               "' AND TEKIYO_FROM = ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *---------- 利払日
           10  FILLER              PIC  X(15)  VALUE
               " AND RIB_YMD = ".
           10  WK-RIB-YMD          PIC  S9(08).
      *---------- UPDATE SQL文(別紙1-8)
         05  WK-MSG-1-8.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *---------- 市場通貨コード
           10  FILLER              PIC  X(18)  VALUE
               "SET SIJO_TUKA_CD='".
           10  WK-SIJO-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 利払対象額面
           10  FILLER              PIC  X(14)  VALUE
               "RIB_TSHO_FACE=".
           10  WK-RIB-TSHO-FACE    PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨経過利息
           10  FILLER              PIC  X(14)  VALUE
               "SJTK_KEKA_RSK=".
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 未入金対象額面残高
           10  FILLER              PIC  X(18)  VALUE
               "MNK_TSHO_FACE_ZAN=".
           10  WK-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 市場通貨源泉税
           10  FILLER              PIC  X(16)  VALUE
               "SJTK_GENSEN_TAX=".
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- ファクター・連動係数
           10  FILLER              PIC  X(19)  VALUE
               "FACTOR_RENDOU_KESU=".
           10  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 更新フラグ
           10  FILLER              PIC  X(12)  VALUE
               "UPD_FLG='3',".
      *---------- 更新日時
           10  FILLER              PIC  X(17)  VALUE
               "UPD_DATE=SYSDATE,".
      *---------- 更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)  VALUE
               "UPD_LOGIN_CMP_CD='".
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新ユーザＩＤ
           10  FILLER              PIC  X(09)  VALUE
               "UPD_SID='".
           10  WK-UPD-SID          PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新プログラムＩＤ
           10  FILLER              PIC  X(20)  VALUE
               "UPD_PGMID='SMZJ2310'".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *---------- ファンドコード
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
      *---------- ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
      *---------- 証券種別コード
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
      *---------- 銘柄コード
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
      *---------- 資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
      *---------- 玉ＩＤ
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
      *---------- 適用開始日
           10  FILLER              PIC  X(20)  VALUE
               "' AND TEKIYO_FROM = ".
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *---------- 利払日
           10  FILLER              PIC  X(14)  VALUE
               " AND RIB_YMD =".
           10  WK-RIB-YMD          PIC  S9(08).
      *---------- INSER SQL文(別紙1-9)
         05  WK-MSG-1-9.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(12)  VALUE
               "INSERT DATA ".
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  銘柄コード
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  資産/負債・買建/売建フラグ
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  玉ＩＤ
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  適用開始日
           10  WK-TEKIYO-FROM      PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  利払日
           10  WK-RIB-YMD          PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  利払対象額面
           10  WK-RIB-TSHO-FACE    PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  市場通貨経過利息金額
           10  WK-SJTK-KEKA-RSK    PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  市場通貨経過利息金額（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999.999999,".
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX  PIC  S9(15)V9(03).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  市場通貨源泉税（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999999.999,".
      *----------  運用通貨経過利息金額（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999.999999,".
      *----------  運用通貨源泉税（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999999.999,".
      *----------  評価為替レート（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "99999999.9999999999,".
      *----------  源泉税評価為替レート（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "99999999.9999999999,".
      *----------  ファクター・連動係数
           10  WK-FACTOR-RENDOU-KESU
                                   PIC  S9(08)V9(10).
           10  FILLER              PIC  X(02)  VALUE
               ",".
      *----------  ファクター・連動係数（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "99999999.9999999999,".
      *----------  未入金対象額面残高
           10  WK-MNK-TSHO-FACE-ZAN
                                   PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  未入金対象額面残高（入力値）
           10  FILLER              PIC  X(20)  VALUE
               "999999999999.999999,".
      *---------- 発行国コード
           10  FILLER              PIC  X(02)  VALUE
               " ,".
      *---------- 投資対象国コード
           10  FILLER              PIC  X(02)  VALUE
               " ,".
      *----------  削除区分
           10  WK-SAKUJO-KBN       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  作成フラグ
           10  FILLER              PIC  X(04)  VALUE
               "'3',".
      *----------  作成日時
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  作成ログインユーザ会社コード
           10  FILLER              PIC  X(01)  VALUE
               "'".
           10  WK-SK-LOGIN-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  作成ユーザＩＤ
           10  FILLER              PIC  X(01)  VALUE
               "'".
           10  WK-SK-SID           PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  作成プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE
               "'SMZJ2310',".
      *----------  更新フラグ
           10  FILLER              PIC  X(04)  VALUE
               "'3',".
      *----------  更新日時
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(01)  VALUE
               "'".
           10  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(01)  VALUE
               "'".
           10  WK-UPD-SID          PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE
               "'SMZJ2310')".
      *---------- INSERT SELECT SQL文(別紙1-11)
         05  WK-MSG-1-11.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW10         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TKMZMB00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理フラグ
           10  FILLER              PIC  X(10)  VALUE
               "SYRI_FLG='".
           10  WK-SYRI-FLG         PIC  X(01).
      *----------  処理実行日
           10  FILLER              PIC  X(16)  VALUE
               "' AND SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
      *----------  起動ID
           10  FILLER              PIC  X(15)  VALUE
               " AND KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- INSERT SELECT SQL文(別紙1-13)
         05  WK-MSG-1-13.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW06         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TKMZZI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- INSERT SELECT SQL文(別紙1-15)
         05  WK-MSG-1-15.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW11         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TKMZZR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- INSERT SELECT SQL文(別紙1-17)
         05  WK-MSG-1-17.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW13         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TKMZGZ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- INSERT SELECT SQL文(別紙1-19)
         05  WK-MSG-1-19.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW07         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TKMZSI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- INSERT SELECT SQL文(別紙1-21)
         05  WK-MSG-1-21.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW12         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TKMZSR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- INSERT SELECT SQL文(別紙1-23)
         05  WK-MSG-1-23.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW15         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TKMZKI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- INSERT SELECT SQL文(別紙1-25)
         05  WK-MSG-1-25.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW16         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TKMZKZ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD=".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "WHERE RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- UPDATE SQL文(別紙1-30)
         05  WK-MSG-1-30.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKK00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *---------- 仕訳基準パターンコード
           10  FILLER              PIC  X(20)  VALUE
               "SET SWK_KJN_PTN_CD='".
           10  WK-SWK-KJN-PTN-CD   PIC  X(08).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 異動計算パターンコード
           10  FILLER              PIC  X(21)  VALUE
               "IDO_CALC_PATTERN_CD='".
           10  WK-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新日時
           10  FILLER              PIC  X(17)  VALUE
               "UPD_DATE=SYSDATE,".
      *---------- 更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)  VALUE
               "UPD_LOGIN_CMP_CD='".
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新ユーザＩＤ
           10  FILLER              PIC  X(09)  VALUE
               "UPD_SID='".
           10  WK-UPD-SID          PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新プログラムＩＤ
           10  FILLER              PIC  X(20)  VALUE
               "UPD_PGMID='SMZJ2310'".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *---------- 利用会社コード
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *---------- ファンドコード
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
      *---------- ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
      *---------- 基準日
           10  FILLER              PIC  X(15)  VALUE
               "' AND KJN_YMD =".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- INSERT SQL文(別紙1-31)
         05  WK-MSG-1-31.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKK00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(12)  VALUE
               "INSERT DATA ".
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  基準日
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  仕訳基準パターンコード
           10  WK-SWK-KJN-PTN-CD   PIC  X(08).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  異動計算パターンコード
           10  WK-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 削除区分
           10  WK-SAKUJO-KBN       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *---------- 作成日時
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- 作成ログインユーザ会社コード
           10  WK-SK-LOGIN-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *---------- 作成ユーザＩＤ
           10  WK-SK-SID           PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 作成プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE
               "'SMZJ2310',".
      *---------- 更新日時
           10  FILLER              PIC  X(08)  VALUE
               "SYSDATE,".
      *---------- 更新ログインユーザ会社コード
           10  FILLER              PIC  X(01)  VALUE
               "'".
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *---------- 更新ユーザＩＤ
           10  WK-UPD-SID          PIC  X(20).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *---------- 更新プログラムＩＤ
           10  FILLER              PIC  X(10)  VALUE
               "'SMZJ2310'".
      *---------- UPDATE SQL文(別紙1-32)
         05  WK-MSG-1-32.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZZI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  赤黒区分
           10  WK-KJN-YMD          PIC  X(01).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  【SMZJ4016】中間データ削除
       01  PARM-SMZJ4016-INOUT.
           COPY  "SMZJ4016.cpy".
      *---------- テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  ARG2リターンパッケージセットルーチン
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ2310-IN.
           COPY  "SMZJ2310.cpy".
       01  PARM-SMZJ2310-RTNPKG.
         05  PARM-SMZJ2310-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ2310-IN
                  PARM-SMZJ2310-RTNPKG.
      ******************************************************************
      *                 DB更新
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ2310処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ2310処理   END   ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *                 3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBL-ID-INIT-RTN
      *----------  3.1.2 テーブルID取得処理2
           PERFORM  TBL-ID-INIT2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  HST-AREA
                       FLG-AREA
                       WORK-AREA
                       SQL-AREA
                       E-MSG-TBL
                       PARM-SMZJ4016-INOUT
                       PARM-SCZY1160-INOUT
                       PARM-SCZY1170-IN
                       PARM-SCZY1170-RTNPKG
                       PARM-RTNPKG
                       PARM-SMZJ2310-ARG2
                       PARM-SMZJ2310-ARG3
      *----初回コール時のみFLG-AREAを初期化する                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FIRST-SW = ["FIRST-SW"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FIRST-SW = 'YES'                                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
             INITIALIZE  FLG-AREA2                                      @3212SEINO@@
             MOVE  'NO '                TO  FIRST-SW                    @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FIRST-SW = ["FIRST-SW"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":HST-AREA =["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLG-AREA =["FLG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":WORK-AREA=["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA =["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL=["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ4016-INOUT=["
      D             PARM-SMZJ4016-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT=["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN=["
      D             PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG=["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["
      D             PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2310-ARG2  =["
      D             PARM-SMZJ2310-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2310-ARG3  =["
      D             PARM-SMZJ2310-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2310-IN  =["
      D             PARM-SMZJ2310-IN"]"
      *-----------------------------------------------------------------
      *----------  基準日断面情報のコピー句
      *----------  処理実行日
           MOVE  SYORI-YMD                   OF  PARM-SMZJ2310-IN
             TO  WK-SYORI-YMD                OF  WK-KYJ-YMD-DMN-INFO
      *----------  起動ID
           MOVE  KIDOU-ID                    OF  PARM-SMZJ2310-IN
             TO  WK-KIDOU-ID                 OF  WK-KYJ-YMD-DMN-INFO
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD                 OF  PARM-SMZJ2310-IN
             TO  WK-RIYO-CMP-CD              OF  WK-KYJ-YMD-DMN-INFO
      *----------  ファンドコード
           MOVE  FUND-CD                     OF  PARM-SMZJ2310-IN
             TO  WK-FUND-CD                  OF  WK-KYJ-YMD-DMN-INFO
      *----------  ポートフォリオコード
           MOVE  PTF-CD                      OF  PARM-SMZJ2310-IN
             TO  WK-PTF-CD                   OF  WK-KYJ-YMD-DMN-INFO
      *----------  基準日
           MOVE  KJN-YMD                     OF  PARM-SMZJ2310-IN
             TO  WK-KJN-YMD                  OF  WK-KYJ-YMD-DMN-INFO
      *----------  仕訳基準パターンコード
           MOVE  SWK-KJN-PTN-CD              OF  PARM-SMZJ2310-IN
             TO  WK-SWK-KJN-PTN-CD           OF  WK-KYJ-YMD-DMN-INFO
      *----------  異動計算パターンコード
           MOVE  IDO-CALC-PATTERN-CD         OF  PARM-SMZJ2310-IN
             TO  WK-IDO-CALC-PATTERN-CD      OF  WK-KYJ-YMD-DMN-INFO
      *----------  開始基準日の翌日
           MOVE  KAISI-KJN-YMD-NEXT          OF  PARM-SMZJ2310-IN
             TO  WK-KAISI-KJN-YMD-NEXT       OF  WK-KYJ-YMD-DMN-INFO
      *----------  起動ログインユーザ会社コード
           MOVE  KIDOU-LOGIN-CMP-CD          OF  PARM-SMZJ2310-IN
             TO  WK-KIDOU-LOGIN-CMP-CD
      *----------  起動ユーザーID
           MOVE  KIDOU-SID                   OF  PARM-SMZJ2310-IN
             TO  WK-KIDOU-SID
      *----------  SCZY1170 RTN-CD 初期化
           MOVE  CNS-RTN-000
             TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *----------  SPACE
           MOVE  SPACE                       TO  H-SPACE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日断面情報のコピー句: "
      D    DISPLAY  CNS-PGM-ID": 処理実行日                  =["
      D             WK-SYORI-YMD             OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID": 起動ID                      =["
      D             WK-KIDOU-ID              OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID": 利用会社コード              =["
      D             WK-RIYO-CMP-CD           OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID": ファンドコード              =["
      D             WK-FUND-CD               OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID": ポートフォリオコード        =["
      D             WK-PTF-CD                OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID": 基準日                      =["
      D             WK-KJN-YMD               OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID": 仕訳基準パターンコード      =["
      D             WK-SWK-KJN-PTN-CD        OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID": 異動計算パターンコード      =["
      D             WK-IDO-CALC-PATTERN-CD   OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID": 開始基準日の翌日            =["
      D             WK-KAISI-KJN-YMD-NEXT    OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":起動ログインユーザ会社コード =["
      D             WK-KIDOU-LOGIN-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":起動ユーザーID               =["
      D             WK-KIDOU-SID"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1170 RTN-CD           =["
      D             RTN-CD                   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":H-SPACE  =["H-SPACE"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *        テーブルID取得処理
      ******************************************************************
       TBL-ID-INIT-RTN        SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  テーブルID取得処理  START  ****"
      *-----------------------------------------------------------------
      *---------- テーブルID取得処理
           MOVE  WK-RIYO-CMP-CD              OF  WK-KYJ-YMD-DMN-INFO
             TO  RIYO-CMP-CD                 OF  PARM-SCZY1160-ARG1
           MOVE  CNS-TBL-TKMZMS00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(1)
           MOVE  CNS-TBL-TKMZKR00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(2)
           MOVE  CNS-TBL-TKMZMB00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(3)
           MOVE  CNS-TBL-TKMZZI00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(4)
           MOVE  CNS-TBL-TKMZZR00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(5)
           MOVE  CNS-TBL-TKMZGZ00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(6)
           MOVE  CNS-TBL-TKMZSI00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(7)
           MOVE  CNS-TBL-TKMZSR00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(8)
           MOVE  CNS-TBL-TKMZKI00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(9)
           MOVE  CNS-TBL-TKMZKZ00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(10)
           MOVE  CNS-TBL-TKMZBW08
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(11)
           MOVE  CNS-TBL-TKMZBW09
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(12)
           MOVE  CNS-TBL-TKMZBW10
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(13)
           MOVE  CNS-TBL-TKMZBW06
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(14)
           MOVE  CNS-TBL-TKMZBW11
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(15)
           MOVE  CNS-TBL-TKMZBW13
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(16)
           MOVE  CNS-TBL-TKMZBW07
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(17)
           MOVE  CNS-TBL-TKMZBW12
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(18)
           MOVE  CNS-TBL-TKMZBW15
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(19)
           MOVE  CNS-TBL-TKMZBW16
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(20)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID1=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID2=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID3=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID4=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID5=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID6=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID7=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(7)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID8=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(8)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID9=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(9)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID10=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(10)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID11=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(11)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID12=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(12)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID13=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(13)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID14=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(14)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID15=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(15)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID16=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(16)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID17=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(17)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID18=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(18)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID19=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(19)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID20=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(20)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)=["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TABLE-TKMZMS00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TABLE-TKMZKR00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TABLE-TKMZMB00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TABLE-TKMZZI00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TABLE-TKMZZR00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(6)
               TO  WK-TABLE-TKMZGZ00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(7)
               TO  WK-TABLE-TKMZSI00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(8)
               TO  WK-TABLE-TKMZSR00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(9)
               TO  WK-TABLE-TKMZKI00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(10)
               TO  WK-TABLE-TKMZKZ00
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(11)
               TO  WK-TABLE-TKMZBW08
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(12)
               TO  WK-TABLE-TKMZBW09
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(13)
               TO  WK-TABLE-TKMZBW10
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(14)
               TO  WK-TABLE-TKMZBW06
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(15)
               TO  WK-TABLE-TKMZBW11
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(16)
               TO  WK-TABLE-TKMZBW13
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(17)
               TO  WK-TABLE-TKMZBW07
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(18)
               TO  WK-TABLE-TKMZBW12
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(19)
               TO  WK-TABLE-TKMZBW15
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(20)
               TO  WK-TABLE-TKMZBW16
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID1  TKMZMS00=["
      D             WK-TABLE-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID2  TKMZKR00=["
      D             WK-TABLE-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID3  TKMZMB00=["
      D             WK-TABLE-TKMZMB00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID4  TKMZZI00=["
      D             WK-TABLE-TKMZZI00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID5  TKMZZR00=["
      D             WK-TABLE-TKMZZR00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID6  TKMZGZ00=["
      D             WK-TABLE-TKMZGZ00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID7  TKMZSI00=["
      D             WK-TABLE-TKMZSI00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID8  TKMZSR00=["
      D             WK-TABLE-TKMZSR00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID9  TKMZKI00=["
      D             WK-TABLE-TKMZKI00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID10 TKMZKZ00=["
      D             WK-TABLE-TKMZKZ00"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID11 TKMZBW08=["
      D             WK-TABLE-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID12 TKMZBW09=["
      D             WK-TABLE-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID13 TKMZBW10=["
      D             WK-TABLE-TKMZBW10"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID14 TKMZBW06=["
      D             WK-TABLE-TKMZBW06"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID15 TKMZBW11=["
      D             WK-TABLE-TKMZBW11"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID16 TKMZBW13=["
      D             WK-TABLE-TKMZBW13"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID17 TKMZBW07=["
      D             WK-TABLE-TKMZBW07"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID18 TKMZBW12=["
      D             WK-TABLE-TKMZBW12"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID19 TKMZBW15=["
      D             WK-TABLE-TKMZBW15"]"
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID20 TKMZBW16=["
      D             WK-TABLE-TKMZBW16"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得エラー"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  テーブルID取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-INIT-EXT.
           EXIT.
      ******************************************************************
      *        テーブルID取得処理2
      ******************************************************************
       TBL-ID-INIT2-RTN       SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  テーブルID取得処理2  START  ****"
      *-----------------------------------------------------------------
      *---------- テーブルID取得処理2
           MOVE  WK-RIYO-CMP-CD              OF  WK-KYJ-YMD-DMN-INFO
             TO  RIYO-CMP-CD                 OF  PARM-SCZY1160-ARG1
           MOVE  CNS-TBL-TKMZKK00
             TO  TBL-ID                      OF  PARM-SCZY1160-ARG1(1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID1=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(1)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)=["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             MOVE  HENSYUGO-TBL-ID           OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TABLE-TKMZKK00
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":編集後テーブルID1  TKMZMS00=["
      D             WK-TABLE-TKMZKK00"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得エラー"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  テーブルID取得処理2  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-INIT2-EXT.
           EXIT.
      ******************************************************************
      *                 3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  主処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.2.1.未収収益データ 追加 / 更新 処理
           PERFORM  TKMZMS00-INSUPD-RTN
      *----------  3.2.2.前払金管理データ 追加 処理
           PERFORM  TKMZMB00-INSUPD-RTN
      *----------  3.2.3.残高異動データ 追加 処理
           PERFORM  TKMZZI00-INSUPD-RTN
      *----------  3.2.4.残高履歴データ 追加 処理
           PERFORM  TKMZZR00-INSUPD-RTN
      *----------  3.2.5.元本残高データ 追加 処理
           PERFORM  TKMZGZ00-INSUPD-RTN
      *----------  3.2.6.資金簿価異動データ 追加 処理
           PERFORM  TKMZSI00-INSUPD-RTN
      *----------  3.2.7.資金残履歴データ 追加 処理
           PERFORM  TKMZSR00-INSUPD-RTN
      *----------  3.2.8.勘定異動データ 追加 処理
           PERFORM  TKMZKI00-INSUPD-RTN
      *----------  3.2.9.勘定残高データ 追加 処理
           PERFORM  TKMZKZ00-INSUPD-RTN
      *----------  3.2.10.基準日計算情報データ更新処理
           PERFORM  TKMZKK00-INSUPD-RTN
      *----------  3.2.10.各計算データTBLを削除処理
           PERFORM  SMZJ4016-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1.未収収益データ 追加 / 更新 処理
      ******************************************************************
       TKMZMS00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益データ 追加 / 更新 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.1 未収収益計算データを処理する
           PERFORM  TKMZBW08-DATA-RTN
      *----------  3.2.1.2 債券過去経過利息計算データを処理する
           PERFORM  TKMZBW09-DATA-RTN
      *----------  更新件数
      *----------  更新件数.未収収益_件数
           MOVE  WK-MS-SHEKI-COUNT            OF  WK-KOUSIN-COUNT
             TO  MS-SHEKI-COUNT               OF  KOUSIN-COUNT
      *----------  更新件数.債券過去経過利息_件数
           MOVE  WK-PAST-BOND-KEKA-RSK-COUNT  OF  WK-KOUSIN-COUNT
             TO  PAST-BOND-KEKA-RSK-COUNT     OF  KOUSIN-COUNT
      *----------  新規件数
      *----------  新規件数.未収収益_件数
           MOVE  WK-MS-SHEKI-COUNT            OF  WK-SINKI-COUNT
             TO  MS-SHEKI-COUNT               OF  SINKI-COUNT
      *----------  新規件数.債券過去経過利息_件数
           MOVE  WK-PAST-BOND-KEKA-RSK-COUNT  OF  WK-SINKI-COUNT
             TO  PAST-BOND-KEKA-RSK-COUNT     OF  SINKI-COUNT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":更新件数.未収収益_件数         =["
      D             MS-SHEKI-COUNT            OF  KOUSIN-COUNT"]"
      D    DISPLAY  CNS-PGM-ID  ":更新件数.債券過去経過利息_件数 =["
      D             PAST-BOND-KEKA-RSK-COUNT  OF  KOUSIN-COUNT"]"
      D    DISPLAY  CNS-PGM-ID  ":新規件数.未収収益_件数         =["
      D             MS-SHEKI-COUNT            OF  SINKI-COUNT"]"
      D    DISPLAY  CNS-PGM-ID  ":新規件数.債券過去経過利息_件数 =["
      D             PAST-BOND-KEKA-RSK-COUNT  OF  SINKI-COUNT"]"
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益データ 追加 / 更新 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1.1 未収収益計算データを処理する
      ******************************************************************
       TKMZBW08-DATA-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益計算データを処理する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.1.1) 未収収益計算データTBLから未収収益処理用情報を取得する
           PERFORM  TKMZBW08-PDO-RTN
      *----------  3.2.1.1.2)『未収収益計算データ』カーソルフェッチする
           MOVE  CNS-ON                 TO  FLG-TKMZBW08-FE-OPEN
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW08-DATA-RTN]"           GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW08-FETCH-RTN
             UNTIL  FLG-TKMZBW08-FE-OPEN = CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW08-DATA-RTN]"           GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  3.2.1.1.3)『未収収益計算データ』カーソルクローズ処理
      *    PERFORM  TKMZBW08-CLOSE-RTN                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益計算データを処理する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-DATA-EXT.
           EXIT.
      ******************************************************************
      *      3.2.1.1.1) 未収収益計算データTBLから未収収益処理用情報を取得する
      ******************************************************************
       TKMZBW08-PDO-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益計算データTBLから"
      D             "未収収益処理用情報を取得する START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW08
             TO  SQL-TBL-ID1,
                 WK-TKMZBW08            OF  WK-MSG-1-1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW08-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-1
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW08-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW08-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-1
           INITIALIZE  SQLSTMT1                                         @3212SEINO@@
           MOVE  SQL-SELECT-1-1         TO  SQLSTMT1                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW08-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW08-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW08-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  取引データCURSOR PREPARE
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW08-CR-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW08-CR-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW08-CR-OPEN  = CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S1  FROM :SQLSTMT1  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-003
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZBW08_CUR  CURSOR  FOR S1 END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQLCODE-DECLARE=["
      D                                      SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZBW08_CUR
                 USING  :H-TKMZBW08-S.H-SYORI-YMD,
                        :H-TKMZBW08-S.H-KIDOU-ID,
                        :H-TKMZBW08-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データカーソルオープン"
      D             "フラグ=["FLG-TKMZBW08-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW08-CR-OPEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理正常（OPEN)"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データカーソルオープン"
      D             "フラグ=["FLG-TKMZBW08-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-004
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益計算データTBLから"
      D             "未収収益処理用情報を取得する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-PDO-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1.1.2)『未収収益計算データ』カーソルフェッチする
      ******************************************************************
       TKMZBW08-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  『未収収益計算データ』"
      D             "カーソルフェッチする START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW08
           EXEC  SQL
             FETCH  TKMZBW08_CUR
             INTO   :H-TKMZBW08.H-SYORI-YMD,
                    :H-TKMZBW08.H-KIDOU-ID,
                    :H-TKMZBW08.H-RIYO-CMP-CD,
                    :H-TKMZBW08.H-FUND-CD,
                    :H-TKMZBW08.H-PTF-CD,
                    :H-TKMZBW08.H-SEC-SBT-CD,
                    :H-TKMZBW08.H-MEG-CD,
                    :H-TKMZBW08.H-TATE-FLG,
                    :H-TKMZBW08.H-GYOKU-ID,
                    :H-TKMZBW08.H-TEKIYO-FROM,
                    :H-TKMZBW08.H-KENRI-OTI-YMD,
                    :H-TKMZBW08.H-SIJO-TUKA-CD,
                    :H-TKMZBW08.H-RIT-SRY,
                    :H-TKMZBW08.H-SJTK-MS-SHEKI,
                    :H-TKMZBW08.H-SJTK-GENSEN-TAX,
                    :H-TKMZBW08.H-MNK-TSHO-SRYZN,
                    :H-TKMZBW08.H-SAKUJO-KBN,
                    :H-TKMZBW08.H-UPD-DATE,
                    :H-TKMZBW08.H-UPD-LOGIN-CMP-CD,
                    :H-TKMZBW08.H-UPD-SID,
                    :H-TKMZBW08.H-UPD-PGMID
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理正常（FETCH)"
      D    DISPLAY  CNS-PGM-ID":処理実行日              =["
      D             H-SYORI-YMD         OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                  =["
      D             H-KIDOU-ID          OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード          =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード          =["
      D             H-FUND-CD           OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード    =["
      D             H-PTF-CD            OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード          =["
      D             H-SEC-SBT-CD        OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード              =["
      D             H-MEG-CD            OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                  =["
      D             H-GYOKU-ID          OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日              =["
      D             H-TEKIYO-FROM       OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":権利落日                =["
      D             H-KENRI-OTI-YMD     OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード          =["
      D             H-SIJO-TUKA-CD      OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":権利付数量              =["
      D             H-RIT-SRY           OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨未収収益        =["
      D             H-SJTK-MS-SHEKI     OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税          =["
      D             H-SJTK-GENSEN-TAX   OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象数量残高      =["
      D             H-MNK-TSHO-SRYZN    OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":削除区分                =["
      D             H-SAKUJO-KBN        OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":更新日時                =["
      D             H-UPD-DATE          OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ          =["
      D             H-UPD-SID           OF  H-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":更新プログラムＩＤ      =["
      D             H-UPD-PGMID         OF  H-TKMZBW08"]"
      *-----------------------------------------------------------------
      *----------  未収収益計算データTBLより、未収収益TBLと同じレコードを探す
               PERFORM  TKMZMS00-FIND-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理NOTFOUND（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-OFF              TO  FLG-TKMZBW08-FE-OPEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算循環フラグ"
      D             "=["FLG-TKMZBW08-FE-OPEN"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-005
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1         DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  『未収収益計算データ』"
      D             "カーソルフェッチする  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-FETCH-EXT.
           EXIT.
      ******************************************************************
      *        未収収益計算データTBLより、未収収益TBLと同じレコードを探す
      ******************************************************************
       TKMZMS00-FIND-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益計算データTBLより、"
      D             "未収収益TBLと同じレコードを探す START ***"
      *-----------------------------------------------------------------
      *----------  TKMZMS00カーソル定義
           PERFORM  TKMZMS00-FIND-D-RTN
      *----------  TKMZMS00カーソルフェッチする
           PERFORM  TKMZMS00-FIND-F-RTN
      *----------  TKMZMS00カーソルクローズ処理
      *    PERFORM  TKMZMS00-FIND-C-RTN                                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益計算データTBLより、"
      D             "未収収益TBLと同じレコードを探す  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-FIND-EXT.
           EXIT.
      ******************************************************************
      *        TKMZMS00カーソル定義
      ******************************************************************
       TKMZMS00-FIND-D-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  TKMZMS00カーソル定義 START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZMS00
             TO  SQL-TBL-ID2            OF  SQL-SELECT-1-2,
                 WK-TKMZMS00            OF  WK-MSG-1-2
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZBW08
             TO  H-RIYO-CMP-CD          OF  H-TKMZMS00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-2
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZBW08
             TO  H-FUND-CD              OF  H-TKMZMS00-S,
                 WK-FUND-CD             OF  WK-MSG-1-2
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZBW08
             TO  H-PTF-CD               OF  H-TKMZMS00-S,
                 WK-PTF-CD              OF  WK-MSG-1-2
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZBW08
             TO  H-SEC-SBT-CD           OF  H-TKMZMS00-S,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-2
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZBW08
             TO  H-MEG-CD               OF  H-TKMZMS00-S,
                 WK-MEG-CD              OF  WK-MSG-1-2
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZBW08
             TO  H-TATE-FLG             OF  H-TKMZMS00-S,
                 WK-TATE-FLG            OF  WK-MSG-1-2
      *----------  玉ＩＤ
           MOVE  H-GYOKU-ID             OF  H-TKMZBW08
             TO  H-GYOKU-ID             OF  H-TKMZMS00-S,
                 WK-GYOKU-ID            OF  WK-MSG-1-2
      *----------  適用開始日
           MOVE  H-TEKIYO-FROM          OF  H-TKMZBW08
             TO  H-TEKIYO-FROM          OF  H-TKMZMS00-S,
                 WK-TEKIYO-FROM         OF  WK-MSG-1-2
      *----------  権利落日
           MOVE  H-KENRI-OTI-YMD        OF  H-TKMZBW08
             TO  H-KENRI-OTI-YMD        OF  H-TKMZMS00-S,
                 WK-KENRI-OTI-YMD       OF  WK-MSG-1-2
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
           MOVE  SQL-SELECT-1-2         TO  SQLSTMT2                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード                   =["
      D             H-SEC-SBT-CD        OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード                       =["
      D             H-MEG-CD            OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ         =["
      D             H-TATE-FLG          OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                           =["
      D             H-GYOKU-ID          OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日                       =["
      D             H-TEKIYO-FROM       OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":権利落日                         =["
      D             H-KENRI-OTI-YMD     OF  H-TKMZMS00-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT2=["SQLSTMT2"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-CR-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZMS00-CR-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZMS00-CR-OPEN  = CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S2  FROM :SQLSTMT2  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-006
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZMS00_CUR  CURSOR  FOR S2 END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQLCODE-DECLARE=["
      D                                       SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZMS00_CUR
                 USING  :H-TKMZMS00-S.H-RIYO-CMP-CD,
                        :H-TKMZMS00-S.H-FUND-CD,
                        :H-TKMZMS00-S.H-PTF-CD,
                        :H-TKMZMS00-S.H-SEC-SBT-CD,
                        :H-TKMZMS00-S.H-MEG-CD,
                        :H-TKMZMS00-S.H-TATE-FLG,
                        :H-TKMZMS00-S.H-GYOKU-ID,
                        :H-TKMZMS00-S.H-TEKIYO-FROM,
                        :H-TKMZMS00-S.H-KENRI-OTI-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":未収収益カーソルオープン"
      D             "フラグ=["FLG-TKMZMS00-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZMS00-CR-OPEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理正常（OPEN)"
      D    DISPLAY  CNS-PGM-ID":未収収益カーソルオープン"
      D             "フラグ=["FLG-TKMZMS00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-007
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  TKMZMS00カーソル定義  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-FIND-D-EXT.
           EXIT.
      ******************************************************************
      *        TKMZMS00カーソルフェッチする
      ******************************************************************
       TKMZMS00-FIND-F-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  TKMZMS00カーソルフェッチす"
      D             "る START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZMS00
           EXEC  SQL
             FETCH  TKMZMS00_CUR
             INTO   :H-TKMZMS00.H-RIYO-CMP-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理正常（FETCH)"
      D    DISPLAY  CNS-PGM-ID":利用会社コード        =["
      D             H-RIYO-CMP-CD        OF  H-TKMZMS00"]"
      *-----------------------------------------------------------------
      *----------  該当レコードを未収収益TBLへ更新する
               PERFORM  TKMZMS00-UPDATE-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理NOTFOUND（FETCH)"
      *-----------------------------------------------------------------
      *----------  該当レコードを未収収益TBLへ追加する
               PERFORM  TKMZMS00-INSERT-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-008
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  TKMZMS00カーソルフェッチす"
      D             "る  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-FIND-F-EXT.
           EXIT.
      ******************************************************************
      *        該当レコードを未収収益TBLへ更新する
      ******************************************************************
       TKMZMS00-UPDATE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  該当レコードを未収収益TBL"
      D             "へ更新する START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZMS00
             TO  SQL-TBL-ID3            OF  SQL-UPDATE-1-3,
                 WK-TKMZMS00            OF  WK-MSG-1-3
      *----------  市場通貨コード
           MOVE  H-SIJO-TUKA-CD         OF  H-TKMZBW08
             TO  H-SIJO-TUKA-CD         OF  H-TKMZMS00-1,
                 WK-SIJO-TUKA-CD        OF  WK-MSG-1-3
      *----------  権利付数量
           MOVE  H-RIT-SRY              OF  H-TKMZBW08
             TO  H-RIT-SRY              OF  H-TKMZMS00-1,
                 WK-RIT-SRY             OF  WK-MSG-1-3
      *----------  市場通貨未収収益
           MOVE  H-SJTK-MS-SHEKI        OF  H-TKMZBW08
             TO  H-SJTK-MS-SHEKI        OF  H-TKMZMS00-1,
                 WK-SJTK-MS-SHEKI       OF  WK-MSG-1-3
      *----------  市場通貨源泉税
           MOVE  H-SJTK-GENSEN-TAX      OF  H-TKMZBW08
             TO  H-SJTK-GENSEN-TAX      OF  H-TKMZMS00-1,
                 WK-SJTK-GENSEN-TAX     OF  WK-MSG-1-3
      *----------  未入金対象数量残高
           MOVE  H-MNK-TSHO-SRYZN       OF  H-TKMZBW08
             TO  H-MNK-TSHO-SRYZN       OF  H-TKMZMS00-1,
                 WK-MNK-TSHO-SRYZN      OF  WK-MSG-1-3
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZMS00-1,
                 WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-3
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZMS00-1,
                 WK-UPD-SID             OF  WK-MSG-1-3
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZBW08
             TO  H-RIYO-CMP-CD          OF  H-TKMZMS00-U-1,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZBW08
             TO  H-FUND-CD              OF  H-TKMZMS00-U-1,
                 WK-FUND-CD             OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZBW08
             TO  H-PTF-CD               OF  H-TKMZMS00-U-1,
                 WK-PTF-CD              OF  WK-MSG-1-3
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZBW08
             TO  H-SEC-SBT-CD           OF  H-TKMZMS00-U-1,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-3
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZBW08
             TO  H-MEG-CD               OF  H-TKMZMS00-U-1,
                 WK-MEG-CD              OF  WK-MSG-1-3
      *----------  資産/負債・買建/売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZBW08
             TO  H-TATE-FLG             OF  H-TKMZMS00-U-1,
                 WK-TATE-FLG            OF  WK-MSG-1-3
      *----------  玉ＩＤ
           MOVE  H-GYOKU-ID             OF  H-TKMZBW08
             TO  H-GYOKU-ID             OF  H-TKMZMS00-U-1,
                 WK-GYOKU-ID            OF  WK-MSG-1-3
      *----------  適用開始日
           MOVE  H-TEKIYO-FROM          OF  H-TKMZBW08
             TO  H-TEKIYO-FROM          OF  H-TKMZMS00-U-1,
                 WK-TEKIYO-FROM         OF  WK-MSG-1-3
      *----------  権利落日
           MOVE  H-KENRI-OTI-YMD        OF  H-TKMZBW08
             TO  H-KENRI-OTI-YMD        OF  H-TKMZMS00-U-1,
                 WK-KENRI-OTI-YMD       OF  WK-MSG-1-3
           INITIALIZE  SQLSTMT3                                         @3212SEINO@@
           MOVE  SQL-UPDATE-1-3         TO  SQLSTMT3                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":UPDATEデータ"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード                   =["
      D             H-SIJO-TUKA-CD      OF  H-TKMZMS00-1"]"
      D    DISPLAY  CNS-PGM-ID":権利付数量                       =["
      D             H-RIT-SRY           OF  H-TKMZMS00-1"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨未収収益                 =["
      D             H-SJTK-MS-SHEKI     OF  H-TKMZMS00-1"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税                   =["
      D             H-SJTK-GENSEN-TAX   OF  H-TKMZMS00-1"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象数量残高               =["
      D             H-MNK-TSHO-SRYZN    OF  H-TKMZMS00-1"]"
      D    DISPLAY  CNS-PGM-ID":更新フラグ                       =["
      D             "3]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZMS00-1"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZMS00-1"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード                   =["
      D             H-SEC-SBT-CD        OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード                       =["
      D             H-MEG-CD            OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ       =["
      D             H-TATE-FLG          OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                           =["
      D             H-GYOKU-ID          OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日                       =["
      D             H-TEKIYO-FROM       OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":権利落日                         =["
      D             H-KENRI-OTI-YMD     OF  H-TKMZMS00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT3=["SQLSTMT3"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-UP-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZMS00-UP-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZMS00-UP-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S3  FROM :SQLSTMT3  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-UPDATE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-UPDATE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-009
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S3
                 USING  :H-TKMZMS00-1.H-SIJO-TUKA-CD,
                        :H-TKMZMS00-1.H-RIT-SRY,
                        :H-TKMZMS00-1.H-SJTK-MS-SHEKI,
                        :H-TKMZMS00-1.H-SJTK-GENSEN-TAX,
                        :H-TKMZMS00-1.H-MNK-TSHO-SRYZN,
                        :H-TKMZMS00-1.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZMS00-1.H-UPD-SID,
                        :H-TKMZMS00-U-1.H-RIYO-CMP-CD,
                        :H-TKMZMS00-U-1.H-FUND-CD,
                        :H-TKMZMS00-U-1.H-PTF-CD,
                        :H-TKMZMS00-U-1.H-SEC-SBT-CD,
                        :H-TKMZMS00-U-1.H-MEG-CD,
                        :H-TKMZMS00-U-1.H-TATE-FLG,
                        :H-TKMZMS00-U-1.H-GYOKU-ID,
                        :H-TKMZMS00-U-1.H-TEKIYO-FROM,
                        :H-TKMZMS00-U-1.H-KENRI-OTI-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":UPDATE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON                TO  FLG-TKMZMS00-UP-OPEN     @3212SEINO@@
               COMPUTE  WK-MS-SHEKI-COUNT  OF  WK-KOUSIN-COUNT
                     =  WK-MS-SHEKI-COUNT  OF  WK-KOUSIN-COUNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-UP-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZMS00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-UPDATE-SQL処理正常（UPDATE)"
      D    DISPLAY  CNS-PGM-ID":更新件数.未収収益_件数=["
      D             WK-MS-SHEKI-COUNT      OF  WK-KOUSIN-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-UPDATE-SQL処理"
      D                           "NOTFOUND（UPDATE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-010
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-110
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-UPDATE-SQL処理エラー（UPDATE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-011
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  該当レコードを未収収益TBL"
      D             "へ更新する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *        該当レコードを未収収益TBLへ追加する
      ******************************************************************
       TKMZMS00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  該当レコードを未収収益TBL"
      D             "へ追加する START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZMS00
             TO  SQL-TBL-ID4            OF  SQL-INSERT-1-4,
                 WK-TKMZMS00            OF  WK-MSG-1-4
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZBW08
             TO  H-RIYO-CMP-CD          OF  H-TKMZMS00-I,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-4
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZBW08
             TO  H-FUND-CD              OF  H-TKMZMS00-I,
                 WK-FUND-CD             OF  WK-MSG-1-4
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZBW08
             TO  H-PTF-CD               OF  H-TKMZMS00-I,
                 WK-PTF-CD              OF  WK-MSG-1-4
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZBW08
             TO  H-SEC-SBT-CD           OF  H-TKMZMS00-I,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-4
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZBW08
             TO  H-MEG-CD               OF  H-TKMZMS00-I,
                 WK-MEG-CD              OF  WK-MSG-1-4
      *----------  資産/負債・買建/売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZBW08
             TO  H-TATE-FLG             OF  H-TKMZMS00-I,
                 WK-TATE-FLG            OF  WK-MSG-1-4
      *----------  玉ＩＤ
           MOVE  H-GYOKU-ID             OF  H-TKMZBW08
             TO  H-GYOKU-ID             OF  H-TKMZMS00-I,
                 WK-GYOKU-ID            OF  WK-MSG-1-4
      *----------  適用開始日
           MOVE  H-TEKIYO-FROM          OF  H-TKMZBW08
             TO  H-TEKIYO-FROM          OF  H-TKMZMS00-I,
                 WK-TEKIYO-FROM         OF  WK-MSG-1-4
      *----------  権利落日
           MOVE  H-KENRI-OTI-YMD        OF  H-TKMZBW08
             TO  H-KENRI-OTI-YMD        OF  H-TKMZMS00-I,
                 WK-KENRI-OTI-YMD       OF  WK-MSG-1-4
      *----------  市場通貨コード
           MOVE  H-SIJO-TUKA-CD         OF  H-TKMZBW08
             TO  H-SIJO-TUKA-CD         OF  H-TKMZMS00-I,
                 WK-SIJO-TUKA-CD        OF  WK-MSG-1-4
      *----------  権利付数量
           MOVE  H-RIT-SRY              OF  H-TKMZBW08
             TO  H-RIT-SRY              OF  H-TKMZMS00-I,
                 WK-RIT-SRY             OF  WK-MSG-1-4
      *----------  市場通貨未収収益
           MOVE  H-SJTK-MS-SHEKI        OF  H-TKMZBW08
             TO  H-SJTK-MS-SHEKI        OF  H-TKMZMS00-I,
                 WK-SJTK-MS-SHEKI       OF  WK-MSG-1-4
      *----------  市場通貨源泉税
           MOVE  H-SJTK-GENSEN-TAX      OF  H-TKMZBW08
             TO  H-SJTK-GENSEN-TAX      OF  H-TKMZMS00-I,
                 WK-SJTK-GENSEN-TAX     OF  WK-MSG-1-4
      *----------  未入金対象数量残高
           MOVE  H-MNK-TSHO-SRYZN       OF  H-TKMZBW08
             TO  H-MNK-TSHO-SRYZN       OF  H-TKMZMS00-I,
                 WK-MNK-TSHO-SRYZN      OF  WK-MSG-1-4
      *----------  削除区分
           MOVE  H-SAKUJO-KBN           OF  H-TKMZBW08
             TO  H-SAKUJO-KBN           OF  H-TKMZMS00-I,
                 WK-SAKUJO-KBN          OF  WK-MSG-1-4
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZMS00-I,
                 WK-SK-LOGIN-CMP-CD     OF  WK-MSG-1-4
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZMS00-I,
                 WK-SK-SID              OF  WK-MSG-1-4
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZMS00-I,
                 WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-4
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZMS00-I,
                 WK-UPD-SID             OF  WK-MSG-1-4
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
           MOVE  SQL-INSERT-1-4         TO  SQLSTMT4                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERTデータ"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード                   =["
      D             H-SEC-SBT-CD        OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード                       =["
      D             H-MEG-CD            OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ         =["
      D             H-TATE-FLG          OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                           =["
      D             H-GYOKU-ID          OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日                       =["
      D             H-TEKIYO-FROM       OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":権利落日                         =["
      D             H-KENRI-OTI-YMD     OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード                   =["
      D             H-SIJO-TUKA-CD      OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":権利付数量                       =["
      D             H-RIT-SRY           OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨未収収益                 =["
      D             H-SJTK-MS-SHEKI     OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税                   =["
      D             H-SJTK-GENSEN-TAX   OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象数量残高               =["
      D             H-MNK-TSHO-SRYZN    OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":削除区分                         =["
      D             H-SAKUJO-KBN        OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":作成フラグ                       =["
      D             "3]"
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":更新フラグ                       =["
      D             "3]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZMS00-I"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT4=["SQLSTMT4"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZMS00-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZMS00-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S4  FROM :SQLSTMT4  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-012
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S4
                 USING  :H-TKMZMS00-I.H-RIYO-CMP-CD,
                        :H-TKMZMS00-I.H-FUND-CD,
                        :H-TKMZMS00-I.H-PTF-CD,
                        :H-TKMZMS00-I.H-SEC-SBT-CD,
                        :H-TKMZMS00-I.H-MEG-CD,
                        :H-TKMZMS00-I.H-TATE-FLG,
                        :H-TKMZMS00-I.H-GYOKU-ID,
                        :H-TKMZMS00-I.H-TEKIYO-FROM,
                        :H-TKMZMS00-I.H-KENRI-OTI-YMD,
                        :H-TKMZMS00-I.H-SIJO-TUKA-CD,
                        :H-TKMZMS00-I.H-RIT-SRY,
                        :H-TKMZMS00-I.H-SJTK-MS-SHEKI,
                        :H-TKMZMS00-I.H-SJTK-GENSEN-TAX,
                        :H-TKMZMS00-I.H-MNK-TSHO-SRYZN,
                        :H-SPACE,
                        :H-SPACE,
                        :H-TKMZMS00-I.H-SAKUJO-KBN,
                        :H-TKMZMS00-I.H-SK-LOGIN-CMP-CD,
                        :H-TKMZMS00-I.H-SK-SID,
                        :H-TKMZMS00-I.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZMS00-I.H-UPD-SID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":TKMZMS00-INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON                TO  FLG-TKMZMS00-IN-OPEN     @3212SEINO@@
               COMPUTE  WK-MS-SHEKI-COUNT  OF  WK-SINKI-COUNT
                     =  WK-MS-SHEKI-COUNT  OF  WK-SINKI-COUNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZMS00-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.未収収益_件数=["
      D             WK-MS-SHEKI-COUNT      OF  WK-SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-INSERT-SQL処理エラ"
      D                                         "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-013
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-014
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  該当レコードを未収収益TBL"
      D             "へ追加する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        TKMZMS00カーソルクローズ処理
      ******************************************************************
      *TKMZMS00-FIND-C-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":***  TKMZMS00カーソルクローズ処理"
      *D             " START ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZMS00_CUR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZMS00-CR-OPEN
      *----------------------<DEBUG>------------------------------------
      *D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理正常（CLOSE)"
      *D    DISPLAY  CNS-PGM-ID":未収収益カーソルオープン"
      *D             "フラグ=["FLG-TKMZMS00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":TKMZMS00-SELECT-SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
      *       MOVE  CNS-POS-015
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-2         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":***  TKMZMS00カーソルクローズ処理"
      *D             "  END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZMS00-FIND-C-EXT.
      *     EXIT.
      ******************************************************************
      *        3.2.1.1.3)『未収収益計算データ』カーソルクローズ処理
      ******************************************************************
      * TKMZBW08-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":*** 『未収収益計算データ』"
      *D             "カーソルクローズ処理 START ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZBW08_CUR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZBW08-CR-OPEN
      *----------------------<DEBUG>------------------------------------
      *D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理正常（CLOSE)"
      *D    DISPLAY  CNS-PGM-ID":未収収益計算データカーソルオープン"
      *D             "フラグ=["FLG-TKMZBW08-CR-OPEN"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":TKMZBW08-SELECT-SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
      *       MOVE  CNS-POS-016
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-1         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":***  『未収収益計算データ』"
      *D             "カーソルクローズ処理  END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZBW08-CLOSE-EXT.
      *     EXIT.
      ******************************************************************
      *        3.2.1.2 債券過去経過利息計算データを処理する
      ******************************************************************
       TKMZBW09-DATA-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  債券過去経過利息計算データ"
      D             "を処理する START ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.2.1) 債券過去経過利息計算データTBLから債券過去経過利息処理
      *            用情報を取得する
           PERFORM  TKMZBW09-PDO-RTN
      *----------  3.2.1.2.2)『債券過去経過利息計算データ』カーソルフェッチする
           MOVE  CNS-ON                  TO  FLG-TKMZBW09-FE-OPEN
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW09-DATA-RTN]"           GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW09-FETCH-RTN
             UNTIL  FLG-TKMZBW09-FE-OPEN = CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW09-DATA-RTN]"           GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  3.2.1.2.3)『債券過去経過利息計算データ』カーソルクローズ処理
      *    PERFORM  TKMZBW09-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  債券過去経過利息計算データ"
      D             "を処理する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-DATA-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1.2.1) 債券過去経過利息計算データTBLから債券過去経過利息処理用情報を取得する
      ******************************************************************
       TKMZBW09-PDO-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  債券過去経過利息計算データTBL"
      D             "から債券過去経過利息処理用情報を取得する START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW09
             TO  SQL-TBL-ID6,
                 WK-TKMZBW09            OF  WK-MSG-1-6
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW09-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-6
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW09-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-6
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW09-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-6
           INITIALIZE  SQLSTMT6                                         @3212SEINO@@
           MOVE  SQL-SELECT-1-6         TO  SQLSTMT6                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW09-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT6=["SQLSTMT6"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW09-CR-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW09-CR-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW09-CR-OPEN  = CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S6  FROM :SQLSTMT6  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-017
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZBW09_CUR  CURSOR  FOR S6 END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQLCODE-DECLARE=["
      D                                       SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZBW09_CUR
                 USING  :H-TKMZBW09-S.H-SYORI-YMD,
                        :H-TKMZBW09-S.H-KIDOU-ID,
                        :H-TKMZBW09-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データカーソル"
      D             "オープンフラグ=["FLG-TKMZBW09-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW09-CR-OPEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理正常（OPEN)"
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データカーソル"
      D             "オープンフラグ=["FLG-TKMZBW09-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-018
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6     DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  債券過去経過利息計算データTBL"
      D             "から債券過去経過利息処理用情報を取得する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-PDO-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1.2.2)『債券過去経過利息計算データ』カーソルフェッチする
      ******************************************************************
       TKMZBW09-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  『債券過去経過利息計算データ』"
      D             "カーソルフェッチする START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW09
           EXEC  SQL
             FETCH  TKMZBW09_CUR
             INTO   :H-TKMZBW09.H-SYORI-YMD,
                    :H-TKMZBW09.H-KIDOU-ID,
                    :H-TKMZBW09.H-RIYO-CMP-CD,
                    :H-TKMZBW09.H-FUND-CD,
                    :H-TKMZBW09.H-PTF-CD,
                    :H-TKMZBW09.H-SEC-SBT-CD,
                    :H-TKMZBW09.H-MEG-CD,
                    :H-TKMZBW09.H-TATE-FLG,
                    :H-TKMZBW09.H-GYOKU-ID,
                    :H-TKMZBW09.H-TEKIYO-FROM,
                    :H-TKMZBW09.H-RIB-YMD,
                    :H-TKMZBW09.H-SIJO-TUKA-CD,
                    :H-TKMZBW09.H-RIB-TSHO-FACE,
                    :H-TKMZBW09.H-SJTK-KEKA-RSK,
                    :H-TKMZBW09.H-SJTK-GENSEN-TAX,
                    :H-TKMZBW09.H-FACTOR-RENDOU-KESU,
                    :H-TKMZBW09.H-MNK-TSHO-FACE-ZAN,
                    :H-TKMZBW09.H-SAKUJO-KBN,
                    :H-TKMZBW09.H-UPD-DATE,
                    :H-TKMZBW09.H-UPD-LOGIN-CMP-CD,
                    :H-TKMZBW09.H-UPD-SID,
                    :H-TKMZBW09.H-UPD-PGMID
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理正常（FETCH)"
      D    DISPLAY  CNS-PGM-ID":処理実行日              =["
      D             H-SYORI-YMD         OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                  =["
      D             H-KIDOU-ID          OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード          =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード          =["
      D             H-FUND-CD           OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード    =["
      D             H-PTF-CD            OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード          =["
      D             H-SEC-SBT-CD        OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード              =["
      D             H-MEG-CD            OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                  =["
      D             H-GYOKU-ID          OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日              =["
      D             H-TEKIYO-FROM       OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":利払日                  =["
      D             H-RIB-YMD           OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード          =["
      D             H-SIJO-TUKA-CD      OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":利払対象額面            =["
      D             H-RIB-TSHO-FACE     OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息        =["
      D             H-SJTK-KEKA-RSK     OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税          =["
      D             H-SJTK-GENSEN-TAX   OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数    =["
      D             H-FACTOR-RENDOU-KESU
      D                                 OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象額面残高      =["
      D             H-MNK-TSHO-FACE-ZAN OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":削除区分                =["
      D             H-SAKUJO-KBN        OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":更新日時                =["
      D             H-UPD-DATE          OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ          =["
      D             H-UPD-SID           OF  H-TKMZBW09"]"
      D    DISPLAY  CNS-PGM-ID":更新プログラムＩＤ      =["
      D             H-UPD-PGMID         OF  H-TKMZBW09"]"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息計算データTBLより、債券過去経過利息TBLと同じレコードを探す
               PERFORM  TKMZKR00-FIND-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理NOTFOUND（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-OFF            TO  FLG-TKMZBW09-FE-OPEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データ循環"
      D             "フラグ=["FLG-TKMZBW09-FE-OPEN"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-019
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  『債券過去経過利息計算データ』"
      D             "カーソルフェッチする  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW09-FETCH-EXT.
           EXIT.
      ******************************************************************
      *        債券過去経過利息計算データTBLより、債券過去経過利息TBLと同じレコードを探す
      ******************************************************************
       TKMZKR00-FIND-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  債券過去経過利息計算データTBLよ"
      D             "り、債券過去経過利息TBLと同じレコードを探す "
      D             "START ***"
      *-----------------------------------------------------------------
      *----------  TKMZKR00カーソル定義
           PERFORM  TKMZKR00-FIND-D-RTN
      *----------  TKMZKR00カーソルフェッチする
           PERFORM  TKMZKR00-FIND-F-RTN
      *----------  TKMZKR00カーソルクローズ処理
      *    PERFORM  TKMZKR00-FIND-C-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  債券過去経過利息計算データTBLよ"
      D             "り、債券過去経過利息TBLと同じレコードを探す "
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-FIND-EXT.
           EXIT.
      ******************************************************************
      *        TKMZKR00カーソル定義
      ******************************************************************
       TKMZKR00-FIND-D-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  TKMZKR00カーソル定義 START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZKR00
             TO  SQL-TBL-ID7            OF  SQL-SELECT-1-7,
                 WK-TKMZKR00            OF  WK-MSG-1-7
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZBW09
             TO  H-RIYO-CMP-CD          OF  H-TKMZKR00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-7
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZBW09
             TO  H-FUND-CD              OF  H-TKMZKR00-S,
                 WK-FUND-CD             OF  WK-MSG-1-7
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZBW09
             TO  H-PTF-CD               OF  H-TKMZKR00-S,
                 WK-PTF-CD              OF  WK-MSG-1-7
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZBW09
             TO  H-SEC-SBT-CD           OF  H-TKMZKR00-S,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-7
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZBW09
             TO  H-MEG-CD               OF  H-TKMZKR00-S,
                 WK-MEG-CD              OF  WK-MSG-1-7
      *----------  資産/負債・買建/売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZBW09
             TO  H-TATE-FLG             OF  H-TKMZKR00-S,
                 WK-TATE-FLG            OF  WK-MSG-1-7
      *----------  玉ＩＤ
           MOVE  H-GYOKU-ID             OF  H-TKMZBW09
             TO  H-GYOKU-ID             OF  H-TKMZKR00-S,
                 WK-GYOKU-ID            OF  WK-MSG-1-7
      *----------  適用開始日
           MOVE  H-TEKIYO-FROM          OF  H-TKMZBW09
             TO  H-TEKIYO-FROM          OF  H-TKMZKR00-S,
                 WK-TEKIYO-FROM         OF  WK-MSG-1-7
      *----------  利払日
           MOVE  H-RIB-YMD              OF  H-TKMZBW09
             TO  H-RIB-YMD              OF  H-TKMZKR00-S,
                 WK-RIB-YMD             OF  WK-MSG-1-7
           INITIALIZE  SQLSTMT7                                         @3212SEINO@@
           MOVE  SQL-SELECT-1-7         TO  SQLSTMT7                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード                   =["
      D             H-SEC-SBT-CD        OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード                       =["
      D             H-MEG-CD            OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ         =["
      D             H-TATE-FLG          OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                           =["
      D             H-GYOKU-ID          OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日                       =["
      D             H-TEKIYO-FROM       OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":利払日                           =["
      D             H-RIB-YMD           OF  H-TKMZKR00-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT7=["SQLSTMT7"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-CR-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZKR00-CR-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKR00-CR-OPEN  = CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S7  FROM :SQLSTMT7  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-020
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-7         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZKR00_CUR  CURSOR  FOR S7 END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQLCODE-DECLARE=["
      D                                            SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZKR00_CUR
                 USING  :H-TKMZKR00-S.H-RIYO-CMP-CD,
                        :H-TKMZKR00-S.H-FUND-CD,
                        :H-TKMZKR00-S.H-PTF-CD,
                        :H-TKMZKR00-S.H-SEC-SBT-CD,
                        :H-TKMZKR00-S.H-MEG-CD,
                        :H-TKMZKR00-S.H-TATE-FLG,
                        :H-TKMZKR00-S.H-GYOKU-ID,
                        :H-TKMZKR00-S.H-TEKIYO-FROM,
                        :H-TKMZKR00-S.H-RIB-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息カーソル"
      D             "オープンフラグ=["FLG-TKMZKR00-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZKR00-CR-OPEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理正常（OPEN)"
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息カーソル"
      D             "オープンフラグ=["FLG-TKMZKR00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-021
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-7         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  TKMZKR00カーソル定義  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-FIND-D-EXT.
           EXIT.
      ******************************************************************
      *        TKMZKR00カーソルフェッチする
      ******************************************************************
       TKMZKR00-FIND-F-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  TKMZKR00カーソルフェッチす"
      D             "る START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZKR00
           EXEC  SQL
             FETCH  TKMZKR00_CUR
             INTO   :H-TKMZKR00.H-RIYO-CMP-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD       OF  H-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理正常（FETCH)"
      *-----------------------------------------------------------------
      *----------  該当レコードを債券過去経過利息TBLへ更新する
               PERFORM  TKMZKR00-UPDATE-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理NOTFOUND（FETCH)"
      *-----------------------------------------------------------------
      *----------  該当レコードを債券過去経過利息TBLへ追加する
               PERFORM  TKMZKR00-INSERT-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-022
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-7       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  TKMZKR00カーソルフェッチす"
      D             "る  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-FIND-F-EXT.
           EXIT.
      ******************************************************************
      *        該当レコードを債券過去経過利息TBLへ更新する
      ******************************************************************
       TKMZKR00-UPDATE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  該当レコードを債券過去経過利息"
      D             "TBLへ更新する START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZKR00
             TO  SQL-TBL-ID8            OF  SQL-UPDATE-1-8,
                 WK-TKMZKR00            OF  WK-MSG-1-8
      *----------  市場通貨コード
           MOVE  H-SIJO-TUKA-CD         OF  H-TKMZBW09
             TO  H-SIJO-TUKA-CD         OF  H-TKMZKR00-1,
                 WK-SIJO-TUKA-CD        OF  WK-MSG-1-8
      *----------  利払対象額面
           MOVE  H-RIB-TSHO-FACE        OF  H-TKMZBW09
             TO  H-RIB-TSHO-FACE        OF  H-TKMZKR00-1,
                 WK-RIB-TSHO-FACE       OF  WK-MSG-1-8
      *----------  市場通貨経過利息
           MOVE  H-SJTK-KEKA-RSK        OF  H-TKMZBW09
             TO  H-SJTK-KEKA-RSK        OF  H-TKMZKR00-1,
                 WK-SJTK-KEKA-RSK       OF  WK-MSG-1-8
      *----------  未入金対象額面残高
           MOVE  H-MNK-TSHO-FACE-ZAN    OF  H-TKMZBW09
             TO  H-MNK-TSHO-FACE-ZAN    OF  H-TKMZKR00-1,
                 WK-MNK-TSHO-FACE-ZAN   OF  WK-MSG-1-8
      *----------  市場通貨源泉税
           MOVE  H-SJTK-GENSEN-TAX      OF  H-TKMZBW09
             TO  H-SJTK-GENSEN-TAX      OF  H-TKMZKR00-1,
                 WK-SJTK-GENSEN-TAX     OF  WK-MSG-1-8
      *----------  ファクター・連動係数
           MOVE  H-FACTOR-RENDOU-KESU   OF  H-TKMZBW09
             TO  H-FACTOR-RENDOU-KESU   OF  H-TKMZKR00-1,
                 WK-FACTOR-RENDOU-KESU  OF  WK-MSG-1-8
      *----------  更新ログインユーザ会社コード
           MOVE  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW09
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZKR00-1,
                 WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-8
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZKR00-1,
                 WK-UPD-SID             OF  WK-MSG-1-8
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZBW09
             TO  H-RIYO-CMP-CD          OF  H-TKMZKR00-U-1,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-8
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZBW09
             TO  H-FUND-CD              OF  H-TKMZKR00-U-1,
                 WK-FUND-CD             OF  WK-MSG-1-8
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZBW09
             TO  H-PTF-CD               OF  H-TKMZKR00-U-1,
                 WK-PTF-CD              OF  WK-MSG-1-8
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZBW09
             TO  H-SEC-SBT-CD           OF  H-TKMZKR00-U-1,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-8
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZBW09
             TO  H-MEG-CD               OF  H-TKMZKR00-U-1,
                 WK-MEG-CD              OF  WK-MSG-1-8
      *----------  資産/負債・買建/売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZBW09
             TO  H-TATE-FLG             OF  H-TKMZKR00-U-1,
                 WK-TATE-FLG            OF  WK-MSG-1-8
      *----------  玉ＩＤ
           MOVE  H-GYOKU-ID             OF  H-TKMZBW09
             TO  H-GYOKU-ID             OF  H-TKMZKR00-U-1,
                 WK-GYOKU-ID            OF  WK-MSG-1-8
      *----------  適用開始日
           MOVE  H-TEKIYO-FROM          OF  H-TKMZBW09
             TO  H-TEKIYO-FROM          OF  H-TKMZKR00-U-1,
                 WK-TEKIYO-FROM         OF  WK-MSG-1-8
      *----------  利払日
           MOVE  H-RIB-YMD              OF  H-TKMZBW09
             TO  H-RIB-YMD              OF  H-TKMZKR00-U-1,
                 WK-RIB-YMD             OF  WK-MSG-1-8
           INITIALIZE  SQLSTMT8                                         @3212SEINO@@
           MOVE  SQL-UPDATE-1-8         TO  SQLSTMT8                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":UPDATEデータ"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード                   =["
      D             H-SIJO-TUKA-CD      OF  H-TKMZKR00-1"]"
      D    DISPLAY  CNS-PGM-ID":利払対象額面                     =["
      D             H-RIB-TSHO-FACE     OF  H-TKMZKR00-1"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息                 =["
      D             H-SJTK-KEKA-RSK     OF  H-TKMZKR00-1"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象額面残高               =["
      D             H-MNK-TSHO-FACE-ZAN OF  H-TKMZKR00-1"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税                   =["
      D             H-SJTK-GENSEN-TAX   OF  H-TKMZKR00-1"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数             =["
      D             H-FACTOR-RENDOU-KESU
      D                                 OF  H-TKMZKR00-1"]"
      D    DISPLAY  CNS-PGM-ID":更新フラグ                       =["
      D             "3]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード                   =["
      D             H-SEC-SBT-CD        OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード                       =["
      D             H-MEG-CD            OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ       =["
      D             H-TATE-FLG          OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                           =["
      D             H-GYOKU-ID          OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日                       =["
      D             H-TEKIYO-FROM       OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":利払日                           =["
      D             H-RIB-YMD           OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT8=["SQLSTMT8"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-UP-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZKR00-UP-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKR00-UP-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S8  FROM :SQLSTMT8  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-023
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-8         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S8
                 USING  :H-TKMZKR00-1.H-SIJO-TUKA-CD,
                        :H-TKMZKR00-1.H-RIB-TSHO-FACE,
                        :H-TKMZKR00-1.H-SJTK-KEKA-RSK,
                        :H-TKMZKR00-1.H-MNK-TSHO-FACE-ZAN,
                        :H-TKMZKR00-1.H-SJTK-GENSEN-TAX,
                        :H-TKMZKR00-1.H-FACTOR-RENDOU-KESU,
                        :H-TKMZKR00-1.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZKR00-1.H-UPD-SID,
                        :H-TKMZKR00-U-1.H-RIYO-CMP-CD,
                        :H-TKMZKR00-U-1.H-FUND-CD,
                        :H-TKMZKR00-U-1.H-PTF-CD,
                        :H-TKMZKR00-U-1.H-SEC-SBT-CD,
                        :H-TKMZKR00-U-1.H-MEG-CD,
                        :H-TKMZKR00-U-1.H-TATE-FLG,
                        :H-TKMZKR00-U-1.H-GYOKU-ID,
                        :H-TKMZKR00-U-1.H-TEKIYO-FROM,
                        :H-TKMZKR00-U-1.H-RIB-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":UPDATE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON               TO  FLG-TKMZKR00-UP-OPEN      @3212SEINO@@
               COMPUTE  WK-PAST-BOND-KEKA-RSK-COUNT  OF  WK-KOUSIN-COUNT
                     =  WK-PAST-BOND-KEKA-RSK-COUNT  OF  WK-KOUSIN-COUNT
                     +  CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-UP-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZKR00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理正常（UPDATE)"
      D    DISPLAY  CNS-PGM-ID":更新件数.債券過去経過利息_件数=["
      D             WK-PAST-BOND-KEKA-RSK-COUNT  OF  WK-KOUSIN-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理"
      D                                            "NOTFOUND（UPDATE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-024
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-110
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理エラー（UPDATE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-025
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  該当レコードを債券過去経過利息"
      D             "TBLへ更新する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *        該当レコードを債券過去経過利息TBLへ追加する
      ******************************************************************
       TKMZKR00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  該当レコードを債券過去経過利息"
      D             "TBLへ追加する START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZKR00
             TO  SQL-TBL-ID9,
                 WK-TKMZKR00            OF  WK-MSG-1-9
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZBW09
             TO  H-RIYO-CMP-CD          OF  H-TKMZKR00-I,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-9
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZBW09
             TO  H-FUND-CD              OF  H-TKMZKR00-I,
                 WK-FUND-CD             OF  WK-MSG-1-9
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZBW09
             TO  H-PTF-CD               OF  H-TKMZKR00-I,
                 WK-PTF-CD              OF  WK-MSG-1-9
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZBW09
             TO  H-SEC-SBT-CD           OF  H-TKMZKR00-I,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-9
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZBW09
             TO  H-MEG-CD               OF  H-TKMZKR00-I,
                 WK-MEG-CD              OF  WK-MSG-1-9
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZBW09
             TO  H-TATE-FLG             OF  H-TKMZKR00-I,
                 WK-TATE-FLG            OF  WK-MSG-1-9
      *----------  玉ＩＤ
           MOVE  H-GYOKU-ID             OF  H-TKMZBW09
             TO  H-GYOKU-ID             OF  H-TKMZKR00-I,
                 WK-GYOKU-ID            OF  WK-MSG-1-9
      *----------  適用開始日
           MOVE  H-TEKIYO-FROM          OF  H-TKMZBW09
             TO  H-TEKIYO-FROM          OF  H-TKMZKR00-I,
                 WK-TEKIYO-FROM         OF  WK-MSG-1-9
      *----------  利払日
           MOVE  H-RIB-YMD              OF  H-TKMZBW09
             TO  H-RIB-YMD              OF  H-TKMZKR00-I,
                 WK-RIB-YMD             OF  WK-MSG-1-9
      *----------  市場通貨コード
           MOVE  H-SIJO-TUKA-CD         OF  H-TKMZBW09
             TO  H-SIJO-TUKA-CD         OF  H-TKMZKR00-I,
                 WK-SIJO-TUKA-CD        OF  WK-MSG-1-9
      *----------  利払対象額面
           MOVE  H-RIB-TSHO-FACE        OF  H-TKMZBW09
             TO  H-RIB-TSHO-FACE        OF  H-TKMZKR00-I,
                 WK-RIB-TSHO-FACE       OF  WK-MSG-1-9
      *----------  市場通貨経過利息
           MOVE  H-SJTK-KEKA-RSK        OF  H-TKMZBW09
             TO  H-SJTK-KEKA-RSK        OF  H-TKMZKR00-I,
                 WK-SJTK-KEKA-RSK       OF  WK-MSG-1-9
      *----------  市場通貨源泉税
           MOVE  H-SJTK-GENSEN-TAX      OF  H-TKMZBW09
             TO  H-SJTK-GENSEN-TAX      OF  H-TKMZKR00-I,
                 WK-SJTK-GENSEN-TAX     OF  WK-MSG-1-9
      *----------  ファクター・連動係数
           MOVE  H-FACTOR-RENDOU-KESU   OF  H-TKMZBW09
             TO  H-FACTOR-RENDOU-KESU   OF  H-TKMZKR00-I,
                 WK-FACTOR-RENDOU-KESU  OF  WK-MSG-1-9
      *----------  未入金対象額面残高
           MOVE  H-MNK-TSHO-FACE-ZAN    OF  H-TKMZBW09
             TO  H-MNK-TSHO-FACE-ZAN    OF  H-TKMZKR00-I,
                 WK-MNK-TSHO-FACE-ZAN   OF  WK-MSG-1-9
      *----------  削除区分
           MOVE  H-SAKUJO-KBN           OF  H-TKMZBW09
             TO  H-SAKUJO-KBN           OF  H-TKMZKR00-I,
                 WK-SAKUJO-KBN          OF  WK-MSG-1-9
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZKR00-I,
                 WK-SK-LOGIN-CMP-CD     OF  WK-MSG-1-9
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZKR00-I,
                 WK-SK-SID              OF  WK-MSG-1-9
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZKR00-I,
                 WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-9
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZKR00-I,
                 WK-UPD-SID             OF  WK-MSG-1-9
           INITIALIZE  SQLSTMT9                                         @3212SEINO@@
           MOVE  SQL-INSERT-1-9         TO  SQLSTMT9                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERTデータ"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード                   =["
      D             H-SEC-SBT-CD        OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード                       =["
      D             H-MEG-CD            OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ         =["
      D             H-TATE-FLG          OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                           =["
      D             H-GYOKU-ID          OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日                       =["
      D             H-TEKIYO-FROM       OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":利払日                           =["
      D             H-RIB-YMD           OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード                   =["
      D             H-SIJO-TUKA-CD      OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":利払対象額面                     =["
      D             H-RIB-TSHO-FACE     OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨経過利息                 =["
      D             H-SJTK-KEKA-RSK     OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税                   =["
      D             H-SJTK-GENSEN-TAX   OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":ファクター・連動係数             =["
      D             H-FACTOR-RENDOU-KESU
      D                                 OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象額面残高               =["
      D             H-MNK-TSHO-FACE-ZAN OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":削除区分                         =["
      D             H-SAKUJO-KBN        OF  H-TKMZKR00-I"]"
      D    DISPLAY  CNS-PGM-ID":作成フラグ                       =["
      D             "3]"
      D    DISPLAY  CNS-PGM-ID":更新フラグ                       =["
      D             "3]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT9=["SQLSTMT9"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZKR00-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKR00-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S9  FROM :SQLSTMT9  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-026
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S9
                 USING  :H-TKMZKR00-I.H-RIYO-CMP-CD,
                        :H-TKMZKR00-I.H-FUND-CD,
                        :H-TKMZKR00-I.H-PTF-CD,
                        :H-TKMZKR00-I.H-SEC-SBT-CD,
                        :H-TKMZKR00-I.H-MEG-CD,
                        :H-TKMZKR00-I.H-TATE-FLG,
                        :H-TKMZKR00-I.H-GYOKU-ID,
                        :H-TKMZKR00-I.H-TEKIYO-FROM,
                        :H-TKMZKR00-I.H-RIB-YMD,
                        :H-TKMZKR00-I.H-SIJO-TUKA-CD,
                        :H-TKMZKR00-I.H-RIB-TSHO-FACE,
                        :H-TKMZKR00-I.H-SJTK-KEKA-RSK,
                        :H-TKMZKR00-I.H-SJTK-GENSEN-TAX,
                        :H-TKMZKR00-I.H-FACTOR-RENDOU-KESU,
                        :H-TKMZKR00-I.H-MNK-TSHO-FACE-ZAN,
                        :H-SPACE,
                        :H-SPACE,
                        :H-TKMZKR00-I.H-SAKUJO-KBN,
                        :H-TKMZKR00-I.H-SK-LOGIN-CMP-CD,
                        :H-TKMZKR00-I.H-SK-SID,
                        :H-TKMZKR00-I.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZKR00-I.H-UPD-SID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON               TO  FLG-TKMZKR00-IN-OPEN      @3212SEINO@@
               COMPUTE  WK-PAST-BOND-KEKA-RSK-COUNT  OF  WK-SINKI-COUNT
                     =  WK-PAST-BOND-KEKA-RSK-COUNT  OF  WK-SINKI-COUNT
                     +  CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZKR00-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.債券過去経過利息_件数=["
      D             WK-PAST-BOND-KEKA-RSK-COUNT  OF  WK-SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-INSERT-SQL処理エラ"
      D                                             "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-027
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-028
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  該当レコードを債券過去経過利息"
      D             "TBLへ追加する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        TKMZKR00カーソルクローズ処理
      ******************************************************************
      * TKMZKR00-FIND-C-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":***  TKMZKR00カーソルクローズ処理"
      *D             " START ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZKR00_CUR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZKR00-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理正常（CLOSE)"
      *D    DISPLAY  CNS-PGM-ID":債券過去経過利息カーソル"
      *D             "オープンフラグ=["FLG-TKMZKR00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":TKMZKR00-SELECT-SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
      *         MOVE  CNS-PGM-ID
      *           TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
      *         MOVE  CNS-POS-029
      *           TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
      *         MOVE  CNS-RTN-900
      *           TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
      *         MOVE  SQLCODE
      *           TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
      *         MOVE  CNS-DETAIL-1
      *           TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-7         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":***  TKMZKR00カーソルクローズ処理"
      *D             "  END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZKR00-FIND-C-EXT.
      *     EXIT.
      ******************************************************************
      *        3.2.1.2.3)『債券過去経過利息計算データ』カーソルクローズ処理
      ******************************************************************
      * TKMZBW09-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":*** 『債券過去経過利息計算データ』"
      *D             "カーソルクローズ処理 START ***"
      *-----------------------------------------------------------------
      *     EXEC  SQL
      *         CLOSE TKMZBW09_CUR
      *     END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-OFF              TO  FLG-TKMZBW09-CR-OPEN
      *----------------------<DEBUG>------------------------------------
      *D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理正常（CLOSE)"
      *D    DISPLAY  CNS-PGM-ID":債券過去経過利息計算データカーソル"
      *D             "オープンフラグ=["FLG-TKMZBW09-CR-OPEN"]"
      *-----------------------------------------------------------------
      *     ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":TKMZBW09-SELECT-SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
      *         MOVE  CNS-PGM-ID
      *           TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
      *         MOVE  CNS-POS-030
      *           TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
      *         MOVE  CNS-RTN-900
      *           TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
      *         MOVE  SQLCODE
      *           TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
      *         MOVE  CNS-DETAIL-1
      *           TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-6         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":***  『債券過去経過利息計算データ』"
      *D             "カーソルクローズ処理  END  ***"
      *-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZBW09-CLOSE-EXT.
      *     EXIT.
      ******************************************************************
      *        3.2.2.前払金管理データ 追加 処理
      ******************************************************************
       TKMZMB00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  前払金管理データ 追加 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.2.1 前払金管理TBLへ追加する
           PERFORM  TKMZMB00-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  前払金管理データ 追加 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMB00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2.1 前払金管理TBLへ追加する
      ******************************************************************
       TKMZMB00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  前払金管理TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW10
             TO  SQL-TBL-ID11-1         OF  SQL-INSERT-1-11,
                 WK-TKMZBW10            OF  WK-MSG-1-11
           MOVE  WK-TABLE-TKMZMB00
             TO  SQL-TBL-ID11           OF  SQL-INSERT-1-11,
                 WK-TKMZMB00            OF  WK-MSG-1-11
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW10
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZBW10
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW10
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZBW10
      *----------  処理フラグ
           MOVE  CNS-SYRI-FLG-1
             TO  H-SYRI-FLG             OF  H-TKMZBW10-S,
                 WK-SYRI-FLG            OF  WK-MSG-1-11
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW10-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-11
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW10-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-11
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW10-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-11
           INITIALIZE  SQLSTMT11                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-11        TO  SQLSTMT11                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZBW10"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZBW10"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW10"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZBW10"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理フラグ                       =["
      D             H-SYRI-FLG          OF  H-TKMZBW10-S"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW10-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW10-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW10-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT11=["SQLSTMT11"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW10-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW10-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW10-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S11  FROM :SQLSTMT11  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-031
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-11        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S11
                 USING  :H-TKMZBW10.H-SK-LOGIN-CMP-CD,
                        :H-TKMZBW10.H-SK-SID,
                        :H-TKMZBW10.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW10.H-UPD-SID,
                        :H-TKMZBW10-S.H-SYORI-YMD,
                        :H-TKMZBW10-S.H-KIDOU-ID,
                        :H-TKMZBW10-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON                 TO  FLG-TKMZBW10-IN-OPEN    @3212SEINO@@
               MOVE  SQLERRD                OF  SQLCA(CNS-3)
                 TO  MAEBR-KIN-KANRI-COUNT  OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW10-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW10-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.前払金管理_件数=["
      D              MAEBR-KIN-KANRI-COUNT  OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-INSERT-SQL処理エラ"
      D                                            "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-032
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-11      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-INSERT-SQL処理（NOTFOUND)"
      *-----------------------------------------------------------------
      *        CONTINUE
               MOVE  CNS-ON                 TO  FLG-TKMZBW10-IN-OPEN    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW10-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW10-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-033
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-13      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  前払金管理TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMB00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.3.残高異動データ 追加 処理
      ******************************************************************
       TKMZZI00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  残高異動データ 追加 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.3.0 赤黒区分更新
           PERFORM  TKMZZI00-UPDATE-RTN
      *----------  3.2.3.1 残高異動TBLへ追加する
           PERFORM  TKMZZI00-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  残高異動データ 追加 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.3.0 赤黒区分更新
      ******************************************************************
       TKMZZI00-UPDATE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3.2.3.0 赤黒区分更新"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZZI00
             TO  SQL-TBL-ID32           OF  SQL-UPDATE-1-32,
                 WK-TKMZZI00            OF  WK-MSG-1-32
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZKR00-U-1,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-32
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-KYJ-YMD-DMN-INFO
             TO  H-FUND-CD              OF  H-TKMZKR00-U-1,
                 WK-FUND-CD             OF  WK-MSG-1-32
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-KYJ-YMD-DMN-INFO
             TO  H-PTF-CD               OF  H-TKMZKR00-U-1,
                 WK-PTF-CD              OF  WK-MSG-1-32
           INITIALIZE  SQLSTMT32                                        @3212SEINO@@
           MOVE  SQL-UPDATE-1-32        TO  SQLSTMT32                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZKR00-U-1"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT32=["SQLSTMT32"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-UP-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZZI00-UP-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZZI00-UP-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S32  FROM :SQLSTMT32  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-034
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-32        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S32
                 USING  :H-TKMZKR00-U-1.H-RIYO-CMP-CD,
                        :H-TKMZKR00-U-1.H-FUND-CD,
                        :H-TKMZKR00-U-1.H-PTF-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":UPDATE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理正常（UPDATE)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON               TO  FLG-TKMZZI00-UP-OPEN      @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-UP-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZZI00-UP-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理"
      D                                            "NOTFOUND（UPDATE)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON               TO  FLG-TKMZZI00-UP-OPEN      @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-UP-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZZI00-UP-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理エラー（UPDATE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-035
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-32      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3.2.3.0 赤黒区分更新"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *        3.2.3.1 残高異動TBLへ追加する
      ******************************************************************
       TKMZZI00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  残高異動TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW06
             TO  SQL-TBL-ID13-1         OF  SQL-INSERT-1-13,
                 WK-TKMZBW06            OF  WK-MSG-1-13
           MOVE  WK-TABLE-TKMZZI00
             TO  SQL-TBL-ID13           OF  SQL-INSERT-1-13,
                 WK-TKMZZI00            OF  WK-MSG-1-13
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW06
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZBW06
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW06
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZBW06
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW06-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-13
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW06-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-13
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW06-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-13
           INITIALIZE  SQLSTMT13                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-13        TO  SQLSTMT13                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZBW06"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZBW06"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW06"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZBW06"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW06-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT13=["SQLSTMT13"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW06-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW06-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW06-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S13  FROM :SQLSTMT13  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-036
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-13        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S13
                 USING  :H-TKMZBW06.H-SK-LOGIN-CMP-CD,
                        :H-TKMZBW06.H-SK-SID,
                        :H-TKMZBW06.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW06.H-UPD-SID,
                        :H-TKMZBW06-S.H-SYORI-YMD,
                        :H-TKMZBW06-S.H-KIDOU-ID,
                        :H-TKMZBW06-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW06-IN-OPEN        @3212SEINO@@
               MOVE  SQLERRD            OF  SQLCA(CNS-3)
                 TO  ZANDAKA-IDO-COUNT  OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW06-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW06-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.残高異動_件数=["
      D              ZANDAKA-IDO-COUNT  OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-INSERT-SQL処理エラ"
      D                                            "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-037
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-13      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-INSERT-SQL処理"
      D                                            "NOTFOUND（INSERT)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-TKMZBW06-IN-OPEN        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW06-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW06-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-038
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-13      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  残高異動TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.4.残高履歴データ 追加 処理
      ******************************************************************
       TKMZZR00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  残高履歴データ 追加 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.4.1 残高履歴TBLへ追加する
           PERFORM  TKMZZR00-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  残高履歴データ 追加 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.4.1 残高履歴TBLへ追加する
      ******************************************************************
       TKMZZR00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  残高履歴TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW11
             TO  SQL-TBL-ID15-1         OF  SQL-INSERT-1-15,
                 WK-TKMZBW11            OF  WK-MSG-1-15
           MOVE  WK-TABLE-TKMZZR00
             TO  SQL-TBL-ID15           OF  SQL-INSERT-1-15,
                 WK-TKMZZR00            OF  WK-MSG-1-15
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW11
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZBW11
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW11
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZBW11
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW11-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-15
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW11-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-15
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW11-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-15
           INITIALIZE  SQLSTMT15                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-15        TO  SQLSTMT15                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZBW11"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZBW11"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW11"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZBW11"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW11-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW11-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW11-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT15=["SQLSTMT15"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW11-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW11-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW11-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S15  FROM :SQLSTMT15  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-039
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-15        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S15
                 USING  :H-TKMZBW11.H-SK-LOGIN-CMP-CD,
                        :H-TKMZBW11.H-SK-SID,
                        :H-TKMZBW11.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW11.H-UPD-SID,
                        :H-TKMZBW11-S.H-SYORI-YMD,
                        :H-TKMZBW11-S.H-KIDOU-ID,
                        :H-TKMZBW11-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW11-IN-OPEN        @3212SEINO@@
               MOVE  SQLERRD            OF  SQLCA(CNS-3)
                 TO  ZN-RIRK-COUNT      OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW11-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW11-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.残高履歴_件数=["
      D              ZN-RIRK-COUNT      OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-INSERT-SQL処理エラ"
      D                                            "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-040
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-15      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-INSERT-SQL処理"
      D                                            "NOTFOUND（INSERT)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-TKMZBW11-IN-OPEN        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW11-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW11-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-041
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-15      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  残高履歴TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.5.元本残高データ 追加 処理
      ******************************************************************
       TKMZGZ00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  元本残高データ 追加 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.5.1 元本残高TBLへ追加する
           PERFORM  TKMZGZ00-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  元本残高データ 追加 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZGZ00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.5.1 元本残高TBLへ追加する
      ******************************************************************
       TKMZGZ00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  元本残高TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW13
             TO  SQL-TBL-ID17-1         OF  SQL-INSERT-1-17,
                 WK-TKMZBW13            OF  WK-MSG-1-17
           MOVE  WK-TABLE-TKMZGZ00
             TO  SQL-TBL-ID17           OF  SQL-INSERT-1-17,
                 WK-TKMZGZ00            OF  WK-MSG-1-17
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW13
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZBW13
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW13
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZBW13
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW13-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-17
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW13-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-17
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW13-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-17
           INITIALIZE  SQLSTMT17                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-17        TO  SQLSTMT17                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZBW13"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZBW13"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW13"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZBW13"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW13-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW13-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW13-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT17=["SQLSTMT17"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW13-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW13-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW13-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S17  FROM :SQLSTMT17  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZGZ00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZGZ00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-042
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-17        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S17
                 USING  :H-TKMZBW13.H-SK-LOGIN-CMP-CD,
                        :H-TKMZBW13.H-SK-SID,
                        :H-TKMZBW13.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW13.H-UPD-SID,
                        :H-TKMZBW13-S.H-SYORI-YMD,
                        :H-TKMZBW13-S.H-KIDOU-ID,
                        :H-TKMZBW13-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW13-IN-OPEN        @3212SEINO@@
               MOVE  SQLERRD            OF  SQLCA(CNS-3)
                 TO  GNP-ZN-COUNT       OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW13-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW13-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZGZ00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.元本残高_件数=["
      D              GNP-ZN-COUNT       OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZGZ00-INSERT-SQL処理エラ"
      D                                            "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-043
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-17      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZGZ00-INSERT-SQL処理"
      D                                            "NOTFOUND（INSERT)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-TKMZBW13-IN-OPEN        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW13-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW13-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZGZ00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-044
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-17      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  元本残高TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZGZ00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.6.資金簿価異動データ 追加 処理
      ******************************************************************
       TKMZSI00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金簿価異動データ 追加 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.6.1 資金簿価異動TBLへ追加する
           PERFORM  TKMZSI00-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金簿価異動データ 追加 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSI00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.6.1 資金簿価異動TBLへ追加する
      ******************************************************************
       TKMZSI00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金簿価異動TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW07
             TO  SQL-TBL-ID19-1         OF  SQL-INSERT-1-19,
                 WK-TKMZBW07            OF  WK-MSG-1-19
           MOVE  WK-TABLE-TKMZSI00
             TO  SQL-TBL-ID19           OF  SQL-INSERT-1-19,
                 WK-TKMZSI00            OF  WK-MSG-1-19
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW07
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZBW07
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW07
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZBW07
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW07-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-19
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW07-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-19
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW07-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-19
           INITIALIZE  SQLSTMT19                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-19        TO  SQLSTMT19                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZBW07"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZBW07"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW07"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZBW07"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT19=["SQLSTMT19"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW07-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW07-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW07-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S19  FROM :SQLSTMT19  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-045
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-19        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S19
                 USING  :H-TKMZBW07.H-SK-LOGIN-CMP-CD,
                        :H-TKMZBW07.H-SK-SID,
                        :H-TKMZBW07.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW07.H-UPD-SID,
                        :H-TKMZBW07-S.H-SYORI-YMD,
                        :H-TKMZBW07-S.H-KIDOU-ID,
                        :H-TKMZBW07-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON                TO  FLG-TKMZBW07-IN-OPEN     @3212SEINO@@
               MOVE  SQLERRD               OF  SQLCA(CNS-3)
                 TO  SIKIN-BOKA-IDO-COUNT  OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW07-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW07-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.資金簿価異動_件数=["
      D              SIKIN-BOKA-IDO-COUNT  OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-INSERT-SQL処理エラ"
      D                                            "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-046
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-19      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-INSERT-SQL処理"
      D                                            "NOTFOUND（INSERT)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON                TO  FLG-TKMZBW07-IN-OPEN     @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW07-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW07-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-047
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-19      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金簿価異動TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSI00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.7.資金残履歴データ 追加 処理
      ******************************************************************
       TKMZSR00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金残履歴データ 追加 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.7.1 資金残履歴TBLへ追加する
           PERFORM  TKMZSR00-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金残履歴データ 追加 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSR00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.7.1 資金残履歴TBLへ追加する
      ******************************************************************
       TKMZSR00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金残履歴TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW12
             TO  SQL-TBL-ID21-1         OF  SQL-INSERT-1-21,
                 WK-TKMZBW12            OF  WK-MSG-1-21
           MOVE  WK-TABLE-TKMZSR00
             TO  SQL-TBL-ID21           OF  SQL-INSERT-1-21,
                 WK-TKMZSR00            OF  WK-MSG-1-21
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW12
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZBW12
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW12
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZBW12
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW12-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-21
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW12-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-21
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW12-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-21
           INITIALIZE  SQLSTMT21                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-21        TO  SQLSTMT21                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZBW12"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZBW12"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW12"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZBW12"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW12-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW12-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW12-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT21=["SQLSTMT21"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW12-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW12-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW12-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S21  FROM :SQLSTMT21  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSR00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSR00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-048
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-21        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S21
                 USING  :H-TKMZBW12.H-SK-LOGIN-CMP-CD,
                        :H-TKMZBW12.H-SK-SID,
                        :H-TKMZBW12.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW12.H-UPD-SID,
                        :H-TKMZBW12-S.H-SYORI-YMD,
                        :H-TKMZBW12-S.H-KIDOU-ID,
                        :H-TKMZBW12-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW12-IN-OPEN        @3212SEINO@@
               MOVE  SQLERRD            OF  SQLCA(CNS-3)
                 TO  SIKI-ZN-COUNT      OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW12-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW12-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZSR00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.資金残履歴_件数=["
      D              SIKI-ZN-COUNT      OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSR00-INSERT-SQL処理エラ"
      D                                            "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-049
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-21      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSR00-INSERT-SQL処理"
      D                                            "NOTFOUND（INSERT)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-TKMZBW12-IN-OPEN        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW12-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW12-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSR00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-050
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-21      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金残履歴TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSR00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.8.勘定異動データ 追加 処理
      ******************************************************************
       TKMZKI00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定異動データ 追加 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.8.1 勘定異動TBLへ追加する
           PERFORM  TKMZKI00-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定異動データ 追加 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKI00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.8.1 勘定異動TBLへ追加する
      ******************************************************************
       TKMZKI00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定異動TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW15
             TO  SQL-TBL-ID23-1         OF  SQL-INSERT-1-23,
                 WK-TKMZBW15            OF  WK-MSG-1-23
           MOVE  WK-TABLE-TKMZKI00
             TO  SQL-TBL-ID23           OF  SQL-INSERT-1-23,
                 WK-TKMZKI00            OF  WK-MSG-1-23
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW15
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZBW15
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW15
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZBW15
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW15-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-23
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW15-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-23
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW15-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-23
           INITIALIZE  SQLSTMT23                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-23        TO  SQLSTMT23                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZBW15"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZBW15"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW15"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZBW15"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW15-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW15-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW15-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT23=["SQLSTMT23"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW15-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW15-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW15-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S23  FROM :SQLSTMT23  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-051
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-23        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S23
                 USING  :H-TKMZBW15.H-SK-LOGIN-CMP-CD,
                        :H-TKMZBW15.H-SK-SID,
                        :H-TKMZBW15.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW15.H-UPD-SID,
                        :H-TKMZBW15-S.H-SYORI-YMD,
                        :H-TKMZBW15-S.H-KIDOU-ID,
                        :H-TKMZBW15-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW15-IN-OPEN        @3212SEINO@@
               MOVE  SQLERRD            OF  SQLCA(CNS-3)
                 TO  KNJ-IDOK-COUNT     OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW15-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW15-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.勘定異動_件数=["
      D              KNJ-IDOK-COUNT     OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-INSERT-SQL処理エラ"
      D                                            "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-052
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-23      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-INSERT-SQL処理"
      D                                            "NOTFOUND（INSERT)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-TKMZBW15-IN-OPEN        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW15-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW15-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-053
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-23      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定異動TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKI00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.9.勘定残高データ 追加 処理
      ******************************************************************
       TKMZKZ00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定残高データ 追加 処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  3.2.9.1 勘定残高TBLへ追加する
           PERFORM  TKMZKZ00-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定残高データ 追加 処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        3.2.9.1 勘定残高TBLへ追加する
      ******************************************************************
       TKMZKZ00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定残高TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW16
             TO  SQL-TBL-ID25-1         OF  SQL-INSERT-1-25,
                 WK-TKMZBW16            OF  WK-MSG-1-25
           MOVE  WK-TABLE-TKMZKZ00
             TO  SQL-TBL-ID25           OF  SQL-INSERT-1-25,
                 WK-TKMZKZ00            OF  WK-MSG-1-25
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZBW16
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZBW16
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW16
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZBW16
      *----------  異動計上開始日
           MOVE  WK-KAISI-KJN-YMD-NEXT  OF  WK-KYJ-YMD-DMN-INFO
             TO  H-IDO-KJY-FROM         OF  H-TKMZBW16
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SYORI-YMD            OF  H-TKMZBW16-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-25
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KIDOU-ID             OF  H-TKMZBW16-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-25
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW16-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-25
           INITIALIZE  SQLSTMT25                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-25        TO  SQLSTMT25                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":異動計上開始日                   =["
      D             H-IDO-KJY-FROM      OF  H-TKMZBW16"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":処理実行日                       =["
      D             H-SYORI-YMD         OF  H-TKMZBW16-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                           =["
      D             H-KIDOU-ID          OF  H-TKMZBW16-S"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW16-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT25=["SQLSTMT25"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZBW16-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW16-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S25  FROM :SQLSTMT25  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-054
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-25        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S25
                 USING  :H-TKMZBW16.H-IDO-KJY-FROM,
                        :H-TKMZBW16.H-SK-LOGIN-CMP-CD,
                        :H-TKMZBW16.H-SK-SID,
                        :H-TKMZBW16.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZBW16.H-UPD-SID,
                        :H-TKMZBW16-S.H-SYORI-YMD,
                        :H-TKMZBW16-S.H-KIDOU-ID,
                        :H-TKMZBW16-S.H-RIYO-CMP-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW16-IN-OPEN        @3212SEINO@@
               MOVE  SQLERRD            OF  SQLCA(CNS-3)
                 TO  KNJZN-COUNT        OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW16-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.勘定残高_件数=["
      D              KNJZN-COUNT        OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理エラ"
      D                                            "ー（一意制約違反)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-055
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-25      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理"
      D                                            "NOTFOUND（INSERT)"
      *-----------------------------------------------------------------
      *        CONTINUE                                                 @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-TKMZBW16-IN-OPEN        @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW16-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-056
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-25      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金残履歴TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKZ00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.10.基準日計算情報データ更新処理
      ******************************************************************
       TKMZKK00-INSUPD-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  基準日計算情報データ更新処理"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  基準日計算情報データ更新
           PERFORM  TKMZKK00-UPDATE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  基準日計算情報データ更新処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKK00-INSUPD-EXT.
           EXIT.
      ******************************************************************
      *        基準日計算情報データ更新
      ******************************************************************
       TKMZKK00-UPDATE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  基準日計算情報データ更新"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZKK00
             TO  SQL-TBL-ID30           OF  SQL-UPDATE-1-30,
                 WK-TKMZKK00            OF  WK-MSG-1-30
      *----------  仕訳基準パターンコード
           MOVE  WK-SWK-KJN-PTN-CD      OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SWK-KJN-PTN-CD       OF  H-TKMZKK00,
                 WK-SWK-KJN-PTN-CD      OF  WK-MSG-1-30
      *----------  異動計算パターンコード
           MOVE  WK-IDO-CALC-PATTERN-CD
                                        OF  WK-KYJ-YMD-DMN-INFO
             TO  H-IDO-CALC-PATTERN-CD  OF  H-TKMZKK00,
                 WK-IDO-CALC-PATTERN-CD
                                        OF  WK-MSG-1-30
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZKK00
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZKK00
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZKK00-U,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-30
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-KYJ-YMD-DMN-INFO
             TO  H-FUND-CD              OF  H-TKMZKK00-U,
                 WK-FUND-CD             OF  WK-MSG-1-30
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-KYJ-YMD-DMN-INFO
             TO  H-PTF-CD               OF  H-TKMZKK00-U,
                 WK-PTF-CD              OF  WK-MSG-1-30
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KJN-YMD              OF  H-TKMZKK00-U,
                 WK-KJN-YMD             OF  WK-MSG-1-30
           INITIALIZE  SQLSTMT30                                        @3212SEINO@@
           MOVE  SQL-UPDATE-1-30        TO  SQLSTMT30                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":UPDATEデータ"
      D    DISPLAY  CNS-PGM-ID":仕訳基準パターンコード           =["
      D             H-SWK-KJN-PTN-CD    OF  H-TKMZKK00"]"
      D    DISPLAY  CNS-PGM-ID":異動計算パターンコード           =["
      D             H-IDO-CALC-PATTERN-CD
      D                                 OF  H-TKMZKK00"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZKK00"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZKK00"]"
      D    DISPLAY  CNS-PGM-ID":WHERE条件"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKK00-U"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZKK00-U"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZKK00-U"]"
      D    DISPLAY  CNS-PGM-ID":基準日                           =["
      D             H-KJN-YMD           OF  H-TKMZKK00-U"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT30=["SQLSTMT30"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-UP-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZKK00-UP-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKK00-UP-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S30  FROM :SQLSTMT30  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-057
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-8         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S30
                 USING  :H-TKMZKK00.H-SWK-KJN-PTN-CD,
                        :H-TKMZKK00.H-IDO-CALC-PATTERN-CD,
                        :H-TKMZKK00.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZKK00.H-UPD-SID,
                        :H-TKMZKK00-U.H-RIYO-CMP-CD,
                        :H-TKMZKK00-U.H-FUND-CD,
                        :H-TKMZKK00-U.H-PTF-CD,
                        :H-TKMZKK00-U.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":UPDATE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON                    TO  FLG-TKMZKK00-UP-OPEN @3212SEINO@@
               MOVE  SQLERRD                   OF  SQLCA(CNS-3)
                 TO  KYJ-YMD-CALC-INFO-COUNT   OF  KOUSIN-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-UP-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZKK00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理正常（UPDATE)"
      D    DISPLAY  CNS-PGM-ID":更新件数.基準日計算情報_件数=["
      D             KYJ-YMD-CALC-INFO-COUNT    OF  KOUSIN-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理"
      D                                            "NOTFOUND（UPDATE)"
      *-----------------------------------------------------------------
      *---------- 基準日計算情報データ追加
               MOVE  CNS-ON                    TO  FLG-TKMZKK00-UP-OPEN @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-UP-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZKK00-UP-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               PERFORM  TKMZKK00-INSERT-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理エラー（UPDATE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-058
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  基準日計算情報データ更新"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKK00-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *        基準日計算情報データ追加
      ******************************************************************
       TKMZKK00-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定残高TBLへ追加する"
      D             " START ***"
      *-----------------------------------------------------------------
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZKK00
             TO  SQL-TBL-ID31           OF  SQL-INSERT-1-31,
                 WK-TKMZKK00            OF  WK-MSG-1-31
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  H-RIYO-CMP-CD          OF  H-TKMZKK00-I,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-31
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-KYJ-YMD-DMN-INFO
             TO  H-FUND-CD              OF  H-TKMZKK00-I,
                 WK-FUND-CD             OF  WK-MSG-1-31
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-KYJ-YMD-DMN-INFO
             TO  H-PTF-CD               OF  H-TKMZKK00-I,
                 WK-PTF-CD              OF  WK-MSG-1-31
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-KYJ-YMD-DMN-INFO
             TO  H-KJN-YMD              OF  H-TKMZKK00-I,
                 WK-KJN-YMD             OF  WK-MSG-1-31
      *----------  仕訳基準パターンコード
           MOVE  WK-SWK-KJN-PTN-CD      OF  WK-KYJ-YMD-DMN-INFO
             TO  H-SWK-KJN-PTN-CD       OF  H-TKMZKK00-I,
                 WK-SWK-KJN-PTN-CD      OF  WK-MSG-1-31
      *----------  異動計算パターンコード
           MOVE  WK-IDO-CALC-PATTERN-CD
                                        OF  WK-KYJ-YMD-DMN-INFO
             TO  H-IDO-CALC-PATTERN-CD  OF  H-TKMZKK00-I,
                 WK-IDO-CALC-PATTERN-CD
                                        OF  WK-MSG-1-31
      *----------  作成ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-SK-LOGIN-CMP-CD      OF  H-TKMZKK00-I,
                 WK-SK-LOGIN-CMP-CD     OF  WK-MSG-1-31
      *----------  作成ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-SK-SID               OF  H-TKMZKK00-I,
                 WK-SK-SID              OF  WK-MSG-1-31
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZKK00-I,
                 WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-31
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID
             TO  H-UPD-SID              OF  H-TKMZKK00-I,
                 WK-UPD-SID             OF  WK-MSG-1-31
           INITIALIZE  SQLSTMT31                                        @3212SEINO@@
           MOVE  SQL-INSERT-1-31        TO  SQLSTMT31                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERTデータ"
      D    DISPLAY  CNS-PGM-ID":利用会社コード                   =["
      D             H-RIYO-CMP-CD       OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード                   =["
      D             H-FUND-CD           OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード             =["
      D             H-PTF-CD            OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":基準日                           =["
      D             H-KJN-YMD           OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":仕訳基準パターンコード           =["
      D             H-SWK-KJN-PTN-CD    OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":異動計算パターンコード           =["
      D             H-IDO-CALC-PATTERN-CD
      D                                 OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":削除区分                         =["
      D             H-SAKUJO-KBN        OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":作成ログインユーザ会社コード     =["
      D             H-SK-LOGIN-CMP-CD   OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":作成ユーザＩＤ                   =["
      D             H-SK-SID            OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード     =["
      D             H-UPD-LOGIN-CMP-CD  OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ                   =["
      D             H-UPD-SID           OF  H-TKMZKK00-I"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT31=["SQLSTMT31"]"                @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-IN-OPEN = ["               @3212SEINO@@
      D                          FLG-TKMZKK00-IN-OPEN"]"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZKK00-IN-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S31  FROM :SQLSTMT31  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-059
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-31        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S31
                 USING  :H-TKMZKK00-I.H-RIYO-CMP-CD,
                        :H-TKMZKK00-I.H-FUND-CD,
                        :H-TKMZKK00-I.H-PTF-CD,
                        :H-TKMZKK00-I.H-KJN-YMD,
                        :H-TKMZKK00-I.H-SWK-KJN-PTN-CD,
                        :H-TKMZKK00-I.H-IDO-CALC-PATTERN-CD,
                        :H-TKMZKK00-I.H-SAKUJO-KBN,
                        :H-TKMZKK00-I.H-SK-LOGIN-CMP-CD,
                        :H-TKMZKK00-I.H-SK-SID,
                        :H-TKMZKK00-I.H-UPD-LOGIN-CMP-CD,
                        :H-TKMZKK00-I.H-UPD-SID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZKK00-IN-OPEN        @3212SEINO@@
               MOVE  SQLERRD            OF  SQLCA(CNS-3)
                 TO  KYJ-YMD-CALC-INFO-COUNT
                                        OF  SINKI-COUNT
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-IN-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZKK00-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理正常（INSERT)"
      D    DISPLAY  CNS-PGM-ID":新規件数.基準日計算情報_件数=["
      D             KYJ-YMD-CALC-INFO-COUNT
      D                                 OF  SINKI-COUNT"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKZ00-INSERT-SQL処理エラー（INSERT)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-060
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-31      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  資金残履歴TBLへ追加する"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKK00-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.10.各計算データTBLを削除処理
      ******************************************************************
       SMZJ4016-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  各計算データTBLを削除処理"
      D             " START ***"
      D    DISPLAY  CNS-PGM-ID  ":***【SMZJ4016】中間データ削除ルーチン"
      D             " START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ4016-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-KYJ-YMD-DMN-INFO
             TO  RIYO-CMP-CD            OF  PARM-SMZJ4016-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-KYJ-YMD-DMN-INFO
             TO  SYORI-YMD              OF  PARM-SMZJ4016-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-KYJ-YMD-DMN-INFO
             TO  KIDOU-ID               OF  PARM-SMZJ4016-ARG1
      *----------  処理区分
           MOVE  CNS-KBN-1
             TO  SYORI-KBN              OF  PARM-SMZJ4016-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード              =["
      D             RIYO-CMP-CD         OF  PARM-SMZJ4016-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日                  =["
      D             SYORI-YMD           OF  PARM-SMZJ4016-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                      =["
      D             KIDOU-ID            OF  PARM-SMZJ4016-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理区分                    =["
      D             SYORI-KBN           OF  PARM-SMZJ4016-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ4016"             USING  PARM-SMZJ4016-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF  PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ4016)=["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***【SMZJ4016】中間データ削除ルーチン"
      D             " 正常 ***"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***【SMZJ4016】中間データ削除ルーチン"
      D             " 異常 ***"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-061
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***【SMZJ4016】中間データ削除ルーチン"
      D             " END ***"
      D    DISPLAY  CNS-PGM-ID  ":***  各計算データTBLを削除処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ4016-EXT.
           EXIT.
      ******************************************************************
      *     3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   後処理  START  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ2310-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ2310-RTNPKG   = ["
      D      PARM-SMZJ2310-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER                        OF PARM-SMZJ2310-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ2310-ARG3(COUNTER  OF PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ2310-ARG3(COUNTER  OF PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ2310-ARG3(COUNTER  OF PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ2310-ARG3(COUNTER  OF PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ2310-ARG3(COUNTER  OF PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ2310-ARG3(COUNTER  OF PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *     3.4.1 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":TKMZBW08_CUR OPEN FLAG =["
      D             FLG-TKMZBW08-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":TKMZMS00_CUR OPEN FLAG =["
      D             FLG-TKMZMS00-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR OPEN FLAG =["
      D             FLG-TKMZBW09-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR OPEN FLAG =["
      D             FLG-TKMZKR00-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-UP-OPEN =["                @3212SEINO@@
      D             FLG-TKMZMS00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZMS00-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-UP-OPEN =["                @3212SEINO@@
      D             FLG-TKMZKR00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZKR00-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW10-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW10-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-UP-OPEN =["                @3212SEINO@@
      D             FLG-TKMZZI00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW06-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW06-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW11-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW11-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW13-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW13-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW07-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW07-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW12-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW12-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW15-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW15-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW16-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-UP-OPEN =["                @3212SEINO@@
      D             FLG-TKMZKK00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZKK00-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                TO  FLG-TKMZKK00-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZKK00-UP-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW16-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW15-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW12-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW07-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW13-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW11-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW06-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZZI00-UP-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW10-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZKR00-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZKR00-UP-OPEN        @3212SEINO@@
           IF  FLG-TKMZKR00-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
               CLOSE TKMZKR00_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-SQLCODE(CLOSE) =[" SQLCODE"]"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZKR00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR OPEN FLAG =["
      D             FLG-TKMZKR00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW09-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
               CLOSE TKMZBW09_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09-SQLCODE(CLOSE) =[" SQLCODE"]"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZBW09-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR OPEN FLAG =["
      D             FLG-TKMZBW09-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           MOVE  CNS-OFF                TO  FLG-TKMZMS00-IN-OPEN        @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZMS00-UP-OPEN        @3212SEINO@@
           IF  FLG-TKMZMS00-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
               CLOSE TKMZMS00_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-SQLCODE(CLOSE) =[" SQLCODE"]"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZMS00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00_CUR OPEN FLAG =["
      D             FLG-TKMZMS00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW08-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
               CLOSE TKMZBW08_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08-SQLCODE(CLOSE) =[" SQLCODE"]"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF              TO  FLG-TKMZBW08-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08_CUR OPEN FLAG =["
      D             FLG-TKMZBW08-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW08_CUR OPEN FLAG =["              @3212SEINO@@
      D             FLG-TKMZBW08-CR-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZMS00_CUR OPEN FLAG =["              @3212SEINO@@
      D             FLG-TKMZMS00-CR-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZBW09_CUR OPEN FLAG =["              @3212SEINO@@
      D             FLG-TKMZBW09-CR-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKR00_CUR OPEN FLAG =["              @3212SEINO@@
      D             FLG-TKMZKR00-CR-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-UP-OPEN =["                @3212SEINO@@
      D             FLG-TKMZMS00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZMS00-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZMS00-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-UP-OPEN =["                @3212SEINO@@
      D             FLG-TKMZKR00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKR00-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZKR00-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW10-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW10-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-UP-OPEN =["                @3212SEINO@@
      D             FLG-TKMZZI00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW06-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW06-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW11-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW11-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW13-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW13-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW07-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW07-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW12-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW12-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW15-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW15-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW16-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZBW16-IN-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-UP-OPEN =["                @3212SEINO@@
      D             FLG-TKMZKK00-UP-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZKK00-IN-OPEN =["                @3212SEINO@@
      D             FLG-TKMZKK00-IN-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":PARM-SMZJ2310-IN=["
      D            PARM-SMZJ2310-IN"]"
      *-----------------------------------------------------------------
      *----------  リターンパッケージの設定
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理 START ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"             USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ2310-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ2310-RTNPKG   = ["
      D      PARM-SMZJ2310-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":  COUNTER  =["
      D            COUNTER              OF  PARM-SMZJ2310-ARG3"]"
      D    DISPLAY CNS-PGM-ID":  エラー検知プログラム名=["
      D            ERR-PGM-ID           OF  PARM-SMZJ2310-ARG3(COUNTER
      D                                 OF  PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  ポジション =["
      D            ERR-POS              OF  PARM-SMZJ2310-ARG3(COUNTER
      D                                 OF  PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  リターンコード =["
      D            RTN-CD               OF  PARM-SMZJ2310-ARG3(COUNTER
      D                                 OF  PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコード =["
      D            DETAIL-RTN-CD        OF  PARM-SMZJ2310-ARG3(COUNTER
      D                                 OF  PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコードデコードフラグ =["
      D            DETAIL-RTN-CD-FLG    OF  PARM-SMZJ2310-ARG3(COUNTER
      D                                 OF  PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  フリーメッセージ =["
      D            FREE-MSG             OF  PARM-SMZJ2310-ARG3(COUNTER
      D                                 OF  PARM-SMZJ2310-ARG3)"]"
      D    DISPLAY CNS-PGM-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理  END  ***"
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
