      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMHJ1110
      * プログラム名称 : ポートフォリオ別ループ処理
      * 処理概要       : 起動指示に伴い登録された実行状況管理明細TBL
      *                  のレコード単位に、締めチェック、
      *                  残高処理対象断面別処理ループ、不要断面削除、
      *                  ポートフォリオ処理終了を行う。
      * 参照ＤＢ       : なし
      * 引数           : IN  利用会社コード
      *                  IN  処理実行日
      *                  IN  起動ID
      *                  IN  実行処理ID
      *                  IN  ループ回数
      *                  IN  ファンドコード
      *                  IN  ポートフォリオコード
      *                  IN  基準日From
      *                  IN  基準日To
      *                  IN  評価系列コード
      *                  IN  業務タスクID
      *                  IN  基準日FROM指定フラグ
      *                  IN  銘柄指定ありフラグ
      *                  IN  銘柄指定エリア
      *                  OUT テーブル名
      *                  OUT テーブル処理名
      *                  OUT テーブル処理件数
      *                  OUT RTNパッケージ
      *
      * 改訂履歴
      * 年月日        区分     所属    担当     内容
      * ------------  ----     ------  -------  -------------
      * 20080219      新規     SCS     王美娟   新規作成
      * 20080707      修正     SCS     王美娟
      * 20080715      修正     SCS     高  偉
      * 20080731      修正     SCS     王美娟
      * 20080820      修正     SCS     高  偉
      * 20081010      修正     SCS     顧孜駿   連結障害147
      * 20081014      修正     SCS     顧孜駿   連結障害161
      * 20081029      修正     SCS     朱  軍   残タスク一覧82
      * 20081124      修正     SCS     寇長江   残タスク一覧109
      * 20090115      修正     SCS     金  晶   連結障害対応1126
      * 20090508      修正     SCS     王美娟   連結障害1732
      * 20090903      修正     SCS     顧孜駿   テーマ1015;総合障害0757
      * 20091118      修正     SCS     周  兵   テーマ1992：評価更新の
      *                                         実行状況明細のステータス
      * 20100208      修正     SCS     HECHENG  性能改善
      * 20100224      修正     SCS     HECHENG  ＧＩＰＳモード起動処理追加
      * 20100326      修正     SCS     HECHENG   (連結障害(0002224)対応)
      *                                        「別紙1 SQL説明」の進捗ス
      *                                         テータスの条件を変更する
      * 20100610      修正     SCS     朱  軍   テーマ2619
      * 20100907      修正     SCS     朱  軍   テーマ3281
      * 20120316      修正     SCS     陶  博   テーマ3262
      *
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMHJ1110.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-02-19.
       DATE-COMPILED.
      ******************************************************************
      *
      *        環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *        デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
      *----------  共通コンスタント定義の宣言
       01  CONSTANT-AREA.
         05  CNS-MHCNS.
           COPY "MHCNS.cpy".
      *----------  プログラムID
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMHJ1110".
      *----------  "100"（正常終了）
         05  CNS-MSG-100           PIC  X(03)  VALUE  "100".
      *----------  "155"（未処理）                                      20091118
         05  CNS-MSG-155           PIC  X(03)  VALUE  "155".            20091118
      *----------  "200"（警告）
         05  CNS-MSG-200           PIC  X(03)  VALUE  "200".
      *----------  "270"（業務エラー（続行可能））
         05  CNS-MSG-270           PIC  X(03)  VALUE  "270".
      *----------  "275"(業務エラー(明細続行不可))
         05  CNS-MSG-275           PIC  X(03)  VALUE  "275".
      *----------  "600"(実行ステータス)
         05  CNS-MSG-600           PIC  X(03)  VALUE  "600".
      *----------  '400'(システムエラー)
         05  CNS-MSG-400           PIC  X(03)  VALUE  "400".
      *----------   サブRTN戻り値                                       20081029
         05  CNS-RTN-008           PIC  X(03)  VALUE  "008".            20081029
      *----------   サブRTN戻り値                                       20081029
         05  CNS-RTN-010           PIC  X(03)  VALUE  "010".            20081029
      *----------  アップロードIDが存在しません。                       20110907
         05  CNS-MSG-E000430       PIC  X(07)  VALUE  "E000430".        20110907
      *----------  進捗管理テーブル
         05  CNS-TBL-TKDYAA40      PIC  X(08)  VALUE  "TKDYAA40".
      ******************************************************************
      *                フラグ  エリア
      ******************************************************************
       01  FLG-AREA.
      *----------  処理続行フラグ
         05  FLG-SYORI             PIC  9(01).
      *----------  未処理フラグ                                         20091118
         05  FLG-SYORI-N           PIC  9(01).                          20091118
      *----------  CURSOR1 OPEN
         05  FLG-CURSOR1-OPEN      PIC  9(01).
      *----------  CURSOR2 OPEN                                         20120316
         05  FLG-CURSOR2-OPEN      PIC  9(01).                          20120316
      ******************************************************************
      *                ORACLE ホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN    DECLARE  SECTION  END-EXEC.
       01  HST-AREA.
      *----------  DBレイアウト
         05  H-SQL-SELECT.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-D-W   PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-D-W       PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-D-W        PIC  X(04).
      *----------  評価系列コード
           10  H-HYK-KRTU-CD-D-W   PIC  X(04).
      *----------  DBレイアウト2
         05  H-SQL-SELECT-2.                                            20120316
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-D-W-2 PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-D-W-2     PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-D-W-2      PIC  X(04).
      *----------  基準日MAX
           10  H-KJN-YMD-MAX-W     PIC  S9(08).
      *----------  基準日MIN
           10  H-KJN-YMD-MIN-W     PIC  S9(08).
         05  H-FETCH.
           10  HST-TBL.
      *----------  処理基準日
             15  H-KJN-YMD         PIC  S9(08).
         05  H-FETCH-2.                                                 20120316
           10  HST-TBL-2.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD     PIC  X(04).
         05  SQLSTMT               PIC  X(2500).
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
      *----------  SCZY7210 中止リクエストチェック
       01  PARM-SCZY7210-INOUT.
           COPY  "SCZY7210.cpy".
      *----------  SMHJ1810 締めチェック
       01  PARM-SMHJ1810-INOUT.
           COPY  "SMHJ1810.cpy".
      *----------  SMHJ2010 残高処理対象断面別処理
       01  PARM-SMHJ2010-INOUT.
           COPY  "SMHJ2010.cpy".
      *----------  SMHJ5010 不要断面削除
       01  PARM-SMHJ5010-INOUT.
           COPY  "SMHJ5010.cpy".
      *----------  SMHJ5210 ポートフォリオ処理終了
       01  PARM-SMHJ5210-INOUT.
           COPY  "SMHJ5210.cpy".
      *----------  SCZY1020 カレンダールーチン                          20110907
       01  PARM-SCZY1020-INOUT.                                         20110907
      *----------  カレンダールーチンコピー句                           20110907
           COPY "SCZY1020.cpy".                                         20110907
      *----------  SCZY7080 バッチメッセージＩＮＳルーチン
       01  PARM-SCZY7080-INOUT.
           COPY  "SCZY7080.cpy".
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      *----------  RTNパッケージコピー句
       01  WK-PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                ワ－ク  エリア
      ******************************************************************
       01  WORK-AREA.
      *----------  ワークメッセージID
         05  WK-MSG-ID             PIC  X(07).
      *---------- 置換文字
         05  WK-TIKAN-MOJI.
           10  WK-TK-MOJI          OCCURS  5
                                   PIC  X(30).
      *----------  ワークリターンコード比較値                           20090115
         05  WK-RTN-CD-CP          PIC  X(03).                          20090115
         05  WK-SMHJ1110-IN.
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  実行処理ID
           10  WK-JIKOU-SYORI-ID   PIC  X(07).
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
      *----------  基準日FROM
           10  WK-KJN-YMD-FROM     PIC  S9(08).
      *----------  基準日TO
           10  WK-KJN-YMD-TO       PIC  S9(08).
      *----------  評価系列コード
           10  WK-HYK-KRTU-CD      PIC  X(04).
      *----------  業務タスクID
           10  WK-GYOMU-TASK-ID    PIC  X(07).
      *----------  基準日FROM指定フラグ
           10  WK-KJN-YMD-FROM-FLG PIC  X(01).
      *----------  銘柄指定ありフラグ
           10  WK-MEG-FLG          PIC  X(01).
      *----------  銘柄指定エリア
           10  WK-MEG-SITEI-AREA.
           COPY  "MEGSITEI.cpy".
      *----------  ユーザＩＤ
           10  WK-USER-ID          PIC  X(20).
      *----------  ワークリターンコード                                 20090115
           10  WK-RTN-CD           PIC  X(03).                          20090115
      *----------  残高処理対象断面別ループ処理DB更新情報
         05  WK-DB-UPDATE-MSG-GROUP.
           10  WK-DB-UPDATE-MSG-GRP
                                   OCCURS  8.                           20090508
      *----------  テーブル名
             15  WK-TBL-ID         PIC  X(13).
      *----------  テーブル処理名
             15  WK-TBL-SYORI-NAME PIC  X(06).
      *----------  テーブル処理件数
             15  WK-TBL-SYORI-COUNT
                                   PIC  9(18).
      *----------  ワーク基準日TO
         05  WK-KJN-YMD-TO-GS      PIC  S9(08).
      *----------  ワーク断面期間FROM                                   20110907
         05  WK-KJN-FROM           PIC  S9(08).                         20110907
      *----------  ワーク断面期間TO                                     20110907
         05  WK-KJN-TO             PIC  S9(08).                         20110907
      *----------  ワーク月数                                           20110907
         05  WK-MONTH              PIC  S9(05)V9(06).                   20110907
      *----------  ワークテーブルID1
         05  WK-HENSYUGO-TBL-ID    PIC  X(13).
      *----------  計算中間値                                           20120316
         05  WK-COMPUTE-TEMP       PIC  S9(06).                         20120316
         05  WK-SQL-SELECT.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
           10  FILLER              PIC  X(04)  VALUE  "NVL(".
           10  FILLER              PIC  X(18)
                                            VALUE  "MAX(DECODE(SUBSTR(".
           10  FILLER              PIC  X(16)
                                            VALUE  "KJN_YMD,7,2),99,".
           10  FILLER              PIC  X(25)
                                     VALUE  "SS_SYORI_YMD,KJN_YMD)),0)".
      *----------  FROM
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  ワーク進捗管理テーブルID
           10  WK-TBL-TKDYAA40-A   PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  A.利用会社コード
           10  FILLER              PIC  X(18)
                                   VALUE  "RIYO_CMP_CD = :V1 ".
      *----------  A.ファンドコード
           10  FILLER              PIC  X(18)
                                   VALUE  "AND FUND_CD = :V2 ".
      *----------  A.ポートフォリオコード
           10  FILLER              PIC  X(17)
                                   VALUE  "AND PTF_CD = :V3 ".
      *----------  A.評価系列コード
           10  FILLER              PIC  X(22)
                                   VALUE  "AND HYK_KRTU_CD = :V4 ".
      *----------  A.進捗タスクID
           10  FILLER              PIC  X(21)
                                   VALUE  "AND SHINTK_TASK_ID = ".
      *----------  ST00600
           10  FILLER              PIC  X(09)
                                   VALUE  "'ST00600'".
      *----------  A.進捗ステータス
           10  FILLER              PIC  X(20)
                                   VALUE  "AND SHINTK_STS IN ( ".
      *----------  000
           10  FILLER              PIC  X(06)
                                   VALUE  "'000',".
      *----------  100
           10  FILLER              PIC  X(06)
                                   VALUE  "'100',".
      *----------  200
           10  FILLER              PIC  X(06)
                                   VALUE  "'200',".
      *----------  270
           10  FILLER              PIC  X(06)
                                   VALUE  "'270',".
      *----------  275
           10  FILLER              PIC  X(06)
                                   VALUE  "'275',".
      *----------  277
           10  FILLER              PIC  X(06)
                                   VALUE  "'277',".
      *----------  375
           10  FILLER              PIC  X(06)
                                   VALUE  "'375',".
      *----------  500
           10  FILLER              PIC  X(06)
                                   VALUE  "'500' ".
      *----------  )
           10  FILLER              PIC  X(03)
                                   VALUE  " ) ".
         05  WK-SQL-SELECT-2.                                           20120316
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
           10  FILLER              PIC  X(11)  
                                   VALUE  "RIYO_CMP_CD".
      *----------  FROM
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  ワーク進捗管理テーブルID
           10  WK-TBL-TKDYAA40-B   PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  A.利用会社コード
           10  FILLER              PIC  X(18)
                                   VALUE  "RIYO_CMP_CD = :V1 ".
      *----------  A.ファンドコード
           10  FILLER              PIC  X(18)
                                   VALUE  "AND FUND_CD = :V2 ".
      *----------  A.ポートフォリオコード
           10  FILLER              PIC  X(17)
                                   VALUE  "AND PTF_CD = :V3 ".
      *----------  A.基準日
           10  FILLER              PIC  X(19)
                                   VALUE  "AND KJN_YMD >= :V5 ".
      *----------  A.基準日
           10  FILLER              PIC  X(19)
                                   VALUE  "AND KJN_YMD <= :V4 ".
      *----------  A.進捗タスクID
           10  FILLER              PIC  X(21)
                                   VALUE  "AND SHINTK_TASK_ID = ".
      *----------  ST00500
           10  FILLER              PIC  X(09)
                                   VALUE  "'ST00500'".
      *----------  rownum
           10  FILLER              PIC  X(15)
                                   VALUE  " AND ROWNUM = 1".
      ******************************************************************
      *        連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMHJ1110-INOUT.
           COPY  "SMHJ1110.cpy".
       01  PARM-SMHJ1110-RTNPKG.
      *----------  RTNパッケージ
         05  PARM-SMHJ1110-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *    手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMHJ1110-INOUT
                  PARM-SMHJ1110-RTNPKG.
      ******************************************************************
      *    メイン処理
      ******************************************************************
       BASE-RTN               SECTION.
      *------------------------<DEBUG>----------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***************  SMHJ1110  START  ***************"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
           CONTINUE.
       BASE-EXT.
           EXIT.
      ******************************************************************
      *    3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBLID-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *     3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE     WORK-AREA
                          FLG-AREA
                          PARM-SMHJ1110-ARG2
                          PARM-SMHJ1110-RTNPKG
                          PARM-SCZY1160-INOUT
                          PARM-SCZY1170-IN
                          PARM-SCZY7210-INOUT
                          PARM-SMHJ1810-INOUT
                          PARM-SMHJ2010-INOUT
                          PARM-SMHJ5010-INOUT
                          PARM-SMHJ5210-INOUT
                          PARM-SCZY7080-INOUT
                          PARM-RTNPKG
           MOVE  PARM-SMHJ1110-ARG1     TO  WK-SMHJ1110-IN
      *----------  未処理フラグ初期化                                   20091118
           MOVE  ZERO                   TO  FLG-SYORI-N                 20091118
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WORK-AREA            =["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLG-AREA            =["FLG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMHJ1110-ARG2   =["
      D             PARM-SMHJ1110-ARG2    "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMHJ1110-RTNPKG =["
      D             PARM-SMHJ1110-RTNPKG  "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1160-INOUT =["
      D             PARM-SCZY1160-INOUT   "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY7210-INOUT =["
      D             PARM-SCZY7210-INOUT   "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1170-IN =["
      D             PARM-SCZY1170-IN      "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMHJ1810-INOUT =["
      D             PARM-SMHJ1810-INOUT   "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMHJ2010-INOUT =["
      D             PARM-SMHJ2010-INOUT   "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SMHJ5010-INOUT =["
      D             PARM-SMHJ5010-INOUT   "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SMHJ5210-INOUT =["
      D             PARM-SMHJ5210-INOUT   "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY7080-INOUT =["
      D             PARM-SCZY7080-INOUT   "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG         =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":WK-SMHJ1110-IN     =["WK-SMHJ1110-IN"]"
      D    DISPLAY  CNS-PGM-ID ":WK-RTN-CD  =["WK-RTN-CD"]"             20090115
      D    DISPLAY  CNS-PGM-ID ":未処理フラグ  =["FLG-SYORI-N"]"        20091118
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD            OF  PARM-SMHJ1110-ARG1
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  テーブルID1
           MOVE  CNS-TBL-TKDYAA40
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(CNS-1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD             =["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID  OF  PARM-SCZY1160-ARG1(1)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1160  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1160  END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG       =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ワークテーブルID1
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(CNS-1)
               TO  WK-HENSYUGO-TBL-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  テーブルID取得 正常  ***"
      D    DISPLAY  CNS-PGM-ID":テーブルID1=["WK-HENSYUGO-TBL-ID"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG(COUNTER
                                        OF  PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING "テーブルID取得エラー:"
                     "利用会社コード =["
                     RIYO-CMP-CD        OF  PARM-SCZY1160-ARG1
                    "] 進捗管理テーブル =["
                     TBL-ID             OF  PARM-SCZY1160-ARG1(CNS-1)
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  テーブルID取得 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *     3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  START  ***"
      *-----------------------------------------------------------------
            PERFORM  GET-DATA-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    GET-DATA
      ******************************************************************
       GET-DATA-RTN           SECTION.
      *----------  3.2.1 ステータス変更処理１
           PERFORM  SCZY7210-RTN
      *----------  3.2.2 締めチェック
           PERFORM  SMHJ1810-RTN
      *----------  3.2.2 GIPS-CHECK
           PERFORM  GIPS-CHECK-RTN
      *------------  テーマ3262 20120316  START  -----------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理続行フラグ=["FLG-SYORI"]"
      *-----------------------------------------------------------------
           IF  FLG-SYORI = CNS-0
           THEN
      *----------  ワーク基準日TO以前の残高断面存在チェック
             PERFORM  BALA-CHECK-RTN
           ELSE
             CONTINUE
           END-IF
      *------------  テーマ3262 20120316  END   ------------------------
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":処理続行フラグ=["FLG-SYORI"]"           20110907
      *-----------------------------------------------------------------20110907
           IF  FLG-SYORI = CNS-0                                        20110907
           THEN                                                         20110907
      *----------  断面期間FROM～断面期間TOの月数のチェック             20110907
             PERFORM  SCZY1020-RTN                                      20110907
           ELSE                                                         20110907
             CONTINUE                                                   20110907
           END-IF                                                       20110907
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理続行フラグ=["FLG-SYORI"]"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード=["GIPS-MODE
      D                                        OF  PARM-SMHJ1110-ARG1"]"
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
           IF  FLG-SYORI = CNS-0
           THEN
      *----------  3.2.3 残高処理対象断面別処理
               PERFORM  SMHJ2010-RTN
               IF  GIPS-MODE  OF  PARM-SMHJ1110-ARG1 NOT = CNS-1
               THEN
      *----------  3.2.4 不要断面削除                                   20090115
                 PERFORM  SMHJ5010-RTN                                  20090115
               ELSE
                 CONTINUE
               END-IF
           ELSE
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                 ":締めフラグ=["SIME-FLG OF PARM-SMHJ1810-ARG2"]"
      *-----------------------------------------------------------------
           IF  SIME-FLG OF PARM-SMHJ1810-ARG2                           20081029 20090115
            =  CNS-1                                                    20081029 20090115
           THEN                                                         20081029 20090115
      *----------  3.2.5 ポートフォリオ処理終了
             PERFORM  SMHJ5210-RTN                                      20081029 20090115
           ELSE                                                         20081029
             CONTINUE                                                   20081029
           END-IF                                                       20081029
      *----------  3.2.6 ステータス変更処理２
           PERFORM  SCZY7210-2-RTN
           CONTINUE.
       GET-DATA-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1 ステータス変更処理１
      ******************************************************************
       SCZY7210-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ステータス変更処理１  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7210-INOUT
                       PARM-RTNPKG
      *----------  セッション区分
           MOVE  CNS-X-0
             TO  SESSION-KBN            OF  PARM-SCZY7210-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7210-ARG2
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7210-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7210-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  PARM-SCZY7210-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  PARM-SCZY7210-ARG2
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD
             TO  HYK-KRTU-CD            OF  PARM-SCZY7210-ARG2
      *----------  帳票ID
           MOVE  SPACE
             TO  REP-ID                 OF  PARM-SCZY7210-ARG2
      *----------  帳票任意コード
           MOVE  SPACE
             TO  REP-ANY-CD             OF  PARM-SCZY7210-ARG2
      *----------  基準日FROM
           MOVE  WK-KJN-YMD-FROM
             TO  KJN-YMD-FROM           OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス
           MOVE  CNS-MSG-600
             TO  JIKOU-STS              OF  PARM-SCZY7210-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":セッション区分=["
      D            SESSION-KBN          OF  PARM-SCZY7210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID        =["
      D             REP-ID              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM    =["
      D             KJN-YMD-FROM        OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":実行ステータス=["
      D             JIKOU-STS           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7210  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY7210"            USING  PARM-SCZY7210-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7210   END   ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7210)       =["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":CONTINUE-KBN OF PARM-SCZY7210-ARG3 =["
      D             CONTINUE-KBN        OF PARM-SCZY7210-ARG3"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ＤＢコミット処理                                     20081014
             EXEC SQL                                                   20081014
                 COMMIT                                                 20081014
             END-EXEC                                                   20081014
      *    机上デバッグについて、IDXの事前設定--START--
      *-------------------<DEBUG>---------------------------------------
      *    MOVE  123            TO  SQLCODE
      *-----------------------------------------------------------------
      *    机上デバッグについて、IDXの事前設定--END--
             IF  SQLCODE = CNS-SQL-NORMAL                               20081014
             THEN                                                       20081014
      *--------------------<DEBUG>--------------------------------------20081014
      D    DISPLAY  CNS-PGM-ID":*** ＤＢコミット処理 正常! ***"         20081014
      *-----------------------------------------------------------------20081014
               CONTINUE                                                 20081014
             ELSE                                                       20081014
      *----------  エラー検知プログラム名                               20081014
               MOVE  CNS-PGM-ID                                         20081014
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1          20081014
      *----------  ポジション                                           20081014
               MOVE  CNS-POS-002                                        20081014
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1          20081014
      *----------  リターンコード                                       20081014
               MOVE  CNS-RTN-900                                        20081014
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1          20081014
      *----------  詳細リターンコード                                   20081014
               MOVE  SQLCODE                                            20081014
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1          20081014
      *----------  詳細リターンコードデコードフラグ                     20081014
               MOVE  CNS-DETAIL-1                                       20081014
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1          20081014
      *---------- フリーメッセージ                                      20081014
               STRING "ＤＢコミット処理 エラー"                         20081014
                      DELIMITED BY SIZE                                 20081014
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1          20081014
      *-------------------<DEBUG>---------------------------------------20081014
      D    DISPLAY  CNS-PGM-ID": *** ＤＢコミット処理 異常  ***"        20081014
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              20081014
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20081014
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              20081014
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20081014
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              20081014
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20081014
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              20081014
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20081014
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     20081014
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20081014
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              20081014
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20081014
      *-----------------------------------------------------------------20081014
      *----------  エラー処理                                           20081014
               PERFORM  ERR-RTN                                         20081014
             END-IF                                                     20081014
             EVALUATE  CONTINUE-KBN     OF  PARM-SCZY7210-ARG3          20081029
      *----------  続行可能区分='0'（続行可能） の場合                  20081029
             WHEN  CNS-X-0                                              20081029
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  ステータス変更処理１ 正常  ***"
      *-----------------------------------------------------------------
               CONTINUE                                                 20081124
      *----------  続行可能区分='1'（一時停止） の場合                  20081029
             WHEN  CNS-X-1                                              20081029
      *----------  ワークメッセージID←E000451（ジョブが一時停止になりました。20081029
               MOVE  CNS-MSG-E000451    TO  WK-MSG-ID                   20081029
      *----------  ワークリターンコード←"010"（後続メイン続行不可）    20081029
               MOVE  CNS-RTN-010        TO  WK-RTN-CD-CP                20081029 20090115
      *-------------------<DEBUG>---------------------------------------20081029
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID =["WK-MSG-ID"]"               20081029
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-CP =["WK-RTN-CD-CP"]"         20081029 20090115
      *-----------------------------------------------------------------20081029
      *----------  リターンコード比較処理                               20090115
               PERFORM  R-CD-CP-RTN                                     20090115
      *----------  ポートフォリオ別メッセージ出力処理                   20081029
               PERFORM  SCZY7080-RTN                                    20081029
      *----------  続行可能区分='2'（強制停止） の場合                  20081029
             WHEN  CNS-X-2                                              20081029
      *----------  ワークメッセージID←E000431（ジョブが強制終了になりました。20081029
               MOVE  CNS-MSG-E000431    TO  WK-MSG-ID                   20081029
      *----------  ワークリターンコード←"008"（メイン続行不可）        20081029
               MOVE  CNS-RTN-008        TO  WK-RTN-CD-CP                20081029 20090115
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID =["WK-MSG-ID"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-CP =["WK-RTN-CD-CP"]"         20090115
      *-----------------------------------------------------------------
      *----------  リターンコード比較処理                               20090115
               PERFORM  R-CD-CP-RTN                                     20090115
      *----------  ポートフォリオ別メッセージ出力処理
               PERFORM  SCZY7080-RTN
      *----------  続行可能区分='3'（ポートフォリオ処理中） の場合      20081029
             WHEN  CNS-X-3                                              20081029
      *----------  後処理へ                                             20081029
               PERFORM  END-RTN                                         20081029
             WHEN  OTHER                                                20081029
               CONTINUE                                                 20081029
             END-EVALUATE                                               20081029
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-003
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                        (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING "SCZY1170ステータス変更処理１エラー:"
                      "セッション区分 =["
                       SESSION-KBN      OF  PARM-SCZY7210-ARG1
                      "]利用会社コード =["
                       RIYO-CMP-CD      OF  PARM-SCZY7210-ARG2
                      "]処理実行日 =["
                       SYORI-YMD        OF  PARM-SCZY7210-ARG2
                      "]起動ID =["
                       KIDOU-ID         OF  PARM-SCZY7210-ARG2
                      "]ファンドコード =["
                       FUND-CD          OF  PARM-SCZY7210-ARG2
                      "]ポートフォリオコード =["
                       PTF-CD           OF  PARM-SCZY7210-ARG2
                      "]評価系列コード =["
                       HYK-KRTU-CD      OF  PARM-SCZY7210-ARG2
                      "]帳票ID =["
                       REP-ID           OF  PARM-SCZY7210-ARG2
                      "]帳票任意コード =["
                       REP-ANY-CD       OF  PARM-SCZY7210-ARG2
                      "]基準日FROM =["
                       KJN-YMD-FROM     OF  PARM-SCZY7210-ARG2
                      "]実行ステータス =["
                       JIKOU-STS        OF  PARM-SCZY7210-ARG2
                      "]"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  ステータス変更処理１ 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  ＤＢコミット処理                                     20081014
      *    EXEC SQL                                                     20081014
      *        COMMIT                                                   20081014
      *    END-EXEC                                                     20081014
      *    IF  SQLCODE = CNS-SQL-NORMAL                                 20081014
      *    THEN                                                         20081014
      *--------------------<DEBUG>--------------------------------------20081014
      *    DISPLAY  CNS-PGM-ID":*** ＤＢコミット処理 正常! ***"         20081014
      *-----------------------------------------------------------------20081014
      *      CONTINUE                                                   20081014
      *    ELSE                                                         20081014
      *----------  エラー検知プログラム名                               20081014
      *      MOVE  CNS-PGM-ID                                           20081014
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20081014
      *----------  ポジション                                           20081014
      *      MOVE  CNS-POS-002                                          20081014
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20081014
      *----------  リターンコード                                       20081014
      *      MOVE  CNS-RTN-900                                          20081014
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20081014
      *----------  詳細リターンコード                                   20081014
      *      MOVE  SQLCODE                                              20081014
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20081014
      *----------  詳細リターンコードデコードフラグ                     20081014
      *      MOVE  CNS-DETAIL-1                                         20081014
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20081014
      *---------- フリーメッセージ                                      20081014
      *      STRING "ＤＢコミット処理 エラー"                           20081014
      *             DELIMITED BY SIZE                                   20081014
      *             INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1          20081014
      *-------------------<DEBUG>---------------------------------------20081014
      *    DISPLAY  CNS-PGM-ID": *** ＤＢコミット処理 異常  ***"        20081014
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              20081014
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20081014
      *    DISPLAY  CNS-PGM-ID":ポジション             =["              20081014
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20081014
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["              20081014
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20081014
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              20081014
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20081014
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     20081014
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20081014
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              20081014
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20081014
      *-----------------------------------------------------------------20081014
      *----------  エラー処理                                           20081014
      *      PERFORM  ERR-RTN                                           20081014
      *    END-IF                                                       20081014
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ステータス変更処理１  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7210-EXT.
           EXIT.
      ******************************************************************
      *    ポートフォリオ別メッセージ出力処理
      ******************************************************************
       SCZY7080-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":***  ポートフォリオ別メッセージ出力処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7080-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7080-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7080-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7080-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SCZY7080-ARG1
      *----------  メッセージエリア
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD
             TO  HYK-KRTU-CD            OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  帳票ID
           MOVE  SPACE
             TO  REP-ID                 OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  帳票任意コード
           MOVE  SPACE
             TO  REP-ANY-CD             OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  基準日From
           MOVE  WK-KJN-YMD-FROM
             TO  KJN-YMD-FROM           OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  基準日To
           MOVE  WK-KJN-YMD-TO
             TO  KJN-YMD-TO             OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  メッセージID
           MOVE  WK-MSG-ID
             TO  MSG-ID                 OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  置換文字
           MOVE  WK-TIKAN-MOJI
             TO  TIKAN-MOJI             OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  フリーメッセージ
           MOVE  SPACE
             TO  FREE-MSG               OF  PARM-SCZY7080-ARG2(CNS-1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日From=["
      D             KJN-YMD-FROM        OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日To=["
      D             KJN-YMD-TO          OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":メッセージID=["
      D             MSG-ID              OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":置換文字=["
      D             TIKAN-MOJI          OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ=["
      D             FREE-MSG            OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY7080"            USING  PARM-SCZY7080-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080   END   ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7080)       =["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ＤＢコミット処理                                     20081010
             EXEC SQL                                                   20081010
                 COMMIT                                                 20081010
             END-EXEC                                                   20081010
      *--------------------<DEBUG>--------------------------------------20081010
      D    DISPLAY  CNS-PGM-ID":COMMIT SQLCODE=["SQLCODE"]"             20081010
      *-----------------------------------------------------------------20081010
             IF  SQLCODE = CNS-SQL-NORMAL                               20081010
             THEN                                                       20081010
      *--------------------<DEBUG>--------------------------------------20081010
      D    DISPLAY  CNS-PGM-ID":*** ＤＢコミット処理 正常! ***"         20081010
      *-----------------------------------------------------------------20081010
      *----------  後処理                                               20081010
               PERFORM  END-RTN                                         20081010
             ELSE                                                       20081010
      *----------  エラー検知プログラム名                               20081010
                 MOVE  CNS-PGM-ID                                       20081010
                   TO  ERR-PGM-ID       OF  PARM-SCZY1170-ARG1          20081010
      *----------  ポジション                                           20081010
                 MOVE  CNS-POS-004                                      20081010
                   TO  ERR-POS          OF  PARM-SCZY1170-ARG1          20081010
      *----------  リターンコード                                       20081010
                 MOVE  CNS-RTN-900                                      20081010
                   TO  RTN-CD           OF  PARM-SCZY1170-ARG1          20081010
      *----------  詳細リターンコード                                   20081010
                 MOVE  SQLCODE                                          20081010
                   TO  DETAIL-RTN-CD    OF  PARM-SCZY1170-ARG1          20081010
      *----------  詳細リターンコードデコードフラグ                     20081010
                 MOVE  CNS-DETAIL-1                                     20081010
                   TO  DETAIL-RTN-CD-FLG                                20081010
                                        OF  PARM-SCZY1170-ARG1          20081010
      *---------- フリーメッセージ                                      20081010
                 STRING "ＤＢコミット処理 エラー"                       20081010
                      DELIMITED BY SIZE                                 20081010
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1          20081010
      *-------------------<DEBUG>---------------------------------------20081010
      D    DISPLAY  CNS-PGM-ID": *** ＤＢコミット処理 異常  ***"        20081010
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              20081010
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              20081010
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              20081010
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              20081010
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     20081010
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              20081010
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20081010
      *-----------------------------------------------------------------20081010
      *----------  エラー処理                                           20081010
                 PERFORM  ERR-RTN                                       20081010
             END-IF                                                     20081010
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-005                                          20081031
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG(COUNTER
                                        OF  PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING "ポートフォリオ別メッセージＩＮＳルーチンエラー:"
                    "利用会社コード =["
                    RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1
                    "] 処理実行日 =["
                    SYORI-YMD           OF  PARM-SCZY7080-ARG1
                    "] 起動ID=["
                    KIDOU-ID            OF  PARM-SCZY7080-ARG1
                    "] 業務タスクID =["
                    GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1
                    "] ファンドコード=["
                    FUND-CD             OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] ポートフォリオコード=["
                    PTF-CD              OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] 評価系列コード=["
                    HYK-KRTU-CD         OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] 帳票ID=["
                    REP-ID              OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] 帳票任意コード=["
                    REP-ANY-CD          OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] 基準日FROM=["
                    KJN-YMD-FROM        OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] 基準日TO=["
                    KJN-YMD-TO          OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] メッセージID=["
                    MSG-ID              OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] 置換文字=["
                    TIKAN-MOJI          OF  PARM-SCZY7080-ARG2(CNS-1)
                    "] フリーメッセージ=["
                    FREE-MSG            OF  PARM-SCZY7080-ARG2(CNS-1)
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":***  ポートフォリオ別メッセージＩＮＳルーチン  異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ": ポートフォリオ別メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7080-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2 締めチェック
      ******************************************************************
       SMHJ1810-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  締めチェック  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMHJ1810-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SMHJ1810-ARG1
      *----------  処理実行日                                           20081010
           MOVE  WK-SYORI-YMD                                           20081010
             TO  SYORI-YMD              OF  PARM-SMHJ1810-ARG1          20081010
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  PARM-SMHJ1810-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  PARM-SMHJ1810-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD
             TO  HYK-KRTU-CD            OF  PARM-SMHJ1810-ARG1
      *----------  基準日FROM指定フラグ
           MOVE  WK-KJN-YMD-FROM-FLG
             TO  KJN-YMD-FROM-FLG       OF  PARM-SMHJ1810-ARG1
      *----------  基準日FROM
           MOVE  WK-KJN-YMD-FROM
             TO  KJN-YMD-FROM           OF  PARM-SMHJ1810-ARG1
      *----------  基準日TO
           MOVE  WK-KJN-YMD-TO
             TO  KJN-YMD-TO             OF  PARM-SMHJ1810-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SMHJ1810-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SMHJ1810-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["                           20081010
      D             SYORI-YMD           OF  PARM-SMHJ1810-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM指定フラグ=["
      D             KJN-YMD-FROM-FLG    OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日TO=["
      D             KJN-YMD-TO          OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SMHJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SMHJ1810  START  ***"
      *-----------------------------------------------------------------
           CALL   "SMHJ1810"            USING  PARM-SMHJ1810-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SMHJ1810   END   ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1810)       =["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SMHJ1810)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":スキップフラグ=["
      D             SUKIPPU-FLG         OF  PARM-SMHJ1810-ARG2"]"
      *-----------------------------------------------------------------
             IF  SUKIPPU-FLG            OF  PARM-SMHJ1810-ARG2
              =  ZERO
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  締めチェック 正常  ***"
      *-----------------------------------------------------------------
                 CONTINUE
             ELSE
      *----------  処理続行フラグ←"1"（処理スッキプ）
               MOVE  CNS-1            TO  FLG-SYORI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理続行フラグ=["FLG-SYORI"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード←"002"(ウォーニング)            20100610
               MOVE  CNS-RTN-002        TO  WK-RTN-CD-CP                20100610
      *-------------------<DEBUG>---------------------------------------20100610
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-CP =["WK-RTN-CD-CP"]"         20100610
      *-----------------------------------------------------------------20100610
      *----------  リターンコード比較処理                               20100610
               PERFORM  R-CD-CP-RTN                                     20100610
             END-IF
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-006
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
              STRING "SMHJ1810締めチェックエラー:"
                      "利用会社コード =["
                      RIYO-CMP-CD       OF  PARM-SMHJ1810-ARG1
                      "]ファンドコード =["
                      FUND-CD           OF  PARM-SMHJ1810-ARG1
                      "]ポートフォリオコード =["
                      PTF-CD            OF  PARM-SMHJ1810-ARG1
                      "]評価系列コード =["
                      HYK-KRTU-CD       OF  PARM-SMHJ1810-ARG1
                      "]基準日FROM =["
                      KJN-YMD-FROM      OF  PARM-SMHJ1810-ARG1
                      "]基準日TO =["
                      KJN-YMD-TO        OF  PARM-SMHJ1810-ARG1
                      "]"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  締めチェック 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  締めチェック  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMHJ1810-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2 GIPSチェック
      ******************************************************************
       GIPS-CHECK-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  GIPSチェック  START  ***"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード=["GIPS-MODE
      D                                        OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SMHJ1810から戻した基準日TO=["KJN-YMD-TO
      D                                        OF  PARM-SMHJ1810-ARG2"]"
      *-----------------------------------------------------------------
           MOVE  KJN-YMD-TO  OF  PARM-SMHJ1810-ARG2
             TO  WK-KJN-YMD-TO-GS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日TO=["WK-KJN-YMD-TO-GS"]"
      *-----------------------------------------------------------------
           IF  GIPS-MODE  OF  PARM-SMHJ1110-ARG1  = CNS-1
           THEN
      *-------------カーソル定義処理1
             PERFORM  PREPARE-CURSOR1-RTN
      *-------------カーソルOPEN処理1
             PERFORM  OPEN-CURSOR1-RTN
      *-------------カーソルFETCH処理1
             PERFORM  FETCH-CURSOR1-RTN
      *----------  カーソルCLOSE処理1
             PERFORM  CLOSE-CURSOR1-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  GIPSチェック  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GIPS-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理1
      ******************************************************************
       PREPARE-CURSOR1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソル定義処理1  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
                       WK-SQL-SELECT
      *----------  テーブルID
           MOVE  WK-HENSYUGO-TBL-ID     TO  WK-TBL-TKDYAA40-A
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD            OF  PARM-SMHJ1110-ARG1
             TO  H-RIYO-CMP-CD-D-W
      *----------  ファンドコード
           MOVE  FUND-CD                OF  PARM-SMHJ1110-ARG1
             TO  H-FUND-CD-D-W
      *----------  ポートフォリオコード
           MOVE  PTF-CD                 OF  PARM-SMHJ1110-ARG1
             TO  H-PTF-CD-D-W
      *----------  評価系列コード
           MOVE  HYK-KRTU-CD            OF  PARM-SMHJ1110-ARG1
             TO  H-HYK-KRTU-CD-D-W
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID=["WK-TBL-TKDYAA40-A"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["H-RIYO-CMP-CD-D-W"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["H-FUND-CD-D-W"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["H-PTF-CD-D-W"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["H-HYK-KRTU-CD-D-W"]"
      *-----------------------------------------------------------------
           MOVE  WK-SQL-SELECT          TO  SQLSTMT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"
      *-----------------------------------------------------------------
      *----------  PREPARE CURSOR
           EXEC  SQL
             PREPARE  C1  FROM  :SQLSTMT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE SQLCODE=["SQLCODE "]"
      *-------------------<DEBUG>---------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": カーソル定義処理1 PREPARE 正常"
      *-------------------<DEBUG>---------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-007
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W
                    "][:V2="
                    H-FUND-CD-D-W
                    "][:V3="
                    H-PTF-CD-D-W
                    "][:V4="
                    H-HYK-KRTU-CD-D-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソル定義処理1 PREPARE  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR1  CURSOR  FOR  C1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":カーソル定義処理1 DECLARE SQLCODE =["SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソル定義処理1  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PREPARE-CURSOR1-EXT.
           EXIT.
      ******************************************************************
      *    カーソルOPEN処理1
      ******************************************************************
       OPEN-CURSOR1-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソルOPEN処理1  START  ***"
      *-----------------------------------------------------------------
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  CR1
           USING  :H-SQL-SELECT.H-RIYO-CMP-CD-D-W,
                  :H-SQL-SELECT.H-FUND-CD-D-W,
                  :H-SQL-SELECT.H-PTF-CD-D-W,
                  :H-SQL-SELECT.H-HYK-KRTU-CD-D-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":OPEN SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-CURSOR1-OPEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CURSOR1-OPEN=["FLG-CURSOR1-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":***  カーソルOPEN処理1  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-008
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W
                    "][:V2="
                    H-FUND-CD-D-W
                    "][:V3="
                    H-PTF-CD-D-W
                    "][:V4="
                    H-HYK-KRTU-CD-D-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルOPEN処理1  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソルOPEN処理1  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-CURSOR1-EXT.
           EXIT.
      ******************************************************************
      *    カーソルFETCH処理1
      ******************************************************************
       FETCH-CURSOR1-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソルFETCH処理1  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH
      *----------  FETCH
           EXEC SQL
             FETCH CR1
             INTO  :H-KJN-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FETCH SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH処理1 正常"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日TO=["WK-KJN-YMD-TO-GS"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD=["H-KJN-YMD"]"
      *-----------------------------------------------------------------
               IF  H-KJN-YMD  NOT=  ZERO
               THEN
                 IF  WK-KJN-YMD-TO-GS  <= H-KJN-YMD
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日TO≦取得した日付の場合"
      *-----------------------------------------------------------------
                   CONTINUE
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日TO ＞ 取得した日付の場合"
      *-----------------------------------------------------------------
                   MOVE  H-KJN-YMD  TO  WK-KJN-YMD-TO-GS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日TO=["WK-KJN-YMD-TO-GS"]"
      *-----------------------------------------------------------------
                 END-IF
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH NOTFOUND"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-009
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W
                    "][:V2="
                    H-FUND-CD-D-W
                    "][:V3="
                    H-PTF-CD-D-W
                    "][:V4="
                    H-HYK-KRTU-CD-D-W
                    "]"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH処理1 異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソルFETCH処理1  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       FETCH-CURSOR1-EXT.
           EXIT.
      ******************************************************************
      *    カーソルCLOSE処理1
      ******************************************************************
       CLOSE-CURSOR1-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCLOSE処理1  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-CURSOR1-OPEN=["FLG-CURSOR1-OPEN"]"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CLOSE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CURSOR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CURSOR1-OPEN=["FLG-CURSOR1-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-010
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W
                    "][:V2="
                    H-FUND-CD-D-W
                    "][:V3="
                    H-PTF-CD-D-W
                    "][:V4="
                    H-HYK-KRTU-CD-D-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  カーソルCLOSE処理1 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCLOSE処理1  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-CURSOR1-EXT.
           EXIT.
      *------------  テーマ3262 20120316  START  -----------------------
      ******************************************************************
      *    3.2.2 ワーク基準日TO以前の残高断面存在チェック 
      ******************************************************************
       BALA-CHECK-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高断面存在チェック START  ***"
      *-------------------<DEBUG>---------------------------------------
      *-------------カーソル定義処理2
           PERFORM  PREPARE-CURSOR2-RTN
      *-------------カーソルOPEN処理2
           PERFORM  OPEN-CURSOR2-RTN
      *-------------カーソルFETCH処理2
           PERFORM  FETCH-CURSOR2-RTN
      *----------  カーソルCLOSE処理2
           PERFORM  CLOSE-CURSOR2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高断面存在チェック END    ***"
      *-------------------<DEBUG>---------------------------------------
           CONTINUE.
       BALA-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理2
      ******************************************************************
       PREPARE-CURSOR2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソル定義処理2  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
                       WK-SQL-SELECT-2
      *----------  テーブルID
           MOVE  WK-HENSYUGO-TBL-ID     TO  WK-TBL-TKDYAA40-B
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD            OF  PARM-SMHJ1110-ARG1
             TO  H-RIYO-CMP-CD-D-W-2
      *----------  ファンドコード
           MOVE  FUND-CD                OF  PARM-SMHJ1110-ARG1
             TO  H-FUND-CD-D-W-2
      *----------  ポートフォリオコード
           MOVE  PTF-CD                 OF  PARM-SMHJ1110-ARG1
             TO  H-PTF-CD-D-W-2
      *----------  基準日MIN
           MOVE  KJN-YMD-FROM           OF  PARM-SMHJ1810-ARG2
             TO  H-KJN-YMD-MIN-W
      *----------  基準日MAX
           COMPUTE WK-COMPUTE-TEMP   = WK-KJN-YMD-TO-GS / 100
           COMPUTE H-KJN-YMD-MAX-W   = WK-COMPUTE-TEMP  * 100 + 99
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID=["WK-TBL-TKDYAA40-B"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["H-RIYO-CMP-CD-D-W-2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["H-FUND-CD-D-W-2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["H-PTF-CD-D-W-2"]"
      D    DISPLAY  CNS-PGM-ID":基準日MAX=["H-KJN-YMD-MAX-W"]"
      D    DISPLAY  CNS-PGM-ID":基準日MIN=["H-KJN-YMD-MIN-W"]"
      *-----------------------------------------------------------------
           MOVE  WK-SQL-SELECT-2          TO  SQLSTMT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"
      *-----------------------------------------------------------------
      *----------  PREPARE CURSOR
           EXEC  SQL
             PREPARE  C2  FROM  :SQLSTMT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE SQLCODE=["SQLCODE "]"
      *-------------------<DEBUG>---------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": カーソル定義処理2 PREPARE 正常"
      *-------------------<DEBUG>---------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-024
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT-2))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W-2
                    "][:V2="
                    H-FUND-CD-D-W-2
                    "][:V3="
                    H-PTF-CD-D-W-2
                    "][:V5="
                    H-KJN-YMD-MIN-W
                    "][:V4="
                    H-KJN-YMD-MAX-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソル定義処理1 PREPARE  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR2  CURSOR  FOR  C2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":カーソル定義処理2 DECLARE SQLCODE =["SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソル定義処理2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PREPARE-CURSOR2-EXT.
           EXIT.
      ******************************************************************
      *    カーソルOPEN処理2
      ******************************************************************
       OPEN-CURSOR2-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソルOPEN処理2  START  ***"
      *-----------------------------------------------------------------
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  CR2
           USING  :H-SQL-SELECT-2.H-RIYO-CMP-CD-D-W-2,
                  :H-SQL-SELECT-2.H-FUND-CD-D-W-2,
                  :H-SQL-SELECT-2.H-PTF-CD-D-W-2,
                  :H-SQL-SELECT-2.H-KJN-YMD-MIN-W,
                  :H-SQL-SELECT-2.H-KJN-YMD-MAX-W
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":OPEN SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-CURSOR2-OPEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CURSOR2-OPEN=["FLG-CURSOR2-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":***  カーソルOPEN処理2  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT-2))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W-2
                    "][:V2="
                    H-FUND-CD-D-W-2
                    "][:V3="
                    H-PTF-CD-D-W-2
                    "][:V5="
                    H-KJN-YMD-MIN-W
                    "][:V4="
                    H-KJN-YMD-MAX-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルOPEN処理2  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソルOPEN処理2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-CURSOR2-EXT.
           EXIT.
      ******************************************************************
      *    カーソルFETCH処理2
      ******************************************************************
       FETCH-CURSOR2-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソルFETCH処理2  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-2
      *----------  FETCH
           EXEC SQL
             FETCH CR2
             INTO  :H-RIYO-CMP-CD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FETCH SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH処理2 正常"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD=["H-RIYO-CMP-CD"]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH NOTFOUND"
      *-----------------------------------------------------------------
               MOVE  CNS-1              TO FLG-SYORI
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-026
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT-2))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W-2
                    "][:V2="
                    H-FUND-CD-D-W-2
                    "][:V3="
                    H-PTF-CD-D-W-2
                    "][:V5="
                    H-KJN-YMD-MIN-W
                    "][:V4="
                    H-KJN-YMD-MAX-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH処理2 異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  カーソルFETCH処理2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       FETCH-CURSOR2-EXT.
           EXIT.
      ******************************************************************
      *    カーソルCLOSE処理2
      ******************************************************************
       CLOSE-CURSOR2-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCLOSE処理2  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-CURSOR2-OPEN=["FLG-CURSOR2-OPEN"]"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CLOSE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CURSOR2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CURSOR2-OPEN=["FLG-CURSOR2-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-027
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT-2))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W-2
                    "][:V2="
                    H-FUND-CD-D-W-2
                    "][:V3="
                    H-PTF-CD-D-W-2
                    "][:V5="
                    H-KJN-YMD-MIN-W
                    "][:V4="
                    H-KJN-YMD-MAX-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  カーソルCLOSE処理2 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCLOSE処理2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-CURSOR2-EXT.
           EXIT.
      *------------  テーマ3262 20120316  END  --------------------------
      ******************************************************************20110907
      *    断面期間FROM～断面期間TOの月数のチェック                     20110907
      ******************************************************************20110907
       SCZY1020-RTN           SECTION.                                  20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":***  断面期間FROM～断面期間TOの月数"    20110907
      D                       "のチェック  START  ***"                  20110907
      *-----------------------------------------------------------------20110907
           INITIALIZE  PARM-SCZY1020-INOUT                              20110907
                       PARM-RTNPKG                                      20110907
      *----------  ワーク断面期間FROM←SMHJ1810から戻した基準日FROM     20110907
           MOVE  KJN-YMD-FROM           OF  PARM-SMHJ1810-ARG2          20110907
             TO  WK-KJN-FROM                                            20110907
      *----------  ワーク断面期間TO←ワーク基準日TO                     20110907
           MOVE  WK-KJN-YMD-TO-GS       TO  WK-KJN-TO                   20110907
      *----------  機能区分                                             20110907
           MOVE  CNS-X-2                TO  IXCAL-FUNCTION              20110907
                                        OF  PARM-SCZY1020-INOUT         20110907
      *----------  基準年月日１                                         20110907
           MOVE  WK-KJN-FROM                                            20110907
             TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-INOUT         20110907
      *----------  計算ベース区分                                       20110907
           MOVE  CNS-X-1                TO  IXCAL-COMP-BASE             20110907
                                        OF  PARM-SCZY1020-INOUT         20110907
      *----------  前後区分１                                           20110907
           MOVE  SPACE                  TO  IXCAL-ZENGO-KBN-1           20110907
                                        OF  PARM-SCZY1020-INOUT         20110907
      *----------  前後区分２                                           20110907
           MOVE  CNS-X-1                TO  IXCAL-ZENGO-KBN-2           20110907
                                        OF  PARM-SCZY1020-INOUT         20110907
      *----------  単位区分                                             20110907
           MOVE  CNS-X-2                TO  IXCAL-TANI-KBN              20110907
                                        OF  PARM-SCZY1020-INOUT         20110907
      *----------  日数                                                 20110907
           MOVE  ZERO                   TO  IXCAL-DAYS                  20110907
                                        OF  PARM-SCZY1020-INOUT         20110907
      *----------  基準年月日２                                         20110907
           MOVE  WK-KJN-TO              TO  IXCAL-KJN-YMD2              20110907
                                        OF  PARM-SCZY1020-INOUT         20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":ワーク断面期間FROM=["WK-KJN-FROM"]"     20110907
      D    DISPLAY  CNS-PGM-ID":ワーク断面期間TO=["WK-KJN-TO"]"         20110907
      D    DISPLAY  CNS-PGM-ID":機能区分=["                             20110907
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":基準年月日1=["                          20110907
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":計算ベース区分=["                       20110907
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":前後区分１=["                           20110907
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":前後区分２=["                           20110907
      D             IXCAL-ZENGO-KBN-2   OF  PARM-SCZY1020-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":単位区分=["                             20110907
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":日数          =["                       20110907
      D             IXCAL-DAYS          OF  PARM-SCZY1020-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":基準年月日２    =["                     20110907
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1020  START  ***"        20110907
      *-----------------------------------------------------------------20110907
           CALL  "SCZY1020"             USING  PARM-SCZY1020-INOUT      20110907
                                               PARM-RTNPKG              20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)            =["         20110907
      D             RTN-CD   OF PARM-RTNPKG( COUNTER OF  PARM-RTNPKG)"]"20110907
      *-----------------------------------------------------------------20110907
           IF  RTN-CD  OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)          20110907
            = CNS-RTN-000                                               20110907
           THEN                                                         20110907
             MOVE  IXCAL-DAYS          OF  PARM-SCZY1020-ARG1           20110907
               TO  WK-MONTH                                             20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":ワーク月数=["WK-MONTH"]"                20110907
      *-----------------------------------------------------------------20110907
           ELSE                                                         20110907
      *----------  エラー検知プログラム名                               20110907
             MOVE  CNS-PGM-ID                                           20110907
               TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1            20110907
      *----------  ポジション                                           20110907
             MOVE  CNS-POS-021                                          20110907
               TO  ERR-POS            OF  PARM-SCZY1170-ARG1            20110907
      *----------  リターンコード                                       20110907
             MOVE  CNS-RTN-901                                          20110907
               TO  RTN-CD             OF  PARM-SCZY1170-ARG1            20110907
      *----------  詳細リターンコード                                   20110907
             MOVE  RTN-CD             OF  PARM-RTNPKG(COUNTER           20110907
                                      OF  PARM-RTNPKG)                  20110907
               TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1            20110907
      *----------  詳細リターンコードデコードフラグ                     20110907
             MOVE  CNS-DETAIL-0                                         20110907
               TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1            20110907
      *---------- フリーメッセージ                                      20110907
             STRING "断面期間FROM～断面期間TOの月数のチェックエラー"    20110907
                    DELIMITED BY SIZE                                   20110907
                    INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1            20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID": ***  残高処理対象断面別処理 異常  ***" 20110907
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              20110907
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              20110907
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              20110907
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              20110907
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     20110907
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              20110907
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20110907
      *-----------------------------------------------------------------20110907
      *----------  エラー処理                                           20110907
             PERFORM  ERR-RTN                                           20110907
           END-IF                                                       20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":ワーク月数=["WK-MONTH"]"                20110907
      *-----------------------------------------------------------------20110907
           IF  WK-MONTH <= CNS-13                                       20110907
           THEN                                                         20110907
             CONTINUE                                                   20110907
           ELSE                                                         20110907
      *----------  ワークメッセージID                                   20110907
             MOVE  CNS-MSG-E000430       TO  WK-MSG-ID                  20110907
      *----------  置換文字                                             20110907
             MOVE  "処理対象断面期間"    TO  WK-TK-MOJI                 20110907
               OF  WK-TIKAN-MOJI(CNS-1)                                 20110907
             MOVE  "13ヶ月"              TO  WK-TK-MOJI                 20110907
               OF  WK-TIKAN-MOJI(CNS-2)                                 20110907
      *----------  ワークリターンコード                                 20110907
             MOVE  CNS-RTN-006           TO  WK-RTN-CD-CP               20110907
      *----------  処理続行フラグ←"1"（処理スッキプ）                  20110907
             MOVE  CNS-1                 TO  FLG-SYORI                  20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID =["WK-MSG-ID"]"               20110907
      D    DISPLAY  CNS-PGM-ID ":ワーク置換文字1=["                     20110907
      D             WK-TK-MOJI  OF  WK-TIKAN-MOJI(CNS-1)"]"             20110907
      D    DISPLAY  CNS-PGM-ID ":ワーク置換文字2=["                     20110907
      D             WK-TK-MOJI  OF  WK-TIKAN-MOJI(CNS-2)"]"             20110907
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-CP =["WK-RTN-CD-CP"]"         20110907
      D    DISPLAY  CNS-PGM-ID":処理続行フラグ=["FLG-SYORI"]"           20110907
      *-----------------------------------------------------------------20110907
      *----------  リターンコード比較処理                               20110907
             PERFORM  R-CD-CP-RTN                                       20110907
      *----------  ポートフォリオ別メッセージ出力処理                   20110907
             PERFORM  SCZY7080-1-RTN                                    20110907
           END-IF                                                       20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":***  断面期間FROM～断面期間TOの月数"    20110907
      D                       "のチェック  END  ***"                    20110907
      *-----------------------------------------------------------------20110907
           CONTINUE.                                                    20110907
       SCZY1020-EXT.                                                    20110907
           EXIT.                                                        20110907
      ******************************************************************20110907
      *    ポートフォリオ別メッセージ出力処理                           20110907
      ******************************************************************20110907
       SCZY7080-1-RTN         SECTION.                                  20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID                                          20110907
      D           ":***  ポートフォリオ別メッセージ出力処理  START  ***"20110907
      *-----------------------------------------------------------------20110907
           INITIALIZE  PARM-SCZY7080-INOUT                              20110907
                       PARM-RTNPKG                                      20110907
      *----------  利用会社コード                                       20110907
           MOVE  WK-RIYO-CMP-CD                                         20110907
             TO  RIYO-CMP-CD            OF  PARM-SCZY7080-ARG1          20110907
      *----------  処理実行日                                           20110907
           MOVE  WK-SYORI-YMD                                           20110907
             TO  SYORI-YMD              OF  PARM-SCZY7080-ARG1          20110907
      *----------  起動ID                                               20110907
           MOVE  WK-KIDOU-ID                                            20110907
             TO  KIDOU-ID               OF  PARM-SCZY7080-ARG1          20110907
      *----------  業務タスクID                                         20110907
           MOVE  WK-GYOMU-TASK-ID                                       20110907
             TO  GYOMU-TASK-ID          OF  PARM-SCZY7080-ARG1          20110907
      *----------  メッセージエリア                                     20110907
      *----------  ファンドコード                                       20110907
           MOVE  WK-FUND-CD                                             20110907
             TO  FUND-CD                OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  ポートフォリオコード                                 20110907
           MOVE  WK-PTF-CD                                              20110907
             TO  PTF-CD                 OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  評価系列コード                                       20110907
           MOVE  WK-HYK-KRTU-CD                                         20110907
             TO  HYK-KRTU-CD            OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  帳票ID                                               20110907
           MOVE  SPACE                                                  20110907
             TO  REP-ID                 OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  帳票任意コード                                       20110907
           MOVE  SPACE                                                  20110907
             TO  REP-ANY-CD             OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  基準日From                                           20110907
           MOVE  WK-KJN-YMD-FROM                                        20110907
             TO  KJN-YMD-FROM           OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  基準日To                                             20110907
           MOVE  WK-KJN-YMD-TO                                          20110907
             TO  KJN-YMD-TO             OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  メッセージID                                         20110907
           MOVE  WK-MSG-ID                                              20110907
             TO  MSG-ID                 OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  置換文字                                             20110907
           MOVE  WK-TIKAN-MOJI                                          20110907
             TO  TIKAN-MOJI             OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *----------  フリーメッセージ                                     20110907
           MOVE  SPACE                                                  20110907
             TO  FREE-MSG               OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["                       20110907
      D             RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":処理実行日=["                           20110907
      D             SYORI-YMD           OF  PARM-SCZY7080-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":起動ID=["                               20110907
      D             KIDOU-ID            OF  PARM-SCZY7080-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["                         20110907
      D             GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["                       20110907
      D             FUND-CD             OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["                 20110907
      D             PTF-CD              OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["                       20110907
      D             HYK-KRTU-CD         OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":帳票ID=["                               20110907
      D             REP-ID              OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["                       20110907
      D             REP-ANY-CD          OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":基準日From=["                           20110907
      D             KJN-YMD-FROM        OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":基準日To=["                             20110907
      D             KJN-YMD-TO          OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":メッセージID=["                         20110907
      D             MSG-ID              OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":置換文字=["                             20110907
      D             TIKAN-MOJI          OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ=["                     20110907
      D             FREE-MSG            OF  PARM-SCZY7080-ARG2(CNS-1)"]"20110907
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  START  ***"        20110907
      *-----------------------------------------------------------------20110907
           CALL   "SCZY7080"            USING  PARM-SCZY7080-INOUT      20110907
                                               PARM-RTNPKG              20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080   END   ***"        20110907
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7080)       =["              20110907
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"20110907
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["              20110907
      D             COUNTER             OF PARM-RTNPKG"]"               20110907
      *-----------------------------------------------------------------20110907
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)            20110907
            =  CNS-RTN-000                                              20110907
           THEN                                                         20110907
      *----------  ＤＢコミット処理                                     20110907
             EXEC SQL                                                   20110907
                 COMMIT                                                 20110907
             END-EXEC                                                   20110907
      *--------------------<DEBUG>--------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":COMMIT SQLCODE=["SQLCODE"]"             20110907
      *-----------------------------------------------------------------20110907
             IF  SQLCODE = CNS-SQL-NORMAL                               20110907
             THEN                                                       20110907
      *--------------------<DEBUG>--------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID":*** ＤＢコミット処理 正常! ***"         20110907
      *-----------------------------------------------------------------20110907
               CONTINUE                                                 20110907
             ELSE                                                       20110907
      *----------  エラー検知プログラム名                               20110907
                 MOVE  CNS-PGM-ID                                       20110907
                   TO  ERR-PGM-ID       OF  PARM-SCZY1170-ARG1          20110907
      *----------  ポジション                                           20110907
                 MOVE  CNS-POS-022                                      20110907
                   TO  ERR-POS          OF  PARM-SCZY1170-ARG1          20110907
      *----------  リターンコード                                       20110907
                 MOVE  CNS-RTN-900                                      20110907
                   TO  RTN-CD           OF  PARM-SCZY1170-ARG1          20110907
      *----------  詳細リターンコード                                   20110907
                 MOVE  SQLCODE                                          20110907
                   TO  DETAIL-RTN-CD    OF  PARM-SCZY1170-ARG1          20110907
      *----------  詳細リターンコードデコードフラグ                     20110907
                 MOVE  CNS-DETAIL-1                                     20110907
                   TO  DETAIL-RTN-CD-FLG                                20110907
                                        OF  PARM-SCZY1170-ARG1          20110907
      *---------- フリーメッセージ                                      20110907
                 STRING "ＤＢコミット処理 エラー"                       20110907
                      DELIMITED BY SIZE                                 20110907
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1          20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID": *** ＤＢコミット処理 異常  ***"        20110907
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              20110907
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              20110907
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              20110907
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              20110907
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     20110907
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              20110907
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20110907
      *-----------------------------------------------------------------20110907
      *----------  エラー処理                                           20110907
                 PERFORM  ERR-RTN                                       20110907
             END-IF                                                     20110907
           ELSE                                                         20110907
      *----------  エラー検知プログラム名                               20110907
             MOVE  CNS-PGM-ID                                           20110907
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20110907
      *----------  ポジション                                           20110907
             MOVE  CNS-POS-023                                          20110907
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20110907
      *----------  リターンコード                                       20110907
             MOVE  CNS-RTN-901                                          20110907
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20110907
      *----------  詳細リターンコード                                   20110907
             MOVE  RTN-CD               OF  PARM-RTNPKG(COUNTER         20110907
                                        OF  PARM-RTNPKG)                20110907
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20110907
      *----------  詳細リターンコードデコードフラグ                     20110907
             MOVE  CNS-DETAIL-0                                         20110907
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20110907
      *---------- フリーメッセージ                                      20110907
             STRING "ポートフォリオ別メッセージＩＮＳルーチンエラー:"   20110907
                    "利用会社コード =["                                 20110907
                    RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1          20110907
                    "] 処理実行日 =["                                   20110907
                    SYORI-YMD           OF  PARM-SCZY7080-ARG1          20110907
                    "] 起動ID=["                                        20110907
                    KIDOU-ID            OF  PARM-SCZY7080-ARG1          20110907
                    "] 業務タスクID =["                                 20110907
                    GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1          20110907
                    "] ファンドコード=["                                20110907
                    FUND-CD             OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] ポートフォリオコード=["                          20110907
                    PTF-CD              OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] 評価系列コード=["                                20110907
                    HYK-KRTU-CD         OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] 帳票ID=["                                        20110907
                    REP-ID              OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] 帳票任意コード=["                                20110907
                    REP-ANY-CD          OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] 基準日FROM=["                                    20110907
                    KJN-YMD-FROM        OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] 基準日TO=["                                      20110907
                    KJN-YMD-TO          OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] メッセージID=["                                  20110907
                    MSG-ID              OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] 置換文字=["                                      20110907
                    TIKAN-MOJI          OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "] フリーメッセージ=["                              20110907
                    FREE-MSG            OF  PARM-SCZY7080-ARG2(CNS-1)   20110907
                    "]"                                                 20110907
                    DELIMITED BY SIZE                                   20110907
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1          20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID                                          20110907
      D    ":***  ポートフォリオ別メッセージＩＮＳルーチン  異常  ***"  20110907
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              20110907
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              20110907
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              20110907
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              20110907
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     20110907
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20110907
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              20110907
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20110907
      *-----------------------------------------------------------------20110907
      *----------  エラー処理                                           20110907
             PERFORM  ERR-RTN                                           20110907
           END-IF                                                       20110907
      *-------------------<DEBUG>---------------------------------------20110907
      D    DISPLAY  CNS-PGM-ID                                          20110907
      D    ": ポートフォリオ別メッセージ出力処理  END  ***"             20110907
      *-----------------------------------------------------------------20110907
           CONTINUE.                                                    20110907
       SCZY7080-1-EXT.                                                  20110907
           EXIT.                                                        20110907
      ******************************************************************
      *    3.2.3 残高処理対象断面別処理
      ******************************************************************
       SMHJ2010-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高処理対象断面別処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMHJ2010-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SMHJ2010-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SMHJ2010-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SMHJ2010-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SMHJ2010-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  PARM-SMHJ2010-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  PARM-SMHJ2010-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD
             TO  HYK-KRTU-CD            OF  PARM-SMHJ2010-ARG1
      *----------  基準日FROM指定フラグ
           MOVE  WK-KJN-YMD-FROM-FLG
             TO  KJN-YMD-FROM-FLG       OF  PARM-SMHJ2010-ARG1
      *----------  基準日FROM
           MOVE  KJN-YMD-FROM           OF  PARM-SMHJ1810-ARG2
             TO  KJN-YMD-FROM           OF  PARM-SMHJ2010-ARG1
      *----------  基準日TO
           MOVE  WK-KJN-YMD-TO-GS
             TO  KJN-YMD-TO             OF  PARM-SMHJ2010-ARG1
      *----------  銘柄指定ありフラグ
           MOVE  WK-MEG-FLG
             TO  MEG-FLG                OF  PARM-SMHJ2010-ARG1
      *----------  銘柄指定エリア
           MOVE  WK-MEG-SITEI-AREA
             TO  MEG-SITEI-GROUP        OF  PARM-SMHJ2010-ARG1
      *----------  ユーザＩＤ
           MOVE  WK-USER-ID
             TO  USER-ID                OF  PARM-SMHJ2010-ARG1
      *----------  評価系列データエリア
           MOVE  HYK-KRTU-AREA          OF  PARM-SMHJ1110-ARG1
             TO  HYK-KRTU-AREA          OF  PARM-SMHJ2010-ARG1
      *----------  評価計算パターンデータエリア
           MOVE  HYK-CALC-AREA          OF  PARM-SMHJ1110-ARG1
             TO  HYK-CALC-AREA          OF  PARM-SMHJ2010-ARG1
      *----------  評価時価取得方法パターンデータエリア
           MOVE  HYK-HOU-AREA           OF  PARM-SMHJ1110-ARG1
             TO  HYK-HOU-AREA           OF  PARM-SMHJ2010-ARG1
      *----------  評価為替取得方法パターンデータエリア
           MOVE  HYK-EX-HOU-AREA        OF  PARM-SMHJ1110-ARG1
             TO  HYK-EX-HOU-AREA        OF  PARM-SMHJ2010-ARG1
      *----------  料率データエリア
           MOVE  RYORITU-AREA           OF  PARM-SMHJ1110-ARG1
             TO  RYORITU-AREA           OF  PARM-SMHJ2010-ARG1
      *----------  通貨データエリア
           MOVE  TUKA-CD-AREA           OF  PARM-SMHJ1110-ARG1
             TO  TUKA-CD-AREA           OF  PARM-SMHJ2010-ARG1
      *----------  為替換算情報データエリア
           MOVE  KWS-KRTU-AREA          OF  PARM-SMHJ1110-ARG1
             TO  KWS-KRTU-AREA          OF  PARM-SMHJ2010-ARG1
      *----------  ＧＩＰＳモード
           MOVE  GIPS-MODE              OF  PARM-SMHJ1110-ARG1
             TO  GIPS-MODE              OF  PARM-SMHJ2010-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM指定フラグ=["
      D             KJN-YMD-FROM-FLG    OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日TO=["
      D             KJN-YMD-TO          OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定ありフラグ=["
      D             MEG-FLG             OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定エリア=["
      D             MEG-SITEI-GROUP     OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ユーザＩＤ=["
      D             USER-ID             OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列データエリア=["
      D             HYK-KRTU-AREA       OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価計算パターンデータエリア=["
      D             HYK-CALC-AREA       OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価時価取得方法パターンデータエリア=["
      D             HYK-HOU-AREA        OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価為替取得方法パターンデータエリア=["
      D             HYK-EX-HOU-AREA     OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":料率データエリア=["
      D             RYORITU-AREA        OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":通貨データエリア=["
      D             TUKA-CD-AREA        OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":為替換算情報データエリア=["
      D             KWS-KRTU-AREA       OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード=["
      D             GIPS-MODE           OF  PARM-SMHJ2010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SMHJ2010  START  ***"
      *-----------------------------------------------------------------
           CALL   "SMHJ2010"            USING  PARM-SMHJ2010-INOUT
                                               PARM-RTNPKG
      *    机上デバッグについて、IDXの事前設定--START--
      *-------------------<DEBUG>---------------------------------------
      *    MOVE  CNS-RTN-002
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *-----------------------------------------------------------------
      *    机上デバッグについて、IDXの事前設定--END--
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SMHJ2010   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SMHJ2010) =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD =["
      D            RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               PERFORM  DB-DATA-RTN
      *----------  リターンコード＝"001"（未処理）の場合                20091118
             WHEN  CNS-RTN-001                                          20091118
               MOVE  CNS-1              TO  FLG-SYORI-N                 20091118
      *-------------------<DEBUG>---------------------------------------20091118
      D    DISPLAY  CNS-PGM-ID":未処理フラグ  =["FLG-SYORI-N"]"         20091118
      *-----------------------------------------------------------------20091118
               PERFORM  DB-DATA-RTN                                     20091118
             WHEN  CNS-RTN-002
             WHEN  CNS-RTN-004
      *----------  ワークリターンコード
               MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                 TO  WK-RTN-CD-CP                                       20090115
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-CP =["WK-RTN-CD-CP"]"         20090115
      *-----------------------------------------------------------------
      *----------  リターンコード比較処理                               20090115
               PERFORM  R-CD-CP-RTN                                     20090115
               PERFORM  DB-DATA-RTN
             WHEN  CNS-RTN-006                                          20081124
      *----------  処理続行フラグ←1（処理スッキプ）                    20081124
               MOVE  CNS-X-1            TO  FLG-SYORI                   20081124
      *----------  ワークリターンコード                                 20081029
               MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)      20081029
                 TO  WK-RTN-CD-CP                                       20081029 20090115
      *-------------------<DEBUG>---------------------------------------20081029
      D    DISPLAY  CNS-PGM-ID":処理続行フラグ =["FLG-SYORI"]"          20081124
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-CP =["WK-RTN-CD-CP"]"         20081029 20090115
      *-----------------------------------------------------------------20081029
      *----------  リターンコード比較処理                               20090115
               PERFORM  R-CD-CP-RTN                                     20090115
               PERFORM  DB-DATA-RTN                                     20081029
             WHEN  CNS-RTN-010                                          20090903
      *----------  処理続行フラグ←1（処理スッキプ）                    20090903
               MOVE  CNS-X-1            TO  FLG-SYORI                   20090903
      *----------  ワークリターンコード                                 20090903
               MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)      20090903
                 TO  WK-RTN-CD-CP                                       20090903
      *-------------------<DEBUG>---------------------------------------20090903
      D    DISPLAY  CNS-PGM-ID":処理続行フラグ =["FLG-SYORI"]"          20090903
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-CP =["WK-RTN-CD-CP"]"         20090903
      *-----------------------------------------------------------------20090903
      *----------  リターンコード比較処理                               20090903
               PERFORM  R-CD-CP-RTN                                     20090903
               PERFORM  DB-DATA-RTN                                     20090903
               PERFORM  END-RTN                                         20090903
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-011
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG(COUNTER
                                        OF  PARM-RTNPKG)
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING "SMHJ2010残高処理対象断面別処理エラー:"
                      "利用会社コード =["
                      RIYO-CMP-CD       OF  PARM-SMHJ2010-ARG1
                      "] 処理実行日 =["
                      SYORI-YMD         OF  PARM-SMHJ2010-ARG1
                      "]起動ID =["
                      KIDOU-ID          OF  PARM-SMHJ2010-ARG1
                      "]業務タスクID =["
                      GYOMU-TASK-ID     OF  PARM-SMHJ2010-ARG1
                      "]ファンドコード =["
                      FUND-CD           OF  PARM-SMHJ2010-ARG1
                      "]ポートフォリオコード =["
                      PTF-CD            OF  PARM-SMHJ2010-ARG1
                      "]評価系列コード =["
                      HYK-KRTU-CD       OF  PARM-SMHJ2010-ARG1
                      "]基準日FROM指定フラグ =["
                      KJN-YMD-FROM-FLG  OF  PARM-SMHJ2010-ARG1
                      "]基準日FROM =["
                      KJN-YMD-FROM      OF  PARM-SMHJ2010-ARG1
                      "]基準日TO =["
                      KJN-YMD-TO        OF  PARM-SMHJ2010-ARG1
                      "]銘柄指定ありフラグ =["
                      MEG-FLG           OF  PARM-SMHJ2010-ARG1
                      "]銘柄指定エリア=["
                      MEG-SITEI-GROUP   OF  PARM-SMHJ2010-ARG1
                      "]ユーザＩＤ=["
                      USER-ID           OF  PARM-SMHJ2010-ARG1
                      "]"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  残高処理対象断面別処理 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------------------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高処理対象断面別処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMHJ2010-EXT.
           EXIT.
      ******************************************************************
      *    3.2.4 不要断面削除
      ******************************************************************
       SMHJ5010-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  不要断面削除  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMHJ5010-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SMHJ5010-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  PARM-SMHJ5010-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  PARM-SMHJ5010-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD
             TO  HYK-KRTU-CD            OF  PARM-SMHJ5010-ARG1
      *----------  基準日FROM
           MOVE  KJN-YMD-FROM           OF  PARM-SMHJ1810-ARG2
             TO  KJN-YMD-FROM           OF  PARM-SMHJ5010-ARG1
      *----------  基準日TO
           MOVE  KJN-YMD-TO             OF  PARM-SMHJ1810-ARG2
             TO  KJN-YMD-TO             OF  PARM-SMHJ5010-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SMHJ5010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SMHJ5010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SMHJ5010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SMHJ5010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SMHJ5010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日TO=["
      D             KJN-YMD-TO          OF  PARM-SMHJ5010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SMHJ5010  START  ***"
      *-----------------------------------------------------------------
           CALL   "SMHJ5010"            USING  PARM-SMHJ5010-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SMHJ5010   END   ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMHJ5010)  =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SMHJ5010)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER            OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  不要断面削除 正常  ***"
      D    DISPLAY  CNS-PGM-ID":【SMHJ5010】・テーブル処理件数（1） =["
      D             TBL-SYORI-COUNT     OF  PARM-SMHJ5010-ARG2(CNS-1)"]"
      *-----------------------------------------------------------------
             IF  TBL-SYORI-COUNT        OF  PARM-SMHJ5010-ARG2(CNS-1)
                 NOT = ZERO
             THEN
      *----------   ワークDB更新情報.識別子(6)                          20090508
               MOVE  TBL-ID             OF  PARM-SMHJ5010-ARG2(CNS-1)
                 TO  WK-TBL-ID(CNS-6)                                   20090508
      *----------   ワークDB更新情報.対象処理(6)                        20090508
               MOVE  TBL-SYORI-NAME     OF  PARM-SMHJ5010-ARG2(CNS-1)
                 TO  WK-TBL-SYORI-NAME(CNS-6)                           20090508
      *----------   ワークDB更新情報.処理件数(6)                        20090508
               COMPUTE  WK-TBL-SYORI-COUNT(CNS-6)                       20090508
                     =  WK-TBL-SYORI-COUNT(CNS-6)                       20090508
                     +  TBL-SYORI-COUNT OF  PARM-SMHJ5010-ARG2(CNS-1)   20090508
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  【SMHJ5010】・テーブル処理件数（1）≠０ ***"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(6)=["           20090508
      D             WK-TBL-ID(CNS-6)"]"                                 20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(6)=["         20090508
      D             WK-TBL-SYORI-NAME(CNS-6)"]"                         20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(6)=["         20090508
      D             WK-TBL-SYORI-COUNT(CNS-6)"]"                        20090508
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": ***  【SMHJ5010】・テーブル処理件数（1）= ０ ***"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
             IF  TBL-SYORI-COUNT        OF  PARM-SMHJ5010-ARG2(CNS-2)   20090508
                 NOT = ZERO                                             20090508
             THEN                                                       20090508
      *----------   ワークDB更新情報.識別子(7)                          20090508
               MOVE  TBL-ID             OF  PARM-SMHJ5010-ARG2(CNS-2)   20090508
                 TO  WK-TBL-ID(CNS-7)                                   20090508
      *----------   ワークDB更新情報.対象処理(7)                        20090508
               MOVE  TBL-SYORI-NAME     OF  PARM-SMHJ5010-ARG2(CNS-2)   20090508
                 TO  WK-TBL-SYORI-NAME(CNS-7)                           20090508
      *----------   ワークDB更新情報.処理件数(7)                        20090508
               COMPUTE  WK-TBL-SYORI-COUNT(CNS-7)                       20090508
                     =  WK-TBL-SYORI-COUNT(CNS-7)                       20090508
                     +  TBL-SYORI-COUNT OF  PARM-SMHJ5010-ARG2(CNS-2)   20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ": ***  【SMHJ5010】・テーブル処理件数（2）≠０ ***"20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(7)=["           20090508
      D             WK-TBL-ID(CNS-7)"]"                                 20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(7)=["         20090508
      D             WK-TBL-SYORI-NAME(CNS-7)"]"                         20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(7)=["         20090508
      D             WK-TBL-SYORI-COUNT(CNS-7)"]"                        20090508
      *-----------------------------------------------------------------20090508
             ELSE                                                       20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ": ***  【SMHJ5010】・テーブル処理件数（2）= ０ ***"20090508
      *-----------------------------------------------------------------20090508
               CONTINUE                                                 20090508
             END-IF                                                     20090508
             IF  TBL-SYORI-COUNT        OF  PARM-SMHJ5010-ARG2(CNS-3)   20090508
                 NOT = ZERO                                             20090508
             THEN                                                       20090508
      *----------   ワークDB更新情報.識別子(8)                          20090508
               MOVE  TBL-ID             OF  PARM-SMHJ5010-ARG2(CNS-3)   20090508
                 TO  WK-TBL-ID(CNS-8)                                   20090508
      *----------   ワークDB更新情報.対象処理(8)                        20090508
               MOVE  TBL-SYORI-NAME     OF  PARM-SMHJ5010-ARG2(CNS-3)   20090508
                 TO  WK-TBL-SYORI-NAME(CNS-8)                           20090508
      *----------   ワークDB更新情報.処理件数(8)                        20090508
               COMPUTE  WK-TBL-SYORI-COUNT(CNS-8)                       20090508
                     =  WK-TBL-SYORI-COUNT(CNS-8)                       20090508
                     +  TBL-SYORI-COUNT OF  PARM-SMHJ5010-ARG2(CNS-3)   20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ": ***  【SMHJ5010】・テーブル処理件数（3）≠０ ***"20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(8)=["           20090508
      D             WK-TBL-ID(CNS-8)"]"                                 20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(8)=["         20090508
      D             WK-TBL-SYORI-NAME(CNS-8)"]"                         20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(8)=["         20090508
      D             WK-TBL-SYORI-COUNT(CNS-8)"]"                        20090508
      *-----------------------------------------------------------------20090508
             ELSE                                                       20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ": ***  【SMHJ5010】・テーブル処理件数（3）= ０ ***"20090508
      *-----------------------------------------------------------------20090508
               CONTINUE                                                 20090508
             END-IF                                                     20090508
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-012
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
              STRING "SMHJ5010不要断面削除エラー:"
                      "利用会社コード =["
                      RIYO-CMP-CD       OF  PARM-SMHJ5010-ARG1
                      "] ファンドコード =["
                      FUND-CD           OF  PARM-SMHJ5010-ARG1
                      "]ポートフォリオコード =["
                      PTF-CD            OF  PARM-SMHJ5010-ARG1
                      "]評価系列コード =["
                      HYK-KRTU-CD       OF  PARM-SMHJ5010-ARG1
                      "]基準日FROM =["
                      KJN-YMD-FROM      OF  PARM-SMHJ5010-ARG1
                      "]基準日TO =["
                      KJN-YMD-TO        OF  PARM-SMHJ5010-ARG1
                      "]"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  不要断面削除 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  不要断面削除  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMHJ5010-EXT.
           EXIT.
      ******************************************************************
      *    3.2.5 ポートフォリオ処理終了
      ******************************************************************
       SMHJ5210-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ポートフォリオ処理終了  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMHJ5210-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SMHJ5210-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SMHJ5210-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SMHJ5210-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SMHJ5210-ARG1
      *----------  締め日FROM
           MOVE  SIME-YMD-FROM          OF  PARM-SMHJ1810-ARG2
             TO  SIME-YMD-FROM          OF  PARM-SMHJ5210-ARG1
      *----------  締め日TO
           MOVE  SIME-YMD-TO            OF  PARM-SMHJ1810-ARG2
             TO  SIME-YMD-TO            OF  PARM-SMHJ5210-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  PARM-SMHJ5210-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  PARM-SMHJ5210-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD
             TO  HYK-KRTU-CD            OF  PARM-SMHJ5210-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":締め日FROM=["
      D             SIME-YMD-FROM       OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":締め日TO=["
      D             SIME-YMD-TO         OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SMHJ5210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SMHJ5210  START  ***"
      *-----------------------------------------------------------------
           CALL   "SMHJ5210"            USING  PARM-SMHJ5210-INOUT
                                               PARM-RTNPKG
      *    机上デバッグについて、IDXの事前設定--START--
      *-------------------<DEBUG>---------------------------------------
      *    MOVE  123
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *-----------------------------------------------------------------
      *    机上デバッグについて、IDXの事前設定--END--
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SMHJ5210   END   ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMHJ5210)  =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SMHJ5210)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  ポートフォリオ処理終了 正常  ***"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-002
      *----------  ワークリターンコード←"002"(ウォーニング)            20081010
               MOVE  CNS-RTN-002        TO  WK-RTN-CD-CP                20090115
      *-------------------<DEBUG>---------------------------------------20090115
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-CP =["WK-RTN-CD-CP"]"         20090115
      *-----------------------------------------------------------------20090115
      *----------  リターンコード比較処理                               20090115
               PERFORM  R-CD-CP-RTN                                     20090115
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-013
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                        (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  "SMHJ5210ポートフォリオ処理終了エラー:"
                      "利用会社コード =["
                       RIYO-CMP-CD      OF  PARM-SMHJ5210-ARG1
                      "]処理実行日 =["
                       SYORI-YMD        OF  PARM-SMHJ5210-ARG1
                      "]起動ID =["
                       KIDOU-ID         OF  PARM-SMHJ5210-ARG1
                      "]業務タスクID =["
                       GYOMU-TASK-ID    OF  PARM-SMHJ5210-ARG1
                      "]締め日FROM =["
                       SIME-YMD-FROM    OF  PARM-SMHJ5210-ARG1
                      "]締め日TO =["
                       SIME-YMD-TO      OF  PARM-SMHJ5210-ARG1
                      "]ファンドコード =["
                       FUND-CD          OF  PARM-SMHJ5210-ARG1
                      "]ポートフォリオコード =["
                       PTF-CD           OF  PARM-SMHJ5210-ARG1
                      "]評価系列コード =["
                       HYK-KRTU-CD      OF  PARM-SMHJ2010-ARG1
                      "]"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  ポートフォリオ処理終了 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ポートフォリオ処理終了  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMHJ5210-EXT.
           EXIT.
      ******************************************************************
      *    3.2.6 ステータス変更処理２
      ******************************************************************
       SCZY7210-2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ステータス変更処理2  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7210-INOUT
                       PARM-RTNPKG
      *----------  セッション区分
           MOVE  CNS-X-1
             TO  SESSION-KBN            OF  PARM-SCZY7210-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7210-ARG2
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7210-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7210-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  PARM-SCZY7210-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  PARM-SCZY7210-ARG2
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD
             TO  HYK-KRTU-CD            OF  PARM-SCZY7210-ARG2
      *----------  帳票ID
           MOVE  SPACE
             TO  REP-ID                 OF  PARM-SCZY7210-ARG2
      *----------  帳票任意コード
           MOVE  SPACE
             TO  REP-ANY-CD             OF  PARM-SCZY7210-ARG2
      *----------  基準日FROM
           MOVE  WK-KJN-YMD-FROM
             TO  KJN-YMD-FROM           OF  PARM-SCZY7210-ARG2
      *-------------------<DEBUG>---------------------------------------20091118
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD  =["WK-RTN-CD"]"              20091118
      *-----------------------------------------------------------------20091118
      *----------  実行ステータス
           EVALUATE  WK-RTN-CD
             WHEN  SPACE
      *-------------------<DEBUG>---------------------------------------20091118
      D    DISPLAY  CNS-PGM-ID":未処理フラグ  =["FLG-SYORI-N"]"         20091118
      *-----------------------------------------------------------------20091118
               IF  FLG-SYORI-N  = ZERO                                  20091118
               THEN                                                     20091118
      *----------  "100"（正常終了）                                    20091118
                 MOVE  CNS-MSG-100                                      20091118
                   TO  JIKOU-STS        OF  PARM-SCZY7210-ARG2          20091118
               ELSE                                                     20091118
      *----------  "155"（未処理）                                      20091118
                 MOVE  CNS-MSG-155                                      20091118
                   TO  JIKOU-STS        OF  PARM-SCZY7210-ARG2          20091118
               END-IF                                                   20091118
             WHEN  CNS-RTN-002
      *----------  "200"（警告）
               MOVE  CNS-MSG-200
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  CNS-RTN-004
      *----------  "270"（業務エラー（続行可能））
               MOVE  CNS-MSG-270
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  CNS-RTN-006
      *----------  "275"(業務エラー(明細続行不可))
               MOVE  CNS-MSG-275
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  OTHER
               MOVE  WK-RTN-CD
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":セッション区分=["
      D            SESSION-KBN          OF  PARM-SCZY7210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":実行ステータス=["
      D             JIKOU-STS           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7210  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY7210"            USING  PARM-SCZY7210-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7210   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY7210)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  ステータス変更処理2 正常  ***"
      *-----------------------------------------------------------------
      *----------  ＤＢコミット処理
             EXEC SQL
                 COMMIT
             END-EXEC
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ＤＢコミット処理 正常! ***"
      *-----------------------------------------------------------------
                 CONTINUE
             ELSE
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID       OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-014
                   TO  ERR-POS          OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                                        OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING "ＤＢコミット処理 エラー"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *** ＤＢコミット処理 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-IF
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-015
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
              STRING "ステータス変更処理１エラー:"
                      "セッション区分 =["
                       SESSION-KBN      OF  PARM-SCZY7210-ARG1
                      "]利用会社コード =["
                      RIYO-CMP-CD       OF  PARM-SCZY7210-ARG2
                      "]処理実行日 =["
                      SYORI-YMD         OF  PARM-SCZY7210-ARG2
                      "]起動ID =["
                      KIDOU-ID          OF  PARM-SCZY7210-ARG2
                      "]ファンドコード =["
                      FUND-CD           OF  PARM-SCZY7210-ARG2
                      "]ポートフォリオコード =["
                      PTF-CD            OF  PARM-SCZY7210-ARG2
                      "]評価系列コード =["
                      HYK-KRTU-CD       OF  PARM-SCZY7210-ARG2
                      "]実行ステータス =["
                      JIKOU-STS         OF  PARM-SCZY7210-ARG2
                      "]"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  ステータス変更処理2 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ステータス変更処理2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7210-2-EXT.
           EXIT.
      ******************************************************************20090115
      *    リターンコード比較処理                                       20090115
      ******************************************************************20090115
       R-CD-CP-RTN            SECTION.                                  20090115
      *-------------------<DEBUG>---------------------------------------20090115
      D    DISPLAY  CNS-PGM-ID":***  リターンコード比較処理  START  ***"20090115
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"     20090115
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード比較値=["           20090115
      D                         WK-RTN-CD-CP"]"                         20090115
      *-----------------------------------------------------------------20090115
           IF  WK-RTN-CD < WK-RTN-CD-CP                                 20090115
           THEN                                                         20090115
             MOVE  WK-RTN-CD-CP  TO  WK-RTN-CD                          20090115
           ELSE                                                         20090115
             CONTINUE                                                   20090115
           END-IF                                                       20090115
      *-------------------<DEBUG>---------------------------------------20090115
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD=["WK-RTN-CD"]"                20090115
      D    DISPLAY  CNS-PGM-ID":***  リターンコード比較処理  END  ***"  20090115
      *-----------------------------------------------------------------20090115
           CONTINUE.                                                    20090115
       R-CD-CP-EXT.                                                     20090115
           EXIT.                                                        20090115
      ******************************************************************
      *         DB更新情報編集処理
      ******************************************************************
       DB-DATA-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DB更新情報編集処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-RTNPKG
                       WK-DB-UPDATE-MSG-GROUP
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SMHJ2010】・テーブル処理件数（1）=["
      D             TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-1)"]"
      *-----------------------------------------------------------------
      *----------   【SMHJ2010】・テーブル処理件数（1）≠０
           IF    TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-1)
                 NOT = ZERO
           THEN
      *----------   ワークDB更新情報.識別子(1)
           MOVE  TBL-ID                 OF  PARM-SMHJ2010-ARG2(CNS-1)
             TO  WK-TBL-ID(CNS-1)
      *----------   ワークDB更新情報.対象処理(1)
           MOVE  TBL-SYORI-NAME         OF  PARM-SMHJ2010-ARG2(CNS-1)
             TO  WK-TBL-SYORI-NAME(CNS-1)
      *----------   ワークDB更新情報.処理件数(1)
           COMPUTE  WK-TBL-SYORI-COUNT(CNS-1) =
             WK-TBL-SYORI-COUNT(CNS-1) + TBL-SYORI-COUNT
                                        OF  PARM-SMHJ2010-ARG2(CNS-1)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(1)=["
      D             WK-TBL-ID(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(1)=["
      D             WK-TBL-SYORI-NAME(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(1)=["
      D             WK-TBL-SYORI-COUNT(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":【SMHJ2010】・テーブル処理件数（2）=["
      D             TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-2)"]"
      *-----------------------------------------------------------------
      *----------   【SMHJ2010】・テーブル処理件数（2）≠０
           IF    TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-2)
                 NOT = ZERO
           THEN
      *----------   ワークDB更新情報.識別子(2)
           MOVE  TBL-ID                 OF  PARM-SMHJ2010-ARG2(CNS-2)
             TO  WK-TBL-ID(CNS-2)
      *----------   ワークDB更新情報.対象処理(2)
           MOVE  TBL-SYORI-NAME         OF  PARM-SMHJ2010-ARG2(CNS-2)
             TO  WK-TBL-SYORI-NAME(CNS-2)
      *----------   ワークDB更新情報.処理件数(2)
           COMPUTE  WK-TBL-SYORI-COUNT(CNS-2) =
             WK-TBL-SYORI-COUNT(CNS-2) + TBL-SYORI-COUNT
                                        OF  PARM-SMHJ2010-ARG2(CNS-2)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(2)=["
      D             WK-TBL-ID(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(2)=["
      D             WK-TBL-SYORI-NAME(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(2)=["
      D             WK-TBL-SYORI-COUNT(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":【SMHJ2010】・テーブル処理件数（3）=["
      D             TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-3)"]"
      *-----------------------------------------------------------------
      *----------   【SMHJ2010】・テーブル処理件数（3）≠０
           IF    TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-3)
                 NOT = ZERO
           THEN
      *----------   ワークDB更新情報.識別子(3)
           MOVE  TBL-ID                 OF  PARM-SMHJ2010-ARG2(CNS-3)
             TO  WK-TBL-ID(CNS-3)
      *----------   ワークDB更新情報.対象処理(3)
           MOVE  TBL-SYORI-NAME         OF  PARM-SMHJ2010-ARG2(CNS-3)
             TO  WK-TBL-SYORI-NAME(CNS-3)
      *----------   ワークDB更新情報.処理件数(3)
           COMPUTE  WK-TBL-SYORI-COUNT(CNS-3) =
             WK-TBL-SYORI-COUNT(CNS-3) + TBL-SYORI-COUNT
                                        OF  PARM-SMHJ2010-ARG2(CNS-3)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(3)=["
      D             WK-TBL-ID(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(3)=["
      D             WK-TBL-SYORI-NAME(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(3)=["
      D             WK-TBL-SYORI-COUNT(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":【SMHJ2010】・テーブル処理件数（4）=["
      D             TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-4)"]"
      *-----------------------------------------------------------------
      *----------   【SMHJ2010】・テーブル処理件数（4）≠０
           IF    TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-4)
                 NOT = ZERO
           THEN
      *----------   ワークDB更新情報.識別子(4)
           MOVE  TBL-ID                 OF  PARM-SMHJ2010-ARG2(CNS-4)
             TO  WK-TBL-ID(CNS-4)
      *----------   ワークDB更新情報.対象処理(4)
           MOVE  TBL-SYORI-NAME         OF  PARM-SMHJ2010-ARG2(CNS-4)
             TO  WK-TBL-SYORI-NAME(CNS-4)
      *----------   ワークDB更新情報.処理件数(4)
           COMPUTE  WK-TBL-SYORI-COUNT(CNS-4) =
             WK-TBL-SYORI-COUNT(CNS-4) + TBL-SYORI-COUNT
                                        OF  PARM-SMHJ2010-ARG2(CNS-4)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(4)=["
      D             WK-TBL-ID(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(4)=["
      D             WK-TBL-SYORI-NAME(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(4)=["
      D             WK-TBL-SYORI-COUNT(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":【SMHJ2010】・テーブル処理件数（5）=["
      D             TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-5)"]"
      *-----------------------------------------------------------------
      *----------   【SMHJ2010】・テーブル処理件数（5）≠０
           IF    TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-5)
                 NOT = ZERO
           THEN
      *----------   ワークDB更新情報.識別子(5)                          20090508
           MOVE  TBL-ID                 OF  PARM-SMHJ2010-ARG2(CNS-5)
             TO  WK-TBL-ID(CNS-5)                                       20090508
      *----------   ワークDB更新情報.対象処理(5)                        20090508
           MOVE  TBL-SYORI-NAME         OF  PARM-SMHJ2010-ARG2(CNS-5)
             TO  WK-TBL-SYORI-NAME(CNS-5)                               20090508
      *----------   ワークDB更新情報.処理件数(5)                        20090508
           COMPUTE  WK-TBL-SYORI-COUNT(CNS-5) =                         20090508
             WK-TBL-SYORI-COUNT(CNS-5) + TBL-SYORI-COUNT                20090508
                                        OF  PARM-SMHJ2010-ARG2(CNS-5)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(5)=["           20090508
      D             WK-TBL-ID(CNS-5)"]"                                 20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(5)=["         20090508
      D             WK-TBL-SYORI-NAME(CNS-5)"]"                         20090508
      D    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(5)=["         20090508
      D             WK-TBL-SYORI-COUNT(CNS-5)"]"                        20090508
      *    DISPLAY  CNS-PGM-ID":【SMHJ2010】・テーブル処理件数（6）=["  20090508
      *             TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-6)"]"20090508
      *-----------------------------------------------------------------20090508
      *----------   【SMHJ2010】・テーブル処理件数（6）≠０             20090508
      *    IF    TBL-SYORI-COUNT     OF  PARM-SMHJ2010-ARG2(CNS-6)      20090508
      *          NOT = ZERO                                             20090508
      *    THEN                                                         20090508
      *----------   ワークDB更新情報.識別子(7)                          20090508
      *    MOVE  TBL-ID                 OF  PARM-SMHJ2010-ARG2(CNS-6)   20090508
      *      TO  WK-TBL-ID(CNS-7)                                       20090508
      *----------   ワークDB更新情報.対象処理(7)                        20090508
      *    MOVE  TBL-SYORI-NAME         OF  PARM-SMHJ2010-ARG2(CNS-6)   20090508
      *      TO  WK-TBL-SYORI-NAME(CNS-7)                               20090508
      *----------   ワークDB更新情報.処理件数(7)                        20090508
      *    COMPUTE  WK-TBL-SYORI-COUNT(CNS-7) =                         20090508
      *      WK-TBL-SYORI-COUNT(CNS-7) + TBL-SYORI-COUNT                20090508
      *                                 OF  PARM-SMHJ2010-ARG2(CNS-6)   20090508
      *    ELSE                                                         20090508
      *      CONTINUE                                                   20090508
      *    END-IF                                                       20090508
      *-------------------<DEBUG>---------------------------------------20090508
      *    DISPLAY  CNS-PGM-ID":ワークDB更新情報.識別子(7)=["           20090508
      *             WK-TBL-ID(CNS-7)"]"                                 20090508
      *    DISPLAY  CNS-PGM-ID":ワークDB更新情報.対象処理(7)=["         20090508
      *             WK-TBL-SYORI-NAME(CNS-7)"]"                         20090508
      *    DISPLAY  CNS-PGM-ID":ワークDB更新情報.処理件数(7)=["         20090508
      *             WK-TBL-SYORI-COUNT(CNS-7)"]"                        20090508
      *    DISPLAY  CNS-PGM-ID":***  DB更新情報編集処理  END  ***"      20090508
      *-----------------------------------------------------------------20090508
           CONTINUE.
       DB-DATA-EXT.
           EXIT.
      ******************************************************************
      *    3.3 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-RTNPKG
      *----------   テーブル名（1）
           MOVE  WK-TBL-ID(CNS-1)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-1)
      *----------   テーブル処理名（1）
           MOVE  WK-TBL-SYORI-NAME(CNS-1)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-1)
      *----------   テーブル処理件数（1）
           MOVE  WK-TBL-SYORI-COUNT(CNS-1)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-1)
      *----------   テーブル名（2）
           MOVE  WK-TBL-ID(CNS-2)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-2)
      *----------   テーブル処理名（2）
           MOVE  WK-TBL-SYORI-NAME(CNS-2)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-2)
      *----------   テーブル処理件数（2）
           MOVE  WK-TBL-SYORI-COUNT(CNS-2)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-2)
      *----------   テーブル名（3）
           MOVE  WK-TBL-ID(CNS-3)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-3)
      *----------   テーブル処理名（3）
           MOVE  WK-TBL-SYORI-NAME(CNS-3)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-3)
      *----------   テーブル処理件数（3）
           MOVE  WK-TBL-SYORI-COUNT(CNS-3)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-3)
      *----------   テーブル名（4）
           MOVE  WK-TBL-ID(CNS-4)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-4)
      *----------   テーブル処理名（4）
           MOVE  WK-TBL-SYORI-NAME(CNS-4)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-4)
      *----------   テーブル処理件数（4）
           MOVE  WK-TBL-SYORI-COUNT(CNS-4)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-4)
      *----------   テーブル名（5）
           MOVE  WK-TBL-ID(CNS-5)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-5)
      *----------   テーブル処理名（5）
           MOVE  WK-TBL-SYORI-NAME(CNS-5)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-5)
      *----------   テーブル処理件数（5）
           MOVE  WK-TBL-SYORI-COUNT(CNS-5)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-5)
      *----------   テーブル名（6）
           MOVE  WK-TBL-ID(CNS-6)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-6)
      *----------   テーブル処理名（6）
           MOVE  WK-TBL-SYORI-NAME(CNS-6)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-6)
      *----------   テーブル処理件数（6）
           MOVE  WK-TBL-SYORI-COUNT(CNS-6)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-6)
      *----------   テーブル名（7）
           MOVE  WK-TBL-ID(CNS-7)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-7)
      *----------   テーブル処理名（7）
           MOVE  WK-TBL-SYORI-NAME(CNS-7)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-7)
      *----------   テーブル処理件数（7）
           MOVE  WK-TBL-SYORI-COUNT(CNS-7)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-7)
      *----------   テーブル名（8）                                     20090508
           MOVE  WK-TBL-ID(CNS-8)                                       20090508
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-8)   20090508
      *----------   テーブル処理名（8）                                 20090508
           MOVE  WK-TBL-SYORI-NAME(CNS-8)                               20090508
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-8)   20090508
      *----------   テーブル処理件数（8）                               20090508
           MOVE  WK-TBL-SYORI-COUNT(CNS-8)                              20090508
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-8)   20090508
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブル名（1）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（1）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（1）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（2）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（2）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（2）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（3）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（3）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（3）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（4）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（4）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（4）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（5）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（5）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（5）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（6）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（6）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（6）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（7）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（7）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（7）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（8）=["                      20090508
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-8)"]"20090508
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（8）=["                  20090508
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-8)"]"20090508
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（8）=["                20090508
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-8)"]"20090508
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMHJ1110-ARG2=["
      D                                            PARM-SMHJ1110-ARG2"]"
      *-----------------------------------------------------------------
            IF WK-RTN-CD NOT = SPACE
            THEN
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-016
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  WK-RTN-CD
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  CNS-0
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.5 業務エラー処理
             PERFORM  ERR1-RTN
            ELSE
             CONTINUE
            END-IF
      *----------  3.3.1 リターンパッケージセットルーチンをコールする
      *----------  リターンコード
           MOVE  CNS-RTN-000
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF PARM-SCZY1170-ARG1 =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1170)       =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           MOVE  PARM-RTNPKG-ARG        OF PARM-RTNPKG
             TO  PARM-SMHJ1110-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":PARM-SMHJ1110-ARG3=["PARM-SMHJ1110-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":***   後処理  END  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":***************  SMHJ1110  END  ***************"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           GOBACK.
      ******************************************************************
      *    3.4 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      *-----------------------------------------------------------------
      *----------   テーブル名（1）
           MOVE  WK-TBL-ID(CNS-1)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-1)
      *----------   テーブル処理名（1）
           MOVE  WK-TBL-SYORI-NAME(CNS-1)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-1)
      *----------   テーブル処理件数（1）
           MOVE  WK-TBL-SYORI-COUNT(CNS-1)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-1)
      *----------   テーブル名（2）
           MOVE  WK-TBL-ID(CNS-2)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-2)
      *----------   テーブル処理名（2）
           MOVE  WK-TBL-SYORI-NAME(CNS-2)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-2)
      *----------   テーブル処理件数（2）
           MOVE  WK-TBL-SYORI-COUNT(CNS-2)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-2)
      *----------   テーブル名（3）
           MOVE  WK-TBL-ID(CNS-3)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-3)
      *----------   テーブル処理名（3）
           MOVE  WK-TBL-SYORI-NAME(CNS-3)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-3)
      *----------   テーブル処理件数（3）
           MOVE  WK-TBL-SYORI-COUNT(CNS-3)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-3)
      *----------   テーブル名（4）
           MOVE  WK-TBL-ID(CNS-4)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-4)
      *----------   テーブル処理名（4）
           MOVE  WK-TBL-SYORI-NAME(CNS-4)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-4)
      *----------   テーブル処理件数（4）
           MOVE  WK-TBL-SYORI-COUNT(CNS-4)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-4)
      *----------   テーブル名（5）
           MOVE  WK-TBL-ID(CNS-5)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-5)
      *----------   テーブル処理名（5）
           MOVE  WK-TBL-SYORI-NAME(CNS-5)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-5)
      *----------   テーブル処理件数（5）
           MOVE  WK-TBL-SYORI-COUNT(CNS-5)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-5)
      *----------   テーブル名（6）
           MOVE  WK-TBL-ID(CNS-6)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-6)
      *----------   テーブル処理名（6）
           MOVE  WK-TBL-SYORI-NAME(CNS-6)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-6)
      *----------   テーブル処理件数（6）
           MOVE  WK-TBL-SYORI-COUNT(CNS-6)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-6)
      *----------   テーブル名（7）
           MOVE  WK-TBL-ID(CNS-7)
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-7)
      *----------   テーブル処理名（7）
           MOVE  WK-TBL-SYORI-NAME(CNS-7)
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-7)
      *----------   テーブル処理件数（7）
           MOVE  WK-TBL-SYORI-COUNT(CNS-7)
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-7)
      *----------   テーブル名（8）                                     20090508
           MOVE  WK-TBL-ID(CNS-8)                                       20090508
             TO  TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-8)   20090508
      *----------   テーブル処理名（8）                                 20090508
           MOVE  WK-TBL-SYORI-NAME(CNS-8)                               20090508
             TO  TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-8)   20090508
      *----------   テーブル処理件数（8）                               20090508
           MOVE  WK-TBL-SYORI-COUNT(CNS-8)                              20090508
             TO  TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-8)   20090508
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブル名（1）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（1）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（1）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（2）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（2）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（2）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（3）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（3）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（3）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（4）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（4）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（4）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（5）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（5）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（5）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（6）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（6）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（6）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（7）=["
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（7）=["
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（7）=["
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":テーブル名（8）=["                      20090508
      D          TBL-ID                 OF  PARM-SMHJ1110-ARG2(CNS-8)"]"20090508
      D    DISPLAY  CNS-PGM-ID":テーブル処理名（8）=["                  20090508
      D          TBL-SYORI-NAME         OF  PARM-SMHJ1110-ARG2(CNS-8)"]"20090508
      D    DISPLAY  CNS-PGM-ID":テーブル処理件数（8）=["                20090508
      D          TBL-SYORI-COUNT        OF  PARM-SMHJ1110-ARG2(CNS-8)"]"20090508
      D    DISPLAY  CNS-PGM-ID":PARM-SMHJ1110-ARG2=["
      D                                            PARM-SMHJ1110-ARG2"]"
      *-----------------------------------------------------------------
      *--------  3.4.1 リターンパッケージの設定
           PERFORM   SCZY1170-RTN
      *----------3.4.2 進捗管理カーソルをクローズ
           PERFORM   ERR-CLOSE-RTN
      *--------  3.4.3 ROLLBACKする
           PERFORM   ERR-ROLLBACK-RTN
      *--------  3.4.4 ステータス変更処理3
           PERFORM   SCZY7210-3-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":***************  SMHJ1110  END  ***************"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
      ******************************************************************
      *    3.4.1 リターンパッケージの設定
      ******************************************************************
       SCZY1170-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  リターンパッケージの設定 START  ***"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER            OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           MOVE  PARM-RTNPKG-ARG        OF PARM-RTNPKG
             TO  PARM-SMHJ1110-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  リターンパッケージの設定 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1170-EXT.
           EXIT.
      ******************************************************************
      *    3.4.2 進捗管理カーソルをクローズ
      ******************************************************************
       ERR-CLOSE-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  進捗管理カーソルをクローズ START  ***"
      D    DISPLAY  CNS-PGM-ID ":FLG-CURSOR1-OPEN= ["
      D             FLG-CURSOR1-OPEN "]"
      *-----------------------------------------------------------------
           IF  FLG-CURSOR1-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CR1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CLOSE SQLCODE =[" SQLCODE "]"
      *-------------------<DEBUG>---------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-OFF              TO  FLG-CURSOR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID ":FLG-CURSOR1-OPEN= [" FLG-CURSOR1-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-017
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W
                    "][:V2="
                    H-FUND-CD-D-W
                    "][:V3="
                    H-PTF-CD-D-W
                    "][:V4="
                    H-HYK-KRTU-CD-D-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": *** 進捗管理カーソルをクローズ 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER            OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  進捗管理カーソルをクローズ END  ***"
      *-----------------------------------------------------------------
      *------------  テーマ3262 20120316  START  -----------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高進捗カーソルをクローズ START  ***"
      D    DISPLAY  CNS-PGM-ID ":FLG-CURSOR2-OPEN= ["
      D             FLG-CURSOR2-OPEN "]"
      *-----------------------------------------------------------------
           IF  FLG-CURSOR2-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CR2
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CLOSE SQLCODE =[" SQLCODE "]"
      *-------------------<DEBUG>---------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-OFF              TO  FLG-CURSOR2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID ":FLG-CURSOR2-OPEN= [" FLG-CURSOR2-OPEN"]"
      *-------------------<DEBUG>---------------------------------------
             ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-028
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING SQLSTMT(CNS-1:FUNCTION  LENGTH(WK-SQL-SELECT-2))
                    "[:V1="
                    H-RIYO-CMP-CD-D-W-2
                    "][:V2="
                    H-FUND-CD-D-W-2
                    "][:V3="
                    H-PTF-CD-D-W-2
                    "][:V5="
                    H-KJN-YMD-MIN-W
                    "][:V4="
                    H-KJN-YMD-MAX-W
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": *** 残高進捗カーソルをクローズ 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER            OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
             CONTINUE
           END-IF                                                       
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高進捗カーソルをクローズ END  ***"
      *-----------------------------------------------------------------
      *------------  テーマ3262 20120316  END  -------------------------
           CONTINUE.
       ERR-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    3.4.2  ROLLBACKする
      ******************************************************************
       ERR-ROLLBACK-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢロールバック処理 START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             ROLLBACK
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ROLLBACK SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ＤＢロールバック処理 正常! ***"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-018
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *** ＤＢロールバック処理 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  START  ***"
      *-----------------------------------------------------------------
             CALL   "SCZY1170"         USING  PARM-SCZY1170-IN
                                              PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER            OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG-ARG      OF PARM-RTNPKG
               TO  PARM-SMHJ1110-ARG3
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢロールバック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-ROLLBACK-EXT.
           EXIT.
      ******************************************************************
      *     3.4.3 ステータス変更処理3
      ******************************************************************
       SCZY7210-3-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ステータス変更処理3  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7210-INOUT
                       WK-PARM-RTNPKG
      *----------  セッション区分
           MOVE  CNS-X-1
             TO  SESSION-KBN            OF  PARM-SCZY7210-ARG1
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD            OF  PARM-SMHJ1110-ARG1
             TO  RIYO-CMP-CD            OF  PARM-SCZY7210-ARG2
      *----------  処理実行日
           MOVE  SYORI-YMD              OF  PARM-SMHJ1110-ARG1
             TO  SYORI-YMD              OF  PARM-SCZY7210-ARG2
      *----------  起動ID
           MOVE  KIDOU-ID               OF  PARM-SMHJ1110-ARG1
             TO  KIDOU-ID               OF  PARM-SCZY7210-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  FUND-CD                OF  PARM-SCZY7210-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  PTF-CD                 OF  PARM-SCZY7210-ARG2
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD
             TO  HYK-KRTU-CD            OF  PARM-SCZY7210-ARG2
      *----------  帳票ID
           MOVE  SPACE
             TO  REP-ID                 OF  PARM-SCZY7210-ARG2
      *----------  帳票任意コード
           MOVE  SPACE
             TO  REP-ANY-CD             OF  PARM-SCZY7210-ARG2
      *----------  基準日FROM
           MOVE  WK-KJN-YMD-FROM
             TO  KJN-YMD-FROM           OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス  '400'(システムエラー)
           MOVE  CNS-MSG-400
             TO  JIKOU-STS              OF  PARM-SCZY7210-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":セッション区分=["
      D            SESSION-KBN          OF  PARM-SCZY7210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":実行ステータス=["
      D             JIKOU-STS           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7210  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY7210"            USING  PARM-SCZY7210-INOUT
                                               WK-PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7210   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY7210)  =["
      D             WK-PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF WK-PARM-RTNPK=["
      D             COUNTER             OF WK-PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF WK-PARM-RTNPKG(COUNTER OF WK-PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ＤＢコミット処理
             EXEC SQL
                 COMMIT
             END-EXEC
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ＤＢコミット処理 正常! ***"
      *-----------------------------------------------------------------
                 CONTINUE
             ELSE
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID       OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-019
                   TO  ERR-POS          OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG
                                        OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 STRING "ＤＢコミット処理 エラー"
                      DELIMITED BY SIZE
                      INTO FREE-MSG     OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *** ＤＢコミット処理 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER            OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
               MOVE  PARM-RTNPKG-ARG    OF PARM-RTNPKG
                 TO  PARM-SMHJ1110-ARG3
             END-IF
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-020
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
              STRING "ステータス変更処理3 エラー:"
                      "セッション区分 =["
                      SESSION-KBN       OF  PARM-SCZY7210-ARG1
                      "]利用会社コード =["
                      RIYO-CMP-CD       OF  PARM-SCZY7210-ARG2
                      "]処理実行日 =["
                      SYORI-YMD         OF  PARM-SCZY7210-ARG2
                      "]起動ID =["
                      KIDOU-ID          OF  PARM-SCZY7210-ARG2
                      "]ファンドコード =["
                      FUND-CD           OF  PARM-SCZY7210-ARG2
                      "]ポートフォリオコード =["
                      PTF-CD            OF  PARM-SCZY7210-ARG2
                      "]評価系列コード =["
                      HYK-KRTU-CD       OF  PARM-SCZY7210-ARG2
                      "]実行ステータス =["
                      JIKOU-STS         OF  PARM-SCZY7210-ARG2
                      "]"
                      DELIMITED BY SIZE
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  ステータス変更処理3 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             MOVE  WK-PARM-RTNPKG       TO  PARM-RTNPKG
      *--------  3.4.4 リターンパッケージの設定
             PERFORM   SCZY1170-2-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ステータス変更処理3  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7210-3-EXT.
           EXIT.
      ******************************************************************
      *    3.4.4 リターンパッケージの設定
      ******************************************************************
       SCZY1170-2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  リターンパッケージの設定 START  ***"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170   END   ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-------------------<DEBUG>---------------------------------------
           MOVE  PARM-RTNPKG-ARG        OF PARM-RTNPKG
             TO  PARM-SMHJ1110-ARG3
      *-----------------------------------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  リターンパッケージの設定 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1170-2-EXT.
           EXIT.
      ******************************************************************
      *    3.5 業務エラー処理
      ******************************************************************
       ERR1-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  業務エラー処理  START  ***"
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1170  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1170)       =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170)  =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           MOVE  PARM-RTNPKG-ARG        OF PARM-RTNPKG
             TO  PARM-SMHJ1110-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SMHJ1110-ARG2=["
      D                                            PARM-SMHJ1110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":PARM-SMHJ1110-ARG3=["PARM-SMHJ1110-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":***   業務エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":***************  SMHJ1110  END  ***************"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR1-EXT.
           GOBACK.
