      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * ＩＤ           : MMHJ0010
      * 名称           : 評価計算メイン
      * 処理概要       : 引数により、関連ポートフォリオ断面
      *                  の評価計算処理を行う。
      * 参照ＤＢ       : なし
      * 更新ＤＢ       : なし
      * 引数           : IN  利用会社コード
      *                  IN  処理実行日
      *                  IN  業務タスクID
      *                  IN  起動ＩＤ
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20080616   新規  SCS        韓明明  新規作成
      *     20080707   修正  SCS        韓明明  ソース修正
      *     20080820   修正  SCS        高  偉  修正
      *     20081030   修正  SCS        寇長江  仕様統一14,17,20番
      *     20081104   修正  SCS        寇長江 【MH】連結障害対応352,399
      *     20081210   修正  SCS        朱  軍  連結障害対応774
      *     20081224   修正  SCS        金  晶  残タスク一覧109
      *     20090117   修正  SCS        金  晶  連結障害対応1126
      *     20090218   修正  SCS        王美娟  【MH】残タスク一覧92
      *     20090508   修正  SCS        王美娟  連結障害1732
      *     20090818   修正  SCS        寇長江  テーマ1308：総合障害1095
      *     20091215   修正  SCS        陳佳    テーマ2021：総合障害3396
      *     20100113   修正  SCS        朱  軍  テーマ2454：総合障害3879
      *     20100223   修正  SCS        王  蕾  性能改善
      *     20100223   修正  SCS        王  蕾  PH2対応（ＧＩＰＳモード起動処理追加）
      *     20100318   修正  SCS        HECHENG 業務支援連結障害
      *                                 SCZY1130の引数「メニューID」の設定値を初期値にする。
      *     20100318   修正  SCS        兪ル    連結障害2183
      *     20100326   修正  SCS        HECHENG 業務支援連結障害002228
      *     20100326   修正  SCS        HECHENG 連結障害0002213対応
      *     20100510   修正  SCS        常　峰  綜合障害0004211対応
      *     20100517   修正  SCS        常　峰  総合障害0004196対応
      *     20100520   修正  SCS        張喬    テーマ2797
      *     20100716   修正  SCS        朱  軍  テーマ2818
      *     20100722   修正  SCS        朱  軍  テーマ2915
      *     20101020   修正  SCS        顧孜駿  テーマ3068
      *     20110418   修正  SCS        常　峰  テーマ3212-2
      *     20111208   修正  SCS        王美娟  テーマ3262
      *     20130708   修正  SCS        馬旭君  テーマ3545-1対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    MMHJ0010.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-06-16.
       DATE-COMPILED.
      ******************************************************************
      *
      *        環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V  WITH  DEBUGGING  MODE.
       OBJECT-COMPUTER.       RP5470.
       SPECIAL-NAMES.
       ENVIRONMENT-NAME       ENV-NAME
       ENVIRONMENT-VALUE      ENV-VALUE.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *        デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
      *----------  共通コンスタント定義の宣言
       01  CONSTANT-AREA.
         05  CNS-MHCNS.
           COPY "MHCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "MMHJ0010".
      *----------  リターンコードの値(メーン)
      *----------  プログラム終了ステータスの値
         05  CNS-BTH-NORMAL        PIC  9(01)  VALUE  0.
      *----------  ＳＱＬリターンコード
      *----------  その他
         05  CNS-X-002             PIC  X(03)  VALUE  "002".            20090117
         05  CNS-X-004             PIC  X(03)  VALUE  "004".            20090117
         05  CNS-X-00000000        PIC  X(08)  VALUE  "00000000".
         05  CNS-X-00010101        PIC  X(08)  VALUE  "00010101".
         05  CNS-267               PIC  9(03)  VALUE  267.
         05  CNS-MAX-50000         PIC  9(05)  VALUE  50000.
         05  CNS-X-W000309         PIC  X(07)  VALUE  "W000309".
         05  CNS-X-E000534         PIC  X(07)  VALUE  "E000534".
         05  CNS-X-07              PIC  X(02)  VALUE  "07".
      *----------  権限チェック有無
         05  CNS-KGN-CHK-UMU       PIC  X(01)  VALUE  "1".
      *----------  日中夜間区分
         05  CNS-NCHU-YAKN-KBN     PIC  X(01)  VALUE  "1".
      *----------  画面アクション区分
         05  CNS-GAMEN-ACT-KBN-9   PIC  X(01)  VALUE  "9".
      *----------  業務タスクID
         05  CNS-T4220MH           PIC  X(07)  VALUE  "T4220MH".
      *----------  進捗管理テーブル
         05  CNS-TKDYAA40          PIC  X(08)  VALUE  "TKDYAA40".
      *----------  評価計算入力テーブル
         05  CNS-TKMHHI00          PIC  X(08)  VALUE  "TKMHHI00".
      *----------  評価履歴テーブル
         05  CNS-TKMHHR00          PIC  X(08)  VALUE  "TKMHHR00".
      *----------  勘定残高テーブル
         05  CNS-TKMZKZ00          PIC  X(08)  VALUE  "TKMZKZ00".
      *----------  実行状況管理明細                                     20090218
         05  CNS-TKDYAA35          PIC  X(08)  VALUE  "TKDYAA35".       20090218
      *----------  再処理要ポートフォリオ一覧（時価）
         05  CNS-TKDYGP09          PIC  X(08)  VALUE  "TKDYGP09".
      *----------  再処理要ポートフォリオ一覧（為替）
         05  CNS-TKDYGP10          PIC  X(08)  VALUE  "TKDYGP10".
      *----------  再処理要ポートフォリオ一覧（取引）
         05  CNS-TKDYGP12          PIC  X(08)  VALUE  "TKDYGP12".
      *----------  再処理要ポートフォリオ一覧（補正）
         05  CNS-TKDYGP13          PIC  X(08)  VALUE  "TKDYGP13".
      *----------  再処理要ポートフォリオ一覧（銘柄属性）
         05  CNS-TKDYGP16          PIC  X(08)  VALUE  "TKDYGP16".
      *----------  再処理要制御テーブル
         05  CNS-TKDYGP17          PIC  X(08)  VALUE  "TKDYGP17".
      *----------   サブRTN戻り値
         05  CNS-RTN-008           PIC  X(03)  VALUE  "008".
      *----------   サブRTN戻り値
         05  CNS-RTN-010           PIC  X(03)  VALUE  "010".
      ******************************************************************
      *                   ワーク  エリア
      ******************************************************************
       01  WORK-AREA.
      *----------  ワークメッセージID                                   20081030
         05  WK-MSG-ID             PIC  X(07).                          20081030
      *----------  ワークメッセージID2                                  20081224
         05  WK-MSG-ID-2           PIC  X(07).                          20081224
      *---------- 置換文字                                              20081030
         05  WK-TIKAN-MOJI.                                             20081030
           10  WK-TK-MOJI          OCCURS  5                            20081030
                                   PIC  X(30).                          20081030
      *----------  ワーク利用会社コード
         05  WK-RIYO-CMP-CD        PIC  X(04).
      *----------  ワーク処理実行日
         05  WK-SYORI-YMD          PIC  X(08).
      *----------  ワーク起動ID
         05  WK-KIDOU-ID           PIC  X(04).
      *----------  ワーク業務タスクID
         05  WK-GYOMU-TASK-ID-IN   PIC  X(07).
      *----------  ＧＩＰＳモード
         05  WK-GIPS-MODE          PIC  X(01).
      *----------  ワーク進捗管理テーブル
         05  WK-TAB-TKDYAA40       PIC  X(13).
      *----------  ワーク評価計算入力テーブル
         05  WK-TAB-TKMHHI00       PIC  X(13).
      *----------  ワーク評価履歴テーブル
         05  WK-TAB-TKMHHR00       PIC  X(13).
      *----------  ワーク勘定残高テーブル
         05  WK-TAB-TKMZKZ00       PIC  X(13).
      *----------  ワーク実行状況管理明細テーブル                       20090218
         05  WK-TAB-TKDYAA35       PIC  X(13).                          20090218
      *----------  再処理要ポートフォリオ一覧（時価）テーブル
         05  WK-TAB-TKDYGP09       PIC  X(13).
      *----------  再処理要ポートフォリオ一覧（為替）テーブル
         05  WK-TAB-TKDYGP10       PIC  X(13).
      *----------  再処理要ポートフォリオ一覧（取引）テーブル
         05  WK-TAB-TKDYGP12       PIC  X(13).
      *----------  再処理要ポートフォリオ一覧（補正）テーブル
         05  WK-TAB-TKDYGP13       PIC  X(13).
      *----------  再処理要ポートフォリオ一覧（銘柄属性）テーブル
         05  WK-TAB-TKDYGP16       PIC  X(13).
      *----------  再処理要制御テーブル
         05  WK-TAB-TKDYGP17       PIC  X(13).
      *----------  ワークDB接続情報
         05  WK-DB-SETUZOKU-JYOUHOU
                                   PIC  X(80).
      *----------  ワークリターンコード比較値
         05  WK-RTN-CD-COM         PIC  9(03).
      *----------  SMHJ1110のRTN-CD
         05  WK-RTN-CD             PIC  9(03).
      *----------  ワーク引継リターンコード                             20090117
         05  WK-SUCCE-R-CD         PIC  X(03).                          20090117
      *----------  ワーク基準日FROM指定フラグ
         05  WK-KJN-YMD-FROM-FLG   PIC  X(01).
      *----------  ワーク銘柄指定ありフラグ
         05  WK-MEG-FLG            PIC  X(01).
      *----------  ワーク銘柄指定件数
         05  WK-MEG-SITEI-KENSU    PIC  9(02).
      *----------  SCZY4033 返却データ
         05  WK-PTF-ATT-DATA    OCCURS  50000.                          20081224
      *----------  ファンドコード
           10  WK-FUND-CD-GP       PIC  X(12).
      *----------  ポートフォリオコード
           10  WK-PTF-CD-GP        PIC  X(04).
      *----------  デフォルト評価系列コード
           10  WK-DEFAUL-THYK-CD-GP
                                   PIC  X(04).
      *----------有效適用開始日FROM
           10  WK-EXPR-YMD-FROM-GP PIC  S9(08).
      *----------有效適用開始日To
           10  WK-EXPR-YMD-TO-GP   PIC  S9(08).
      *----------  処理対象実行状況管理明細ＧＥＴルーチン
         05  WK-SCZY7200-ARG2.
      *----------  取得件数
           10  WK-GET-KENSU        PIC  9(05).
      *----------  ポートフォリオ単位
           10  WK-JIKO-DATA  OCCURS  50000.
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  基準日From
             15  WK-KJN-YMD-FROM   PIC  S9(08).
      *----------  基準日To
             15  WK-KJN-YMD-TO     PIC  S9(08).
      *----------  評価系列コード
             15  WK-HYK-KRTU-CD    PIC  X(04).
      *----------  業務タスクID
             15  WK-GYOMU-TASK-ID  PIC  X(07).
      *----------  DB更新情報
         05  WK-DB-MSG-GRP.
      *----------  テーブル・ファイル情報
           10  WK-DB-MSG   OCCURS  8.                                   20090508
      *----------  テーブル名
             15  WK-TBL-ID         PIC  X(256).
      *----------  テーブル処理名
             15  WK-TBL-SYORI-NAME PIC  X(06).
      *----------  テーブル処理件数
             15  WK-TBL-SYORI-COUNT
                                   PIC  9(18).
      *----------  評価履歴TBLに削除件数                                @3212SEINO@@
         05  WK-TKMHHR00-COUNT     PIC  9(18).                          @3212SEINO@@
      *----------  プログラム終了ステータス
         05  WK-PGM-END-STS        PIC  9(03).
      *----------  ワーク評価系列データエリア
         05  WK-TKPFPT02-AREA.
      *----------  評価系列データ配列
           10  WK-TKPFPT02-GRR     OCCURS  101.
      *----------  評価系列コード
             15  WK-HYK-KRTU-CD    PIC  X(04).
      *----------  評価時価取得方法コード
             15  WK-HYK-CP-SHTK-PTN-CD
                                   PIC  X(04).
      *----------  評価為替取得方法コード
             15  WK-HYK-EX-SHTK-PTN-CD
                                   PIC  X(04).
      *----------  評価計算パターンコード
             15  WK-HYK-CALC-PTN-CD
                                   PIC  X(04).
      *----------  評価系列名称
             15  WK-HYK-KRTU-NAME  PIC  X(60).
      *----------  有効件数
           10  WK-YUUKOU-KENSUU    PIC  9(04).
      *----------  ワーク評価計算パターンデータエリア
         05  WK-TKPFPT03-AREA.
      *----------  評価計算パターンデータ配列
           10  WK-TKPFPT03-GRR     OCCURS  10001.
      *----------  評価計算パターンコード
             15  WK-HYK-CALC-PTN-CD
                                   PIC  X(04).
      *----------  市場通貨コード
             15  WK-SIJO-TUKA-CD   PIC  X(04).
      *----------  証券種別コード
             15  WK-SEC-SBT-CD     PIC  X(04).
      *----------  保有目的
             15  WK-POSSESSION-OBJECT
                                   PIC  X(01).
      *----------  計算区分コード
             15  WK-COMPUTE-KBN-CODE
                                   PIC  X(06).
      *----------  端数処理方法（市場通貨）
             15  WK-KETASU-BC      PIC  X(01).
      *----------  端数処理桁数（市場通貨）
             15  WK-HASU-BC        PIC  9(02).
      *----------  端数処理方法（運用通貨）
             15  WK-KETASU-LC      PIC  X(01).
      *----------  端数処理桁数（運用通貨）
             15  WK-HASU-LC        PIC  9(02).
      *----------  有効件数
           10  WK-YUUKOU-KENSUU    PIC  9(05).
      *----------  ワーク評価時価取得方法パターンデータエリア
         05  WK-TKPFPT04-AREA.
      *----------  評価時価取得方法パターンデータ配列
           10  WK-TKPFPT04-GRR     OCCURS  101.
      *----------  評価時価取得方法コード
             15  WK-HYK-CP-SHTK-PTN-CD
                                   PIC  X(04).
      *----------  銘柄通貨コード
             15  WK-MEG-TUKA-CD    PIC  X(04).
      *----------  証券種別コード
             15  WK-SEC-SBT-CD     PIC  X(04).
      *----------  銘柄コード
             15  WK-MEG-CD         PIC  X(15).
      *----------  優先順位１時価系列
             15  WK-PRIO-1-CP-KRTU PIC  X(04).
      *----------  優先順位２時価系列
             15  WK-PRIO-2-CP-KRTU PIC  X(04).
      *----------  優先順位３時価系列
             15  WK-PRIO-3-CP-KRTU PIC  X(04).
      *----------  優先順位４時価系列
             15  WK-PRIO-4-CP-KRTU PIC  X(04).
      *----------  優先順位５時価系列
             15  WK-PRIO-5-CP-KRTU PIC  X(04).
      *----------  優先順位６時価系列
             15  WK-PRIO-6-CP-KRTU PIC  X(04).
      *----------  優先順位７時価系列
             15  WK-PRIO-7-CP-KRTU PIC  X(04).
      *----------  優先順位８時価系列
             15  WK-PRIO-8-CP-KRTU PIC  X(04).
      *----------  優先順位９時価系列
             15  WK-PRIO-9-CP-KRTU PIC  X(04).
      *----------  遡り方法
             15  WK-SOKYU-HOU      PIC  X(01).
      *----------  最大遡り日数
             15  WK-MAX-SOKYU-NISU PIC  S9(08).
      *----------  有効件数
           10  WK-YUUKOU-KENSUU    PIC  9(04).
      *----------  ワーク評価為替取得方法パターンデータエリア
         05  WK-TKPFPT05-AREA.
      *----------  評価為替取得方法パターンデータ配列
           10  WK-TKPFPT05-GRR     OCCURS  101.
      *----------  評価為替取得方法コード
             15  WK-HYK-EX-SHTK-PTN-CD
                                   PIC  X(04).
      *----------  市場通貨コード
             15  WK-SIJO-TUKA-CD   PIC  X(04).
      *----------  優先順位１為替系列
             15  WK-PRIO-1-EX-KRTU PIC  X(04).
      *----------  優先順位２為替系列
             15  WK-PRIO-2-EX-KRTU PIC  X(04).
      *----------  優先順位３為替系列
             15  WK-PRIO-3-EX-KRTU PIC  X(04).
      *----------  優先順位４為替系列
             15  WK-PRIO-4-EX-KRTU PIC  X(04).
      *----------  優先順位５為替系列
             15  WK-PRIO-5-EX-KRTU PIC  X(04).
      *----------  優先順位６為替系列
             15  WK-PRIO-6-EX-KRTU PIC  X(04).
      *----------  優先順位７為替系列
             15  WK-PRIO-7-EX-KRTU PIC  X(04).
      *----------  優先順位８為替系列
             15  WK-PRIO-8-EX-KRTU PIC  X(04).
      *----------  優先順位９為替系列
             15  WK-PRIO-9-EX-KRTU PIC  X(04).
      *----------  遡り方法
             15  WK-SOKYU-HOU      PIC  X(01).
      *----------  最大遡り日数
             15  WK-MAX-SOKYU-NISU PIC  S9(08).
      *----------  有効件数
           10  WK-YUUKOU-KENSUU    PIC  9(04).
      *----------  ワーク料率データエリア
         05  WK-TKCMRY00-AREA.
      *----------  料率データ配列
           10  WK-TKCMRY00-GRR     OCCURS  1001.
      *----------  料率パターンコード
             15 WK-COMMISSION-PATTERN
                                   PIC  X(04).
      *----------  料率区分
             15 WK-RYORITU-KBN     PIC  X(01).
      *----------  国コード
             15 WK-KUNI-CD         PIC  X(04).
      *----------  適用開始日
             15 WK-TEKIYO-FROM     PIC  S9(08).
      *----------  適用終了日
             15 WK-TEKIYO-TO       PIC  S9(08).
      *----------  証券種別コード
             15 WK-SEC-SBT-CD      PIC  X(04).
      *----------  基準値
             15 WK-KJN-TI          PIC  S9(15)V9(03).
      *----------  基準値TO
             15 WK-KJN-TI-TO       PIC  S9(15)V9(03).
      *----------  料率
             15 WK-RYORITU         PIC  S9(08)V9(10).
      *----------  有効件数
           10  WK-YUUKOU-KENSUU    PIC  9(04).
      *----------  ワーク通貨データエリア
         05  WK-TKCMTK00-AREA.
      *----------  通貨データ配列
           10  WK-TKCMTK00-GRR     OCCURS  501.
      *----------  通貨コード
             15 WK-TUKA-CD         PIC  X(04).
      *----------  通貨名称_全角（日）
             15 WK-TUKA-NAME-J-ZK  PIC  X(60).
      *----------  通貨名称_半角（日）
             15 WK-TUKA-NAME-J-HK  PIC  X(60).
      *----------  通貨名称（英）
             15 WK-TUKA-NAME-E     PIC  X(60).
      *----------  通貨名称_略称（日）
             15 WK-TUKA-AB-NAME-J  PIC  X(30).
      *----------  通貨名称_略称（英）
             15 WK-TUKA-AB-NAME-E  PIC  X(30).
      *----------  小数点以下桁数
             15 WK-SYOSU-TENYIKA-KETASU
                                   PIC  S9(01).
      *----------  端数処理
             15 WK-HASU-KBN        PIC  X(01).
      *----------  出力順
             15 WK-OUT-JUN         PIC  S9(04).
      *----------  有効件数
           10  WK-YUUKOU-KENSUU    PIC  9(04).
      *----------  ワーク為替換算情報データエリア
         05  WK-TKJCKK00-AREA.
      *----------  為替換算情報データ配列
           10  WK-TKJCKK00-GRR     OCCURS  10001.
      *----------  為替系列コード
             15  WK-KWS-KRTU-CD    PIC  X(04).
      *----------  ベース通貨コード
             15  WK-BASE-TUKA-CD   PIC  X(04).
      *----------  目的通貨コード
             15  WK-MOKUTEKI-TUKA-CD
                                   PIC  X(04).
      *----------  媒介通貨
             15  WK-BAYIKAYI-TUKA  PIC  X(04).
      *----------  乗算/除算区分
             15  WK-JZ-JS-KBN      PIC  X(01).
      *----------  有効件数
           10  WK-YUUKOU-KENSUU    PIC  9(05).
      *----------  WK-MAX-件数
         05  WK-MAX-KENSUU         PIC  9(09).
      *----------  ヒット件数
         05  WK-HIT-KENSUU         PIC  9(09).
         05  WK-DELETE-SQL.                                             20090218
      *****10  FILLER              PIC  X(12)  VALUE  "DELETE FROM ".   @3212SEINO@@ 20090218
      *****------  評価履歴TBL H                                        @3212SEINO@@ 20090218
      *****10  WK-TBL-TKMHHR00-H   PIC  X(13).                          @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(03)  VALUE  " H ".            @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(06)  VALUE  "WHERE ".         @3212SEINO@@ 20090218
      *****------  (                                                    @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  "( ".             @3212SEINO@@ 20090218
      *****------  H.利用会社コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(14)  VALUE  "H.RIYO_CMP_CD,". @3212SEINO@@ 20090218
      *****------  H.ファンドコード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(10)  VALUE  "H.FUND_CD,".     @3212SEINO@@ 20090218
      *****------  H.ポートフォリオコード                               @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(09)  VALUE  "H.PTF_CD,".      @3212SEINO@@ 20090218
      *****------  H.評価系列コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(14)  VALUE  "H.HYK_KRTU_CD,". @3212SEINO@@ 20090218
      *****------  H.証券種別コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(13)  VALUE  "H.SEC_SBT_CD,".  @3212SEINO@@ 20090218
      *****------  H.銘柄コード                                         @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(09)  VALUE  "H.MEG_CD,".      @3212SEINO@@ 20090218
      *****------  H.資産負債・買建売建フラグ                           @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(11)  VALUE  "H.TATE_FLG,".    @3212SEINO@@ 20090218
      *****------  H.玉ＩＤ                                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(11)  VALUE  "H.GYOKU_ID,".    @3212SEINO@@ 20090218
      *****------  H.基準日                                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(10)  VALUE  "H.KJN_YMD,".     @3212SEINO@@ 20090218
      *****------  H.決算日断面区分                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(18)                           @3212SEINO@@ 20090218
      *****                        VALUE  "H.KSN_YMD_DMN_KBN ".         @3212SEINO@@ 20090218
      *****------  ) IN                                                 @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(05)  VALUE  ") IN ".          @3212SEINO@@ 20090218
      *****------  ( 子SQL文１                                          @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  "( ".             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  "( ".             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(07)  VALUE  "SELECT ".        @3212SEINO@@ 20090218
      *****------  A.利用会社コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(14)  VALUE  "A.RIYO_CMP_CD,". @3212SEINO@@ 20090218
      *****------  A.ファンドコード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(10)  VALUE  "A.FUND_CD,".     @3212SEINO@@ 20090218
      *****------  A.ポートフォリオコード                               @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(09)  VALUE  "A.PTF_CD,".      @3212SEINO@@ 20090218
      *****------  A.評価系列コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(14)  VALUE  "A.HYK_KRTU_CD,". @3212SEINO@@ 20090218
      *****------  A.証券種別コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(13)  VALUE  "A.SEC_SBT_CD,".  @3212SEINO@@ 20090218
      *****------  A.銘柄コード                                         @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(09)  VALUE  "A.MEG_CD,".      @3212SEINO@@ 20090218
      *****------  A.資産負債・買建売建フラグ                           @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(11)  VALUE  "A.TATE_FLG,".    @3212SEINO@@ 20090218
      *****------  A.玉ＩＤ                                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(11)  VALUE  "A.GYOKU_ID,".    @3212SEINO@@ 20090218
      *****------  A.基準日                                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(10)  VALUE  "A.KJN_YMD,".     @3212SEINO@@ 20090218
      *****------  A.決算日断面区分                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(18)                           @3212SEINO@@ 20090218
      *****                        VALUE  "A.KSN_YMD_DMN_KBN ".         @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(05)  VALUE  "FROM ".          @3212SEINO@@ 20090218
      *****------  評価履歴TBL A                                        @3212SEINO@@ 20090218
      *****10  WK-TBL-TKMHHR00-A   PIC  X(13).                          @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(03)  VALUE  " A,".            @3212SEINO@@ 20090218
      *****------  (                                                    @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  "( ".             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(07)  VALUE  "SELECT ".        @3212SEINO@@ 20090218
      *****------  E.ファンドコード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(10)  VALUE  "E.FUND_CD,".     @3212SEINO@@ 20090218
      *****------  E.ポートフォリオコード                               @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(09)  VALUE  "E.PTF_CD,".      @3212SEINO@@ 20090218
      *****------  E.評価系列コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(14)  VALUE  "E.HYK_KRTU_CD ". @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(05)  VALUE  "FROM ".          @3212SEINO@@ 20090218
      *****------  実行状況管理明細TBL E                                @3212SEINO@@ 20090218
      *****10  WK-TBL-TKDYAA35-E   PIC  X(13).                          @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(03)  VALUE  " E ".            @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(06)  VALUE  "WHERE ".         @3212SEINO@@ 20090218
      *****------  E.利用会社コード = ワーク利用会社コード              @3212SEINO@@
      *****10  FILLER              PIC  X(20)                           @3212SEINO@@
      *****                        VALUE  "E.RIYO_CMP_CD = :V1 ".       @3212SEINO@@
      *****------  E.処理実行日 = ワーク処理実行日                      @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(22)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND E.SYORI_YMD = :V2 ".     @3212SEINO@@ 20090218
      *****------  E.起動ID = ワーク起動ID                              @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(21)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND E.KIDOU_ID = :V3 ".      @3212SEINO@@ 20090218
      *****------  E.帳票ID                                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(19)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND E.REP_ID = :V4 ".        @3212SEINO@@ 20090218
      *****------  E.帳票任意コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(23)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND E.REP_ANY_CD = :V5 ".    @3212SEINO@@ 20090218
      *****------  ) B                                                  @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(04)  VALUE  ") B,".           @3212SEINO@@ 20090218
      *****------  進捗管理TBL C                                        @3212SEINO@@ 20090218
      *****10  WK-TBL-TKDYAA40-C   PIC  X(13).                          @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(03)  VALUE  " C ".            @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(06)  VALUE  "WHERE ".         @3212SEINO@@ 20090218
      *****------  A.ファンドコード = C.ファンドコード                  @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(22)                           @3212SEINO@@ 20090218
      *****                        VALUE  "A.FUND_CD = C.FUND_CD ".     @3212SEINO@@ 20090218
      *****------  A.ポートフォリオコード = C.ポートフォリオコード      @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(24)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND A.PTF_CD = C.PTF_CD ".   @3212SEINO@@ 20090218
      *****------  A.評価系列コード = C.評価系列コード                  @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(34)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND A.HYK_KRTU_CD = C.HYK_KRTU_CD ".             @3212SEINO@@ 20090218
      *****------  A.基準日 = DECODE(SUBSTR(C.基準日,7,2),99,C.最終処理基準日,C.基準日) @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(45)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND A.KJN_YMD = DECODE(SUBSTR(C.KJN_YMD,7,2),".  @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(29)                           @3212SEINO@@ 20090218
      *****    VALUE  "99,C.SS_SYORI_YMD,C.KJN_YMD) ".                  @3212SEINO@@ 20090218
      *****------  A.基準日 >= SCZY7060より取得した上電文．基準日FROM   @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(21)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND A.KJN_YMD >= :V7 ".      @3212SEINO@@ 20090218
      *****------  A.基準日 <= SCZY7060より取得した上電文．基準日TO     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(21)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND A.KJN_YMD <= :V8 ".      @3212SEINO@@ 20090218
      *****------  C.進捗タスクID = 'ST00600' (評価)                    @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(33)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND C.SHINTK_TASK_ID = 'ST00600' ".              @3212SEINO@@ 20090218
      *****------  C.進捗ステータス <> '000' (確定済み)                 @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(26)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND C.SHINTK_STS <> '000' ".                     @3212SEINO@@ 20090218
      *****------  A.ファンドコード = B.ファンドコード(+)               @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(29)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND A.FUND_CD = B.FUND_CD(+) ".                  @3212SEINO@@ 20090218
      *****------  A.ポートフォリオコード = B.ポートフォリオコード(+)   @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(27)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND A.PTF_CD = B.PTF_CD(+) ".@3212SEINO@@ 20090218
      *****------  A.評価系列コード = B.評価系列コード(+)               @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(37)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND A.HYK_KRTU_CD = B.HYK_KRTU_CD(+) ".          @3212SEINO@@ 20090218
      *****------  B.評価系列コード IS NULL                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(26)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND B.HYK_KRTU_CD IS NULL ". @3212SEINO@@ 20090218
      *****------  )                                                    @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  ") ".             @3212SEINO@@ 20090218
      *****------  MINUS                                                @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(06)  VALUE  "MINUS ".         @3212SEINO@@ 20090218
      *****------  子SQL文２)                                           @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  "( ".             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(07)  VALUE  "SELECT ".        @3212SEINO@@ 20090218
      *****------  X.利用会社コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(14)  VALUE  "X.RIYO_CMP_CD,". @3212SEINO@@ 20090218
      *****------  X.ファンドコード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(10)  VALUE  "X.FUND_CD,".     @3212SEINO@@ 20090218
      *****------  X.ポートフォリオコード                               @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(09)  VALUE  "X.PTF_CD,".      @3212SEINO@@ 20090218
      *****------  X.評価系列コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(14)  VALUE  "X.HYK_KRTU_CD,". @3212SEINO@@ 20090218
      *****------  X.証券種別コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(13)  VALUE  "X.SEC_SBT_CD,".  @3212SEINO@@ 20090218
      *****------  X.銘柄コード                                         @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(09)  VALUE  "X.MEG_CD,".      @3212SEINO@@ 20090218
      *****------  X.資産負債・買建売建フラグ                           @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(11)  VALUE  "X.TATE_FLG,".    @3212SEINO@@ 20090218
      *****------  X.玉ＩＤ                                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(11)  VALUE  "X.GYOKU_ID,".    @3212SEINO@@ 20090218
      *****------  X.基準日                                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(10)  VALUE  "X.KJN_YMD,".     @3212SEINO@@ 20090218
      *****------  X.決算日断面区分                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(18)                           @3212SEINO@@ 20090218
      *****                        VALUE  "X.KSN_YMD_DMN_KBN ".         @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(05)  VALUE  "FROM ".          @3212SEINO@@ 20090218
      *****------  評価履歴TBL X                                        @3212SEINO@@ 20090218
      *****10  WK-TBL-TKMHHR00-X   PIC  X(13).                          @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(03)  VALUE  " X ".            @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(06)  VALUE  "WHERE ".         @3212SEINO@@ 20090218
      *****------  X.基準日 >= SCZY7060より取得した上電文．基準日FROM   @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(18)                           @3212SEINO@@ 20090218
      *****                        VALUE  "X.KJN_YMD >= :V11 ".         @3212SEINO@@ 20090218
      *****------  X.基準日 <= SCZY7060より取得した上電文．基準日TO     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(22)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND X.KJN_YMD <= :V12 ".     @3212SEINO@@ 20090218
      *****------  AND NOT EXISTS                                       @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(15)  VALUE  "AND NOT EXISTS ".@3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  "( ".             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(09)  VALUE  "SELECT 1 ".      @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(05)  VALUE  "FROM ".          @3212SEINO@@ 20090218
      *****------  実行状況管理明細TBL Y                                @3212SEINO@@ 20090218
      *****10  WK-TBL-TKDYAA35-Y   PIC  X(13).                          @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(03)  VALUE  " Y ".            @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(06)  VALUE  "WHERE ".         @3212SEINO@@ 20090218
      *****------  Y.利用会社コード = ワーク利用会社コード              @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(21)                           @3212SEINO@@ 20090218
      *****                        VALUE  "Y.RIYO_CMP_CD = :V13 ".      @3212SEINO@@ 20090218
      *****------  Y.処理実行日 = ワーク処理実行日                      @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(23)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND Y.SYORI_YMD = :V14 ".    @3212SEINO@@ 20090218
      *****------  Y.起動ID = ワーク起動ID                              @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(22)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND Y.KIDOU_ID = :V15 ".     @3212SEINO@@ 20090218
      *****------  Y.帳票ID                                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(20)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND Y.REP_ID = :V16 ".       @3212SEINO@@ 20090218
      *****------  Y.帳票任意コード                                     @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(24)                           @3212SEINO@@ 20090218
      *****                        VALUE  "AND Y.REP_ANY_CD = :V17 ".   @3212SEINO@@ 20090218
      *****------  X.基準日 >= Y.基準日FROM                             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(32)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND X.KJN_YMD >= Y.KJN_YMD_FROM ".               @3212SEINO@@ 20090218
      *****------  X.基準日 <= Y.基準日TO                               @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(30)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND X.KJN_YMD <= Y.KJN_YMD_TO ".                 @3212SEINO@@ 20090218
      *****------  X.ファンドコード = Y.ファンドコード                  @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(26)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND X.FUND_CD = Y.FUND_CD ".                     @3212SEINO@@ 20090218
      *****------  X.ポートフォリオコード = Y.ポートフォリオコード      @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(24)                           @3212SEINO@@ 20090218
      *****    VALUE  "AND X.PTF_CD = Y.PTF_CD ".                       @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  ") ".             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  ") ".             @3212SEINO@@ 20090218
      *****10  FILLER              PIC  X(02)  VALUE  ") ".             @3212SEINO@@ 20090218
           10  FILLER              PIC  X(06)  VALUE  "DELETE".         @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " FROM ".         @3212SEINO@@
           10  WK-TBL-TKMHHR00-H   PIC  X(13).                          @3212SEINO@@
           10  FILLER              PIC  X(02)  VALUE  " H".             @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " WHERE".         @3212SEINO@@
           10  FILLER              PIC  X(12)  VALUE " (H.FUND_CD,".    @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE "H.PTF_CD,".       @3212SEINO@@
           10  FILLER              PIC  X(14)  VALUE "H.HYK_KRTU_CD,".  @3212SEINO@@
           10  FILLER              PIC  X(13)  VALUE "H.SEC_SBT_CD,".   @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE "H.MEG_CD,".       @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE "H.TATE_FLG,".     @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE "H.GYOKU_ID,".     @3212SEINO@@
           10  FILLER              PIC  X(10)  VALUE "H.KJN_YMD,".      @3212SEINO@@
           10  FILLER              PIC  X(18)  VALUE                    @3212SEINO@@
               "H.KSN_YMD_DMN_KBN)".                                    @3212SEINO@@
           10  FILLER              PIC  X(03)  VALUE  " IN".            @3212SEINO@@
           10  FILLER              PIC  X(08)  VALUE  " (SELECT".       @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  " B.FUND_CD,".    @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "B.PTF_CD,".      @3212SEINO@@
           10  FILLER              PIC  X(14)  VALUE  "B.HYK_KRTU_CD,". @3212SEINO@@
           10  FILLER              PIC  X(13)  VALUE  "B.SEC_SBT_CD,".  @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "B.MEG_CD,".      @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  "B.TATE_FLG,".    @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  "B.GYOKU_ID,".    @3212SEINO@@
           10  FILLER              PIC  X(10)  VALUE  "B.KJN_YMD,".     @3212SEINO@@
           10  FILLER              PIC  X(17)  VALUE                    @3212SEINO@@
               "B.KSN_YMD_DMN_KBN".                                     @3212SEINO@@
           10  FILLER              PIC  X(05)  VALUE  " FROM".          @3212SEINO@@
           10  FILLER              PIC  X(08)  VALUE  " (SELECT".       @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  " A.FUND_CD,".    @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "A.PTF_CD,".      @3212SEINO@@
           10  FILLER              PIC  X(14)  VALUE  "A.HYK_KRTU_CD,". @3212SEINO@@
           10  FILLER              PIC  X(13)  VALUE  "A.SEC_SBT_CD,".  @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "A.MEG_CD,".      @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  "A.TATE_FLG,".    @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  "A.GYOKU_ID,".    @3212SEINO@@
           10  FILLER              PIC  X(10)  VALUE  "A.KJN_YMD,".     @3212SEINO@@
           10  FILLER              PIC  X(17)  VALUE                    @3212SEINO@@
               "A.KSN_YMD_DMN_KBN".                                     @3212SEINO@@
           10  FILLER              PIC  X(05)  VALUE  " FROM".          @3212SEINO@@
           10  FILLER              PIC  X(08)  VALUE  " (SELECT".       @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  " X.FUND_CD,".    @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "X.PTF_CD,".      @3212SEINO@@
           10  FILLER              PIC  X(14)  VALUE  "X.HYK_KRTU_CD,". @3212SEINO@@
           10  FILLER              PIC  X(13)  VALUE  "X.SEC_SBT_CD,".  @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "X.MEG_CD,".      @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  "X.TATE_FLG,".    @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  "X.GYOKU_ID,".    @3212SEINO@@
           10  FILLER              PIC  X(10)  VALUE  "X.KJN_YMD,".     @3212SEINO@@
           10  FILLER              PIC  X(17)  VALUE                    @3212SEINO@@
               "X.KSN_YMD_DMN_KBN".                                     @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " FROM ".         @3212SEINO@@
           10  WK-TBL-TKMHHR00-X   PIC  X(13).                          @3212SEINO@@
           10  FILLER              PIC  X(02)  VALUE  " X".             @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " WHERE".         @3212SEINO@@
           10  FILLER              PIC  X(12)  VALUE  " (X.FUND_CD,".   @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "X.PTF_CD)".      @3212SEINO@@
           10  FILLER              PIC  X(03)  VALUE  " IN".            @3212SEINO@@
           10  FILLER              PIC  X(08)  VALUE  " (SELECT".       @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  " Y.FUND_CD,".    @3212SEINO@@
           10  FILLER              PIC  X(08)  VALUE  "Y.PTF_CD".       @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " FROM ".         @3212SEINO@@
           10  WK-TBL-TKDYAA35-Y   PIC  X(13).                          @3212SEINO@@
           10  FILLER              PIC  X(02)  VALUE  " Y".             @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " WHERE".         @3212SEINO@@
           10  FILLER              PIC  X(33)  VALUE                    @3212SEINO@@
               " Y.RIYO_CMP_CD = :V_W_RIYO_CMP_CD".                     @3212SEINO@@
           10  FILLER              PIC  X(33)  VALUE                    @3212SEINO@@
               " AND Y.SYORI_YMD = :V_W_SYORI_YMD".                     @3212SEINO@@
           10  FILLER              PIC  X(36)  VALUE                    @3212SEINO@@
               " AND Y.KIDOU_ID = :V_W_KIDOU_ID)) A,".                  @3212SEINO@@
           10  FILLER              PIC  X(08)  VALUE  " (SELECT".       @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  " G.FUND_CD,".    @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "G.PTF_CD,".      @3212SEINO@@
           10  FILLER              PIC  X(13)  VALUE  "G.HYK_KRTU_CD".  @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " FROM ".         @3212SEINO@@
           10  WK-TBL-TKDYAA35-G   PIC  X(13).                          @3212SEINO@@
           10  FILLER              PIC  X(02)  VALUE  " G".             @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " WHERE".         @3212SEINO@@
           10  FILLER              PIC  X(33)  VALUE                    @3212SEINO@@
               " G.RIYO_CMP_CD = :V_W_RIYO_CMP_CD".                     @3212SEINO@@
           10  FILLER              PIC  X(33)  VALUE                    @3212SEINO@@
               " AND G.SYORI_YMD = :V_W_SYORI_YMD".                     @3212SEINO@@
           10  FILLER              PIC  X(34)  VALUE                    @3212SEINO@@
               " AND G.KIDOU_ID = :V_W_KIDOU_ID) E".                    @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " WHERE".         @3212SEINO@@
           10  FILLER              PIC  X(25)  VALUE                    @3212SEINO@@
               " A.FUND_CD = E.FUND_CD(+)".                             @3212SEINO@@
           10  FILLER              PIC  X(27)  VALUE                    @3212SEINO@@
               " AND A.PTF_CD = E.PTF_CD(+)".                           @3212SEINO@@
           10  FILLER              PIC  X(37)  VALUE                    @3212SEINO@@
               " AND A.HYK_KRTU_CD = E.HYK_KRTU_CD(+)".                 @3212SEINO@@
           10  FILLER              PIC  X(26)  VALUE                    @3212SEINO@@
               " AND E.HYK_KRTU_CD IS NULL".                            @3212SEINO@@
           10  FILLER              PIC  X(34)  VALUE                    @3212SEINO@@
               " AND A.KJN_YMD >= :V_SCZY7060_FROM".                    @3212SEINO@@
           10  FILLER              PIC  X(36)  VALUE                    @3212SEINO@@
               " AND A.KJN_YMD <= :V_SCZY7060_TO) B,".                  @3212SEINO@@
           10  FILLER              PIC  X(08)  VALUE  " (SELECT".       @3212SEINO@@
           10  FILLER              PIC  X(11)  VALUE  " D.FUND_CD,".    @3212SEINO@@
           10  FILLER              PIC  X(09)  VALUE  "D.PTF_CD,".      @3212SEINO@@
           10  FILLER              PIC  X(14)  VALUE  "D.HYK_KRTU_CD,". @3212SEINO@@
           10  FILLER              PIC  X(10)  VALUE  "D.KJN_YMD,".     @3212SEINO@@
           10  FILLER              PIC  X(14)  VALUE  "D.SS_SYORI_YMD". @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " FROM ".         @3212SEINO@@
           10  WK-TBL-TKDYAA40-D   PIC  X(13).                          @3212SEINO@@
           10  FILLER              PIC  X(02)  VALUE  " D".             @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " WHERE".         @3212SEINO@@
           10  FILLER              PIC  X(29)  VALUE                    @3212SEINO@@
               " D.SHINTK_TASK_ID = 'ST00600'".                         @3212SEINO@@
           10  FILLER              PIC  X(29)  VALUE                    @3212SEINO@@
               " AND D.SHINTK_STS <> '000') C".                         @3212SEINO@@
           10  FILLER              PIC  X(06)  VALUE  " WHERE".         @3212SEINO@@
           10  FILLER              PIC  X(22)  VALUE                    @3212SEINO@@
               " B.FUND_CD = C.FUND_CD".                                @3212SEINO@@
           10  FILLER              PIC  X(24)  VALUE                    @3212SEINO@@
               " AND B.PTF_CD = C.PTF_CD".                              @3212SEINO@@
           10  FILLER              PIC  X(34)  VALUE                    @3212SEINO@@
               " AND B.HYK_KRTU_CD = C.HYK_KRTU_CD".                    @3212SEINO@@
           10  FILLER              PIC  X(16)  VALUE                    @3212SEINO@@
               " AND B.KJN_YMD =".                                      @3212SEINO@@
           10  FILLER              PIC  X(30)  VALUE                    @3212SEINO@@
               " DECODE(SUBSTR(C.KJN_YMD,7,2),".                        @3212SEINO@@
           10  FILLER              PIC  X(29)  VALUE                    @3212SEINO@@
               "99,C.SS_SYORI_YMD,C.KJN_YMD))".                         @3212SEINO@@
         05  WK-DELETE-SQL-ZKZ.                                         20090508
           10  FILLER              PIC  X(12)  VALUE  "DELETE FROM ".   20090508
      *----------  勘定残高TBL K                                        20090508
           10  WK-TBL-TKMZKZ00-K   PIC  X(13).                          20090508
           10  FILLER              PIC  X(03)  VALUE  " K ".            20090508
           10  FILLER              PIC  X(06)  VALUE  "WHERE ".         20090508
      *----------  NOT EXISTS                                           20090508
           10  FILLER              PIC  X(11)  VALUE  "NOT EXISTS ".    20090508
           10  FILLER              PIC  X(02)  VALUE  "( ".             20090508
      *----------  SELECT  1                                            20090508
           10  FILLER              PIC  X(09)  VALUE  "SELECT 1 ".      20090508
      *----------  FROM                                                 20090508
           10  FILLER              PIC  X(05)  VALUE  "FROM ".          20090508
      *----------  評価履歴TBL N                                        20090508
           10  WK-TBL-TKMHHR00-N   PIC  X(13).                          20090508
           10  FILLER              PIC  X(03)  VALUE  " N ".            20090508
      *----------  WHERE                                                20090508
           10  FILLER              PIC  X(06)  VALUE  "WHERE ".         20090508
      *----------  N.ファンドコード = K.ファンドコード                  20090508
           10  FILLER              PIC  X(22)                           20090508
               VALUE  "N.FUND_CD = K.FUND_CD ".                         20090508
      *----------  AND  N.ポートフォリオコード = K.ポートフォリオコード 20090508
           10  FILLER              PIC  X(24)                           20090508
               VALUE  "AND N.PTF_CD = K.PTF_CD ".                       20090508
      *----------  AND  N.評価系列コード = K.評価系列コード             20090508
           10  FILLER              PIC  X(34)                           20090508
               VALUE  "AND N.HYK_KRTU_CD = K.HYK_KRTU_CD ".             20090508
      *----------  AND  N.基準日 = K.基準日                             20090508
           10  FILLER              PIC  X(26)                           20090508
               VALUE  "AND N.KJN_YMD = K.KJN_YMD ".                     20090508
      *----------  AND  N.決算日断面区分 = K.決算日断面区分             20090508
           10  FILLER              PIC  X(42)                           20090508
               VALUE  "AND N.KSN_YMD_DMN_KBN = K.KSN_YMD_DMN_KBN ".     20090508
      *----------  AND ( N.証券種別コード = K.証券種別コード            20090508
           10  FILLER              PIC  X(34)                           20090508
               VALUE  "AND ( N.SEC_SBT_CD = K.SEC_SBT_CD ".             20090508
      *----------  OR  K.証券種別コード = '    ' )                      20090508
           10  FILLER              PIC  X(28)                           20090508
               VALUE  "OR K.SEC_SBT_CD = '    ' )) ".                   20090508
      *----------  AND K.基準日>=SCZY7060より取得した上電文.基準日FROM  20111208
           10  FILLER              PIC  X(21)                           20111208
               VALUE  "AND K.KJN_YMD >= :V1 ".                          20111208
      *----------  AND K.基準日<=SCZY7060より取得した上電文.基準日TO    20111208
           10  FILLER              PIC  X(21)                           20111208
               VALUE  "AND K.KJN_YMD <= :V2 ".                          20111208
      *----------  AND  K.評価系列コード <> '    '                      20090508
           10  FILLER              PIC  X(28)                           20090508
               VALUE  "AND K.HYK_KRTU_CD <> '    ' ".                   20090508
      *----------  AND ( K.更新プログラムＩＤ < 'RXIKG600'              20100113
           10  FILLER              PIC  X(32)                           20100113
               VALUE  "AND ( K.UPD_PGMID < 'RXIKG600'  ".               20100113 20101020
      *----------  OR K.更新プログラムＩＤ > 'RXIKG600')                20100113
           10  FILLER              PIC  X(30)                           20100113
               VALUE  "OR K.UPD_PGMID > 'RXIKG600' ) ".                 20100113
         05  WK-DELETE-SQL-HHI.                                         20090508
           10  FILLER              PIC  X(12)  VALUE  "DELETE FROM ".   20090508
      *----------  評価計算入力TBL K                                    20090508
           10  WK-TBL-TKMHHI00-K   PIC  X(13).                          20090508
           10  FILLER              PIC  X(03)  VALUE  " K ".            20090508
           10  FILLER              PIC  X(06)  VALUE  "WHERE ".         20090508
      *----------  NOT EXISTS                                           20090508
           10  FILLER              PIC  X(11)  VALUE  "NOT EXISTS ".    20090508
           10  FILLER              PIC  X(02)  VALUE  "( ".             20090508
      *----------  SELECT  1                                            20090508
           10  FILLER              PIC  X(09)  VALUE  "SELECT 1 ".      20090508
      *----------  FROM                                                 20090508
           10  FILLER              PIC  X(05)  VALUE  "FROM ".          20090508
      *----------  評価履歴TBL N                                        20090508
           10  WK-TBL-TKMHHR00-N   PIC  X(13).                          20090508
           10  FILLER              PIC  X(03)  VALUE  " N ".            20090508
      *----------  WHERE                                                20090508
           10  FILLER              PIC  X(06)  VALUE  "WHERE ".         20090508
      *----------  N.ファンドコード = K.ファンドコード                  20090508
           10  FILLER              PIC  X(22)                           20090508
               VALUE  "N.FUND_CD = K.FUND_CD ".                         20090508
      *----------  AND  N.ポートフォリオコード = K.ポートフォリオコード 20090508
           10  FILLER              PIC  X(24)                           20090508
               VALUE  "AND N.PTF_CD = K.PTF_CD ".                       20090508
      *----------  AND  N.評価系列コード = K.評価系列コード             20090508
           10  FILLER              PIC  X(34)                           20090508
               VALUE  "AND N.HYK_KRTU_CD = K.HYK_KRTU_CD ".             20090508
      *----------  AND  N.証券種別コード = K.証券種別コード             20090508
           10  FILLER              PIC  X(32)                           20090508
               VALUE  "AND N.SEC_SBT_CD = K.SEC_SBT_CD ".               20090508
      *----------  AND  N.銘柄コード = K.銘柄コード                     20090508
           10  FILLER              PIC  X(24)                           20090508
               VALUE  "AND N.MEG_CD = K.MEG_CD ".                       20090508
      *----------  AND  N.資産負債・買建売建フラグ = K.資産負債・買建売建フラグ  20090508
           10  FILLER              PIC  X(28)                           20090508
               VALUE  "AND N.TATE_FLG = K.TATE_FLG ".                   20090508
      *----------  AND  N.玉ＩＤ = K.玉ＩＤ                             20090508
           10  FILLER              PIC  X(28)                           20090508
               VALUE  "AND N.GYOKU_ID = K.GYOKU_ID ".                   20090508
      *----------  AND  N.基準日 = K.基準日                             20090508
           10  FILLER              PIC  X(26)                           20090508
               VALUE  "AND N.KJN_YMD = K.KJN_YMD ".                     20090508
      *----------  AND  N.決算日断面区分 = K.決算日断面区分)            20090508
           10  FILLER              PIC  X(44)                           20090508
               VALUE  "AND N.KSN_YMD_DMN_KBN = K.KSN_YMD_DMN_KBN ) ".   20090508
      *----------  AND K.基準日>=SCZY7060より取得した上電文.基準日FROM  20111208
           10  FILLER              PIC  X(21)                           20111208
               VALUE  "AND K.KJN_YMD >= :V1 ".                          20111208
      *----------  AND K.基準日<=SCZY7060より取得した上電文.基準日TO    20111208
           10  FILLER              PIC  X(21)                           20111208
               VALUE  "AND K.KJN_YMD <= :V2 ".                          20111208
         05  WK-SELECT-SQL-TKDY.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  A.ファンドコード
           10  FILLER              PIC  X(10)  VALUE  "A.FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE  "A.PTF_CD,".
      *----------  評価系列コード
           10  FILLER              PIC  X(14)  VALUE  "A.HYK_KRTU_CD,".
      *----------  MIN(計算期間FROM)
           10  FILLER              PIC  X(21)
                                        VALUE  "MIN(A.CALC_KKN_FROM),".
      *----------  MAX(計算期間TO)
           10  FILLER              PIC  X(18)
                                        VALUE  "MAX(A.CALC_KKN_TO)".
           10  FILLER              PIC  X(08)  VALUE  " FROM ( ".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD,".
      *----------  評価系列コード
           10  FILLER              PIC  X(12)  VALUE  "HYK_KRTU_CD,".
      *----------  計算期間FROM
           10  FILLER              PIC  X(14)  VALUE  "CALC_KKN_FROM,".
      *----------  計算期間TO
           10  FILLER              PIC  X(11)  VALUE  "CALC_KKN_TO".
      *----------  FROM
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  再処理要ポートフォリオ一覧（時価）TBL
           10  WK-TBL-TKDYGP09     PIC  X(13).
           10  FILLER              PIC  X(03)  VALUE  " ) ".
           10  FILLER              PIC  X(11)  VALUE  " UNION ALL ".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD,".
      *----------  評価系列コード
           10  FILLER              PIC  X(12)  VALUE  "HYK_KRTU_CD,".
      *----------  計算期間FROM
           10  FILLER              PIC  X(14)  VALUE  "CALC_KKN_FROM,".
      *----------  計算期間TO
           10  FILLER              PIC  X(11)  VALUE  "CALC_KKN_TO".
      *----------  FROM
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  再処理要ポートフォリオ一覧（銘柄属性）TBL
           10  WK-TBL-TKDYGP16     PIC  X(13).
           10  FILLER              PIC  X(03)  VALUE  " ) ".
           10  FILLER              PIC  X(11)  VALUE  " UNION ALL ".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD,".
      *----------  評価系列コード
           10  FILLER              PIC  X(12)  VALUE  "HYK_KRTU_CD,".
      *----------  計算期間FROM
           10  FILLER              PIC  X(14)  VALUE  "CALC_KKN_FROM,".
      *----------  計算期間TO
           10  FILLER              PIC  X(11)  VALUE  "CALC_KKN_TO".
      *----------  FROM
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  再処理要ポートフォリオ一覧（為替）TBL
           10  WK-TBL-TKDYGP10     PIC  X(13).
           10  FILLER              PIC  X(03)  VALUE  " ) ".
           10  FILLER              PIC  X(11)  VALUE  " UNION ALL ".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD,".
      *----------  評価系列コード
           10  FILLER              PIC  X(12)  VALUE  "HYK_KRTU_CD,".
      *----------  計算期間FROM
           10  FILLER              PIC  X(14)  VALUE  "CALC_KKN_FROM,".
      *----------  計算期間TO
           10  FILLER              PIC  X(11)  VALUE  "CALC_KKN_TO".
      *----------  FROM
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  再処理要ポートフォリオ一覧（取引）TBL
           10  WK-TBL-TKDYGP12     PIC  X(13).
           10  FILLER              PIC  X(03)  VALUE  " ) ".
           10  FILLER              PIC  X(11)  VALUE  " UNION ALL ".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD,".
      *----------  評価系列コード
           10  FILLER              PIC  X(12)  VALUE  "HYK_KRTU_CD,".
      *----------  計算期間FROM
           10  FILLER              PIC  X(14)  VALUE  "CALC_KKN_FROM,".
      *----------  計算期間TO
           10  FILLER              PIC  X(11)  VALUE  "CALC_KKN_TO".
      *----------  FROM
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  再処理要ポートフォリオ一覧（補正）TBL
           10  WK-TBL-TKDYGP13     PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " ) ) A ".
           10  FILLER              PIC  X(10)  VALUE  " GROUP BY ".
      *----------  ファンドコード
           10  FILLER              PIC  X(10)  VALUE  "A.FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE  "A.PTF_CD,".
      *----------  評価系列コード
           10  FILLER              PIC  X(13)  VALUE  "A.HYK_KRTU_CD".
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
      *----------  ファンドコード
           10  FILLER              PIC  X(10)  VALUE  "A.FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE  "A.PTF_CD,".
      *----------  評価系列コード
           10  FILLER              PIC  X(13)  VALUE  "A.HYK_KRTU_CD".
         05  WK-SELECT-SQL-TKDY-1.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  利用会社コード
           10  FILLER              PIC  X(12)  VALUE  "RIYO_CMP_CD ".
      *----------  FROM
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
      *----------  再処理要制御TBL
           10  WK-TBL-TKDYGP17     PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード= ワーク利用会社コード
           10  FILLER              PIC  X(19)
                                        VALUE  "RIYO_CMP_CD = :V18 ".
      *----------  FOR UPDATE
           10  FILLER              PIC  X(11)  VALUE  "FOR UPDATE ".
         05  WK-UPDATE-SQL-TKDY-2.
      *----------  UPDATE
           10  FILLER              PIC  X(07)  VALUE  "UPDATE ".
      *----------  再処理要制御TBL
           10  WK-TBL-TKDYGP17     PIC  X(13).
      *----------  SET
           10  FILLER              PIC  X(05)  VALUE  " SET ".
      *----------  業務タスクＩＤ
           10  FILLER              PIC  X(21)
                                         VALUE  "GYOMU_TASK_ID = :V19,".
      *----------  更新日時
           10  FILLER              PIC  X(19)
                                           VALUE  "UPD_DATE = SYSDATE,".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(24)
                                      VALUE  "UPD_LOGIN_CMP_CD = :V20,".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(15)  VALUE  "UPD_SID = :V21,".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(22)
                                        VALUE  "UPD_PGMID = 'MMHJ0010'".
      *----------  WHERE
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード = ワーク利用会社コード
           10  FILLER              PIC  X(19)
                                           VALUE  "RIYO_CMP_CD = :V22 ".
      *----------  共通ルーチン、ヘッダ項目
       01  PARM-AIFA-HEADER.
      *----------  共通初期ルーチン
         05  PARM-WOMCMAIFA-ARG.
           COPY  "WOMCMAIFA.CPY".
      *----------  共通ヘッダ項目
         05  PARM-CZCOMMONHEADER-ARG.
           COPY  "CZCOMMONHEADER.cpy".
      ******************************************************************
      *                   電文  エリア
      ******************************************************************
       01  WK-DENBUN-AREA.
      *----------  AIFA情報
         05  WK-AIFA-IN.
           COPY  "WOMCMAIFA.CPY".
      *----------  共通ヘッダ
         05  WK-HEADER-IN.
           COPY  "CZCOMMONHEADER.cpy".
      *----------  上り電文エリア
         05  WK-DATA-IN.
           COPY  "INMMHR0110_COBOL.cpy".
      ******************************************************************
      *                SQL通信領域
      ******************************************************************
      *----------  SQLコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN    DECLARE  SECTION  END-EXEC.
       01  HST-AREA.
      *----------  ORACLE接続ユーザ領域
         05  H-ORA-USER            PIC  X(80).
      *----------  DBレイアウト                                         20090218
         05  H-SQL-DELETE.                                              20090218
      *****------  利用会社コード                                       @3212SEINO@@
      *****10  H-RIYO-CMP-CD-E     PIC  X(04).                          @3212SEINO@@
      *****------  処理実行日                                           @3212SEINO@@ 20090218
      *****10  H-SYORI-YMD-E       PIC  S9(08).                         @3212SEINO@@ 20090218
      *****------  起動ID                                               @3212SEINO@@ 20090218
      *****10  H-KIDOU-ID-E        PIC  X(04).                          @3212SEINO@@ 20090218
      *****------  帳票ID                                               @3212SEINO@@ 20090218
      *****10  H-REP-ID-E          PIC  X(08).                          @3212SEINO@@ 20090218
      *****------  帳票任意コード                                       @3212SEINO@@ 20090218
      *****10  H-REP-ANY-CD-E      PIC  X(50).                          @3212SEINO@@ 20090218
      *****------  基準日                                               @3212SEINO@@ 20090218
      *****10  H-KJN-YMD-FROM-A    PIC  S9(08).                         @3212SEINO@@ 20090218
      *****10  H-KJN-YMD-TO-A      PIC  S9(08).                         @3212SEINO@@ 20090218
      *****------  基準日                                               @3212SEINO@@ 20090218
      *****10  H-KJN-YMD-FROM-X    PIC  S9(08).                         @3212SEINO@@ 20090218
      *****10  H-KJN-YMD-TO-X      PIC  S9(08).                         @3212SEINO@@ 20090218
      *****------  利用会社コード                                       @3212SEINO@@ 20090218
      *****10  H-RIYO-CMP-CD-Y     PIC  X(04).                          @3212SEINO@@ 20090218
      *****------  処理実行日                                           @3212SEINO@@ 20090218
      *****10  H-SYORI-YMD-Y       PIC  S9(08).                         @3212SEINO@@ 20090218
      *****------  起動ID                                               @3212SEINO@@ 20090218
      *****10  H-KIDOU-ID-Y        PIC  X(04).                          @3212SEINO@@ 20090218
      *****------  帳票ID                                               @3212SEINO@@ 20090218
      *****10  H-REP-ID-Y          PIC  X(08).                          @3212SEINO@@ 20090218
      *****------  帳票任意コード                                       @3212SEINO@@ 20090218
      *****10  H-REP-ANY-CD-Y      PIC  X(50).                          @3212SEINO@@ 20090218
      *----------  利用会社コード                                       @3212SEINO@@
           10  H-RIYO-CMP-CD       PIC  X(04).                          @3212SEINO@@
      *----------  処理実行日                                           @3212SEINO@@
           10  H-SYORI-YMD         PIC  S9(08).                         @3212SEINO@@
      *----------  起動ID                                               @3212SEINO@@
           10  H-KIDOU-ID          PIC  X(04).                          @3212SEINO@@
      *----------  基準日                                               @3212SEINO@@
           10  H-KJN-YMD-FROM      PIC  S9(08).                         @3212SEINO@@
           10  H-KJN-YMD-TO        PIC  S9(08).                         @3212SEINO@@
         05  H-SQL-DELETE-ZKZ.                                          20111208
      *----------  基準日                                               20111208
           10  H-KJN-YMD-FROM-ZKZ  PIC  S9(08).                         20111208
           10  H-KJN-YMD-TO-ZKZ    PIC  S9(08).                         20111208
         05  H-SQL-DELETE-HHI.                                          20111208
      *----------  基準日                                               20111208
           10  H-KJN-YMD-FROM-HHI  PIC  S9(08).                         20111208
           10  H-KJN-YMD-TO-HHI    PIC  S9(08).                         20111208
         05  H-SQL-UPDATE-1.
      *----------  業務タスクＩＤ
           10  H-GYOMU-TASK-ID     PIC  X(07).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-U     PIC  X(04).
         05  H-SQL-SELECT-1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-S     PIC  X(04).
         05  H-SQL-FETCH.
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *----------  計算期間FROM
           10  H-CALC-KKN-FROM     PIC  S9(08).                         20101020
      *----------  計算期間TO
           10  H-CALC-KKN-TO       PIC  S9(08).                         20101020
      *----------  SQL条件ワーク                                        20090218
         05  SQLSTMT               PIC  X(2500).                        20090218
         05  SQLSTMT4              PIC  X(1500).                        @3212SEINO@@
         05  SQLSTMT5              PIC  X(442).                         @3212SEINO@@20111208
         05  SQLSTMT6              PIC  X(442).                         @3212SEINO@@20111208
           EXEC  SQL  END      DECLARE  SECTION  END-EXEC.
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FLAG-AREA.
      *----------  ORACLE接続フラグ
         05  FLG-ORA-CONNECT       PIC  9(01).
      *----------  ワーク取得FLG
         05  FLG-GET               PIC  9(01).
      *----------  ワークカーソルOPENフラグ1
         05  FLG-CR1-OPEN          PIC  9(01).
      ******************************************************************
      *                カウンタ  エリア
      ******************************************************************
       01  WK-COUNTER-AREA.
      *---------  計数器
         05  WK-IDX                PIC  9(09).
         05  WK-IDX1               PIC  9(09).
         05  WK-IDX2               PIC  9(09).
         05  WK-IDX3               PIC  9(09).
         05  WK-IDX4               PIC  9(09).
         05  WK-IDX5               PIC  9(09).
         05  WK-IDX6               PIC  9(09).
         05  WK-IDX7               PIC  9(09).
         05  WK-IDX8               PIC  9(09).
         05  WK-IDX9               PIC  9(09).
         05  WK-IDX10              PIC  9(09).
         05  WK-IDX11              PIC  9(09).
         05  WK-IDX12              PIC  9(09).
      *----------  ヒット件数
         05  WK-CNT-HIT-KENSU      PIC  9(05).
      *----------  取得件数
         05  WK-CNT-GET-KENSU      PIC  9(05).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY7010 バッチ開始メッセージ出力ルーチン
       01  PARM-SCZY7010-INOUT.
           COPY  "SCZY7010.cpy".
      *----------  SCZY7020 バッチ終了メッセージ出力ルーチン
       01  PARM-SCZY7020-INOUT.
           COPY  "SCZY7020.cpy".
      *----------  SCZY7090 バッチ引数一括取得ルーチン
       01  PARM-SCZY7090-INOUT.
           COPY  "SCZY7090.cpy".
      *----------  SCZY7100 バッチＤＢ接続情報取得ルーチン
       01  PARM-SCZY7100-INOUT.
           COPY  "SCZY7100.cpy".
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY "SCZY1160.cpy".
      *----------  SCZY7060 実行状況管理SELメイン.xls
       01  PARM-SCZY7060-INOUT.
           COPY  "SCZY7060.cpy".
      *----------  SCZY1010 システム日付・マシン日付時刻
      *----------           ＧＥＴルーチン.xls
       01  PARM-SCZY1010-INOUT.
           COPY  "SCZY1010.cpy".
      *----------  SCZY7080 ポートフォリオ別メッセージＩＮＳルーチン
       01  PARM-SCZY7080-INOUT.
           COPY  "SCZY7080.cpy".
      *----------  SCZY7070 実行状況管理UPDメイン.xls
       01  PARM-SCZY7070-INOUT.
           COPY  "SCZY7070.cpy".
      *----------  SCZY7040 バッチ処理件数出力ルーチン
       01  PARM-SCZY7040-INOUT.
           COPY  "SCZY7040.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-INOUT.
           COPY  "SCZY1170.cpy".
      *----------  SCZY7200 処理対象パラメータGETルーチン
       01  PARM-SCZY7200-INOUT.
           COPY  "SCZY7200.cpy".
      *----------  SCZY4311 評価系列情報メモリ格納処理
       01  PARM-SCZY4311-INOUT.
           COPY  "SCZY4311.cpy".
      *----------  SCZY4305 評価計算パターン情報メモリ格納処理
       01  PARM-SCZY4305-INOUT.
           COPY  "SCZY4305.cpy".
      *----------  SCZY4307 評価時価取得方法パターン情報メモリ格納処理
       01  PARM-SCZY4307-INOUT.
           COPY  "SCZY4307.cpy".
      *----------  SCZY4309 評価為替取得方法パターン情報メモリ格納処理
       01  PARM-SCZY4309-INOUT.
           COPY  "SCZY4309.cpy".
      *----------  SCZY4407 料率情報メモリ格納処理
       01  PARM-SCZY4407-INOUT.
           COPY  "SCZY4407.cpy".
      *----------  SCZY4401 通貨情報メモリ格納処理
       01  PARM-SCZY4401-INOUT.
           COPY  "SCZY4401.cpy".
      *----------  SCZY4501 為替換算情報メモリ格納処理
       01  PARM-SCZY4501-INOUT.
           COPY  "SCZY4501.cpy".
      *----------  SCZY1130 利用権限チェックルーチン
       01  PARM-SCZY1130-INOUT.
           COPY  "SCZY1130.cpy".
      *----------  SCZY7110 バッチ用監査ログＩＮＳルーチン
       01  PARM-SCZY7110-INOUT.
           COPY  "SCZY7110.cpy".
      *----------  SMHR0110 評価計算起動単体チェックルーチン
       01  PARM-SMHR0110-ARG1.
      *----------  AIFA-IN
         05  AIFA-IN.
           COPY  "WOMCMAIFA.CPY".
      *----------  共通ヘッダ
         05  HEADER-IN.
           COPY  "CZCOMMONHEADER.cpy".
      *----------  上り電文
         05  DATA-IN.
           COPY  "INMMHR0110_COBOL.cpy".
       01  PARM-SMHR0110-INOUT.
           COPY  "SMHR0110.cpy".
      *----------  SCZY4033 ポートフォリオと有効期間取得                20081224
       01  PARM-SCZY4033-INOUT.                                         20081224
           COPY  "SCZY4033.cpy".                                        20081224
      *----------  SCZY7050 実行状況管理明細ＩＮＳルーチン
       01  PARM-SCZY7050-INOUT.
           COPY  "SCZY7050.cpy".
      *----------  SMHJ1110 ポートフォリオ別ループ処理
       01  PARM-SMHJ1110-INOUT.
           COPY  "SMHJ1110.cpy".
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *        手続き部
      *
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
      *    処理全体
      ******************************************************************
       MMHJ0010-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D            ":◆◇◆◇◆◇◆◇  MMHJ0010 START  ◇◆◇◆◇◆◇◆"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":◆◇◆◇◆◇◆◇  MMHJ0010 END  ◇◆◇◆◇◆◇◆"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       MMHJ0010-EXT.
           EXIT.
      ******************************************************************
      *    3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  前処理  START  *****"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.1.1.初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2.バッチ開始メッセージ出力処理
           PERFORM  PUT-START-MSG-RTN
      *----------  3.1.3.引数取得処理
           PERFORM  GET-EXEC-ARG-RTN
      *----------  3.1.4.バッチＤＢ接続情報取得
           PERFORM  GET-DB-VAR-RTN
      *----------  3.1.5.オラクル接続
           PERFORM  CONNECT-ORA-RTN
      *----------  3.1.6.テーブルID取得
           PERFORM  TBLID-GET-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  前処理  END  *****"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1.初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  ワークエリアを初期化する
           INITIALIZE  WORK-AREA
                       WK-DENBUN-AREA
                       FLAG-AREA
                       WK-COUNTER-AREA
                       PARM-SCZY7010-INOUT
                       PARM-SCZY7020-INOUT
                       PARM-SCZY7090-INOUT
                       PARM-SCZY7100-INOUT
                       PARM-SCZY1160-INOUT
                       PARM-SCZY7060-INOUT
                       PARM-SCZY1010-INOUT
                       PARM-SCZY7080-INOUT
                       PARM-SCZY7070-INOUT
                       PARM-SCZY7040-INOUT
                       PARM-SCZY1170-INOUT
                       PARM-SCZY7200-INOUT
                       PARM-SCZY4311-INOUT
                       PARM-SCZY4305-INOUT
                       PARM-SCZY4307-INOUT
                       PARM-SCZY4309-INOUT
                       PARM-SCZY4407-INOUT
                       PARM-SCZY4401-INOUT
                       PARM-SCZY4501-INOUT
                       PARM-SCZY1130-INOUT
                       PARM-SCZY7110-INOUT
                       PARM-SMHR0110-ARG1
                       PARM-SMHR0110-INOUT
                       PARM-SCZY4033-INOUT
                       PARM-SMHJ1110-INOUT
                       PARM-SCZY7050-INOUT
           MOVE  CNS-MAX-50000    TO  WK-MAX-KENSUU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WORK-AREA           =["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":WK-DENBUN-AREA      =["WK-DENBUN-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLAG-AREA           =["FLAG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":WK-COUNTER-AREA     =["
      D             WK-COUNTER-AREA"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7010-INOUT =["
      D             PARM-SCZY7010-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7020-INOUT =["
      D             PARM-SCZY7020-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7090-INOUT =["
      D             PARM-SCZY7090-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7100-INOUT =["
      D             PARM-SCZY7100-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT =["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7060-INOUT =["
      D             PARM-SCZY7060-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1010-INOUT =["
      D             PARM-SCZY1010-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7080-INOUT =["
      D             PARM-SCZY7080-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7070-INOUT =["
      D             PARM-SCZY7070-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7040-INOUT =["
      D             PARM-SCZY7040-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-INOUT =["
      D             PARM-SCZY1170-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7200-INOUT =["
      D             PARM-SCZY7200-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4311-INOUT =["
      D             PARM-SCZY4311-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4305-INOUT =["
      D             PARM-SCZY4305-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4307-INOUT =["
      D             PARM-SCZY4307-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4309-INOUT =["
      D             PARM-SCZY4309-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4407-INOUT =["
      D             PARM-SCZY4407-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4401-INOUT =["
      D             PARM-SCZY4401-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4501-INOUT =["
      D             PARM-SCZY4501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1130-INOUT =["
      D             PARM-SCZY1130-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7110-INOUT =["
      D             PARM-SCZY7110-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4033-INOUT =["                 20081224
      D             PARM-SCZY4033-INOUT"]"                              20081224
      D    DISPLAY  CNS-PGM-ID":PARM-SMHR0110-ARG1 =["
      D             PARM-SMHR0110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMHR0110-INOUT =["
      D             PARM-SMHR0110-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMHJ1110-INOUT =["
      D             PARM-SMHJ1110-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7050-INOUT =["
      D             PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":WK-MAX-KENSUU =["WK-MAX-KENSUU"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  プログラム終了パラメータ
           MOVE  CNS-BTH-NORMAL         TO  WK-PGM-END-STS
           MOVE  CNS-OFF                TO  FLG-ORA-CONNECT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":MMHJ0010のプログラム終了ステータス=["
      D             WK-PGM-END-STS "]"
      D    DISPLAY  CNS-PGM-ID":オラクル接続フラグ=["FLG-ORA-CONNECT"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2.バッチ開始メッセージ出力処理
      ******************************************************************
       PUT-START-MSG-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  バッチ開始メッセージ出力処理"
      D                       "START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  接続用パラメータ設定
           INITIALIZE  PARM-SCZY7010-INOUT
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7010-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PGM-ID  OF  PARM-SCZY7010-ARG1 =["
      D             PGM-ID              OF  PARM-SCZY7010-ARG1 "]"
      *-----------------------------------------------------------------
           CALL  "SCZY7010"             USING  PARM-SCZY7010-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  開始メッセージ出力 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PUT-START-MSG-EXT.
           EXIT.
      ******************************************************************
      *    3.1.3.引数取得処理
      ******************************************************************
       GET-EXEC-ARG-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  引数取得処理 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  接続用パラメータ設定
           INITIALIZE  PARM-SCZY7090-INOUT
                       PARM-RTNPKG
           MOVE  CNS-5
             TO  ARG-NUM                OF  PARM-SCZY7090-INOUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":引数個数=["
      D              ARG-NUM            OF  PARM-SCZY7090-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7090 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  バッチ引数一括取得ルーチン(SCZY7090)をコール
           CALL  "SCZY7090"             USING  PARM-SCZY7090-INOUT
                                               PARM-RTNPKG
      *    机上デバッグについて、RETURN-CODEの事前設定--START--
      *    MOVE  CNS-RTN-800
      *      TO  RTN-CD         OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    机上デバッグについて、RETURN-CODEの事前設定--END--
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7090 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY7090=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           IF  RTN-CD                   OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ワークパラメータのセット
      *----------  利用会社コード
             MOVE  ARG-STRING           OF PARM-SCZY7090-ARG2(CNS-1)
               TO  WK-RIYO-CMP-CD
      *----------  処理実行日
             MOVE  ARG-STRING           OF PARM-SCZY7090-ARG2(CNS-2)
               TO  WK-SYORI-YMD
      *----------  起動ＩＤ
             MOVE  ARG-STRING           OF PARM-SCZY7090-ARG2(CNS-3)
               TO  WK-KIDOU-ID
      *----------  業務タスクID
             MOVE  ARG-STRING           OF PARM-SCZY7090-ARG2(CNS-4)
               TO  WK-GYOMU-TASK-ID-IN
      *----------  ＧＩＰＳモード
             MOVE  ARG-STRING           OF PARM-SCZY7090-ARG2(CNS-5)
               TO  WK-GIPS-MODE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日     =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":起動ＩＤ       =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID   =["WK-GYOMU-TASK-ID-IN"]"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード =["WK-GIPS-MODE"]"
      *--------------------<DEBUG>--------------------------------------
             IF  WK-RIYO-CMP-CD = SPACE AND WK-SYORI-YMD        = SPACE
               AND  WK-KIDOU-ID = SPACE AND WK-GYOMU-TASK-ID-IN = SPACE
             THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-001
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  CNS-0
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  "引数取得処理 エラー:"
                 "利用会社コード = ["
                 ARG-STRING             OF PARM-SCZY7090-ARG2(CNS-1)
                 "]"
                 "処理実行日 = ["
                 ARG-STRING             OF PARM-SCZY7090-ARG2(CNS-2)
                 "]"
                 "起動ＩＤ = ["
                 ARG-STRING             OF PARM-SCZY7090-ARG2(CNS-3)
                 "]"
                 "業務タスクID = ["
                 ARG-STRING             OF PARM-SCZY7090-ARG2(CNS-4)
                 "]"
                 DELIMITED BY SIZE
                 INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
             ELSE
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード,処理実行日,"
      D             "起動ＩＤ,業務タスクID  NOT ALL = SPACE"
      *--------------------<DEBUG>--------------------------------------
             END-IF
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  CNS-0
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  "引数取得処理 エラー"
                 DELIMITED BY SIZE
                 INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  引数取得処理 END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       GET-EXEC-ARG-EXT.
           EXIT.
      ******************************************************************
      *    3.1.4.バッチＤＢ接続情報取得
      ******************************************************************
       GET-DB-VAR-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  バッチＤＢ接続情報取得 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  接続用パラメータ設定
           INITIALIZE  PARM-SCZY7100-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7100-INOUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY7100-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7100 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  バッチＤＢ接続情報取得ルーチン(SCZY7100)をコールする
           CALL  "SCZY7100"             USING  PARM-SCZY7100-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7100 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY7100=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           IF  RTN-CD                   OF PARM-RTNPKG
                                           (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢ接続情報取得ユーザ=["
      D               DB-SETUZOKU-JYOUHOU OF PARM-SCZY7100-INOUT"]"
      *--------------------<DEBUG>--------------------------------------
             MOVE  DB-SETUZOKU-JYOUHOU  OF  PARM-SCZY7100-INOUT
               TO  WK-DB-SETUZOKU-JYOUHOU
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-DB-SETUZOKU-JYOUHOU=["
      D             WK-DB-SETUZOKU-JYOUHOU"]"
      *--------------------<DEBUG>--------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-003
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING "ＤＢ接続情報取得エラー:"
                 "利用会社コード = ["
                 RIYO-CMP-CD            OF  PARM-SCZY7100-INOUT
                 "]"
                 DELIMITED BY SIZE
                 INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  バッチＤＢ接続情報取得 END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       GET-DB-VAR-EXT.
           EXIT.
      ******************************************************************
      *    3.1.5.オラクル接続
      ******************************************************************
       CONNECT-ORA-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  オラクル接続 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  ＳＱＬエラー処理の設定
           MOVE  WK-DB-SETUZOKU-JYOUHOU
             TO  H-ORA-USER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-ORA-USER = [" H-ORA-USER"]"
      *--------------------<DEBUG>--------------------------------------
           EXEC  SQL  WHENEVER  SQLERROR    CONTINUE  END-EXEC
           EXEC  SQL  WHENEVER  SQLWARNING  CONTINUE  END-EXEC
           EXEC  SQL
               CONNECT :H-ORA-USER
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":オラクル接続のSQLCODE = [" SQLCODE "]"
      *--------------------<DEBUG>--------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":オラクル接続正常"
      *--------------------<DEBUG>--------------------------------------
      *----------  ORACLE接続フラグ
             MOVE  CNS-ON               TO  FLG-ORA-CONNECT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":オラクル接続フラグ=["FLG-ORA-CONNECT "]"
      *--------------------<DEBUG>--------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":オラクル接続エラー"
      *--------------------<DEBUG>--------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-004
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING "オラクル接続エラー（CONNECT):"
                 "ORACLE接続情報 = ["
                 H-ORA-USER
                 "]"
                 DELIMITED BY SIZE
                 INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  オラクル接続 END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       CONNECT-ORA-EXT.
           EXIT.
      ******************************************************************
      *                 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  テーブルID取得処理  START  *****"
      *-----------------------------------------------------------------
           INITIALIZE     PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD                 OF PARM-SCZY1160-ARG1
      *----------  テーブルID
           MOVE  CNS-TKDYAA40
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(1)
      *----------  テーブルID
           MOVE  CNS-TKMHHI00
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(2)
      *----------  テーブルID
           MOVE  CNS-TKMHHR00
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(3)
      *----------  テーブルID
           MOVE  CNS-TKMZKZ00
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(4)
      *----------  テーブルID                                           20090218
           MOVE  CNS-TKDYAA35                                           20090218
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(5)   20090218
      *----------  テーブルID
           MOVE  CNS-TKDYGP09
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(6)
      *----------  テーブルID
           MOVE  CNS-TKDYGP10
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(7)
      *----------  テーブルID
           MOVE  CNS-TKDYGP12                                           20100716
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(8)
      *----------  テーブルID
           MOVE  CNS-TKDYGP13                                           20100716
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(9)
      *----------  テーブルID
           MOVE  CNS-TKDYGP16                                           20100716
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(10)
      *----------  テーブルID
           MOVE  CNS-TKDYGP17                                           20100716
             TO  TBL-ID                      OF PARM-SCZY1160-ARG1(11)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD  OF PARM-SCZY1160-ARG1=["
      D              RIYO-CMP-CD             OF PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(1)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(2)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(3)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(4)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(5)=["20090218
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(5)"]"20090218
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(6)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(7)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(7)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(8)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(8)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID       OF PARM-SCZY1160-ARG1(9)=["
      D              TBL-ID                  OF PARM-SCZY1160-ARG1(9)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID      OF PARM-SCZY1160-ARG1(10)=["
      D              TBL-ID                 OF PARM-SCZY1160-ARG1(10)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID      OF PARM-SCZY1160-ARG1(11)=["
      D              TBL-ID                 OF PARM-SCZY1160-ARG1(11)"]"
      D    DISPLAY  CNS-PGM-ID":CALL テーブルID取得ルーチンSCZY1160開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"                  USING  PARM-SCZY1160-INOUT
                                                    PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CALL テーブルID取得ルーチンSCZY1160終了"
      D    DISPLAY  CNS-PGM-ID":RTN-CD       OF PARM-SCZY1160-RTNPKG=["
      D             RTN-CD                   OF PARM-RTNPKG
      D                             (COUNTER OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                        OF PARM-RTNPKG
                                    (COUNTER OF PARM-RTNPKG)
               NOT = CNS-RTN-000
           THEN
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-005
               TO  ERR-POS              OF PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF PARM-RTNPKG
                                           (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF PARM-SCZY1170-ARG1
      *----------  詳細ﾘﾀｰﾝｺｰﾄﾞﾃﾞｺｰﾄﾞﾌﾗｸﾞ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  "SCZY1160テーブルID取得処理エラー:"
                     "利用会社コード = ["
                     RIYO-CMP-CD        OF PARM-SCZY1160-ARG1
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(1) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(1)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(2) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(2)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(3) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(3)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(4) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(4)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(5) = ["   20090218
                     TBL-ID             OF PARM-SCZY1160-ARG1(5)        20090218
                     "]"
                     "TBL-ID            OF PARM-SCZY1160-ARG1(6) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(6)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(7) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(7)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(8) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(8)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(9) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(9)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(10) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(10)
                     "] "
                     "TBL-ID            OF PARM-SCZY1160-ARG1(11) = ["
                     TBL-ID             OF PARM-SCZY1160-ARG1(11)
                     "] "
                 DELIMITED BY SIZE
                 INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           ELSE
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(1)
               TO  WK-TAB-TKDYAA40
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(2)
               TO  WK-TAB-TKMHHI00
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(3)
               TO  WK-TAB-TKMHHR00
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(4)
               TO  WK-TAB-TKMZKZ00
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(5)        20090218
               TO  WK-TAB-TKDYAA35                                      20090218
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(6)
               TO  WK-TAB-TKDYGP09
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(7)
               TO  WK-TAB-TKDYGP10
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(8)
               TO  WK-TAB-TKDYGP12                                      20100716
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(9)
               TO  WK-TAB-TKDYGP13                                      20100716
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(10)
               TO  WK-TAB-TKDYGP16                                      20100716
             MOVE  HENSYUGO-TBL-ID      OF PARM-SCZY1160-ARG2(11)       20100716
               TO  WK-TAB-TKDYGP17
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKDYAA40=["WK-TAB-TKDYAA40"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKMHHI00=["WK-TAB-TKMHHI00"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKMHHR00=["WK-TAB-TKMHHR00"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKMZKZ00=["WK-TAB-TKMZKZ00"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKDYAA35=["WK-TAB-TKDYAA35"]"    20080218
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKDYGP09=["WK-TAB-TKDYGP09"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKDYGP10=["WK-TAB-TKDYGP10"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKDYGP12=["WK-TAB-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKDYGP13=["WK-TAB-TKDYGP13"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKDYGP16=["WK-TAB-TKDYGP16"]"
      D    DISPLAY  CNS-PGM-ID":WK-TAB-TKDYGP17=["WK-TAB-TKDYGP17"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  テーブルID取得処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.                                                    20101020
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2.主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.2.1.処理対象取得処理
      *----------  1) 電文情報取得処理
           PERFORM  GET-DENBUN-RTN
      *----------  2) 電文情報判別処理
           PERFORM  CHK-DENBUN-RTN
      *----------  3) 電文情報転換処理
           PERFORM  EXC-DENBUN-RTN
      *----------  4) 電文より、プォートフォリオの展開
           PERFORM  GET-PTF-RTN
      *----------  5) コミットする
           PERFORM  SQL-COMMIT-RTN
      *----------  3.2.3.ポートフォリオ別ループ処理
      *----------  1) 実行状況管理明細テーブルからデータ情報取得
           PERFORM  SEL-MANAGE-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理 END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    1) 電文情報取得処理
      ******************************************************************
       GET-DENBUN-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報取得処理 START  ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY7060-INOUT
                       WK-AIFA-IN
                       WK-HEADER-IN
                       WK-DATA-IN
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7060-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7060-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7060-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY7060-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":処理実行日         =["
      D             SYORI-YMD           OF PARM-SCZY7060-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":起動ID             =["
      D             KIDOU-ID            OF PARM-SCZY7060-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7060 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  実行状況管理SELルーチン(SCZY7060)をコールする
           CALL  "SCZY7060"             USING  PARM-SCZY7060-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7060 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY7060=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             = CNS-RTN-000
           THEN
      *----------  電文情報
             MOVE  DENBUN-INFO          OF  PARM-SCZY7060-INOUT
               TO  WK-DENBUN-AREA
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-AIFA-IN =[" WK-AIFA-IN "]"
      D    DISPLAY  CNS-PGM-ID":WK-HEADER-IN =[" WK-HEADER-IN "]"
      D    DISPLAY  CNS-PGM-ID":WK-DATA-IN =[" WK-DATA-IN "]"
      *--------------------<DEBUG>--------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジションS
             MOVE  CNS-POS-006
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  "SCZY7060電文情報取得エラー:"
                     "利用会社コード = ["
                     RIYO-CMP-CD        OF  PARM-SCZY7060-ARG1
                     "]"
                 DELIMITED BY SIZE
                 INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報取得処理 END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       GET-DENBUN-EXT.
           EXIT.
      ******************************************************************
      *    2) 電文情報判別処理
      ******************************************************************
       CHK-DENBUN-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報判別処理 START  ***"
      *--------------------<DEBUG>--------------------------------------
           IF  WK-GIPS-MODE  NOT =  CNS-1
           THEN
             INITIALIZE  PARM-SMHR0110-ARG1
                         PARM-SMHR0110-INOUT
                         PARM-RTNPKG
      *----------  電文情報
             MOVE  WK-AIFA-IN
               TO  AIFA-IN               OF  PARM-SMHR0110-ARG1
             MOVE  WK-HEADER-IN
               TO  HEADER-IN             OF  PARM-SMHR0110-ARG1
             MOVE  WK-DATA-IN
               TO  DATA-IN               OF  PARM-SMHR0110-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":AIFA-IN=["
      D             AIFA-IN OF  PARM-SMHR0110-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":HEADER-IN=["
      D             HEADER-IN OF  PARM-SMHR0110-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":DATA-IN=["
      D             DATA-IN OF  PARM-SMHR0110-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SMHR0110 START  ***"
      *--------------------<DEBUG>--------------------------------------
             CALL  "SMHR0110"             USING  PARM-SMHR0110-ARG1
                                                 PARM-SMHR0110-INOUT
                                                 PARM-RTNPKG
      *    机上デバッグについて、RETURN-CODEの事前設定--START--
      *    MOVE  CNS-RTN-900
      *      TO  RTN-CD     OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    机上デバッグについて、RETURN-CODEの事前設定--END--
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SMHR0110 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SMHR0110=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
             IF  RTN-CD                   OF  PARM-RTNPKG
                                              (COUNTER OF PARM-RTNPKG)
              =  CNS-RTN-000
             THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":スキップ区分=["
      D             SKIP-KBN  OF  PARM-SMHR0110-INOUT"]"
      *--------------------<DEBUG>--------------------------------------
               EVALUATE  SKIP-KBN         OF  PARM-SMHR0110-INOUT
                 WHEN  CNS-X-0
                   CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SMHR0110リターンコード＝'000'(正常)"
      D             "ANDスキップ区分＝'0'(続行)"
      *--------------------<DEBUG>--------------------------------------
                 WHEN  CNS-X-1
      *---------- メッセージを登録する
             INITIALIZE  PARM-SCZY7080-INOUT                              20081030
                         PARM-RTNPKG                                      20081030
      *---------- アーギュメントIN-2                                    20081030
                 MOVE  SMHR0110-BT-OUT         OF  PARM-SMHR0110-INOUT    20081030  20081104
                   TO  PARM-SCZY7080-ARG2      OF  PARM-SCZY7080-INOUT    20081030
      *---------- 利用会社コード                                        20081030
                 MOVE  WK-RIYO-CMP-CD                                     20081030
                   TO  RIYO-CMP-CD        OF  PARM-SCZY7080-INOUT         20081030
      *---------- 処理実行日                                            20081030
                 MOVE  WK-SYORI-YMD                                       20081030
                   TO  SYORI-YMD          OF  PARM-SCZY7080-INOUT         20081030
      *---------- 起動ID                                                20081030
                 MOVE  WK-KIDOU-ID                                        20081030
                   TO  KIDOU-ID           OF  PARM-SCZY7080-INOUT         20081030
      *---------- 業務タスクID                                          20081030
                 MOVE  WK-GYOMU-TASK-ID-IN                                20081030
                   TO  GYOMU-TASK-ID      OF  PARM-SCZY7080-INOUT         20081030
      *--------------------<DEBUG>--------------------------------------20081030
      D    DISPLAY  CNS-PGM-ID":アーギュメントIN-2 =["PARM-SCZY7080-ARG2 20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD      20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD        20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID         20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID    20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      *--------------------<DEBUG>--------------------------------------20081030
                   PERFORM  WARNING-MSG-RTN
                   MOVE  CNS-8            TO  WK-RTN-CD-COM               20081030
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード比較値=["
      D             WK-RTN-CD-COM"]"
      *-----------------------------------------------------------------
      *----------  ワーニング更新
                   PERFORM  WRN-UPD-RTN
      *----------  3.3.後処理へ進む
                   PERFORM  END-RTN
                 WHEN  CNS-X-2
      *---------- メッセージを登録する
             INITIALIZE  PARM-SCZY7080-INOUT                              20081030
                         PARM-RTNPKG                                      20081030
      *---------- アーギュメントIN-2                                    20081030
                 MOVE  SMHR0110-BT-OUT         OF  PARM-SMHR0110-INOUT    20081030  20081104
                   TO  PARM-SCZY7080-ARG2      OF  PARM-SCZY7080-INOUT    20081030
      *---------- 利用会社コード                                        20081030
                 MOVE  WK-RIYO-CMP-CD                                     20081030
                   TO  RIYO-CMP-CD        OF  PARM-SCZY7080-INOUT         20081030
      *---------- 処理実行日                                            20081030
                 MOVE  WK-SYORI-YMD                                       20081030
                   TO  SYORI-YMD          OF  PARM-SCZY7080-INOUT         20081030
      *---------- 起動ID                                                20081030
                 MOVE  WK-KIDOU-ID                                        20081030
                   TO  KIDOU-ID           OF  PARM-SCZY7080-INOUT         20081030
      *---------- 業務タスクID                                          20081030
                 MOVE  WK-GYOMU-TASK-ID-IN                                20081030
                   TO  GYOMU-TASK-ID      OF  PARM-SCZY7080-INOUT         20081030
      *--------------------<DEBUG>--------------------------------------20081030
      D    DISPLAY  CNS-PGM-ID":アーギュメントIN-2 =["PARM-SCZY7080-ARG2 20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD      20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD        20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID         20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID    20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      *--------------------<DEBUG>--------------------------------------20081030
                   PERFORM  WARNING-MSG-RTN
                   MOVE  CNS-8          TO  WK-RTN-CD-COM                 20081030
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード比較値=["
      D             WK-RTN-CD-COM"]"
      *-----------------------------------------------------------------
      *----------  ワーニング更新
                   PERFORM  WRN-UPD-RTN
      *----------  3.3.後処理へ進む
                   PERFORM  END-RTN
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-007
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                              (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING "電文情報判別処理エラー:"
                   "AIFA情報 = ["
                   AIFA-IN                OF  PARM-SMHR0110-ARG1
                   "]"
                   "共通ヘッダ = ["
                   HEADER-IN              OF  PARM-SMHR0110-ARG1
                   "]"
                   "上り電文 = ["
                   DATA-IN                OF  PARM-SMHR0110-ARG1
                   "]"
                   DELIMITED BY SIZE
                   INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
             END-IF
           ELSE
      *----------  ワーク電文情報.基準日TO ← ワーク処理実行日
             MOVE  WK-SYORI-YMD
               TO  I-KJN-TO-YMD         OF  WK-DENBUN-AREA
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日            =["
      D               WK-SYORI-YMD                            "]"
      D    DISPLAY  CNS-PGM-ID":ワーク電文情報.基準日TO     =["
      D               I-KJN-TO-YMD         OF  WK-DENBUN-AREA "]"
      *--------------------<DEBUG>--------------------------------------
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報判別処理 END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       CHK-DENBUN-EXT.
           EXIT.
      ******************************************************************
      *    メッセージを登録する
      ******************************************************************
       WARNING-MSG-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  メッセージを登録する  START  ***"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7080 START  ***"
      *--------------------<DEBUG>--------------------------------------
           CALL  "SCZY7080"             USING  PARM-SCZY7080-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7080 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY7080=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ＤＢコミット処理                                     20081010
             EXEC SQL                                                   20081010
                 COMMIT                                                 20081010
             END-EXEC                                                   20081010
      *--------------------<DEBUG>--------------------------------------20081010
      D    DISPLAY  CNS-PGM-ID":COMMIT SQLCODE=["SQLCODE"]"             20081010
      *-----------------------------------------------------------------20081010
             IF  SQLCODE = CNS-SQL-NORMAL                               20081010
             THEN                                                       20081010
      *--------------------<DEBUG>--------------------------------------20081010
      D    DISPLAY  CNS-PGM-ID":*** ＤＢコミット処理 正常! ***"         20081010
      *-----------------------------------------------------------------20081010
               CONTINUE                                                 20081010  20081030
             ELSE                                                       20081010
      *----------  エラー検知プログラム名                               20081010
                 MOVE  CNS-PGM-ID                                       20081010
                   TO  ERR-PGM-ID       OF  PARM-SCZY1170-ARG1          20081010
      *----------  ポジション                                           20081010
                 MOVE  CNS-POS-017                                      20081010
                   TO  ERR-POS          OF  PARM-SCZY1170-ARG1          20081010
      *----------  リターンコード                                       20081010
                 MOVE  CNS-RTN-900                                      20081010
                   TO  RTN-CD           OF  PARM-SCZY1170-ARG1          20081010
      *----------  詳細リターンコード                                   20081010
                 MOVE  SQLCODE                                          20081010
                   TO  DETAIL-RTN-CD    OF  PARM-SCZY1170-ARG1          20081010
      *----------  詳細リターンコードデコードフラグ                     20081010
                 MOVE  CNS-DETAIL-1                                     20081010
                   TO  DETAIL-RTN-CD-FLG                                20081010
                                        OF  PARM-SCZY1170-ARG1          20081010
      *---------- フリーメッセージ                                      20081010
                 STRING "ＤＢコミット処理 エラー"                       20081010
                      DELIMITED BY SIZE                                 20081010
                      INTO  FREE-MSG    OF  PARM-SCZY1170-ARG1          20081010
      *-------------------<DEBUG>---------------------------------------20081010
      D    DISPLAY  CNS-PGM-ID": *** ＤＢコミット処理 異常  ***"        20081010
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              20081010
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              20081010
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              20081010
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              20081010
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     20081010
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20081010
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              20081010
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20081010
      *-----------------------------------------------------------------20081010
      *----------  エラー処理                                           20081010
                 PERFORM  ERR-RTN                                       20081010
             END-IF                                                     20081010
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":メッセージを登録正常"
      *--------------------<DEBUG>--------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-008
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING "メッセージを登録エラー:"
                 "利用会社コード = ["
                 RIYO-CMP-CD            OF  PARM-SCZY7080-INOUT
                 "]"
                 DELIMITED BY SIZE
                 INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  メッセージを登録する  END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       WARNING-MSG-EXT.
           EXIT.
      ******************************************************************
      *    3) 電文情報転換処理
      ******************************************************************
       EXC-DENBUN-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報転換処理 START ***"
      D    DISPLAY  CNS-PGM-ID":SCZY7060取得した電文情報.基準日FROM=["
      D             I-KJN-FR-YMD        OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID"WK-GIPS-MODE=[" WK-GIPS-MODE "]"
      *--------------------<DEBUG>--------------------------------------
           IF  I-KJN-FR-YMD             OF  WK-DATA-IN = SPACE
             AND WK-GIPS-MODE NOT = CNS-X-1
           THEN
             MOVE  CNS-X-1              TO  WK-KJN-YMD-FROM-FLG
             MOVE  CNS-X-00010101
               TO  I-KJN-FR-YMD         OF  WK-DATA-IN
           ELSE
             MOVE  CNS-X-0              TO  WK-KJN-YMD-FROM-FLG
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク基準日FROM指定フラグ=["
      D             WK-KJN-YMD-FROM-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク電文情報.基準日FROM=["
      D             I-KJN-FR-YMD        OF  WK-DATA-IN"]"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-1                  TO  WK-IDX8
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX8=["WK-IDX8"]"
      D    DISPLAY  CNS-PGM-ID":FLG-GET=["FLG-GET"]"
      *--------------------<DEBUG>--------------------------------------
           PERFORM                  VARYING WK-IDX8 FROM CNS-1 BY CNS-1
             UNTIL  WK-IDX8 > CNS-10  OR  FLG-GET = CNS-1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX8=["WK-IDX8"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").証券種別コード=["
      D             I-SEC-SBT-CD        OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").銘柄通貨コード=["
      D             I-MEG-TUKA-CD       OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").発行体国コード=["
      D             I-HAKO-CD           OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").投資対象国コード=["
      D             I-TSTSK-CD          OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").外部銘柄コード=["
      D             I-GAIBU-MEG-CD      OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").株式種別=["
      D             I-KABU-SBT          OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").回=["
      D             I-KAYI              OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").号=["
      D             I-GOU               OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").限月=["
      D             I-GENGETSU          OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8")."
      D             "ストライクプライス=["
      D             I-STRIKEPRICE       OF WK-DATA-IN(WK-IDX8)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8").満期日=["
      D             I-MNK-YMD           OF WK-DATA-IN(WK-IDX8)"]"
      *--------------------<DEBUG>--------------------------------------
             IF  I-SEC-SBT-CD           OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-MEG-TUKA-CD     OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-HAKO-CD         OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-TSTSK-CD        OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-GAIBU-MEG-CD    OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-KABU-SBT        OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-KAYI            OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-GOU             OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-GENGETSU-X      OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-STRIKEPRICE-X   OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE OR I-MNK-YMD         OF WK-DATA-IN(WK-IDX8) NOT =
             SPACE
             THEN
               MOVE  CNS-1              TO  FLG-GET
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-GET=["FLG-GET"]"
      *--------------------<DEBUG>--------------------------------------
             ELSE
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX8")未指定"
      *--------------------<DEBUG>--------------------------------------
             END-IF
           END-PERFORM
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-GET=["FLG-GET"]"
      *--------------------<DEBUG>--------------------------------------
           IF  FLG-GET = CNS-0
           THEN
      *----------  ワーク銘柄指定ありフラグ← '1'(なし)
             MOVE  CNS-X-1              TO  WK-MEG-FLG
           ELSE
      *----------  ワーク銘柄指定ありフラグ← '2'(あり)
             MOVE  CNS-X-2              TO  WK-MEG-FLG
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク銘柄指定ありフラグ=["WK-MEG-FLG"]"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-1                  TO  WK-IDX9
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX9=["WK-IDX9"]"
      *--------------------<DEBUG>--------------------------------------
           PERFORM                  VARYING WK-IDX9 FROM CNS-1 BY CNS-1
             UNTIL  WK-IDX9 > CNS-10
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX9=["WK-IDX9"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX9").限月=["
      D             I-GENGETSU-X        OF WK-DATA-IN(WK-IDX9)"]"
      *--------------------<DEBUG>--------------------------------------
             IF  I-GENGETSU-X           OF WK-DATA-IN(WK-IDX9) = SPACE
             THEN
               MOVE  CNS-0
                 TO  I-GENGETSU         OF WK-DATA-IN(WK-IDX9)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX9").限月=["
      D             I-GENGETSU          OF WK-DATA-IN(WK-IDX9)"]"
      *--------------------<DEBUG>--------------------------------------
             ELSE
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7060取得した電文情報."
      D             "銘柄指定("WK-IDX9").限月 NOT = SPACE"
      *--------------------<DEBUG>--------------------------------------
             END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX9")."
      D             "ストライクプライス=["
      D             I-STRIKEPRICE-X     OF WK-DATA-IN(WK-IDX9)"]"
      *--------------------<DEBUG>--------------------------------------
             IF  I-STRIKEPRICE-X        OF WK-DATA-IN(WK-IDX9) = SPACE
             THEN
               MOVE  CNS-0
                 TO  I-STRIKEPRICE      OF WK-DATA-IN(WK-IDX9)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX9")."
      D             "ストライクプライス=["
      D             I-STRIKEPRICE       OF WK-DATA-IN(WK-IDX9)"]"
      *--------------------<DEBUG>--------------------------------------
             ELSE
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7060取得した電文情報."
      D             "銘柄指定("WK-IDX9").ストライクプライス NOT = SPACE"
      *--------------------<DEBUG>--------------------------------------
             END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX9").満期日=["
      D             I-MNK-YMD           OF WK-DATA-IN(WK-IDX9)"]"
      *--------------------<DEBUG>--------------------------------------
             IF  I-MNK-YMD              OF WK-DATA-IN(WK-IDX9) = SPACE
             THEN
               MOVE  CNS-X-00000000
                 TO  I-MNK-YMD          OF WK-DATA-IN(WK-IDX9)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄指定("WK-IDX9").満期日=["
      D             I-MNK-YMD           OF WK-DATA-IN(WK-IDX9)"]"
      *--------------------<DEBUG>--------------------------------------
             ELSE
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7060取得した電文情報."
      D             "銘柄指定("WK-IDX9").満期日 NOT = SPACE"
      *--------------------<DEBUG>--------------------------------------
             END-IF
           END-PERFORM
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報転換処理  END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       EXC-DENBUN-EXT.
           EXIT.
      ******************************************************************
      *    4) 電文より、プォートフォリオの展開
      ******************************************************************
       GET-PTF-RTN            SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文より、プォートフォリオの展開"
      D             " START ***"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード = " WK-GIPS-MODE
      *--------------------<DEBUG>--------------------------------------
           IF  WK-GIPS-MODE = CNS-X-1
           THEN
      *----------  4.1)ＧＩＰＳモード起動
               PERFORM  GIPS-MODE-RTN
           ELSE
      *----------  4.2)非ＧＩＰＳモード起動
               PERFORM  NOT-GIPS-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文より、プォートフォリオの展開"
      D             " END ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       GET-PTF-EXT.
           EXIT.
      ******************************************************************
      *    4.1) ＧＩＰＳモード起動
      ******************************************************************
       GIPS-MODE-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＧＩＰＳモード起動 START ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  排他ロック処理
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  排他ロック処理 START ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  SQLSTMT
                       WK-SELECT-SQL-TKDY-1
                       H-SQL-SELECT-1
      *----------  再処理要制御TBL
           MOVE  WK-TAB-TKDYGP17
             TO  WK-TBL-TKDYGP17        OF  WK-SELECT-SQL-TKDY-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD-S        OF  H-SQL-SELECT-1
           MOVE  WK-SELECT-SQL-TKDY-1   TO  SQLSTMT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":再処理要制御TBL=["
      D                 WK-TBL-TKDYGP17  OF  WK-SELECT-SQL-TKDY-1"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-S=["
      D                    H-RIYO-CMP-CD-S  OF  H-SQL-SELECT-1"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"
      *--------------------<DEBUG>--------------------------------------
           EXEC  SQL
             PREPARE  S17  FROM  :SQLSTMT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(PREPARE)=[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID": PREPARE end= ["
      D           FUNCTION CURRENT-DATE(1:16)"]"
      *--------------------<DEBUG>--------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "PREPARE 正常"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-039
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING SQLSTMT(1:FUNCTION  LENGTH(WK-SELECT-SQL-TKDY-1))
                    "[:V18="
                     H-RIYO-CMP-CD-S OF  H-SQL-SELECT-1
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID": EXECUTE start= ["
      D            FUNCTION CURRENT-DATE(1:16)"]"
      *--------------------<DEBUG>--------------------------------------
           EXEC  SQL
             EXECUTE S17
             USING
             :H-SQL-SELECT-1.H-RIYO-CMP-CD-S
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE=[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID": EXECUTE end= ["
      D           FUNCTION CURRENT-DATE(1:16)"]"
      *--------------------<DEBUG>--------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "EXECUTE 正常"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-024
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING SQLSTMT(1:FUNCTION  LENGTH(WK-SELECT-SQL-TKDY-1))
                    "[:V18="
                     H-RIYO-CMP-CD-S OF  H-SQL-SELECT-1
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *----------  再処理要制御テーブルを更新
           INITIALIZE  SQLSTMT
                       WK-UPDATE-SQL-TKDY-2
                       H-SQL-UPDATE-1
      *----------  再処理要制御TBL
           MOVE  WK-TAB-TKDYGP17
             TO  WK-TBL-TKDYGP17        OF  WK-UPDATE-SQL-TKDY-2
      *----------  業務タスクＩＤ
           MOVE  WK-GYOMU-TASK-ID-IN
             TO  H-GYOMU-TASK-ID        OF  H-SQL-UPDATE-1
      *----------  更新ログインユーザ会社コード
           MOVE  COMPANY-CODE           OF  WK-AIFA-IN
             TO  H-UPD-LOGIN-CMP-CD     OF  H-SQL-UPDATE-1
      *----------  更新ユーザＩＤ
           MOVE  JOB-USER-ID            OF  WK-AIFA-IN
             TO  H-UPD-SID              OF  H-SQL-UPDATE-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD-U        OF  H-SQL-UPDATE-1
           MOVE  WK-UPDATE-SQL-TKDY-2   TO  SQLSTMT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":再処理要制御TBL=["
      D                 WK-TBL-TKDYGP17  OF  WK-UPDATE-SQL-TKDY-2"]"
      D    DISPLAY  CNS-PGM-ID":H-GYOMU-TASK-ID=["
      D                       H-GYOMU-TASK-ID  OF  H-SQL-UPDATE-1"]"
      D    DISPLAY  CNS-PGM-ID":H-UPD-LOGIN-CMP-CD=["
      D                    H-UPD-LOGIN-CMP-CD  OF  H-SQL-UPDATE-1"]"
      D    DISPLAY  CNS-PGM-ID":H-UPD-SID=["
      D                             H-UPD-SID  OF  H-SQL-UPDATE-1"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-U=["
      D                       H-RIYO-CMP-CD-U  OF  H-SQL-UPDATE-1"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"
      *--------------------<DEBUG>--------------------------------------
           EXEC  SQL
             PREPARE  SU17  FROM  :SQLSTMT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(PREPARE)=[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID": PREPARE end= ["
      D           FUNCTION CURRENT-DATE(1:16)"]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "再処理要制御テーブルを更新 正常"
      *-----------------------------------------------------------------
                 CONTINUE
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "再処理要制御テーブルを更新 NOTFOUND"
      *-----------------------------------------------------------------
                 PERFORM  END-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-040
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING SQLSTMT(1:FUNCTION  LENGTH(WK-UPDATE-SQL-TKDY-2))
                    "[:V19="
                     H-GYOMU-TASK-ID     OF  H-SQL-UPDATE-1
                    "][:V20="
                     H-UPD-LOGIN-CMP-CD  OF  H-SQL-UPDATE-1
                    "][:V21="
                     H-UPD-SID           OF  H-SQL-UPDATE-1
                    "][:V22="
                     H-RIYO-CMP-CD-U     OF  H-SQL-UPDATE-1
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID": EXECUTE start= ["
      D            FUNCTION CURRENT-DATE(1:16)"]"
      *--------------------<DEBUG>--------------------------------------
           EXEC  SQL
             EXECUTE SU17
             USING
             :H-SQL-UPDATE-1.H-GYOMU-TASK-ID,
             :H-SQL-UPDATE-1.H-UPD-LOGIN-CMP-CD,
             :H-SQL-UPDATE-1.H-UPD-SID,
             :H-SQL-UPDATE-1.H-RIYO-CMP-CD-U
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE=[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID": EXECUTE end= ["
      D           FUNCTION CURRENT-DATE(1:16)"]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "再処理要制御テーブルを更新 正常"
      *-----------------------------------------------------------------
                 CONTINUE
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "再処理要制御テーブルを更新 NOTFOUND"
      *-----------------------------------------------------------------
                 PERFORM  END-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING SQLSTMT(1:FUNCTION  LENGTH(WK-UPDATE-SQL-TKDY-2))
                    "[:V19="
                     H-GYOMU-TASK-ID     OF  H-SQL-UPDATE-1
                    "][:V20="
                     H-UPD-LOGIN-CMP-CD  OF  H-SQL-UPDATE-1
                    "][:V21="
                     H-UPD-SID           OF  H-SQL-UPDATE-1
                    "][:V22="
                     H-RIYO-CMP-CD-U     OF  H-SQL-UPDATE-1
                    "]"
                    DELIMITED BY SIZE
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  排他ロック処理 END ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  SQL文発行、カーソルCR1を作成
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL文発行、カーソルCR1を作成 START"
      D                       " ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  SQLSTMT
                       WK-SELECT-SQL-TKDY
                       FLG-CR1-OPEN
      *----------  再処理要ポートフォリオ一覧（時価）TBL
           MOVE  WK-TAB-TKDYGP09        TO  WK-TBL-TKDYGP09
      *----------  再処理要ポートフォリオ一覧（為替）
           MOVE  WK-TAB-TKDYGP10        TO  WK-TBL-TKDYGP10
      *----------  再処理要ポートフォリオ一覧（取引）
           MOVE  WK-TAB-TKDYGP12        TO  WK-TBL-TKDYGP12
      *----------  再処理要ポートフォリオ一覧（補正）
           MOVE  WK-TAB-TKDYGP13        TO  WK-TBL-TKDYGP13
      *----------  再処理要ポートフォリオ一覧（銘柄属性）
           MOVE  WK-TAB-TKDYGP16        TO  WK-TBL-TKDYGP16
           MOVE  WK-SELECT-SQL-TKDY     TO  SQLSTMT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":再処理要ポートフォリオ一覧（時価）TBL=["
      D                         WK-TBL-TKDYGP09"]"
      D    DISPLAY  CNS-PGM-ID":再処理要ポートフォリオ一覧（為替）TBL=["
      D                         WK-TBL-TKDYGP10"]"
      D    DISPLAY  CNS-PGM-ID":再処理要ポートフォリオ一覧（取引）TBL=["
      D                         WK-TBL-TKDYGP12"]"
      D    DISPLAY  CNS-PGM-ID":再処理要ポートフォリオ一覧（補正）TBL=["
      D                         WK-TBL-TKDYGP13"]"
      D    DISPLAY  CNS-PGM-ID":再処理要ポートフォリオ一覧（銘柄属性）"
      D                       "TBL=["WK-TBL-TKDYGP16"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"
      *--------------------<DEBUG>--------------------------------------
           EXEC  SQL
             PREPARE  SA  FROM  :SQLSTMT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "PREPARE 正常"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-026
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING SQLSTMT(1:FUNCTION  LENGTH(WK-SELECT-SQL-TKDY))
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL文発行、カーソルCR1を作成 END"
      D                       " ***"
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCR1をオープン"
      D             "(DECLARE，OPEN)  START  ***"
      *-----------------------------------------------------------------
      *----------DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR1  CURSOR  FOR  SA
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------OPEN    CURSOR
           EXEC  SQL
             OPEN  CR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR1-OPEN=["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
             WHEN   OTHER
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-027
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING SQLSTMT(1:FUNCTION  LENGTH(WK-SELECT-SQL-TKDY))
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引実績データ保存断面を取得"
      D             "(DECLARE，OPEN)  END  ***"
      *-----------------------------------------------------------------
      *----------  カーソルCR1フェッチ
             INITIALIZE      WK-HIT-KENSUU
             PERFORM  UNTIL  FLG-CR1-OPEN = CNS-OFF
               PERFORM  CR1-FETCH-RTN
             END-PERFORM
      *----------  カーソルCR1クロース処理
             PERFORM  CR1-CLOSE-RTN
      *----------  利用権限があるポートフォリオが0個の場合、
      *----------  エラーメッセージ'E000217'の出力処理を追加する。
             PERFORM  MSG-OUT-RTN
      *----------  実行状況管理明細インサート処理
             PERFORM  VARYING  WK-IDX12  FROM  CNS-1  BY  CNS-1
                   UNTIL  WK-IDX12  >  WK-HIT-KENSUU
               PERFORM  INS-MANAGE-RTN
             END-PERFORM
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＧＩＰＳモード起動  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GIPS-MODE-EXT.
           EXIT.
      ******************************************************************
      *    カーソルCR1フェッチ
      ******************************************************************
       CR1-FETCH-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カーソルCR1フェッチ  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-SQL-FETCH
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH CR1
              INTO :H-SQL-FETCH.H-FUND-CD,
                   :H-SQL-FETCH.H-PTF-CD,
                   :H-SQL-FETCH.H-HYK-KRTU-CD,
                   :H-SQL-FETCH.H-CALC-KKN-FROM,
                   :H-SQL-FETCH.H-CALC-KKN-TO
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR FETCH)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常の場合
             WHEN  CNS-SQL-NORMAL
      *----------  業務グループコード
                 MOVE  GYOUMU-GROUP-CODE  OF  WK-HEADER-IN
                   TO  GYOMU-GRP-CD       OF  PARM-SCZY1130-INOUT
      *----------  利用会社コード
                 MOVE  WK-RIYO-CMP-CD
                   TO  RIYO-CMP-CD        OF  PARM-SCZY1130-INOUT
      *----------  ログインユーザ会社コード
                 MOVE  COMPANY-CODE       OF  WK-AIFA-IN                20100722
                   TO  LOGIN-CMP-CD       OF  PARM-SCZY1130-INOUT
      *----------  メニューID
                 MOVE  SPACE
                   TO  MENU-ID            OF  PARM-SCZY1130-INOUT
      *----------  実行処理ID
                 MOVE  SPACE
                   TO  JIKOU-SYORI-ID     OF  PARM-SCZY1130-INOUT
      *----------  ファンドコード
                 MOVE  H-FUND-CD          OF  H-SQL-FETCH
                   TO  FUND-CD            OF  PARM-SCZY1130-INOUT
      *----------  ポートフォリオコード
                 MOVE  H-PTF-CD           OF  H-SQL-FETCH
                   TO  PTF-CD             OF  PARM-SCZY1130-INOUT
      *----------  予備
                 MOVE  SPACE
                   TO  YOBI               OF  PARM-SCZY1130-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1130-ARG1:"
      D    DISPLAY  CNS-PGM-ID":業務グループコード=["
      D             GYOMU-GRP-CD        OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ログインユーザ会社コード=["
      D             LOGIN-CMP-CD        OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":メニューID=["
      D             MENU-ID             OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":実行処理ID=["
      D             JIKOU-SYORI-ID      OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備=["YOBI  OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1130 START  ***"
      *-----------------------------------------------------------------
                 CALL  "SCZY1130"       USING  PARM-SCZY1130-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1130 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD       OF PARM-SCZY1130-RTNPKG=["
      D             RTN-CD                   OF PARM-RTNPKG
      D                             (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *-----------------------------------------------------------------
                 EVALUATE  RTN-CD  OF  PARM-RTNPKG
                                      (COUNTER OF PARM-RTNPKG)
      *----------  正常の場合（権限有）
                   WHEN  CNS-RTN-000
                       COMPUTE  WK-HIT-KENSUU  =  WK-HIT-KENSUU + CNS-1
                       IF    WK-HIT-KENSUU < WK-MAX-KENSUU
                         OR  WK-HIT-KENSUU = WK-MAX-KENSUU
                       THEN
      *----------  ファンドコード
                         MOVE  H-FUND-CD      OF  H-SQL-FETCH
                           TO  WK-FUND-CD-GP(WK-HIT-KENSUU)
      *----------  ポートフォリオコード
                         MOVE  H-PTF-CD       OF  H-SQL-FETCH
                           TO  WK-PTF-CD-GP(WK-HIT-KENSUU)
      *----------  評価系列コード
                         MOVE  H-HYK-KRTU-CD  OF  H-SQL-FETCH
                           TO  WK-DEFAUL-THYK-CD-GP(WK-HIT-KENSUU)
      *----------  基準日From
                         MOVE  H-CALC-KKN-FROM  OF  H-SQL-FETCH
                           TO  WK-EXPR-YMD-FROM-GP(WK-HIT-KENSUU)
      *----------  基準日To
                         MOVE  H-CALC-KKN-TO  OF  H-SQL-FETCH
                           TO  WK-EXPR-YMD-TO-GP(WK-HIT-KENSUU)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSUU=["WK-HIT-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":WK-FUND-CD-GP(WK-HIT-KENSUU)=["
      D                         WK-FUND-CD-GP(WK-HIT-KENSUU)"]"
      D    DISPLAY  CNS-PGM-ID":WK-PTF-CD-GP(WK-HIT-KENSUU)=["
      D                         WK-PTF-CD-GP(WK-HIT-KENSUU)"]"
      D    DISPLAY  CNS-PGM-ID":WK-DEFAUL-THYK-CD-GP(WK-HIT-KENSUU)=["
      D                         WK-DEFAUL-THYK-CD-GP(WK-HIT-KENSUU)"]"
      D    DISPLAY  CNS-PGM-ID":WK-EXPR-YMD-FROM-GP(WK-HIT-KENSUU) =["
      D                         WK-EXPR-YMD-FROM-GP(WK-HIT-KENSUU)"]"
      D    DISPLAY  CNS-PGM-ID":WK-EXPR-YMD-TO-GP(WK-HIT-KENSUU)=["
      D                         WK-EXPR-YMD-TO-GP(WK-HIT-KENSUU)"]"
      *--------------------<DEBUG>--------------------------------------
                       ELSE
      *----------  ヒット件数　←　WK-MAX-件数
                         MOVE  WK-MAX-KENSUU  TO  WK-HIT-KENSUU
      *----------  ワークリターンコード比較値 ← 2 (警告)
                         MOVE  CNS-2          TO  WK-RTN-CD-COM
      *----------  ワーク引継リターンコード ← 2 (警告)
                         MOVE  CNS-X-002      TO  WK-SUCCE-R-CD
      *----------  ワークメッセージID ← W000309：ポートフォリオ別データ抽出件数超過50000件
                         MOVE  CNS-X-W000309  TO  WK-MSG-ID
      *----------  ワーク置換文字 ← スペース
                         MOVE  SPACE          TO  WK-TIKAN-MOJI
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSUU=["WK-HIT-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM=["WK-RTN-CD-COM"]"
      D    DISPLAY  CNS-PGM-ID":WK-SUCCE-R-CD=["WK-SUCCE-R-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID    =["WK-MSG-ID"]"
      D    DISPLAY  CNS-PGM-ID":WK-TIKAN-MOJI=["WK-TIKAN-MOJI"]"
      *--------------------<DEBUG>--------------------------------------
      *---------- メッセージを登録する
                         INITIALIZE  PARM-SCZY7080-INOUT
                                     PARM-RTNPKG
      *---------- 利用会社コード
                         MOVE  WK-RIYO-CMP-CD
                           TO  RIYO-CMP-CD      OF  PARM-SCZY7080-INOUT
      *---------- 処理実行日
                         MOVE  WK-SYORI-YMD
                           TO  SYORI-YMD        OF  PARM-SCZY7080-INOUT
      *---------- 起動ID
                         MOVE  WK-KIDOU-ID
                           TO  KIDOU-ID         OF  PARM-SCZY7080-INOUT
      *---------- 業務タスクID
                         MOVE  WK-GYOMU-TASK-ID-IN
                           TO  GYOMU-TASK-ID    OF  PARM-SCZY7080-INOUT
      *---------- ファンドコード
                         MOVE  H-FUND-CD        OF  H-SQL-FETCH
                           TO  FUND-CD
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- ポートフォリオコード
                         MOVE  H-PTF-CD         OF  H-SQL-FETCH
                           TO  PTF-CD
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- 評価系列コード
                         MOVE  H-HYK-KRTU-CD    OF  H-SQL-FETCH
                           TO  HYK-KRTU-CD
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- 基準日From
                         MOVE  H-CALC-KKN-FROM  OF  H-SQL-FETCH
                           TO  KJN-YMD-FROM
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- 基準日To
                         MOVE  H-CALC-KKN-TO    OF  H-SQL-FETCH
                           TO  KJN-YMD-TO
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- メッセージID
                         MOVE  WK-MSG-ID
                           TO  MSG-ID
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  置換文字
                         MOVE  WK-TIKAN-MOJI
                           TO  TIKAN-MOJI
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード     =[" FUND-CD
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=[" PTF-CD
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード     =[" HYK-KRTU-CD
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日From         =[" KJN-YMD-FROM
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日To           =[" KJN-YMD-TO
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":メッセージID       =[" MSG-ID
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":置換文字           =[" TIKAN-MOJI
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      *--------------------<DEBUG>--------------------------------------
                         PERFORM  WARNING-MSG-RTN
      *----------  カーソルCR1クロース処理
                         MOVE  CNS-OFF        TO  FLG-CR1-OPEN
                       END-IF
      *----------  リターンコード＝'130'(権限なし)の場合
                   WHEN  CNS-RTN-130
      *----------  ワークリターンコード比較値 ← 4 （業務エラー（続行可能））
                         MOVE  CNS-4          TO  WK-RTN-CD-COM
      *----------  ワーク引継リターンコード ← 4 （業務エラー（続行可能））
                         MOVE  CNS-X-004      TO  WK-SUCCE-R-CD
      *----------  ワークメッセージID ← E000534：利用権限のないポートフォリオは処理しませんでした
                         MOVE  CNS-X-E000534  TO  WK-MSG-ID
      *----------  ワーク置換文字 ← スペース
                         MOVE  SPACE          TO  WK-TIKAN-MOJI
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSUU=["WK-HIT-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM=["WK-RTN-CD-COM"]"
      D    DISPLAY  CNS-PGM-ID":WK-SUCCE-R-CD=["WK-SUCCE-R-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID    =["WK-MSG-ID"]"
      D    DISPLAY  CNS-PGM-ID":WK-TIKAN-MOJI=["WK-TIKAN-MOJI"]"
      *--------------------<DEBUG>--------------------------------------
      *---------- SCZY7080
      *---------- メッセージを登録する
                         INITIALIZE  PARM-SCZY7080-INOUT
                                     PARM-RTNPKG
      *---------- 利用会社コード
                         MOVE  WK-RIYO-CMP-CD
                           TO  RIYO-CMP-CD      OF  PARM-SCZY7080-INOUT
      *---------- 処理実行日
                         MOVE  WK-SYORI-YMD
                           TO  SYORI-YMD        OF  PARM-SCZY7080-INOUT
      *---------- 起動ID
                         MOVE  WK-KIDOU-ID
                           TO  KIDOU-ID         OF  PARM-SCZY7080-INOUT
      *---------- 業務タスクID
                         MOVE  WK-GYOMU-TASK-ID-IN
                           TO  GYOMU-TASK-ID    OF  PARM-SCZY7080-INOUT
      *---------- ファンドコード
                         MOVE  H-FUND-CD        OF  H-SQL-FETCH
                           TO  FUND-CD
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- ポートフォリオコード
                         MOVE  H-PTF-CD         OF  H-SQL-FETCH
                           TO  PTF-CD
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- 評価系列コード
                         MOVE  H-HYK-KRTU-CD    OF  H-SQL-FETCH
                           TO  HYK-KRTU-CD
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- 基準日From
                         MOVE  H-CALC-KKN-FROM  OF  H-SQL-FETCH
                           TO  KJN-YMD-FROM
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *---------- 基準日To
                         MOVE  H-CALC-KKN-TO    OF  H-SQL-FETCH
                           TO  KJN-YMD-TO
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  メッセージID
                         MOVE  WK-MSG-ID
                           TO  MSG-ID
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  置換文字
                         MOVE  WK-TIKAN-MOJI
                           TO  TIKAN-MOJI
                           OF  PARM-SCZY7080-ARG2(CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード     =[" FUND-CD
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=[" PTF-CD
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード     =[" HYK-KRTU-CD
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日From         =[" KJN-YMD-FROM
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日To           =[" KJN-YMD-TO
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":メッセージID       =[" MSG-ID
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":置換文字           =[" TIKAN-MOJI
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      *--------------------<DEBUG>--------------------------------------
                         PERFORM  WARNING-MSG-RTN
      *----------  SCZY7110
      *----------  ＡＩＦＡ共通ヘッダ
                         MOVE  WK-AIFA-IN     OF  WK-DENBUN-AREA
                           TO  PARM-WOMCMAIFA-ARG
                           OF  PARM-AIFA-HEADER
                         MOVE  WK-HEADER-IN   OF  WK-DENBUN-AREA
                           TO  PARM-CZCOMMONHEADER-ARG
                                              OF  PARM-AIFA-HEADER
      *----------  システム処理ID
                         MOVE  MENU-ID        OF  WK-DATA-IN
                           TO  SYS-SYORI-ID   OF  PARM-SCZY7110-INOUT
      *----------  起動ID
                         MOVE  SPACE
                           TO  KIDOU-ID       OF  PARM-SCZY7110-INOUT
      *----------  画面アクション区分
                         MOVE  CNS-X-9
                           TO  GAMEN-ACT-KBN  OF  PARM-SCZY7110-INOUT
      *----------  正常エラー区分
                         MOVE  CNS-X-07
                           TO  NML-ERR-KBN    OF  PARM-SCZY7110-INOUT
      *----------  課金用検索区分
                         MOVE  ZERO
                           TO  EE-SEARCH-KBN  OF  PARM-SCZY7110-INOUT
      *----------  基準年月日1
                         MOVE  H-CALC-KKN-FROM
                           OF  H-SQL-FETCH
                           TO  KIJUN-YMD1     OF  PARM-SCZY7110-INOUT
      *----------  基準年月日2
                         MOVE  H-CALC-KKN-TO  OF  H-SQL-FETCH
                           TO  KIJUN-YMD2     OF  PARM-SCZY7110-INOUT
      *----------  委託会社コード
                         MOVE  SPACE
                           TO  ITK-CMP-CD     OF  PARM-SCZY7110-INOUT
      *----------  ファンドコード
                         MOVE  SPACE
                           TO  FND-CD         OF  PARM-SCZY7110-INOUT
      *----------  銘柄コード
                         MOVE  SPACE
                           TO  MEG-CD         OF  PARM-SCZY7110-INOUT
      *----------  データ特定用ID
                         MOVE  WK-GYOMU-TASK-ID-IN
                           TO  DATA-ID        OF  PARM-SCZY7110-INOUT
      *----------  TXRX利用区分
                         MOVE  WK-HEADER-IN(CNS-267:CNS-1)
                           TO  TXRX-KBN       OF  PARM-SCZY7110-INOUT
      *----------  RXファンドコード
                         MOVE  H-FUND-CD      OF  H-SQL-FETCH
                           TO  FUND-CD        OF  PARM-SCZY7110-INOUT
      *----------  RXポートフォリオコード
                         MOVE  H-PTF-CD       OF  H-SQL-FETCH
                           TO  PTF-CD         OF  PARM-SCZY7110-INOUT
      *----------  電文ID
                         MOVE  SPACE
                           TO  DENBUN-ID      OF  PARM-SCZY7110-INOUT
      *----------  入力電文
                         MOVE  SPACE
                           TO  IN-DENBUN      OF  PARM-SCZY7110-INOUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":システム処理ID     =[" SYS-SYORI-ID
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":画面アクション区分 =[" GAMEN-ACT-KBN
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":正常エラー区分     =[" NML-ERR-KBN
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":課金用検索区分     =[" EE-SEARCH-KBN
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":基準年月日1        =[" KIJUN-YMD1
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":基準年月日2        =[" KIJUN-YMD2
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":委託会社コード     =[" ITK-CMP-CD
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード     =[" FND-CD
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード         =[" MEG-CD
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":データ特定用ID     =[" DATA-ID
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":TXRX利用区分       =[" TXRX-KBN
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":RXファンドコード   =[" FUND-CD
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":RXポートフォリオコード=[" PTF-CD
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":電文ID             =[" DENBUN-ID
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":入力電文           =[" IN-DENBUN
      D                                 OF  PARM-SCZY7110-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7110 START ***"
      *--------------------<DEBUG>--------------------------------------
                         CALL   "SCZY7110"   USING  PARM-AIFA-HEADER
                                                    PARM-SCZY7110-INOUT
                                                    PARM-RTNPKG
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7110 END ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7110)=["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
                         IF  RTN-CD OF PARM-RTNPKG
                                      (COUNTER OF PARM-RTNPKG)
                          =  CNS-RTN-000
                         THEN
                             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7110 正常"
      *--------------------<DEBUG>--------------------------------------
                         ELSE
      *----------  エラー検知プログラム名
                           MOVE  CNS-PGM-ID
                             TO  ERR-PGM-ID      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                           MOVE  CNS-POS-028
                             TO  ERR-POS         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                           MOVE  CNS-RTN-901
                             TO  RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                           MOVE  RTN-CD
                             OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                             TO  DETAIL-RTN-CD   OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                           MOVE  DETAIL-RTN-CD-FLG
                             OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                             TO  DETAIL-RTN-CD-FLG
                             OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                           MOVE  FREE-MSG        OF  PARM-RTNPKG
                                               (COUNTER OF PARM-RTNPKG)
                             TO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
                           PERFORM  ERR-RTN
                         END-IF
      *----------  上記以外の場合
                   WHEN  OTHER
      *----------  エラー検知プログラム名
                       MOVE  CNS-PGM-ID
                         TO  ERR-PGM-ID     OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                       MOVE  CNS-POS-029
                         TO  ERR-POS        OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                       MOVE  CNS-RTN-901
                         TO  RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                       MOVE  RTN-CD         OF  PARM-RTNPKG
                                               (COUNTER OF PARM-RTNPKG)
                         TO  DETAIL-RTN-CD  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                       MOVE  DETAIL-RTN-CD-FLG
                         OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                         TO  DETAIL-RTN-CD-FLG
                         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                       MOVE  FREE-MSG       OF  PARM-RTNPKG
                                               (COUNTER OF PARM-RTNPKG)
                         TO  FREE-MSG       OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
                       PERFORM  ERR-RTN
                 END-EVALUATE
           WHEN  CNS-SQL-NOTFOUND
      *----------  カーソルCR1クロース処理
               MOVE  CNS-OFF        TO  FLG-CR1-OPEN
           WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID     OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-030
                 TO  ERR-POS        OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG
                 OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING SQLSTMT(1:FUNCTION  LENGTH(WK-SELECT-SQL-TKDY))
                    DELIMITED BY SIZE
                    INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カーソルCR1フェッチ  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR1-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    カーソルCR1クロース処理
      ******************************************************************
       CR1-CLOSE-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カーソルCR1クロース処理  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR CLOSE)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR1-OPEN =["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID     OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-031
               TO  ERR-POS        OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG
               OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING SQLSTMT(1:FUNCTION  LENGTH(WK-SELECT-SQL-TKDY))
                  DELIMITED BY SIZE
                  INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カーソルCR1クロース処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR1-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    エラーメッセージの出力処理を追加処理
      ******************************************************************
       MSG-OUT-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**エラーメッセージの出力処理 START  ***"
      D    DISPLAY  CNS-PGM-ID":ヒット件数=["WK-HIT-KENSUU"]"
      *--------------------<DEBUG>--------------------------------------
               IF  WK-HIT-KENSUU  =  ZERO
               THEN
      *----------ワークリターンコード比較値 ← 8 (業務エラー（続行不可))
                 MOVE  CNS-8              TO  WK-RTN-CD-COM
      *----------  ワークメッセージID ← E000217：$項目$が取得できません
                 MOVE  CNS-MSG-E000217    TO  WK-MSG-ID
      *----------  ワーク置換文字 ← ポートフォリオ有効期間
                 MOVE  CNS-PTF-LIST       TO  WK-TIKAN-MOJI
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM=["WK-RTN-CD-COM"]"
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID    =["WK-MSG-ID"]"
      D    DISPLAY  CNS-PGM-ID":WK-TIKAN-MOJI=["WK-TIKAN-MOJI"]"
      *--------------------<DEBUG>--------------------------------------
      *---------- メッセージを登録する
                 INITIALIZE  PARM-SCZY7080-INOUT
                             PARM-RTNPKG
      *---------- 利用会社コード
                 MOVE  WK-RIYO-CMP-CD
                   TO  RIYO-CMP-CD      OF  PARM-SCZY7080-INOUT
      *---------- 処理実行日
                 MOVE  WK-SYORI-YMD
                   TO  SYORI-YMD        OF  PARM-SCZY7080-INOUT
      *---------- 起動ID
                 MOVE  WK-KIDOU-ID
                   TO  KIDOU-ID         OF  PARM-SCZY7080-INOUT
      *---------- 業務タスクID
                 MOVE  WK-GYOMU-TASK-ID-IN
                   TO  GYOMU-TASK-ID    OF  PARM-SCZY7080-INOUT
      *----------  メッセージID
                 MOVE  WK-MSG-ID
                   TO  MSG-ID           OF  PARM-SCZY7080-ARG2(CNS-1)
      *----------  置換文字
                 MOVE  WK-TIKAN-MOJI
                   TO  TIKAN-MOJI       OF  PARM-SCZY7080-ARG2(CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID
      D                                 OF  PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":メッセージID       =[" MSG-ID
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":置換文字           =[" TIKAN-MOJI
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      *--------------------<DEBUG>--------------------------------------
                 PERFORM  WARNING-MSG-RTN
      *----------  ワーニング更新
                 PERFORM  WRN-UPD-RTN
      *----------  3.3.後処理
                 PERFORM  END-RTN
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**エラーメッセージの出力処理 END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       MSG-OUT-EXT.
           EXIT.
      ******************************************************************
      *    非ＧＩＰＳモード起動
      ******************************************************************
       NOT-GIPS-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 非ＧＩＰＳモード起動  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-AIFA-HEADER
                       PARM-SCZY4033-INOUT                              20081224
                       PARM-RTNPKG
                       WK-IDX
                       WK-IDX1
                       WK-IDX2
                       WK-IDX3
                       WK-IDX4
      *----------  ＡＩＦＡ共通ヘッダ
           MOVE  WK-AIFA-IN             OF  WK-DENBUN-AREA
             TO  PARM-WOMCMAIFA-ARG     OF  PARM-AIFA-HEADER
           MOVE  WK-HEADER-IN           OF  WK-DENBUN-AREA
             TO  PARM-CZCOMMONHEADER-ARG
                                        OF  PARM-AIFA-HEADER
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-COMPANY-CODE      OF  PARM-SCZY4033-ARG1          20081224
      *----------  オール指定1
           IF  I-PTF-SYORI-KBN          OF  WK-DATA-IN  =  CNS-X-1
           THEN
             MOVE  CNS-X-2
               TO  ALL-SITEI-1          OF  PARM-SCZY4033-ARG1          20081224
           ELSE
             MOVE  CNS-X-1
               TO  ALL-SITEI-1          OF  PARM-SCZY4033-ARG1          20081224
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX=["WK-IDX"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ区分=["
      D             I-PTF-SYORI-KBN     OF  WK-DATA-IN  "]"
      *--------------------<DEBUG>--------------------------------------
           IF  I-PTF-SYORI-KBN          OF  WK-DATA-IN
            =  CNS-X-1
           THEN
             PERFORM                VARYING  WK-IDX FROM CNS-1 BY CNS-1
               UNTIL  WK-IDX  >  CNS-10                                 20081224
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX=["WK-IDX"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ区分("WK-IDX")=["
      D             I-FUND-PTF-KBN      OF  I-FUND-PTF-GRP
      D                                 OF  WK-DATA-IN(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":グループ又はファンドコード("WK-IDX")=[" 20081224
      D             I-FUND-CD           OF  WK-DATA-IN(WK-IDX)"]"       20081224
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード("WK-IDX")=["       20081224
      D             I-PTF-CD            OF  WK-DATA-IN(WK-IDX)"]"       20081224
      *--------------------<DEBUG>--------------------------------------
               MOVE  I-FUND-PTF-KBN     OF  I-FUND-PTF-GRP              20081224
                                        OF  WK-DATA-IN(WK-IDX)          20081224
                 TO  PTF-KBN            OF  PARM-SCZY4033-ARG1(WK-IDX)  20081224
               MOVE  I-FUND-CD          OF  I-FUND-PTF-GRP              20081224
                                        OF  WK-DATA-IN(WK-IDX)          20081224
                 TO  GRP-FUND-CD        OF  PARM-SCZY4033-ARG1(WK-IDX)  20081224
               MOVE  I-PTF-CD           OF  I-FUND-PTF-GRP              20081224
                                        OF  WK-DATA-IN(WK-IDX)          20081224
                 TO  PTF-CD             OF  PARM-SCZY4033-ARG1(WK-IDX)  20081224
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID                                          20081224
      D             ":ポートフォリオ区分(SCZY4033)("WK-IDX")=["         20081224
      D             PTF-KBN             OF PARM-SCZY4033-ARG1(WK-IDX)"]"20081224
      D    DISPLAY  CNS-PGM-ID                                          20081224
      D             ":グループ又はファンドコード(SCZY4033)("WK-IDX")=[" 20081224
      D             GRP-FUND-CD         OF PARM-SCZY4033-ARG1(WK-IDX)"]"20081224
      D    DISPLAY  CNS-PGM-ID                                          20081224
      D             ":ポートフォリオコード(SCZY4033)("WK-IDX")=["       20081224
      D             PTF-CD              OF PARM-SCZY4033-ARG1(WK-IDX)"]"20081224
      *--------------------<DEBUG>--------------------------------------
             END-PERFORM
           ELSE
            MOVE  SPACE                                                 20081224
              TO  PTF-FUND-LIST    OF  PARM-SCZY4033-ARG1               20081224
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ選択リスト=["             20081224
      D             PTF-FUND-LIST    OF  PARM-SCZY4033-ARG1"]"          20081224
      *--------------------<DEBUG>--------------------------------------
           END-IF
      *----------  オール指定2
           IF  I-HYK-SYORI-KBN          OF  WK-DATA-IN  =  CNS-X-1
           THEN
             MOVE  CNS-X-3
               TO  ALL-SITEI-2          OF  PARM-SCZY4033-ARG1          20081224
           ELSE
             MOVE  CNS-X-1
               TO  ALL-SITEI-2          OF  PARM-SCZY4033-ARG1          20081224
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":SCZY7060より取得上電文．評価系列選択区分=["
      D             I-HYK-SYORI-KBN     OF  WK-DATA-IN"]"
      *--------------------<DEBUG>--------------------------------------
           IF  I-HYK-SYORI-KBN          OF  WK-DATA-IN
            =  CNS-X-1
           THEN
             PERFORM                VARYING WK-IDX3 FROM CNS-1 BY CNS-1
               UNTIL  WK-IDX3  >  CNS-10
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":評価系列コード("WK-IDX3")=["
      D             I-HYK-KRTU-CD       OF  I-HYK-KRTU-GRP
      D                                 OF  WK-DATA-IN(WK-IDX3)"]"
      *--------------------<DEBUG>--------------------------------------
               MOVE  I-HYK-KRTU-CD      OF  I-HYK-KRTU-GRP              20081224
                                        OF  WK-DATA-IN(WK-IDX3)         20081224
                 TO  HYK-KRTU-CD        OF  HYK-KRTU                    20081224
                                        OF  PARM-SCZY4033-ARG1(WK-IDX3) 20081224
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":評価系列コード("WK-IDX3")=["
      D             HYK-KRTU-CD         OF  HYK-KRTU
      D             OF  PARM-SCZY4033-ARG1(WK-IDX3)"]"                  20081224
      *--------------------<DEBUG>--------------------------------------
             END-PERFORM
           ELSE
             MOVE  SPACE                TO  HYK-KRTU
                                        OF  PARM-SCZY4033-ARG1          20081224
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU            OF  PARM-SCZY4033-ARG1"]"       20081224
      *--------------------<DEBUG>--------------------------------------
           END-IF
      *----------  基準日FROM
           MOVE  I-KJN-FR-YMD           OF  WK-DATA-IN
             TO  KZYN-YMD-FROM          OF  PARM-SCZY4033-ARG1          20081224
      *----------  基準日TO
           MOVE  I-KJN-TO-YMD           OF  WK-DATA-IN
             TO  KZYN-YMD-TO            OF  PARM-SCZY4033-ARG1          20081224
      *----------  権限チェック有無
           MOVE  CNS-KGN-CHK-UMU
             TO  KGN-CHK-UMU            OF  PARM-SCZY4033-ARG1          20081224
      *----------  メニューID
           MOVE  MENU-ID                OF  WK-DATA-IN
             TO  MENU-ID                OF  PARM-SCZY4033-ARG1          20081224
      *----------  画面アクション区分
           MOVE  CNS-GAMEN-ACT-KBN-9
             TO  GAMEN-ACT-KBN          OF  PARM-SCZY4033-ARG1          20081224
      *----------  業務タスクID
           MOVE  CNS-T4220MH
             TO  GYOMU-TASK-ID          OF  PARM-SCZY4033-ARG1          20081224
      *----------  日中夜間区分
           MOVE  CNS-NCHU-YAKN-KBN
             TO  NCHU-YAKN-KBN          OF  PARM-SCZY4033-ARG1          20081224
      *----------  APL指定出力件数
           MOVE  CNS-0
             TO  APL-OUT-CNT            OF  PARM-SCZY4033-ARG1          20081224
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-WOMCMAIFA-ARG=["
      D              PARM-WOMCMAIFA-ARG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-CZCOMMONHEADER-ARG=["
      D              PARM-CZCOMMONHEADER-ARG "]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D              RIYO-COMPANY-CODE  OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":オール指定1=["
      D              ALL-SITEI-1        OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ選択リスト =["
      D              PTF-FUND-LIST      OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":オール指定2=["
      D              ALL-SITEI-2        OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":評価系列=["
      D              HYK-KRTU           OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D              KZYN-YMD-FROM      OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":基準日TO=["
      D              KZYN-YMD-TO        OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":権限チェック有無=["
      D              KGN-CHK-UMU        OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":メニューID=["
      D              MENU-ID            OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":画面アクション区分=["
      D              GAMEN-ACT-KBN      OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D              GYOMU-TASK-ID      OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":日中夜間区分=["
      D              NCHU-YAKN-KBN      OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":APL指定出力件数=["
      D              APL-OUT-CNT        OF  PARM-SCZY4033-ARG1"]"       20081224
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4033-ARG1=["                   20081224
      D              PARM-SCZY4033-ARG1"]"                              20081224
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4033 START  ***"          20081224
      *--------------------<DEBUG>--------------------------------------
           CALL  "SCZY4033"             USING  PARM-AIFA-HEADER         20081224
                                               PARM-SCZY4033-INOUT      20081224
                                               PARM-RTNPKG
      *    机上デバッグについて、IDXの事前設定--START--
      *-------------------<DEBUG>---------------------------------------
      *    MOVE  CNS-RTN-002
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    MOVE  CNS-RTN-130
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *-----------------------------------------------------------------
      *    机上デバッグについて、IDXの事前設定--END--
      *-------------------<DEBUG>---------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4033 END  ***"            20081224
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D              COUNTER            OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY4033=["                   20081224
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)      20081224
             WHEN  CNS-RTN-000                                          20081224
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ヒット件数=["
      D             HIT-KENSU           OF  PARM-SCZY4033-INOUT"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  ヒット件数
               MOVE  HIT-KENSU          OF  PARM-SCZY4033-INOUT         20081224
                 TO  WK-CNT-HIT-KENSU                                   20081224
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ヒット件数=["WK-CNT-HIT-KENSU"]"
      *--------------------<DEBUG>--------------------------------------
               IF  WK-CNT-HIT-KENSU  =  CNS-0
               THEN
      *----------  ワークリターンコード比較値 ← 8 (業務エラー（続行不可）) 20081030
                 MOVE  CNS-8              TO  WK-RTN-CD-COM             20081030
      *----------  ワークメッセージID ← E000217：$項目$が取得できません 20081030
                 MOVE  CNS-MSG-E000217    TO  WK-MSG-ID                 20081030
      *----------  ワーク置換文字 ← ポートフォリオ有効期間             20081030
                 MOVE  CNS-PTF-LIST       TO  WK-TIKAN-MOJI             20081030
      *--------------------<DEBUG>--------------------------------------20081030
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM=["WK-RTN-CD-COM"]"        20081030
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID    =["WK-MSG-ID"]"            20081030
      D    DISPLAY  CNS-PGM-ID":WK-TIKAN-MOJI=["WK-TIKAN-MOJI"]"        20081030
      *--------------------<DEBUG>--------------------------------------20081030
      *---------- メッセージを登録する                                  20081030
                 INITIALIZE  PARM-SCZY7080-INOUT                        20081030
                             PARM-RTNPKG                                20081030
      *---------- 利用会社コード                                        20081030
                 MOVE  WK-RIYO-CMP-CD                                   20081030
                   TO  RIYO-CMP-CD      OF  PARM-SCZY7080-INOUT         20081030
      *---------- 処理実行日                                            20081030
                 MOVE  WK-SYORI-YMD                                     20081030
                   TO  SYORI-YMD        OF  PARM-SCZY7080-INOUT         20081030
      *---------- 起動ID                                                20081030
                 MOVE  WK-KIDOU-ID                                      20081030
                   TO  KIDOU-ID         OF  PARM-SCZY7080-INOUT         20081030
      *---------- 業務タスクID                                          20081030
                 MOVE  WK-GYOMU-TASK-ID-IN                              20081030
                   TO  GYOMU-TASK-ID    OF  PARM-SCZY7080-INOUT         20081030
      *----------  メッセージID                                         20081030
                 MOVE  WK-MSG-ID                                        20081030
                   TO  MSG-ID           OF  PARM-SCZY7080-ARG2(CNS-1)   20081030
      *----------  置換文字                                             20081030
                 MOVE  WK-TIKAN-MOJI                                    20081030
                   TO  TIKAN-MOJI       OF  PARM-SCZY7080-ARG2(CNS-1)   20081030
      *--------------------<DEBUG>--------------------------------------20081030
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD      20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD        20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID         20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID    20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":メッセージID       =[" MSG-ID           20081030
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"20081030
      D    DISPLAY  CNS-PGM-ID":置換文字           =[" TIKAN-MOJI       20081030
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"20081030
      *--------------------<DEBUG>--------------------------------------20081030
                 PERFORM  WARNING-MSG-RTN                               20081030
      *----------  ワーニング更新
                 PERFORM  WRN-UPD-RTN
      *----------  3.3.後処理
                 PERFORM  END-RTN
               ELSE
                 PERFORM             VARYING WK-IDX4 FROM CNS-1 BY CNS-1
                   UNTIL  WK-IDX4  >  WK-CNT-HIT-KENSU
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX4     =["WK-IDX4"]"
      D    DISPLAY  CNS-PGM-ID":ヒット件数  =["WK-CNT-HIT-KENSU"]"
      *--------------------<DEBUG>--------------------------------------
                     PERFORM     VARYING WK-IDX12 FROM WK-IDX4 BY CNS-1 20081224
                       UNTIL  WK-IDX12  >  WK-IDX4                      20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":WK-IDX12     =["WK-IDX12"]"             20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *----------  ファンドコード                                       20081224
                       MOVE  FUND-CD     OF  PARM-SCZY4033-ARG2(WK-IDX4)20081224
                         TO  WK-FUND-CD-GP(WK-IDX12)                    20081224
      *----------  ポートフォリオコード                                 20081224
                       MOVE  PTF-CD      OF  PARM-SCZY4033-ARG2(WK-IDX4)20081224
                         TO  WK-PTF-CD-GP(WK-IDX12)                     20081224
      *----------  デフォルト評価系列コード                             20081224
                       MOVE  DEFAUL-THYK-CD                             20081224
                                         OF  PARM-SCZY4033-ARG2(WK-IDX4)20081224
                         TO  WK-DEFAUL-THYK-CD-GP(WK-IDX12)             20081224
      *----------  基準日From                                           20081224
                       MOVE  KZYN-YMD-FROM                              20081224
                                         OF  PARM-SCZY4033-ARG2(WK-IDX4)20081224
                         TO  WK-EXPR-YMD-FROM-GP(WK-IDX12)              20081224
      *----------  基準日To                                             20081224
                       MOVE  KZYN-YMD-TO OF  PARM-SCZY4033-ARG2(WK-IDX4)20081224
                         TO  WK-EXPR-YMD-TO-GP(WK-IDX12)                20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":ファンドコー("WK-IDX12")  =["           20081224
      D              WK-FUND-CD-GP(WK-IDX12)"]"                         20081224
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード("WK-IDX12")=["     20081224
      D              WK-PTF-CD-GP(WK-IDX12)"]"                          20081224
      D    DISPLAY  CNS-PGM-ID":デフォルト評価系列コード("WK-IDX12")=[" 20081224
      D              WK-DEFAUL-THYK-CD-GP(WK-IDX12)"]"                  20081224
      D    DISPLAY  CNS-PGM-ID":有效適用開始日FROM("WK-IDX12")=["       20081224
      D              WK-EXPR-YMD-FROM-GP(WK-IDX12)"]"                   20081224
      D    DISPLAY  CNS-PGM-ID":有效適用開始日TO("WK-IDX12")=["         20081224
      D              WK-EXPR-YMD-TO-GP(WK-IDX12)"]"                     20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *----------  実行状況管理明細テーブルにデータをインサートする
                   PERFORM  INS-MANAGE-RTN
                 END-PERFORM
               END-PERFORM                                              20091215
               END-IF                                                   20081030
             WHEN  CNS-RTN-002                                          20081024
      *--------------------<DEBUG>------------------------------------- 20081030
      D    DISPLAY  CNS-PGM-ID":ヒット件数=["                           20081030
      D             HIT-KENSU           OF  PARM-SCZY4033-INOUT"]"      20081030
      *--------------------<DEBUG>--------------------------------------20081030
      *----------  ヒット件数                                           20081030
               MOVE  HIT-KENSU          OF  PARM-SCZY4033-INOUT         20081030
                 TO  WK-CNT-HIT-KENSU                                   20081030
      *--------------------<DEBUG>--------------------------------------20081030
      D    DISPLAY  CNS-PGM-ID":ヒット件数=["WK-CNT-HIT-KENSU"]"        20081030
      *--------------------<DEBUG>--------------------------------------20081030
      *----------  ワークリターンコード比較値 ← 2 (警告)               20081030
               MOVE  CNS-2            TO  WK-RTN-CD-COM                 20081030
      *----------  ワーク引継リターンコード ← 2 (警告)                 20090117
               MOVE  CNS-X-002        TO  WK-SUCCE-R-CD                 20090117
               PERFORM              VARYING WK-IDX10 FROM CNS-1 BY CNS-1 20081224
                 UNTIL  WK-IDX10  >  WK-CNT-HIT-KENSU                   20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":WK-IDX10     =["WK-IDX10"]"             20081224
      D    DISPLAY  CNS-PGM-ID":ヒット件数  =["WK-CNT-HIT-KENSU"]"      20081224
      *--------------------<DEBUG>--------------------------------------20081224
                   PERFORM     VARYING WK-IDX12 FROM WK-IDX10 BY CNS-1  20081224
                     UNTIL  WK-IDX12  >  WK-IDX10                       20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *D    DISPLAY  CNS-PGM-ID":WK-IDX12     =["WK-IDX12"]"             20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *----------  ファンドコード                                       20081224
                       MOVE  FUND-CD    OF  PARM-SCZY4033-ARG2(WK-IDX10) 20081224
                         TO  WK-FUND-CD-GP(WK-IDX12)                    20081224
      *----------  ポートフォリオコード                                 20081224
                       MOVE  PTF-CD     OF  PARM-SCZY4033-ARG2(WK-IDX10) 20081224
                         TO  WK-PTF-CD-GP(WK-IDX12)                     20081224
      *----------  デフォルト評価系列コード                             20081224
                       MOVE  DEFAUL-THYK-CD                             20081224
                                        OF  PARM-SCZY4033-ARG2(WK-IDX10) 20081224
                         TO  WK-DEFAUL-THYK-CD-GP(WK-IDX12)             20081224
      *----------  基準日From                                           20081224
                       MOVE  KZYN-YMD-FROM                              20081224
                                        OF  PARM-SCZY4033-ARG2(WK-IDX10) 20081224
                         TO  WK-EXPR-YMD-FROM-GP(WK-IDX12)              20081224
      *----------  基準日To                                             20081224
                       MOVE  KZYN-YMD-TO                                20081224
                                        OF  PARM-SCZY4033-ARG2(WK-IDX10) 20081224
                         TO  WK-EXPR-YMD-TO-GP(WK-IDX12)                20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *D    DISPLAY  CNS-PGM-ID":ファンドコー("WK-IDX12")  =["           20081224
      *D              WK-FUND-CD-GP(WK-IDX12)"]"                         20081224
      *D    DISPLAY  CNS-PGM-ID":ポートフォリオコード("WK-IDX12")=["     20081224
      *D              WK-PTF-CD-GP(WK-IDX12)"]"                          20081224
      *D    DISPLAY  CNS-PGM-ID":デフォルト評価系列コード("WK-IDX12")=[" 20081224
      *D              WK-DEFAUL-THYK-CD-GP(WK-IDX12)"]"                  20081224
      *D    DISPLAY  CNS-PGM-ID":有效適用開始日FROM("WK-IDX12")=["       20081224
      *D              WK-EXPR-YMD-FROM-GP(WK-IDX12)"]"                   20081224
      *D    DISPLAY  CNS-PGM-ID":有效適用開始日TO("WK-IDX12")=["         20081224
      *D              WK-EXPR-YMD-TO-GP(WK-IDX12)"]"                     20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *----------  実行状況管理明細テーブルにデータをインサートする     20081224
                       PERFORM  INS-MANAGE-RTN                          20081224
                   END-PERFORM                                          20081224
               END-PERFORM                                              20081224
      *----------  ワークメッセージID ← W000309：ポートフォリオ別データ抽出件数超過50000件 20081030
               MOVE  CNS-MSG-W000309  TO  WK-MSG-ID                     20081030
      *----------  ワーク置換文字 ← スペース                           20081030
               MOVE  SPACE            TO  WK-TIKAN-MOJI                 20081030
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM=["WK-RTN-CD-COM"]"        20081224
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID    =["WK-MSG-ID"]"            20081224
      D    DISPLAY  CNS-PGM-ID":WK-TIKAN-MOJI=["WK-TIKAN-MOJI"]"        20081224
      D    DISPLAY  CNS-PGM-ID":ワーク引継リターンコード=["             20090117
      D                         WK-SUCCE-R-CD"]"                        20090117
      *--------------------<DEBUG>--------------------------------------20081224
      *---------- メッセージを登録する                                  20081030
               INITIALIZE  PARM-SCZY7080-INOUT                          20081030
                           PARM-RTNPKG                                  20081030
      *---------- 利用会社コード                                        20081030
               MOVE  WK-RIYO-CMP-CD                                     20081030
                 TO  RIYO-CMP-CD      OF  PARM-SCZY7080-INOUT           20081030
      *---------- 処理実行日                                            20081030
               MOVE  WK-SYORI-YMD                                       20081030
                 TO  SYORI-YMD        OF  PARM-SCZY7080-INOUT           20081030
      *---------- 起動ID                                                20081030
               MOVE  WK-KIDOU-ID                                        20081030
                 TO  KIDOU-ID         OF  PARM-SCZY7080-INOUT           20081030
      *---------- 業務タスクID                                          20081030
               MOVE  WK-GYOMU-TASK-ID-IN                                20081030
                 TO  GYOMU-TASK-ID    OF  PARM-SCZY7080-INOUT           20081030
      *----------  メッセージID                                         20081030
               MOVE  WK-MSG-ID                                          20081030
                 TO  MSG-ID           OF  PARM-SCZY7080-ARG2(CNS-1)     20081030
      *----------  置換文字                                             20081030
               MOVE  WK-TIKAN-MOJI                                      20081030
                 TO  TIKAN-MOJI       OF  PARM-SCZY7080-ARG2(CNS-1)     20081030
      *--------------------<DEBUG>--------------------------------------20081030
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD      20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD        20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID         20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID    20081030
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081030
      D    DISPLAY  CNS-PGM-ID":メッセージID       =[" MSG-ID           20081030
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"20081030
      D    DISPLAY  CNS-PGM-ID":置換文字           =[" TIKAN-MOJI       20081030
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"20081030
      *--------------------<DEBUG>--------------------------------------20081030
               PERFORM  WARNING-MSG-RTN                                 20081030
      *----------  ワーニング更新                                       20081030
               PERFORM  WRN-UPD-RTN                                     20081030
             WHEN  CNS-RTN-130                                          20081224
      *--------------------<DEBUG>------------------------------------- 20081224
      D    DISPLAY  CNS-PGM-ID":ヒット件数=["                           20081224
      D             HIT-KENSU           OF  PARM-SCZY4033-INOUT"]"      20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *----------  ヒット件数                                           20081224
               MOVE  HIT-KENSU          OF  PARM-SCZY4033-INOUT         20081224
                 TO  WK-CNT-HIT-KENSU                                   20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":ヒット件数=["WK-CNT-HIT-KENSU"]"        20081224
      *--------------------<DEBUG>--------------------------------------20081224
               IF  WK-CNT-HIT-KENSU  =  CNS-0                           20081224
               THEN                                                     20081224
      *----------  ワークリターンコード比較値 ← 8 (業務エラー（処理中メイン続行不可）) 20081224
                 MOVE  CNS-8            TO  WK-RTN-CD-COM               20081224
      *----------  ワークメッセージID ← E000217：$項目$が取得できません 20081224
                 MOVE  CNS-MSG-E000217  TO  WK-MSG-ID                   20081224
      *----------  ワーク置換文字1 ← ポートフォリオ有効期間            20081224
                 MOVE  CNS-PTF-LIST                                     20081224
                   TO  WK-TK-MOJI       OF  WK-TIKAN-MOJI(CNS-1)        20081224
      *----------  ワークメッセージID2 ← E000534：利用権限のないポートフォリオは処理しませんでした 20081224
                 MOVE  CNS-MSG-E000534  TO  WK-MSG-ID-2                 20081224
      *----------  ワーク置換文字2 ← スペース                          20081224
                 MOVE  SPACE                                            20081224
                   TO  WK-TK-MOJI       OF  WK-TIKAN-MOJI(CNS-2)        20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM=["WK-RTN-CD-COM"]"        20081224
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID    =["WK-MSG-ID"]"            20081224
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID-2  =["WK-MSG-ID-2"]"          20081224
      D    DISPLAY  CNS-PGM-ID":WK-TIKAN-MOJI(1)=["                     20081224
      D             WK-TK-MOJI      OF  WK-TIKAN-MOJI(CNS-1)"]"         20081224
      D    DISPLAY  CNS-PGM-ID":WK-TIKAN-MOJI(2)=["                     20081224
      D             WK-TK-MOJI      OF  WK-TIKAN-MOJI(CNS-2)"]"         20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *---------- メッセージを登録する                                  20081224
                 INITIALIZE  PARM-SCZY7080-INOUT                        20081224
                             PARM-RTNPKG                                20081224
      *---------- 利用会社コード                                        20081224
                 MOVE  WK-RIYO-CMP-CD                                   20081224
                   TO  RIYO-CMP-CD      OF  PARM-SCZY7080-INOUT         20081224
      *---------- 処理実行日                                            20081224
                 MOVE  WK-SYORI-YMD                                     20081224
                   TO  SYORI-YMD        OF  PARM-SCZY7080-INOUT         20081224
      *---------- 起動ID                                                20081224
                 MOVE  WK-KIDOU-ID                                      20081224
                   TO  KIDOU-ID         OF  PARM-SCZY7080-INOUT         20081224
      *---------- 業務タスクID                                          20081224
                 MOVE  WK-GYOMU-TASK-ID-IN                              20081224
                   TO  GYOMU-TASK-ID    OF  PARM-SCZY7080-INOUT         20081224
      *----------  メッセージID                                         20081224
                 MOVE  WK-MSG-ID                                        20081224
                   TO  MSG-ID           OF  PARM-SCZY7080-ARG2(CNS-1)   20081224
      *----------  メッセージID2                                        20081224
                 MOVE  WK-MSG-ID-2                                      20081224
                   TO  MSG-ID           OF  PARM-SCZY7080-ARG2(CNS-2)   20081224
      *----------  置換文字1                                            20081224
                 MOVE  WK-TK-MOJI       OF  WK-TIKAN-MOJI(CNS-1)        20081224
                   TO  TIKAN-MOJI       OF  PARM-SCZY7080-ARG2(CNS-1)   20081224
      *----------  置換文字2                                            20081224
                 MOVE  WK-TK-MOJI       OF  WK-TIKAN-MOJI(CNS-2)        20081224
                   TO  TIKAN-MOJI       OF  PARM-SCZY7080-ARG2(CNS-2)   20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD      20081224
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081224
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD        20081224
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081224
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID         20081224
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081224
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID    20081224
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081224
      D    DISPLAY  CNS-PGM-ID":メッセージID       =[" MSG-ID           20081224
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"20081224
      D    DISPLAY  CNS-PGM-ID":メッセージID2      =[" MSG-ID           20081224
      D                                 OF  PARM-SCZY7080-ARG2(CNS-2)"]"20081224
      D    DISPLAY  CNS-PGM-ID":置換文字1          =[" TIKAN-MOJI       20081224
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"20081224
      D    DISPLAY  CNS-PGM-ID":置換文字2          =[" TIKAN-MOJI       20081224
      D                                 OF  PARM-SCZY7080-ARG2(CNS-2)"]"20081224
      *--------------------<DEBUG>--------------------------------------20081224
                 PERFORM  WARNING-MSG-RTN                               20081224
      *----------  ワーニング更新                                       20081224
                 PERFORM  WRN-UPD-RTN                                   20081224
      *----------  3.3.後処理                                           20081224
                 PERFORM  END-RTN                                       20081224
               ELSE                                                     20081224
      *----------  ワークリターンコード比較値 ← 4 (業務エラー（続行可能）) 20081224
                 MOVE  CNS-4            TO  WK-RTN-CD-COM               20081224
      *----------  ワーク引継リターンコード ← 4 （業務エラー（続行可能）） 20090117
                 MOVE  CNS-X-004        TO  WK-SUCCE-R-CD               20090117
                 PERFORM            VARYING WK-IDX11 FROM CNS-1 BY CNS-1 20081224
                   UNTIL  WK-IDX11  >  WK-CNT-HIT-KENSU                 20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":WK-IDX11     =["WK-IDX11"]"             20081224
      D    DISPLAY  CNS-PGM-ID":ヒット件数  =["WK-CNT-HIT-KENSU"]"      20081224
      *--------------------<DEBUG>--------------------------------------20081224
                     PERFORM     VARYING WK-IDX12 FROM WK-IDX11 BY CNS-1 20081224
                       UNTIL  WK-IDX12  >  WK-IDX11                     20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":WK-IDX12     =["WK-IDX12"]"             20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *----------  ファンドコード                                       20081224
                       MOVE  FUND-CD    OF  PARM-SCZY4033-ARG2(WK-IDX11) 20081224
                         TO  WK-FUND-CD-GP(WK-IDX12)                    20081224
      *----------  ポートフォリオコード                                 20081224
                       MOVE  PTF-CD     OF  PARM-SCZY4033-ARG2(WK-IDX11) 20081224
                         TO  WK-PTF-CD-GP(WK-IDX12)                     20081224
      *----------  デフォルト評価系列コード                             20081224
                       MOVE  DEFAUL-THYK-CD                             20081224
                                        OF  PARM-SCZY4033-ARG2(WK-IDX11) 20081224
                         TO  WK-DEFAUL-THYK-CD-GP(WK-IDX12)             20081224
      *----------  基準日From                                           20081224
                       MOVE  KZYN-YMD-FROM                              20081224
                                        OF  PARM-SCZY4033-ARG2(WK-IDX11) 20081224
                         TO  WK-EXPR-YMD-FROM-GP(WK-IDX12)              20081224
      *----------  基準日To                                             20081224
                       MOVE  KZYN-YMD-TO                                20081224
                                        OF  PARM-SCZY4033-ARG2(WK-IDX11) 20081224
                         TO  WK-EXPR-YMD-TO-GP(WK-IDX12)                20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":ファンドコー("WK-IDX12")  =["           20081224
      D              WK-FUND-CD-GP(WK-IDX12)"]"                         20081224
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード("WK-IDX12")=["     20081224
      D              WK-PTF-CD-GP(WK-IDX12)"]"                          20081224
      D    DISPLAY  CNS-PGM-ID":デフォルト評価系列コード("WK-IDX12")=[" 20081224
      D              WK-DEFAUL-THYK-CD-GP(WK-IDX12)"]"                  20081224
      D    DISPLAY  CNS-PGM-ID":有效適用開始日FROM("WK-IDX12")=["       20081224
      D              WK-EXPR-YMD-FROM-GP(WK-IDX12)"]"                   20081224
      D    DISPLAY  CNS-PGM-ID":有效適用開始日TO("WK-IDX12")=["         20081224
      D              WK-EXPR-YMD-TO-GP(WK-IDX12)"]"                     20081224
      *--------------------<DEBUG>--------------------------------------20081224
      *----------  実行状況管理明細テーブルにデータをインサートする     20081224
                       PERFORM  INS-MANAGE-RTN                          20081224
                     END-PERFORM                                        20081224
                 END-PERFORM                                            20081224
      *----------  ワークメッセージID2 ← E000534：利用権限のないポートフォリオは処理しませんでした 20081224
                 MOVE  CNS-MSG-E000534  TO  WK-MSG-ID                   20081224
      *----------  ワーク置換文字 ← スペース                           20081224
                 MOVE  SPACE                                            20081224
                   TO  WK-TK-MOJI       OF  WK-TIKAN-MOJI(CNS-1)        20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM=["WK-RTN-CD-COM"]"        20081224
      D    DISPLAY  CNS-PGM-ID":WK-MSG-ID    =["WK-MSG-ID"]"            20081224
      D    DISPLAY  CNS-PGM-ID":WK-TIKAN-MOJI(1)=["                     20081224
      D             WK-TK-MOJI      OF  WK-TIKAN-MOJI(CNS-1)"]"         20081224
      D    DISPLAY  CNS-PGM-ID":ワーク引継リターンコード=["             20090117
      D                         WK-SUCCE-R-CD"]"                        20090117
      *--------------------<DEBUG>--------------------------------------20081224
      *---------- メッセージを登録する                                  20081224
                 INITIALIZE  PARM-SCZY7080-INOUT                        20081224
                             PARM-RTNPKG                                20081224
      *---------- 利用会社コード                                        20081224
                 MOVE  WK-RIYO-CMP-CD                                   20081224
                   TO  RIYO-CMP-CD      OF  PARM-SCZY7080-INOUT         20081224
      *---------- 処理実行日                                            20081224
                 MOVE  WK-SYORI-YMD                                     20081224
                   TO  SYORI-YMD        OF  PARM-SCZY7080-INOUT         20081224
      *---------- 起動ID                                                20081224
                 MOVE  WK-KIDOU-ID                                      20081224
                   TO  KIDOU-ID         OF  PARM-SCZY7080-INOUT         20081224
      *---------- 業務タスクID                                          20081224
                 MOVE  WK-GYOMU-TASK-ID-IN                              20081224
                   TO  GYOMU-TASK-ID    OF  PARM-SCZY7080-INOUT         20081224
      *---------- メッセージID                                          20081224
                 MOVE  WK-MSG-ID                                        20081224
                   TO  MSG-ID           OF  PARM-SCZY7080-ARG2(CNS-1)   20081224
      *---------- 置換文字                                              20081224
                 MOVE  WK-TK-MOJI       OF  WK-TIKAN-MOJI(CNS-1)        20081224
                   TO  TIKAN-MOJI       OF  PARM-SCZY7080-ARG2(CNS-1)   20081224
      *--------------------<DEBUG>--------------------------------------20081224
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =[" RIYO-CMP-CD      20081224
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081224
      D    DISPLAY  CNS-PGM-ID":処理実行日         =[" SYORI-YMD        20081224
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081224
      D    DISPLAY  CNS-PGM-ID":起動ID             =[" KIDOU-ID         20081224
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081224
      D    DISPLAY  CNS-PGM-ID":業務タスクID       =[" GYOMU-TASK-ID    20081224
      D                                 OF  PARM-SCZY7080-INOUT "]"     20081224
      D    DISPLAY  CNS-PGM-ID":メッセージID       =[" MSG-ID           20081224
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"20081224
      D    DISPLAY  CNS-PGM-ID":置換文字           =[" TIKAN-MOJI       20081224
      D                                 OF  PARM-SCZY7080-ARG2(CNS-1)"]"20081224
      *--------------------<DEBUG>--------------------------------------20081224
                 PERFORM  WARNING-MSG-RTN                               20081224
      *----------  ワーニング更新                                       20081224
                 PERFORM  WRN-UPD-RTN                                   20081224
               END-IF
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-009
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING "プォートフォリオの展開エラー:"
                     "利用会社コード = ["
                     RIYO-COMPANY-CODE  OF  PARM-SCZY4033-INOUT
                     "]"
                    DELIMITED BY SIZE
                    INTO FREE-MSG       OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文より、プォートフォリオの展開"
      D             " END ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       NOT-GIPS-EXT.
           EXIT.
      ******************************************************************
      *    実行状況管理明細テーブルにデータをインサートする
      ******************************************************************
       INS-MANAGE-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況管理明細テーブルにデータを"
      D             "インサートする START ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY7050-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7050-INOUT
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7050-INOUT
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7050-INOUT
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID-IN
             TO  GYOMU-TASK-ID          OF  PARM-SCZY7050-INOUT
      *----------  ファンドコード
           MOVE  WK-FUND-CD-GP(WK-IDX12)
             TO  FUND-CD                OF  PARM-SCZY7050-INOUT
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD-GP(WK-IDX12)
             TO  PTF-CD                 OF  PARM-SCZY7050-INOUT
      *----------  評価系列コード
           MOVE  WK-DEFAUL-THYK-CD-GP(WK-IDX12)
             TO  HYK-KRTU-CD            OF  PARM-SCZY7050-INOUT
      *----------  帳票ID
           MOVE  SPACE
             TO  REP-ID                 OF  PARM-SCZY7050-INOUT
      *----------  任意コード
           MOVE  SPACE
             TO  REP-ANY-CD             OF  PARM-SCZY7050-INOUT
      *----------  基準日From
           MOVE  WK-EXPR-YMD-FROM-GP(WK-IDX12)
             TO  KJN-YMD-FROM           OF  PARM-SCZY7050-INOUT
      *----------  基準日To
           MOVE  WK-EXPR-YMD-TO-GP(WK-IDX12)
             TO  KJN-YMD-TO             OF  PARM-SCZY7050-INOUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日    =["SYORI-YMD
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":起動ID        =["KIDOU-ID
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID  =["GYOMU-TASK-ID
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["FUND-CD
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["PTF-CD
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["HYK-KRTU-CD
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID        =["REP-ID
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":任意コード    =["REP-ANY-CD
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":基準日From    =["KJN-YMD-FROM
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":基準日To      =["KJN-YMD-TO
      D                                 OF  PARM-SCZY7050-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7050 START  ***"
      *--------------------<DEBUG>--------------------------------------
           CALL  "SCZY7050"             USING  PARM-SCZY7050-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7050 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY7050=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7050 正常"
      *--------------------<DEBUG>--------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-010
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING "SCZY7050実行状況管理明細インサートエラー："
                    "利用会社コード=["RIYO-CMP-CD
                                        OF  PARM-SCZY7050-INOUT"]"
                    "処理実行日    =["SYORI-YMD
                                        OF  PARM-SCZY7050-INOUT"]"
                    "起動ID        =["KIDOU-ID
                                        OF  PARM-SCZY7050-INOUT"]"
                    "業務タスクID  =["GYOMU-TASK-ID
                                        OF  PARM-SCZY7050-INOUT"]"
                    "ファンドコード=["FUND-CD
                                        OF  PARM-SCZY7050-INOUT"]"
                    "ポートフォリオコード=["PTF-CD
                                        OF  PARM-SCZY7050-INOUT"]"
                    "評価系列コード=["HYK-KRTU-CD
                                        OF  PARM-SCZY7050-INOUT"]"
                    "帳票ID        =["REP-ID
                                        OF  PARM-SCZY7050-INOUT"]"
                    "任意コード    =["REP-ANY-CD
                                        OF  PARM-SCZY7050-INOUT"]"
                    "基準日From    =["KJN-YMD-FROM
                                        OF  PARM-SCZY7050-INOUT"]"
                    "基準日To      =["KJN-YMD-TO
                                        OF  PARM-SCZY7050-INOUT"]"
                 DELIMITED BY SIZE
                 INTO FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況管理明細テーブルにデータを"
      D             "インサートする END ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       INS-MANAGE-EXT.
           EXIT.
      ******************************************************************
      *    5) コミットする
      ******************************************************************
       SQL-COMMIT-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  コミットする START  ***"
      *--------------------<DEBUG>--------------------------------------
           EXEC  SQL
             COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":コミットする正常"
      *--------------------<DEBUG>--------------------------------------
           ELSE
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-011
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-COMMIT-ERR
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  コミットする END  ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       SQL-COMMIT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3 1) 実行状況管理明細テーブルからデータ情報取得
      ******************************************************************
       SEL-MANAGE-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  :実行状況管理明細テーブルから"
      D             "データ情報取得 START ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY7200-INOUT
                       PARM-RTNPKG
                       WK-IDX5
                       WK-IDX6
                       WK-CNT-GET-KENSU
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7200-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7200-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7200-ARG1
      *----------  帳票ID
           MOVE  SPACE
             TO  REP-ID                 OF  PARM-SCZY7200-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7200-ARG1=["
      D             PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7200 START  ***"
      *--------------------<DEBUG>--------------------------------------
           CALL  "SCZY7200"             USING  PARM-SCZY7200-INOUT
                                               PARM-RTNPKG
      *    机上デバッグについて、RETURN-CODEの事前設定--START--
      *    MOVE  CNS-0
      *      TO  GET-KENSU              OF  PARM-SCZY7200-INOUT
      *    MOVE  CNS-RTN-900
      *      TO  RTN-CD     OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    机上デバッグについて、RETURN-CODEの事前設定--END--
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7200 END  ***"
      D    DISPLAY  CNS-PGM-ID":SCZY7200:COUNTER OF PARM-RTNPKG=["
      D             COUNTER OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY7200=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             = CNS-RTN-000
           THEN
             MOVE  GET-KENSU            OF  PARM-SCZY7200-INOUT
               TO  WK-CNT-GET-KENSU
             MOVE  GET-KENSU            OF  PARM-SCZY7200-INOUT
               TO  WK-GET-KENSU
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CNT-GET-KENSU=["WK-CNT-GET-KENSU"]"
      *--------------------<DEBUG>--------------------------------------
             IF  WK-CNT-GET-KENSU  =  CNS-0
             THEN
      *----------  ワークリターンコード比較値 ← 8 (業務エラー（続行不可）)  20081030
               MOVE  CNS-8              TO  WK-RTN-CD-COM               20081030
      *----------  ワークメッセージID ← E000217：$項目$が取得できません20081120
               MOVE  CNS-MSG-E000217    TO  WK-MSG-ID                   20081120
      *----------  ワーク置換文字 ← 処理対象実行状況管理明細データ     20081120
               MOVE  CNS-SEL-MANAGE     TO  WK-TIKAN-MOJI               20081120
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード比較値=["
      D               WK-RTN-CD-COM"]"
      D    DISPLAY  CNS-PGM-ID":ワークメッセージID  =["WK-MSG-ID"]"     20081120
      D    DISPLAY  CNS-PGM-ID":ワーク置換文字 =["WK-TIKAN-MOJI"]"      20081120
      *--------------------<DEBUG>--------------------------------------
      *----------  ワーニング更新
               PERFORM  WRN-UPD-RTN
      *----------  3.3.後処理
               PERFORM  END-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CNT-GET-KENSU=["WK-CNT-GET-KENSU"]"
      *--------------------<DEBUG>--------------------------------------
             ELSE
               PERFORM              VARYING WK-IDX5 FROM CNS-1 BY CNS-1
                 UNTIL  WK-IDX5 > WK-CNT-GET-KENSU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200.ファンドコード("WK-IDX5")=["
      D             FUND-CD             OF  JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200.ポートフォリオコード("
      D             WK-IDX5")=["
      D             PTF-CD              OF  JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200.基準日From("WK-IDX5")=["
      D             KJN-YMD-FROM        OF  JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200.基準日To("WK-IDX5")=["
      D             KJN-YMD-TO          OF  JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200.評価系列コード("WK-IDX5")=["
      D             HYK-KRTU-CD         OF  JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200.業務タスクID("WK-IDX5")=["
      D             GYOMU-TASK-ID       OF  JIKO-DATA(WK-IDX5)"]"
      *-----------------------------------------------------------------
      *---------- ワークファンドコード(ワークIDX)
                 MOVE  FUND-CD          OF  JIKO-DATA(WK-IDX5)
                   TO  WK-FUND-CD       OF  WK-JIKO-DATA(WK-IDX5)
      *---------- ワークポートフォリオコード(ワークIDX)
                 MOVE  PTF-CD           OF  JIKO-DATA(WK-IDX5)
                   TO  WK-PTF-CD        OF  WK-JIKO-DATA(WK-IDX5)
      *---------- ワーク基準日From(ワークIDX)
                 MOVE  KJN-YMD-FROM     OF  JIKO-DATA(WK-IDX5)
                   TO  WK-KJN-YMD-FROM  OF  WK-JIKO-DATA(WK-IDX5)
      *---------- ワーク基準日To(ワークIDX)
                 MOVE  KJN-YMD-TO       OF  JIKO-DATA(WK-IDX5)
                   TO  WK-KJN-YMD-TO    OF  WK-JIKO-DATA(WK-IDX5)
      *---------- ワーク評価系列コード(ワークIDX)
                 MOVE  HYK-KRTU-CD      OF  JIKO-DATA(WK-IDX5)
                   TO  WK-HYK-KRTU-CD   OF  WK-JIKO-DATA(WK-IDX5)
      *---------- ワーク業務タスクID(ワークIDX)
                 MOVE  GYOMU-TASK-ID    OF  JIKO-DATA(WK-IDX5)
                   TO  WK-GYOMU-TASK-ID OF  WK-JIKO-DATA(WK-IDX5)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークファンドコード("WK-IDX5")=["
      D             WK-FUND-CD       OF  WK-JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ワークポートフォリオコード("WK-IDX5")=["
      D             WK-PTF-CD        OF  WK-JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日From("WK-IDX5")=["
      D             WK-KJN-YMD-FROM  OF  WK-JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク基準日To("WK-IDX5")=["
      D             WK-KJN-YMD-TO    OF  WK-JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク評価系列コード("WK-IDX5")=["
      D             WK-HYK-KRTU-CD   OF  WK-JIKO-DATA(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID("WK-IDX5")=["
      D             WK-GYOMU-TASK-ID OF  WK-JIKO-DATA(WK-IDX5)"]"
      *-----------------------------------------------------------------
               END-PERFORM
             END-IF
      *--------------------<DEBUG>--------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID                                          20090218
      D             ":SCZY7060より取得上電文．評価系列選択区分=["       20090218
      D             I-HYK-SYORI-KBN     OF  WK-DATA-IN"]"               20090218
      D    DISPLAY  CNS-PGM-ID":ワーク取得FLG=["FLG-GET"]"              20090218
      D    DISPLAY  CNS-PGM-ID":GIPS-MODE=["WK-GIPS-MODE"]"
      *--------------------<DEBUG>--------------------------------------20090218
           IF  WK-GIPS-MODE  NOT  =  CNS-1
           THEN
             IF  I-HYK-SYORI-KBN          OF  WK-DATA-IN = CNS-X-2  AND 20090218
                 FLG-GET = CNS-0                                        20090218
             THEN                                                       20090218
      *--------------------<DEBUG>--------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID":SCZY7060より取得上電文.評価系列選択区分"20090218
      D             "='2'(ALL指定の場合)且つワーク取得FLG=0"            20090218
      D             "(銘柄指定なし)の場合"                              20090218
      *-----------------------------------------------------------------20090218
      *----------  1-2) 評価履歴からごみデータ削除処理                  20090218
               PERFORM  DELETE-TKMHHR00-RTN                             20090218
      *----------  ②勘定残高TBLからごみデータ削除処理                  @3212SEINO@@ 20090508
      *********PERFORM  DELETE-TKMZKZ00-RTN                             @3212SEINO@@ 20090508
      *----------  ③評価計算入力TBLからごみデータ削除処理              @3212SEINO@@ 20090508
      *********PERFORM  DELETE-TKMHHI00-RTN                             @3212SEINO@@ 20090508
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-TKMHHR00-COUNT=["WK-TKMHHR00-COUNT"]"@3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               IF  WK-TKMHHR00-COUNT = CNS-0                            @3212SEINO@@
               THEN                                                     @3212SEINO@@
                 CONTINUE                                               @3212SEINO@@
               ELSE                                                     @3212SEINO@@
      *----------  ②勘定残高TBLからごみデータ削除処理                  @3212SEINO@@
                 PERFORM  DELETE-TKMZKZ00-RTN                           @3212SEINO@@
      *----------  ③評価計算入力TBLからごみデータ削除処理              @3212SEINO@@
                 PERFORM  DELETE-TKMHHI00-RTN                           @3212SEINO@@
               END-IF                                                   @3212SEINO@@
             ELSE                                                       20090218
               CONTINUE                                                 20090218
      *--------------------<DEBUG>--------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID":SCZY7060より取得上電文.評価系列選択区分"20090218
      D             "≠'2'(ALL指定の場合)且つワーク取得FLG≠0"          20090218
      D             "(銘柄指定なし)の場合"                              20090218
      *-----------------------------------------------------------------20090218
             END-IF                                                     20090218
           ELSE
             CONTINUE
           END-IF
      *----------  1-3) 評価系列情報取得
           PERFORM  SCZY4311-GET-RTN
      *----------  1-4) 評価計算パターン情報取得
           PERFORM  SCZY4305-GET-RTN
      *----------  1-5) 評価時価取得方法パターン情報取得
           PERFORM  SCZY4307-GET-RTN
      *----------  1-6) 評価為替取得方法パターン情報取得
           PERFORM  SCZY4309-GET-RTN
      *----------  1-7) 料率情報取得
           PERFORM  SCZY4407-GET-RTN
      *----------  1-8) 通貨情報取得
           PERFORM  SCZY4401-GET-RTN
      *----------  1-9) 為替換算情報メモリ格納処理
           PERFORM  SCZY4501-GET-RTN
               PERFORM              VARYING WK-IDX6 FROM CNS-1 BY CNS-1
                 UNTIL  WK-IDX6 > WK-CNT-GET-KENSU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX6=["WK-IDX6"]"
      *-----------------------------------------------------------------
      *----------  3.2.2 2) ポートフォリオ別ループ処理
                     PERFORM  PF-LOOP-RTN
               END-PERFORM
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-012
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING "処理対象実行状況管理詳細ＧＥＴデータ取得エラー:"
                 "利用会社コード =["
                  RIYO-CMP-CD           OF  PARM-SCZY7200-ARG1
                 "] 処理実行日 =["
                  SYORI-YMD             OF  PARM-SCZY7200-ARG1
                 "] 起動ID =["
                  KIDOU-ID              OF  PARM-SCZY7200-ARG1
                 "]"
                 DELIMITED BY SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  実行状況管理詳細データ取得 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  :実行状況管理明細テーブルから"
      D             "データ情報取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SEL-MANAGE-EXT.
           EXIT.
      ******************************************************************20090218
      *    1-2) 評価履歴からごみデータ削除処理                          20090218
      ******************************************************************20090218
       DELETE-TKMHHR00-RTN    SECTION.                                  20090218
      *-------------------<DEBUG>---------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID                                          20090218
      D             ":***  評価履歴からごみデータ削除処理 START  ***"   20090218
      *-----------------------------------------------------------------20090218
      *****INITIALIZE  SQLSTMT                                          @3212SEINO@@ 20090218
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
                       WK-DELETE-SQL                                    20090218
      *----------  評価履歴TBL H                                        20090218
           MOVE  WK-TAB-TKMHHR00        TO  WK-TBL-TKMHHR00-H           20090218
      *****------  評価履歴TBL A                                        20090218
      *****MOVE  WK-TAB-TKMHHR00        TO  WK-TBL-TKMHHR00-A           @3212SEINO@@ 20090218
      *----------  評価履歴TBL X                                        20090218
           MOVE  WK-TAB-TKMHHR00        TO  WK-TBL-TKMHHR00-X           20090218
      *****------  進捗管理TBL C                                        @3212SEINO@@ 20090218
      *****MOVE  WK-TAB-TKDYAA40        TO  WK-TBL-TKDYAA40-C           @3212SEINO@@ 20090218
      *----------  進捗管理TBL D                                        @3212SEINO@@
           MOVE  WK-TAB-TKDYAA40        TO  WK-TBL-TKDYAA40-D           @3212SEINO@@
      *****------  実行状況管理明細TBL E                                @3212SEINO@@ 20090218
      *****MOVE  WK-TAB-TKDYAA35        TO  WK-TBL-TKDYAA35-E           @3212SEINO@@ 20090218
      *----------  実行状況管理明細TBL G                                @3212SEINO@@
           MOVE  WK-TAB-TKDYAA35        TO  WK-TBL-TKDYAA35-G           @3212SEINO@@
      *----------  実行状況管理明細TBL Y                                20090218
           MOVE  WK-TAB-TKDYAA35        TO  WK-TBL-TKDYAA35-Y           20090218
      *****------  利用会社コード                                       @3212SEINO@@
      *****MOVE  WK-RIYO-CMP-CD         TO  H-RIYO-CMP-CD-E             @3212SEINO@@
      *****------  処理実行日                                           @3212SEINO@@ 20090218
      *****MOVE  WK-SYORI-YMD           TO  H-SYORI-YMD-E               @3212SEINO@@ 20090218
      *****------  起動ID                                               @3212SEINO@@ 20090218
      *****MOVE  WK-KIDOU-ID            TO  H-KIDOU-ID-E                @3212SEINO@@ 20090218
      *****------  帳票ID                                               @3212SEINO@@ 20090218
      *****MOVE  SPACE                  TO  H-REP-ID-E                  @3212SEINO@@ 20090218
      *****------  帳票任意コード                                       @3212SEINO@@ 20090218
      *****MOVE  SPACE                  TO  H-REP-ANY-CD-E              @3212SEINO@@ 20090218
      *****------  基準日                                               @3212SEINO@@ 20090218
      *****MOVE  I-KJN-FR-YMD           OF  WK-DATA-IN                  @3212SEINO@@ 20090218
      *****  TO  H-KJN-YMD-FROM-A                                       @3212SEINO@@ 20090218
      *****MOVE  I-KJN-TO-YMD           OF  WK-DATA-IN                  @3212SEINO@@ 20090218
      *****  TO  H-KJN-YMD-TO-A                                         @3212SEINO@@ 20090218
      *****------  基準日                                               @3212SEINO@@ 20090218
      *****MOVE  I-KJN-FR-YMD           OF  WK-DATA-IN                  @3212SEINO@@ 20090218
      *****  TO  H-KJN-YMD-FROM-X                                       @3212SEINO@@ 20090218
      *****MOVE  I-KJN-TO-YMD           OF  WK-DATA-IN                  @3212SEINO@@ 20090218
      *****  TO  H-KJN-YMD-TO-X                                         @3212SEINO@@ 20090218
      *****------  利用会社コード                                       @3212SEINO@@ 20090218
      *****MOVE  WK-RIYO-CMP-CD         TO  H-RIYO-CMP-CD-Y             @3212SEINO@@ 20090218
      *****------  処理実行日                                           @3212SEINO@@ 20090218
      *****MOVE  WK-SYORI-YMD           TO  H-SYORI-YMD-Y               @3212SEINO@@ 20090218
      *****------  起動ID                                               @3212SEINO@@ 20090218
      *****MOVE  WK-KIDOU-ID            TO  H-KIDOU-ID-Y                @3212SEINO@@ 20090218
      *****------  帳票ID                                               @3212SEINO@@ 20090218
      *****MOVE  SPACE                  TO  H-REP-ID-Y                  @3212SEINO@@ 20090218
      *****------  帳票任意コード                                       @3212SEINO@@ 20090218
      *****MOVE  SPACE                  TO  H-REP-ANY-CD-Y              @3212SEINO@@ 20090218
      *****MOVE  WK-DELETE-SQL          TO  SQLSTMT                     @3212SEINO@@ 20090218
      *----------  利用会社コード                                       @3212SEINO@@
           MOVE  WK-RIYO-CMP-CD         TO  H-RIYO-CMP-CD               @3212SEINO@@
      *----------  処理実行日                                           @3212SEINO@@
           MOVE  WK-SYORI-YMD           TO  H-SYORI-YMD                 @3212SEINO@@
      *----------  起動ID                                               @3212SEINO@@
           MOVE  WK-KIDOU-ID            TO  H-KIDOU-ID                  @3212SEINO@@
      *----------  基準日                                               @3212SEINO@@
           MOVE  I-KJN-FR-YMD           OF  WK-DATA-IN                  @3212SEINO@@
             TO  H-KJN-YMD-FROM                                         @3212SEINO@@
           MOVE  I-KJN-TO-YMD           OF  WK-DATA-IN                  @3212SEINO@@
             TO  H-KJN-YMD-TO                                           @3212SEINO@@
           MOVE  WK-DELETE-SQL          TO  SQLSTMT4                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID":評価履歴TBL H=["WK-TBL-TKMHHR00-H"]"    20090218
      *D***DISPLAY  CNS-PGM-ID":評価履歴TBL A=["WK-TBL-TKMHHR00-A"]"    @3212SEINO@@ 20090218
      D    DISPLAY  CNS-PGM-ID":評価履歴TBL X=["WK-TBL-TKMHHR00-X"]"    20090218
      *D***DISPLAY  CNS-PGM-ID":進捗管理TBL C=["WK-TBL-TKDYAA40-C"]"    @3212SEINO@@ 20090218
      D    DISPLAY  CNS-PGM-ID":進捗管理TBL D=["WK-TBL-TKDYAA40-D"]"    @3212SEINO@@
      *D***DISPLAY  CNS-PGM-ID":実行状況管理明細TBL E=["                @3212SEINO@@ 20090218
      *D***         WK-TBL-TKDYAA35-E"]"                                @3212SEINO@@ 20090218
      D    DISPLAY  CNS-PGM-ID":実行状況管理明細TBL G=["                @3212SEINO@@
      D             WK-TBL-TKDYAA35-G"]"                                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":実行状況管理明細TBL Y=["                20090218
      D             WK-TBL-TKDYAA35-Y"]"                                20090218
      *D***DISPLAY  CNS-PGM-ID":H-SYORI-YMD-E=["H-SYORI-YMD-E"]"        @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-KIDOU-ID-E=["H-KIDOU-ID-E"]"          @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-REP-ID-E=["H-REP-ID-E"]"              @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-REP-ANY-CD-E=["H-REP-ANY-CD-E"]"      @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-KJN-YMD-FROM-A=["H-KJN-YMD-FROM-A"]"  @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-KJN-YMD-TO-A=["H-KJN-YMD-TO-A"]"      @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-KJN-YMD-FROM-X=["H-KJN-YMD-FROM-X"]"  @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-KJN-YMD-TO-X=["H-KJN-YMD-TO-X"]"      @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-Y=["H-RIYO-CMP-CD-Y"]"    @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-SYORI-YMD-Y=["H-SYORI-YMD-Y"]"        @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-KIDOU-ID-Y=["H-KIDOU-ID-Y"]"          @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-REP-ID-Y=["H-REP-ID-Y"]"              @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":H-REP-ANY-CD-Y=["H-REP-ANY-CD-Y"]"      @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":WK-DELETE-SQL=["WK-DELETE-SQL"]"        @3212SEINO@@ 20090218
      *D***DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                    @3212SEINO@@ 20090218
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD=["H-RIYO-CMP-CD"]"        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":H-SYORI-YMD=["H-SYORI-YMD"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":H-KIDOU-ID=["H-KIDOU-ID"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-FROM=["H-KJN-YMD-FROM"]"      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-TO=["H-KJN-YMD-TO"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT4=["SQLSTMT4"]"                  @3212SEINO@@
      *-----------------------------------------------------------------20090218
           EXEC  SQL                                                    20090218
      *******PREPARE  S  FROM  :SQLSTMT                                 @3212SEINO@@ 20090218
             PREPARE  S  FROM  :SQLSTMT4                                @3212SEINO@@
           END-EXEC                                                     20090218
      *-------------------<DEBUG>---------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID "PREPARE SQLCODE =[" SQLCODE "]"         20090218
      *-----------------------------------------------------------------20090218
           IF  SQLCODE = CNS-SQL-NORMAL                                 20090218
           THEN                                                         20090218
             CONTINUE                                                   20090218
      *-------------------<DEBUG>---------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID "PREPARE 正常"                           20090218
      *-----------------------------------------------------------------20090218
           ELSE                                                         20090218
      *----------  エラー検知プログラム名                               20090218
             MOVE  CNS-PGM-ID                                           20090218
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20090218
      *----------  ポジション                                           20090218
             MOVE  CNS-POS-018                                          20090218
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20090218
      *----------  リターンコード                                       20090218
             MOVE  CNS-RTN-900                                          20090218
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20090218
      *----------  詳細リターンコード                                   20090218
             MOVE  SQLCODE                                              20090218
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20090218
      *----------  詳細リターンコードデコードフラグ                     20090218
             MOVE  CNS-DETAIL-1                                         20090218
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20090218
      *----------  フリーメッセージ                                     20090218
      *******STRING SQLSTMT(1:FUNCTION  LENGTH(WK-DELETE-SQL))          @3212SEINO@@ 20090218
      *******       "[:V1="                                             @3212SEINO@@ 20090218
      *******        H-RIYO-CMP-CD-E                                    @3212SEINO@@ 20090218
      *******       "][:V2="                                            @3212SEINO@@ 20090218
      *******        H-SYORI-YMD-E                                      @3212SEINO@@ 20090218
      *******       "][:V3="                                            @3212SEINO@@ 20090218
      *******        H-KIDOU-ID-E                                       @3212SEINO@@ 20090218
      *******       "][:V4="                                            @3212SEINO@@ 20090218
      *******        H-REP-ID-E                                         @3212SEINO@@ 20090218
      *******       "][:V5="                                            @3212SEINO@@ 20090218
      *******        H-REP-ANY-CD-E                                     @3212SEINO@@ 20090218
      *******       "][:V7="                                            @3212SEINO@@ 20090218
      *******        H-KJN-YMD-FROM-A                                   @3212SEINO@@ 20090218
      *******       "][:V8="                                            @3212SEINO@@ 20090218
      *******        H-KJN-YMD-TO-A                                     @3212SEINO@@ 20090218
      *******       "][:V11="                                           @3212SEINO@@ 20090218
      *******        H-KJN-YMD-FROM-X                                   @3212SEINO@@ 20090218
      *******       "][:V12="                                           @3212SEINO@@ 20090218
      *******        H-KJN-YMD-TO-X                                     @3212SEINO@@ 20090218
      *******       "][:V13="                                           @3212SEINO@@ 20090218
      *******        H-RIYO-CMP-CD-Y                                    @3212SEINO@@ 20090218
      *******       "][:V14="                                           @3212SEINO@@ 20090218
      *******        H-SYORI-YMD-Y                                      @3212SEINO@@ 20090218
      *******       "][:V15="                                           @3212SEINO@@ 20090218
      *******        H-KIDOU-ID-Y                                       @3212SEINO@@ 20090218
      *******       "][:V16="                                           @3212SEINO@@ 20090218
      *******        H-REP-ID-Y                                         @3212SEINO@@ 20090218
      *******       "][:V17="                                           @3212SEINO@@ 20090218
      *******        H-REP-ANY-CD-Y                                     @3212SEINO@@ 20090218
      *******       "]"                                                 @3212SEINO@@ 20090218
             STRING SQLSTMT4(1:FUNCTION  LENGTH(WK-DELETE-SQL))         @3212SEINO@@
                    "[:V_W_RIYO_CMP_CD="                                @3212SEINO@@
                     H-RIYO-CMP-CD                                      @3212SEINO@@
                    "][:V_W_SYORI_YMD="                                 @3212SEINO@@
                     H-SYORI-YMD                                        @3212SEINO@@
                    "][:V_W_KIDOU_ID="                                  @3212SEINO@@
                     H-KIDOU-ID                                         @3212SEINO@@
                    "][:V_SCZY7060_FROM="                               @3212SEINO@@
                     H-KJN-YMD-FROM                                     @3212SEINO@@
                    "][:V_SCZY7060_TO="                                 @3212SEINO@@
                     H-KJN-YMD-TO                                       @3212SEINO@@
                    "]"                                                 @3212SEINO@@
                    DELIMITED BY SIZE                                   20090218
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1             20090218
      *-------------------<DEBUG>---------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"                20090218
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["   20090218
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["   20090218
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["   20090218
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["   20090218
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["   20090218
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["   20090218
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20090218
      *-----------------------------------------------------------------20090218
      *----------  エラー処理                                           20090218
               PERFORM  ERR-RTN                                         20090218
           END-IF                                                       20090218
           EXEC SQL                                                     20090218
               EXECUTE S
      *********  USING  :H-RIYO-CMP-CD-E,                               @3212SEINO@@
      *********         :H-SYORI-YMD-E,                                 @3212SEINO@@ 20090218
      *********         :H-KIDOU-ID-E,                                  @3212SEINO@@ 20090218
      *********         :H-REP-ID-E,                                    @3212SEINO@@ 20090218
      *********         :H-REP-ANY-CD-E,                                @3212SEINO@@ 20090218
      *********         :H-KJN-YMD-FROM-A,                              @3212SEINO@@ 20090218
      *********         :H-KJN-YMD-TO-A,                                @3212SEINO@@ 20090218
      *********         :H-KJN-YMD-FROM-X,                              @3212SEINO@@ 20090218
      *********         :H-KJN-YMD-TO-X,                                @3212SEINO@@ 20090218
      *********         :H-RIYO-CMP-CD-Y,                               @3212SEINO@@ 20090218
      *********         :H-SYORI-YMD-Y,                                 @3212SEINO@@ 20090218
      *********         :H-KIDOU-ID-Y,                                  @3212SEINO@@ 20090218
      *********         :H-REP-ID-Y,                                    @3212SEINO@@ 20090218
      *********         :H-REP-ANY-CD-Y                                 @3212SEINO@@ 20090218
                 USING  :H-RIYO-CMP-CD,                                 @3212SEINO@@
                        :H-SYORI-YMD,                                   @3212SEINO@@
                        :H-KIDOU-ID,                                    @3212SEINO@@
                        :H-RIYO-CMP-CD,                                 @3212SEINO@@
                        :H-SYORI-YMD,                                   @3212SEINO@@
                        :H-KIDOU-ID,                                    @3212SEINO@@
                        :H-KJN-YMD-FROM,                                @3212SEINO@@
                        :H-KJN-YMD-TO                                   @3212SEINO@@
           END-EXEC                                                     20090218
      *----------------------<DEBUG>------------------------------------20090218
      D    DISPLAY CNS-PGM-ID":DELETE SQLCODE=["SQLCODE"]"              20090218
      *-----------------------------------------------------------------20090218
           IF  SQLCODE = CNS-SQL-NORMAL  OR  SQLCODE = CNS-SQL-NOTFOUND 20090218
           THEN                                                         20090218
      *----------  ワークDB更新情報.処理件数(6)                         20090508 @3212SEINO@@
             COMPUTE  WK-TBL-SYORI-COUNT OF  WK-DB-MSG(CNS-6)           20090508 @3212SEINO@@
                   =  WK-TBL-SYORI-COUNT OF  WK-DB-MSG(CNS-6)           20090508 @3212SEINO@@
                   +  SQLERRD            OF  SQLCA(3)                   20090508
             MOVE  SQLERRD               OF  SQLCA(3)                   @3212SEINO@@
               TO  WK-TKMHHR00-COUNT                                    @3212SEINO@@
      *      CONTINUE                                                   20090218
      *----------------------<DEBUG>------------------------------------20090218
      D    DISPLAY CNS-PGM-ID":評価履歴TBLからごみデータ削除処理 正常"  20090218
      D    DISPLAY CNS-PGM-ID":ワークDB更新情報.処理件数(6)=["          20090508
      D            WK-TBL-SYORI-COUNT   OF  WK-DB-MSG(CNS-6) "]"        20090508
      *-----------------------------------------------------------------20090218
           ELSE                                                         20090218
      *----------  エラー検知プログラム名                               20090218
             MOVE  CNS-PGM-ID                                           20090218
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20090218
      *----------  ポジション                                           20090218
             MOVE  CNS-POS-019                                          20090218
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20090218
      *----------  リターンコード                                       20090218
             MOVE  CNS-RTN-900                                          20090218
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20090218
      *----------  詳細リターンコード                                   20090218
             MOVE  SQLCODE                                              20090218
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20090218
      *----------  詳細リターンコードデコードフラグ                     20090218
             MOVE  CNS-DETAIL-1                                         20090218
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20090218
      *----------  フリーメッセージ                                     20090218
      *******STRING SQLSTMT(1:FUNCTION  LENGTH(WK-DELETE-SQL))          @3212SEINO@@ 20090218
      *******       "[:V2="                                             @3212SEINO@@ 20090218
      *******        H-SYORI-YMD-E                                      @3212SEINO@@ 20090218
      *******       "][:V3="                                            @3212SEINO@@ 20090218
      *******        H-KIDOU-ID-E                                       @3212SEINO@@ 20090218
      *******       "][:V4="                                            @3212SEINO@@ 20090218
      *******        H-REP-ID-E                                         @3212SEINO@@ 20090218
      *******       "][:V5="                                            @3212SEINO@@ 20090218
      *******        H-REP-ANY-CD-E                                     @3212SEINO@@ 20090218
      *******       "][:V7="                                            @3212SEINO@@ 20090218
      *******        H-KJN-YMD-FROM-A                                   @3212SEINO@@ 20090218
      *******       "][:V8="                                            @3212SEINO@@ 20090218
      *******        H-KJN-YMD-TO-A                                     @3212SEINO@@ 20090218
      *******       "][:V11="                                           @3212SEINO@@ 20090218
      *******        H-KJN-YMD-FROM-X                                   @3212SEINO@@ 20090218
      *******       "][:V12="                                           @3212SEINO@@ 20090218
      *******        H-KJN-YMD-TO-X                                     @3212SEINO@@ 20090218
      *******       "][:V13="                                           @3212SEINO@@ 20090218
      *******        H-RIYO-CMP-CD-Y                                    @3212SEINO@@ 20090218
      *******       "][:V14="                                           @3212SEINO@@ 20090218
      *******        H-SYORI-YMD-Y                                      @3212SEINO@@ 20090218
      *******       "][:V15="                                           @3212SEINO@@ 20090218
      *******        H-KIDOU-ID-Y                                       @3212SEINO@@ 20090218
      *******       "][:V16="                                           @3212SEINO@@ 20090218
      *******        H-REP-ID-Y                                         @3212SEINO@@ 20090218
      *******       "][:V17="                                           @3212SEINO@@ 20090218
      *******        H-REP-ANY-CD-Y                                     @3212SEINO@@ 20090218
      *******       "]"                                                 @3212SEINO@@ 20090218
             STRING SQLSTMT4(1:FUNCTION  LENGTH(WK-DELETE-SQL))         @3212SEINO@@
                    "[:V_W_RIYO_CMP_CD="                                @3212SEINO@@
                     H-RIYO-CMP-CD                                      @3212SEINO@@
                    "][:V_W_SYORI_YMD="                                 @3212SEINO@@
                     H-SYORI-YMD                                        @3212SEINO@@
                    "][:V_W_KIDOU_ID="                                  @3212SEINO@@
                     H-KIDOU-ID                                         @3212SEINO@@
                    "][:V_SCZY7060_FROM="                               @3212SEINO@@
                     H-KJN-YMD-FROM                                     @3212SEINO@@
                    "][:V_SCZY7060_TO="                                 @3212SEINO@@
                     H-KJN-YMD-TO                                       @3212SEINO@@
                    "]"                                                 @3212SEINO@@
                    DELIMITED BY SIZE                                   20090218
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1             20090218
      *-------------------<DEBUG>---------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID                                          20090218
      D             ": ***  評価履歴TBLからごみデータ削除処理 異常  ***"20090218
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["   20090218
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["   20090218
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["   20090218
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["   20090218
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["   20090218
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20090218
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["   20090218
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20090218
      *-----------------------------------------------------------------20090218
      *----------  エラー処理                                           20090218
               PERFORM  ERR-RTN                                         20090218
           END-IF                                                       20090218
      *-------------------<DEBUG>---------------------------------------20090218
      D    DISPLAY  CNS-PGM-ID                                          20090218
      D             ":***  評価履歴からごみデータ削除処理 END ***"      20090218
      *-----------------------------------------------------------------20090218
           CONTINUE.                                                    20090218
       DELETE-TKMHHR00-EXT.                                             20090218
           EXIT.                                                        20090218
      ******************************************************************20090508
      *    ②勘定残高TBLからごみデータ削除処理                          20090508
      ******************************************************************20090508
       DELETE-TKMZKZ00-RTN    SECTION.                                  20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ":***  勘定残高TBLからごみデータ削除処理 START  ***"20090508
      *-----------------------------------------------------------------20090508
      *****INITIALIZE  SQLSTMT                                          @3212SEINO@@ 20090508
           INITIALIZE  SQLSTMT5                                         @3212SEINO@@
                       WK-DELETE-SQL-ZKZ                                20090508
      *----------  勘定残高TBL K                                        20090508
           MOVE  WK-TAB-TKMZKZ00                                        20090508
             TO  WK-TBL-TKMZKZ00-K      OF  WK-DELETE-SQL-ZKZ           20090508
      *----------  評価履歴TBL N                                        20090508
           MOVE  WK-TAB-TKMHHR00                                        20090508
             TO  WK-TBL-TKMHHR00-N      OF  WK-DELETE-SQL-ZKZ           20090508
      *----------  SCZY7060より取得した上電文.基準日FROM                20111208
           MOVE  I-KJN-FR-YMD           OF  WK-DATA-IN                  20111208
             TO  H-KJN-YMD-FROM-ZKZ                                     20111208
      *----------  SCZY7060より取得した上電文.基準日TO                  20111208
           MOVE  I-KJN-TO-YMD           OF  WK-DATA-IN                  20111208
             TO  H-KJN-YMD-TO-ZKZ                                       20111208
      *****MOVE  WK-DELETE-SQL-ZKZ      TO  SQLSTMT                     @3212SEINO@@ 20090508
           MOVE  WK-DELETE-SQL-ZKZ      TO  SQLSTMT5                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID":勘定残高TBL K=["                        20090508
      D             WK-TBL-TKMZKZ00-K   OF  WK-DELETE-SQL-ZKZ"]"        20090508
      D    DISPLAY  CNS-PGM-ID":評価履歴TBL N=["                        20090508
      D             WK-TBL-TKMHHR00-N   OF  WK-DELETE-SQL-ZKZ"]"        20090508
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-FROM-ZKZ=["                   20111208
      D             H-KJN-YMD-FROM-ZKZ"]"                               20111208
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-TO-ZKZ=["H-KJN-YMD-TO-ZKZ"]"  20111208
      D    DISPLAY  CNS-PGM-ID":WK-DELETE-SQL-ZKZ=["WK-DELETE-SQL-ZKZ"]"20090508
      *D***DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                    @3212SEINO@@ 20090508
      D    DISPLAY  CNS-PGM-ID":SQLSTMT5=["SQLSTMT5"]"                  @3212SEINO@@
      *-----------------------------------------------------------------20090508
           EXEC  SQL                                                    20090508
      *******PREPARE  SZ  FROM  :SQLSTMT                                @3212SEINO@@ 20090508
             PREPARE  SZ  FROM  :SQLSTMT5                               @3212SEINO@@
           END-EXEC                                                     20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID "PREPARE SQLCODE =[" SQLCODE "]"         20090508
      *-----------------------------------------------------------------20090508
           IF  SQLCODE = CNS-SQL-NORMAL                                 20090508
           THEN                                                         20090508
             CONTINUE                                                   20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID "PREPARE 正常"                           20090508
      *-----------------------------------------------------------------20090508
           ELSE                                                         20090508
      *----------  エラー検知プログラム名                               20090508
             MOVE  CNS-PGM-ID                                           20090508
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20090508
      *----------  ポジション                                           20090508
             MOVE  CNS-POS-020                                          20090508
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20090508
      *----------  リターンコード                                       20090508
             MOVE  CNS-RTN-900                                          20090508
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20090508
      *----------  詳細リターンコード                                   20090508
             MOVE  SQLCODE                                              20090508
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20090508
      *----------  詳細リターンコードデコードフラグ                     20090508
             MOVE  CNS-DETAIL-1                                         20090508
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20090508
      *----------  フリーメッセージ                                     20090508
      *******STRING SQLSTMT(1:FUNCTION  LENGTH(WK-DELETE-SQL-ZKZ))      @3212SEINO@@ 20090508
             STRING SQLSTMT5(1:FUNCTION  LENGTH(WK-DELETE-SQL-ZKZ))     @3212SEINO@@
                    "[:V1="                                             20111208
                     H-KJN-YMD-FROM-ZKZ                                 20111208
                    "][:V2="                                            20111208
                     H-KJN-YMD-TO-ZKZ                                   20111208
                    "]"                                                 20111208
                    DELIMITED BY SIZE                                   20090508
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1             20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"                20090508
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["   20090508
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["   20090508
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["   20090508
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["   20090508
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["   20090508
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["   20090508
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20090508
      *-----------------------------------------------------------------20090508
      *----------  エラー処理                                           20090508
               PERFORM  ERR-RTN                                         20090508
           END-IF                                                       20090508
           EXEC SQL                                                     20090508
               EXECUTE SZ                                               20090508
                 USING  :H-KJN-YMD-FROM-ZKZ,                            20111208
                        :H-KJN-YMD-TO-ZKZ                               20111208
           END-EXEC                                                     20090508
      *----------------------<DEBUG>------------------------------------20090508
      D    DISPLAY CNS-PGM-ID":DELETE SQLCODE=["SQLCODE"]"              20090508
      *-----------------------------------------------------------------20090508
           IF  SQLCODE = CNS-SQL-NORMAL  OR  SQLCODE = CNS-SQL-NOTFOUND 20090508
           THEN                                                         20090508
      *----------  ワークDB更新情報.処理件数(7)                         20090508 @3212SEINO@@
             COMPUTE  WK-TBL-SYORI-COUNT OF  WK-DB-MSG(CNS-7)           20090508 @3212SEINO@@
                   =  WK-TBL-SYORI-COUNT OF  WK-DB-MSG(CNS-7)           20090508 @3212SEINO@@
                   +  SQLERRD            OF  SQLCA(3)                   20090508
      *----------------------<DEBUG>------------------------------------20090508
      D    DISPLAY CNS-PGM-ID":勘定残高TBLからごみデータ削除処理 正常"  20090508
      D    DISPLAY CNS-PGM-ID":ワークDB更新情報.処理件数(7)=["          20090508
      D            WK-TBL-SYORI-COUNT   OF  WK-DB-MSG(CNS-7) "]"        20090508
      *-----------------------------------------------------------------20090218
           ELSE                                                         20090508
      *----------  エラー検知プログラム名                               20090508
             MOVE  CNS-PGM-ID                                           20090508
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20090508
      *----------  ポジション                                           20090508
             MOVE  CNS-POS-021                                          20090508
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20090508
      *----------  リターンコード                                       20090508
             MOVE  CNS-RTN-900                                          20090508
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20090508
      *----------  詳細リターンコード                                   20090508
             MOVE  SQLCODE                                              20090508
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20090508
      *----------  詳細リターンコードデコードフラグ                     20090508
             MOVE  CNS-DETAIL-1                                         20090508
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20090508
      *----------  フリーメッセージ                                     20090508
      *******STRING SQLSTMT(1:FUNCTION  LENGTH(WK-DELETE-SQL-ZKZ))      @3212SEINO@@ 20090508
             STRING SQLSTMT5(1:FUNCTION  LENGTH(WK-DELETE-SQL-ZKZ))     @3212SEINO@@
                    "[:V1="                                             20111208
                     H-KJN-YMD-FROM-ZKZ                                 20111208
                    "][:V2="                                            20111208
                     H-KJN-YMD-TO-ZKZ                                   20111208
                    "]"                                                 20111208
                    DELIMITED BY SIZE                                   20090508
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1             20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ": ***  勘定残高TBLからごみデータ削除処理 異常  ***"20090508
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["   20090508
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["   20090508
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["   20090508
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["   20090508
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["   20090508
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["   20090508
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20090508
      *-----------------------------------------------------------------20090508
      *----------  エラー処理                                           20090508
               PERFORM  ERR-RTN                                         20090508
           END-IF                                                       20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ":***  勘定残高TBLからごみデータ削除処理 END ***"   20090508
      *-----------------------------------------------------------------20090508
           CONTINUE.                                                    20090508
       DELETE-TKMZKZ00-EXT.                                             20090508
           EXIT.                                                        20090508
      ******************************************************************20090508
      *    ③評価計算入力TBLからごみデータ削除処理                      20090508
      ******************************************************************20090508
       DELETE-TKMHHI00-RTN    SECTION.                                  20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D    ":***  評価計算入力TBLからごみデータ削除処理 START  ***"     20090508
      *-----------------------------------------------------------------20090508
      *****INITIALIZE  SQLSTMT                                          @3212SEINO@@ 20090508
           INITIALIZE  SQLSTMT6                                         @3212SEINO@@
                       WK-DELETE-SQL-HHI                                20090508
      *----------  評価計算入力TBL K                                    20090508
           MOVE  WK-TAB-TKMHHI00                                        20090508
             TO  WK-TBL-TKMHHI00-K      OF  WK-DELETE-SQL-HHI           20090508
      *----------  評価履歴TBL N                                        20090508
           MOVE  WK-TAB-TKMHHR00                                        20090508
             TO  WK-TBL-TKMHHR00-N      OF  WK-DELETE-SQL-HHI           20090508
      *----------  SCZY7060より取得した上電文.基準日FROM                20111208
           MOVE  I-KJN-FR-YMD           OF  WK-DATA-IN                  20111208
             TO  H-KJN-YMD-FROM-HHI                                     20111208
      *----------  SCZY7060より取得した上電文.基準日TO                  20111208
           MOVE  I-KJN-TO-YMD           OF  WK-DATA-IN                  20111208
             TO  H-KJN-YMD-TO-HHI                                       20111208
      *****MOVE  WK-DELETE-SQL-HHI      TO  SQLSTMT                     @3212SEINO@@ 20090508
           MOVE  WK-DELETE-SQL-HHI      TO  SQLSTMT6                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID":評価計算入力TBL K=["                    20090508
      D             WK-TBL-TKMHHI00-K   OF  WK-DELETE-SQL-HHI"]"        20090508
      D    DISPLAY  CNS-PGM-ID":評価履歴TBL N=["                        20090508
      D             WK-TBL-TKMHHR00-N   OF  WK-DELETE-SQL-HHI"]"        20090508
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-FROM-HHI=["                   20111208
      D             H-KJN-YMD-FROM-HHI"]"                               20111208
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-TO-HHI=["H-KJN-YMD-TO-HHI"]"  20111208
      D    DISPLAY  CNS-PGM-ID":WK-DELETE-SQL-HHI=["WK-DELETE-SQL-HHI"]"20090508
      *D***DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                    @3212SEINO@@ 20090508
      D    DISPLAY  CNS-PGM-ID":SQLSTMT6=["SQLSTMT6"]"                  @3212SEINO@@
      *-----------------------------------------------------------------20090508
           EXEC  SQL                                                    20090508
      *******PREPARE  SI  FROM  :SQLSTMT                                @3212SEINO@@ 20090508
             PREPARE  SI  FROM  :SQLSTMT6                               @3212SEINO@@
           END-EXEC                                                     20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID "PREPARE SQLCODE =[" SQLCODE "]"         20090508
      *-----------------------------------------------------------------20090508
           IF  SQLCODE = CNS-SQL-NORMAL                                 20090508
           THEN                                                         20090508
             CONTINUE                                                   20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID "PREPARE 正常"                           20090508
      *-----------------------------------------------------------------20090508
           ELSE                                                         20090508
      *----------  エラー検知プログラム名                               20090508
             MOVE  CNS-PGM-ID                                           20090508
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20090508
      *----------  ポジション                                           20090508
             MOVE  CNS-POS-022                                          20090508
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20090508
      *----------  リターンコード                                       20090508
             MOVE  CNS-RTN-900                                          20090508
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20090508
      *----------  詳細リターンコード                                   20090508
             MOVE  SQLCODE                                              20090508
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20090508
      *----------  詳細リターンコードデコードフラグ                     20090508
             MOVE  CNS-DETAIL-1                                         20090508
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20090508
      *----------  フリーメッセージ                                     20090508
      *******STRING SQLSTMT(1:FUNCTION  LENGTH(WK-DELETE-SQL-HHI))      @3212SEINO@@ 20090508
             STRING SQLSTMT6(1:FUNCTION  LENGTH(WK-DELETE-SQL-HHI))     @3212SEINO@@
                    "[:V1="                                             20111208
                     H-KJN-YMD-FROM-HHI                                 20111208
                    "][:V2="                                            20111208
                     H-KJN-YMD-TO-HHI                                   20111208
                    "]"                                                 20111208
                    DELIMITED BY SIZE                                   20090508
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1             20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID": ***  PREPARE 異常  ***"                20090508
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["   20090508
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["   20090508
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["   20090508
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["   20090508
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["   20090508
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["   20090508
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20090508
      *-----------------------------------------------------------------20090508
      *----------  エラー処理                                           20090508
               PERFORM  ERR-RTN                                         20090508
           END-IF                                                       20090508
           EXEC SQL                                                     20090508
               EXECUTE SI                                               20090508
                 USING  :H-KJN-YMD-FROM-HHI,                            20111208
                        :H-KJN-YMD-TO-HHI                               20111208
           END-EXEC                                                     20090508
      *----------------------<DEBUG>------------------------------------20090508
      D    DISPLAY CNS-PGM-ID":DELETE SQLCODE=["SQLCODE"]"              20090508
      *-----------------------------------------------------------------20090508
           IF  SQLCODE = CNS-SQL-NORMAL  OR  SQLCODE = CNS-SQL-NOTFOUND 20090508
           THEN                                                         20090508
             CONTINUE                                                   20090508
      *----------------------<DEBUG>------------------------------------20090508
      D    DISPLAY CNS-PGM-ID                                           20090508
      D            ":評価計算入力TBLからごみデータ削除処理 正常"        20090508
      *-----------------------------------------------------------------20090218
           ELSE                                                         20090508
      *----------  エラー検知プログラム名                               20090508
             MOVE  CNS-PGM-ID                                           20090508
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          20090508
      *----------  ポジション                                           20090508
             MOVE  CNS-POS-023                                          20090508
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          20090508
      *----------  リターンコード                                       20090508
             MOVE  CNS-RTN-900                                          20090508
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          20090508
      *----------  詳細リターンコード                                   20090508
             MOVE  SQLCODE                                              20090508
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          20090508
      *----------  詳細リターンコードデコードフラグ                     20090508
             MOVE  CNS-DETAIL-1                                         20090508
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          20090508
      *----------  フリーメッセージ                                     20090508
      *******STRING SQLSTMT(1:FUNCTION  LENGTH(WK-DELETE-SQL-HHI))      @3212SEINO@@ 20090508
             STRING SQLSTMT6(1:FUNCTION  LENGTH(WK-DELETE-SQL-HHI))     @3212SEINO@@
                    "[:V1="                                             20111208
                     H-KJN-YMD-FROM-HHI                                 20111208
                    "][:V2="                                            20111208
                     H-KJN-YMD-TO-HHI                                   20111208
                    "]"                                                 20111208
                    DELIMITED BY SIZE                                   20090508
                    INTO  FREE-MSG   OF  PARM-SCZY1170-ARG1             20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ": *** 評価計算入力TBLからごみデータ削除処理異常***"20090508
      D    DISPLAY  CNS-PGM-ID": エラー検知プログラム名           =["   20090508
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": ポジション                       =["   20090508
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": リターンコード                   =["   20090508
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコード               =["   20090508
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": 詳細リターンコードデコードフラグ =["   20090508
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       20090508
      D    DISPLAY  CNS-PGM-ID": フリーメッセージ                 =["   20090508
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       20090508
      *-----------------------------------------------------------------20090508
      *----------  エラー処理                                           20090508
               PERFORM  ERR-RTN                                         20090508
           END-IF                                                       20090508
      *-------------------<DEBUG>---------------------------------------20090508
      D    DISPLAY  CNS-PGM-ID                                          20090508
      D             ":*** 評価計算入力TBLからごみデータ削除処理 END ***"20090508
      *-----------------------------------------------------------------20090508
           CONTINUE.                                                    20090508
       DELETE-TKMHHI00-EXT.                                             20090508
           EXIT.                                                        20090508
      ******************************************************************
      *    1-3) 評価系列情報取得
      ******************************************************************
       SCZY4311-GET-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  評価系列情報取得 START  ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY4311-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4311-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY4311-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4311 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  評価系列情報メモリ格納処理(SCZY4311)をコールする
           CALL  "SCZY4311"             USING  PARM-SCZY4311-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4311 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY4311=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
      *----------  リターンコード＝'000'(正常)の場合
             WHEN  CNS-RTN-000
      *----------  ワーク評価系列データエリア←【SCZY4311】.評価系列データエリア
               MOVE  PARM-SCZY4311-ARG2   OF  PARM-SCZY4311-INOUT
                 TO  WK-TKPFPT02-AREA
      *----------  リターンコード＝'110'(データなし)の場合
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-032
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  DETAIL-RTN-CD-FLG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  FREE-MSG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  評価系列情報取得 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 評価系列情報取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4311-GET-EXT.
           EXIT.
      ******************************************************************
      *    1-4) 評価計算パターン情報取得
      ******************************************************************
       SCZY4305-GET-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  評価計算パターン情報取得 START  ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY4305-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4305-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY4305-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4305 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  評価計算パターン情報メモリ格納処理(SCZY4305)をコールする
           CALL  "SCZY4305"             USING  PARM-SCZY4305-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4305 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY4305=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
      *----------  リターンコード＝'000'(正常)の場合
             WHEN  CNS-RTN-000
      *----------  ワーク評価系列データエリア←【SCZY4305】.評価系列データエリア
               MOVE  PARM-SCZY4305-ARG2   OF  PARM-SCZY4305-INOUT
                 TO  WK-TKPFPT03-AREA
      *----------  リターンコード＝'110'(データなし)の場合
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-033
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  DETAIL-RTN-CD-FLG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  FREE-MSG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  評価計算パターン情報取得 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 評価計算パターン情報取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4305-GET-EXT.
           EXIT.
      ******************************************************************
      *    1-5) 評価時価取得方法パターン情報取得
      ******************************************************************
       SCZY4307-GET-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  評価時価取得方法パターン情報取得 START  ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY4307-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4307-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY4307-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4307 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  評価時価取得方法パターン情報メモリ格納処理(SCZY4307)をコールする
           CALL  "SCZY4307"             USING  PARM-SCZY4307-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4307 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY4307=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
      *----------  リターンコード＝'000'(正常)の場合
             WHEN  CNS-RTN-000
      *----------  ワーク評価系列データエリア←【SCZY4307】.評価系列データエリア
               MOVE  PARM-SCZY4307-ARG2   OF  PARM-SCZY4307-INOUT
                 TO  WK-TKPFPT04-AREA
      *----------  リターンコード＝'110'(データなし)の場合
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-034
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  DETAIL-RTN-CD-FLG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  FREE-MSG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  評価時価取得方法パターン情報取得 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 評価時価取得方法パターン情報取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4307-GET-EXT.
           EXIT.
      ******************************************************************
      *    1-6) 評価為替取得方法パターン情報取得
      ******************************************************************
       SCZY4309-GET-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  評価為替取得方法パターン情報取得 START  ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY4309-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4309-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY4309-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4309 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  評価為替取得方法パターン情報メモリ格納処理(SCZY4309)をコールする
           CALL  "SCZY4309"             USING  PARM-SCZY4309-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4309 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY4309=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
      *----------  リターンコード＝'000'(正常)の場合
             WHEN  CNS-RTN-000
      *----------  ワーク評価系列データエリア←【SCZY4309】.評価系列データエリア
               MOVE  PARM-SCZY4309-ARG2   OF  PARM-SCZY4309-INOUT
                 TO  WK-TKPFPT05-AREA
      *----------  リターンコード＝'110'(データなし)の場合
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-035
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  DETAIL-RTN-CD-FLG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  FREE-MSG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  評価為替取得方法パターン情報取得 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 評価為替取得方法パターン情報取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4309-GET-EXT.
           EXIT.
      ******************************************************************
      *    1-7) 料率情報取得
      ******************************************************************
       SCZY4407-GET-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  料率情報取得 START  ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY4407-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4407-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY4407-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4407 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  料率情報メモリ格納処理(SCZY4407)をコールする
           CALL  "SCZY4407"             USING  PARM-SCZY4407-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4407 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY4407=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
      *----------  リターンコード＝'000'(正常)の場合
             WHEN  CNS-RTN-000
      *----------  ワーク評価系列データエリア←【SCZY4407】.評価系列データエリア
               MOVE  PARM-SCZY4407-ARG2   OF  PARM-SCZY4407-INOUT
                 TO  WK-TKCMRY00-AREA
      *----------  リターンコード＝'110'(データなし)の場合
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-036
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  DETAIL-RTN-CD-FLG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  FREE-MSG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  評価為替取得方法パターン情報取得 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 評価為替取得方法パターン情報取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4407-GET-EXT.
           EXIT.
      ******************************************************************
      *    1-8) 通貨情報取得
      ******************************************************************
       SCZY4401-GET-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  通貨情報取得 START  ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY4401-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4401-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY4401-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4401 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  通貨情報メモリ格納処理(SCZY4401)をコールする
           CALL  "SCZY4401"             USING  PARM-SCZY4401-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4401 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY4401=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
      *----------  リターンコード＝'000'(正常)の場合
             WHEN  CNS-RTN-000
      *----------  ワーク評価系列データエリア←【SCZY4401】.評価系列データエリア
               MOVE  PARM-SCZY4401-ARG2   OF  PARM-SCZY4401-INOUT
                 TO  WK-TKCMTK00-AREA
      *----------  リターンコード＝'110'(データなし)の場合
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-037
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  DETAIL-RTN-CD-FLG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  FREE-MSG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  通貨情報取得 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 通貨情報取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4401-GET-EXT.
           EXIT.
      ******************************************************************
      *    1-9) 為替換算情報メモリ格納処理
      ******************************************************************
       SCZY4501-GET-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  為替換算情報メモリ格納処理 START  ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY4501-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4501-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["
      D             RIYO-CMP-CD         OF PARM-SCZY4501-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4501 START  ***"
      *--------------------<DEBUG>--------------------------------------
      *----------  為替換算情報メモリ格納処理(SCZY4501)をコールする
           CALL  "SCZY4501"             USING  PARM-SCZY4501-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4501 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF SCZY4501=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
      *----------  リターンコード＝'000'(正常)の場合
             WHEN  CNS-RTN-000
      *----------  ワーク評価系列データエリア←【SCZY4501】.評価系列データエリア
               MOVE  PARM-SCZY4501-ARG2   OF  PARM-SCZY4501-INOUT
                 TO  WK-TKJCKK00-AREA
      *----------  リターンコード＝'110'(データなし)の場合
             WHEN  CNS-RTN-110
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-038
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  DETAIL-RTN-CD-FLG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  FREE-MSG
                 OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  為替換算情報メモリ格納処理 異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 為替換算情報メモリ格納処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4501-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2 2) ポートフォリオ別ループ処理
      ******************************************************************
       PF-LOOP-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ別ループ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMHJ1110-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SMHJ1110-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SMHJ1110-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SMHJ1110-ARG1
      *----------  銘柄指定コビ－句
           PERFORM                  VARYING WK-IDX7 FROM CNS-1 BY CNS-1
             UNTIL  WK-IDX7 > CNS-10
             MOVE  I-SEC-SBT-CD-FLG     OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  SEC-SBT-CD-FLG       OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-SEC-SBT-CD         OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  SEC-SBT-CD           OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-MEG-TUKA-CD-FLG    OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  MEG-TUKA-CD-FLG      OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-MEG-TUKA-CD        OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  MEG-TUKA-CD          OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-HAKO-CD-FLG        OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  HAKKO-TAI-KUNI-CD-FLG
                                        OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-HAKO-CD            OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  HAKKO-TAI-KUNI-CD    OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-TSTSK-CD-FLG       OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  TOUSI-TARGET-KUNI-CD-FLG
                                        OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-TSTSK-CD           OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  TOUSI-TARGET-KUNI-CD OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-GAIBU-MEG-CD-FLG   OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  GAIBU-MEG-CD-FLG     OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-GAIBU-MEG-CD       OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  GAIBU-MEG-CD         OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-KABU-SBT           OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  KABU-SBT             OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-KAYI               OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  KAYI                 OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-GOU                OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  GOU                  OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-GENGETSU           OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  GENGETSU             OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-STRIKEPRICE        OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  STRIKEPRICE          OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
             MOVE  I-MNK-YMD            OF  I-MG-GRP
                                        OF  WK-DATA-IN(WK-IDX7)
               TO  MNK-YMD              OF  MEG-SITEI-AREA
                                        OF  PARM-SMHJ1110-INOUT(WK-IDX7)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SEC-SBT-CD-FLG("WK-IDX7")=["
      D             SEC-SBT-CD-FLG   OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":SEC-SBT-CD("WK-IDX7")=["
      D             SEC-SBT-CD       OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":MEG-TUKA-CD-FLG("WK-IDX7")=["
      D             MEG-TUKA-CD-FLG  OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":MEG-TUKA-CD("WK-IDX7")=["
      D             MEG-TUKA-CD      OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":HAKKO-TAI-KUNI-CD-FLG("WK-IDX7")=["
      D             HAKKO-TAI-KUNI-CD-FLG
      D                              OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":HAKKO-TAI-KUNI-CD("WK-IDX7")=["
      D             HAKKO-TAI-KUNI-CD
      D                              OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":TOUSI-TARGET-KUNI-CD-FLG("WK-IDX7")=["
      D             TOUSI-TARGET-KUNI-CD-FLG
      D                              OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":TOUSI-TARGET-KUNI-CD("WK-IDX7")=["
      D             TOUSI-TARGET-KUNI-CD
      D                              OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":GAIBU-MEG-CD-FLG("WK-IDX7")=["
      D             GAIBU-MEG-CD-FLG OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":GAIBU-MEG-CD("WK-IDX7")=["
      D             GAIBU-MEG-CD     OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":KABU-SBT("WK-IDX7")=["
      D             KABU-SBT         OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":KAYI("WK-IDX7")=["
      D             KAYI             OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":GOU("WK-IDX7")=["
      D             GOU              OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":GENGETSU("WK-IDX7")=["
      D             GENGETSU         OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":STRIKEPRICE("WK-IDX7")=["
      D             STRIKEPRICE      OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      D    DISPLAY  CNS-PGM-ID":MNK-YMD("WK-IDX7")=["
      D             MNK-YMD          OF  MEG-SITEI-AREA
      D                              OF  PARM-SMHJ1110-INOUT(WK-IDX7)"]"
      *-----------------------------------------------------------------
           END-PERFORM
      *----------  基準日FROM指定フラグ
           MOVE  WK-KJN-YMD-FROM-FLG
             TO  KJN-YMD-FROM-FLG       OF  PARM-SMHJ1110-ARG1
      *----------  銘柄指定ありフラグ
           MOVE  WK-MEG-FLG
             TO  MEG-FLG                OF  PARM-SMHJ1110-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-JIKO-DATA(WK-IDX6)
             TO  FUND-CD                OF  PARM-SMHJ1110-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-JIKO-DATA(WK-IDX6)
             TO  PTF-CD                 OF  PARM-SMHJ1110-ARG1
      *----------  基準日From
           MOVE  WK-KJN-YMD-FROM        OF  WK-JIKO-DATA(WK-IDX6)
             TO  KJN-YMD-FROM           OF  PARM-SMHJ1110-ARG1
      *----------  基準日To
           MOVE  WK-KJN-YMD-TO          OF  WK-JIKO-DATA(WK-IDX6)
             TO  KJN-YMD-TO             OF  PARM-SMHJ1110-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-JIKO-DATA(WK-IDX6)
             TO  HYK-KRTU-CD            OF  PARM-SMHJ1110-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-JIKO-DATA(WK-IDX6)
             TO  GYOMU-TASK-ID          OF  PARM-SMHJ1110-ARG1
      *----------  ユーザＩＤ
           MOVE  JOB-USER-ID            OF  WK-AIFA-IN
                                        OF  WK-DENBUN-AREA
             TO  USER-ID                OF  PARM-SMHJ1110-ARG1
      *----------  引継のリターンコード                                 20090117
           MOVE  WK-SUCCE-R-CD                                          20090117
             TO  SUCCE-RTN-CD           OF  PARM-SMHJ1110-ARG1          20090117
      *----------  評価系列データエリア
           MOVE  WK-TKPFPT02-AREA
             TO  HYK-KRTU-AREA          OF  PARM-SMHJ1110-ARG1
      *----------  評価計算パターンデータエリア
           MOVE  WK-TKPFPT03-AREA
             TO  HYK-CALC-AREA          OF  PARM-SMHJ1110-ARG1
      *----------  評価時価取得方法パターンデータエリア
           MOVE  WK-TKPFPT04-AREA
             TO  HYK-HOU-AREA           OF  PARM-SMHJ1110-ARG1
      *----------  評価為替取得方法パターンデータエリア
           MOVE  WK-TKPFPT05-AREA
             TO  HYK-EX-HOU-AREA        OF  PARM-SMHJ1110-ARG1
      *----------  料率データエリア
           MOVE  WK-TKCMRY00-AREA
             TO  RYORITU-AREA           OF  PARM-SMHJ1110-ARG1
      *----------  通貨データエリア
           MOVE  WK-TKCMTK00-AREA
             TO  TUKA-CD-AREA           OF  PARM-SMHJ1110-ARG1
      *----------  為替換算情報データエリア
           MOVE  WK-TKJCKK00-AREA
             TO  KWS-KRTU-AREA          OF  PARM-SMHJ1110-ARG1
      *----------  ＧＩＰＳモード
           MOVE  WK-GIPS-MODE
             TO  GIPS-MODE              OF  PARM-SMHJ1110-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             RIYO-CMP-CD         OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             SYORI-YMD           OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             KIDOU-ID            OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定エリア =["
      D             MEG-SITEI-AREA      OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM指定フラグ =["
      D             KJN-YMD-FROM-FLG    OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄指定ありフラグ =["
      D             MEG-FLG             OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D             FUND-CD             OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             PTF-CD              OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日From =["
      D             KJN-YMD-FROM        OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日To =["
      D             KJN-YMD-TO          OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード =["
      D             HYK-KRTU-CD         OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID =["
      D             GYOMU-TASK-ID       OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ユーザＩＤ =["
      D             USER-ID             OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":引継のリターンコード =["                20090117
      D             SUCCE-RTN-CD        OF  PARM-SMHJ1110-ARG1"]"       20090117
      D    DISPLAY  CNS-PGM-ID":評価系列データエリア =["
      D             HYK-KRTU-AREA       OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価計算パターンデータエリア =["
      D             HYK-CALC-AREA       OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価時価取得方法パターンデータエリア =["
      D             HYK-HOU-AREA        OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価為替取得方法パターンデータエリア =["
      D             HYK-EX-HOU-AREA     OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":料率データエリア =["
      D             RYORITU-AREA        OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":通貨データエリア =["
      D             TUKA-CD-AREA        OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":為替換算情報データエリア =["
      D             KWS-KRTU-AREA       OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード =["
      D             GIPS-MODE           OF  PARM-SMHJ1110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SMHJ1110 START  ***"
      *-----------------------------------------------------------------
           CALL  "SMHJ1110"             USING  PARM-SMHJ1110-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SMHJ1110 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMHJ1110)            =["
      D             RTN-CD   OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
             WHEN  CNS-RTN-900
             WHEN  CNS-RTN-901
             WHEN  CNS-RTN-800
      *----------  ポジション
               MOVE  CNS-POS-013
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード+
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                              (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING "SMHJ1110ポートフォリオ別ループ処理エラー:"
                 "利用会社コード =["
                  RIYO-CMP-CD           OF  PARM-SMHJ1110-ARG1
                 "] 処理実行日 =["
                  SYORI-YMD             OF  PARM-SMHJ1110-ARG1
                 "] 起動ID =["
                  KIDOU-ID              OF  PARM-SMHJ1110-ARG1
                 "] ファンドコード =["
                  FUND-CD               OF  PARM-SMHJ1110-ARG1
                 "] ポートフォリオコード =["
                  PTF-CD                OF  PARM-SMHJ1110-ARG1
                 "] 基準日From =["
                  KJN-YMD-FROM          OF  PARM-SMHJ1110-ARG1
                 "] 基準日To =["
                  KJN-YMD-TO            OF  PARM-SMHJ1110-ARG1
                 "] 評価系列コード =["
                  HYK-KRTU-CD           OF  PARM-SMHJ1110-ARG1
                 "] 業務タスクID =["
                  GYOMU-TASK-ID         OF  PARM-SMHJ1110-ARG1
                 "] ユーザＩＤ =["
                  USER-ID               OF  PARM-SMHJ1110-ARG1
                 "] 引継のリターンコード =["
                  SUCCE-RTN-CD          OF  PARM-SMHJ1110-ARG1
                 "] 評価系列データエリア =["
                  HYK-KRTU-AREA         OF  PARM-SMHJ1110-ARG1
                 "] 評価計算パターンデータエリア =["
                  HYK-CALC-AREA         OF  PARM-SMHJ1110-ARG1
                 "] 評価時価取得方法パターンデータエリア =["
                  HYK-HOU-AREA          OF  PARM-SMHJ1110-ARG1
                 "] 評価為替取得方法パターンデータエリア =["
                  HYK-EX-HOU-AREA       OF  PARM-SMHJ1110-ARG1
                 "] 料率データエリア =["
                  RYORITU-AREA          OF  PARM-SMHJ1110-ARG1
                 "] 通貨データエリア =["
                  TUKA-CD-AREA          OF  PARM-SMHJ1110-ARG1
                 "] 為替換算情報データエリア =["
                  KWS-KRTU-AREA         OF  PARM-SMHJ1110-ARG1
                 DELIMITED BY SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ別ループ処理  異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
             WHEN  CNS-RTN-008                                          20081104
             WHEN  CNS-RTN-010                                          20081104
      *-------------------<DEBUG>---------------------------------------20081104
      D    DISPLAY  CNS-PGM-ID                                          20081104
      D             ":***  ポートフォリオ別ループ処理  正常  ***"       20081104
      *-----------------------------------------------------------------20081104
               MOVE  FUNCTION NUMVAL(RTN-CD                             20081104
                 OF  PARM-RTNPKG(COUNTER                                20081104
                                        OF  PARM-RTNPKG))               20081104
                 TO  WK-RTN-CD-COM                                      20081104
      *-------------------<DEBUG>---------------------------------------20081104
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM =["WK-RTN-CD-COM"]"       20081104
      *-----------------------------------------------------------------20081104
      *----------  ワーニング更新                                       20081104
               PERFORM  WRN-UPD-RTN                                     20081104
      *----------  DB更新情報編集処理                                   20081104
               PERFORM  DB-UPD-MSG-RTN                                  20081104
      *----------  後処理                                               20081104
               PERFORM  END-RTN                                         20081104
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ別ループ処理  正常  ***"
      *-----------------------------------------------------------------
               MOVE  FUNCTION NUMVAL(RTN-CD
                 OF  PARM-RTNPKG(COUNTER
                                        OF  PARM-RTNPKG))
                 TO  WK-RTN-CD-COM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD-COM =["WK-RTN-CD-COM"]"
      *-----------------------------------------------------------------
      *----------  ワーニング更新
               PERFORM  WRN-UPD-RTN
      *----------  DB更新情報編集処理
               PERFORM  DB-UPD-MSG-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ別ループ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PF-LOOP-EXT.
           EXIT.
      ******************************************************************
      *    ワーニング更新
      ******************************************************************
       WRN-UPD-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーニング更新 START ***"
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード比較値=["
      D             WK-RTN-CD-COM"]"
      *-----------------------------------------------------------------
           IF  WK-RTN-CD < WK-RTN-CD-COM
           THEN
             MOVE  WK-RTN-CD-COM        TO  WK-RTN-CD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D        ":ワークリターンコード NOT < ワークリターンコード比較値"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーニング更新 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WRN-UPD-EXT.
           EXIT.
      ******************************************************************
      *    DB更新情報編集処理
      ******************************************************************
       DB-UPD-MSG-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** DB更新情報編集処理 START ***"
      *-----------------------------------------------------------------
      *----------  識別子(1)
           MOVE  WK-TAB-TKDYAA40
             TO  WK-TBL-ID              OF  WK-DB-MSG(CNS-1)
      *----------  対象処理(1)
           MOVE  CNS-SQL-FETCH
             TO  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-1)
      *----------  処理件数(1)
           COMPUTE  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-1)
                 =  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-1)
                 +  TBL-SYORI-COUNT     OF  DB-UPDATE-MSG-GRP(CNS-1)
      *----------  識別子(2)
           MOVE  WK-TAB-TKMHHI00
             TO  WK-TBL-ID              OF  WK-DB-MSG(CNS-2)
      *----------  対象処理(2)
           MOVE  CNS-SQL-FETCH
             TO  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-2)
      *----------  処理件数(2)
           COMPUTE  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-2)
                 =  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-2)
                 +  TBL-SYORI-COUNT     OF  DB-UPDATE-MSG-GRP(CNS-2)
      *----------  識別子(3)
           MOVE  WK-TAB-TKMHHR00
             TO  WK-TBL-ID              OF  WK-DB-MSG(CNS-3)
      *----------  対象処理(3)
           MOVE  CNS-SQL-INSERT
             TO  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-3)
      *----------  処理件数(3)
           COMPUTE  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-3)
                 =  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-3)
                 +  TBL-SYORI-COUNT     OF  DB-UPDATE-MSG-GRP(CNS-3)
      *----------  識別子(4)
           MOVE  WK-TAB-TKMHHR00
             TO  WK-TBL-ID              OF  WK-DB-MSG(CNS-4)
      *----------  対象処理(4)
           MOVE  CNS-SQL-UPDATE
             TO  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-4)
      *----------  処理件数(4)
           COMPUTE  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-4)
                 =  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-4)
                 +  TBL-SYORI-COUNT     OF  DB-UPDATE-MSG-GRP(CNS-4)
      *----------  識別子(5)
           MOVE  WK-TAB-TKMZKZ00                                        20090508
             TO  WK-TBL-ID              OF  WK-DB-MSG(CNS-5)
      *----------  対象処理(5)
           MOVE  CNS-SQL-INSERT                                         20090508
             TO  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-5)
      *----------  処理件数(5)
           COMPUTE  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-5)
                 =  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-5)
                 +  TBL-SYORI-COUNT     OF  DB-UPDATE-MSG-GRP(CNS-5)
      **----------  識別子(6)
      *     MOVE  WK-TAB-TKDYAA40                                        20090508
      *       TO  WK-TBL-ID              OF  WK-DB-MSG(CNS-6)
      **----------  対象処理(6)
      *     MOVE  CNS-SQL-DELETE                                         20090508
      *       TO  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-6)
      **----------  処理件数(6)
      *     COMPUTE  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-6)
      *           =  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-6)
      *           +  TBL-SYORI-COUNT     OF  DB-UPDATE-MSG-GRP(CNS-6)
      *----------  識別子(6)                                            20090818
           MOVE  WK-TAB-TKMHHR00                                        20090508
             TO  WK-TBL-ID              OF  WK-DB-MSG(CNS-6)            20090818
      *----------  対象処理(6)                                          20090818
           MOVE  CNS-SQL-DELETE
             TO  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-6)            20090818
      *----------  処理件数(6)                                          20090818
           COMPUTE  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-6)            20090818
                 =  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-6)            20090818
                 +  TBL-SYORI-COUNT     OF  DB-UPDATE-MSG-GRP(CNS-7)
      *----------  識別子(7)                                            20090818
           MOVE  WK-TAB-TKMZKZ00                                        20090508
             TO  WK-TBL-ID              OF  WK-DB-MSG(CNS-7)            20090508 20090818
      *----------  対象処理(7)                                          20090508 20090818
           MOVE  CNS-SQL-DELETE                                         20090508
             TO  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-7)            20090508 20090818
      *----------  処理件数(7)                                          20090508 20090818
           COMPUTE  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-7)            20090508 20090818
                 =  WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-7)            20090508 20090818
                 +  TBL-SYORI-COUNT     OF  DB-UPDATE-MSG-GRP(CNS-8)    20090508
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":識別子("CNS-1")  =["
      D             WK-TBL-ID           OF  WK-DB-MSG(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理("CNS-1")=["
      D             WK-TBL-SYORI-NAME   OF  WK-DB-MSG(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数("CNS-1")=["
      D             WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":識別子("CNS-2")  =["
      D             WK-TBL-ID           OF  WK-DB-MSG(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理("CNS-2")=["
      D             WK-TBL-SYORI-NAME   OF  WK-DB-MSG(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数("CNS-2")=["
      D             WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":識別子("CNS-3")  =["
      D             WK-TBL-ID           OF  WK-DB-MSG(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理("CNS-3")=["
      D             WK-TBL-SYORI-NAME   OF  WK-DB-MSG(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数("CNS-3")=["
      D             WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":識別子("CNS-4")  =["
      D             WK-TBL-ID           OF  WK-DB-MSG(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理("CNS-4")=["
      D             WK-TBL-SYORI-NAME   OF  WK-DB-MSG(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数("CNS-4")=["
      D             WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":識別子("CNS-5")  =["
      D             WK-TBL-ID           OF  WK-DB-MSG(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理("CNS-5")=["
      D             WK-TBL-SYORI-NAME   OF  WK-DB-MSG(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数("CNS-5")=["
      D             WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-5)"]"
      *D    DISPLAY  CNS-PGM-ID":識別子("CNS-6")  =["
      *D             WK-TBL-ID           OF  WK-DB-MSG(CNS-6)"]"
      *D    DISPLAY  CNS-PGM-ID":対象処理("CNS-6")=["
      *D             WK-TBL-SYORI-NAME   OF  WK-DB-MSG(CNS-6)"]"
      *D    DISPLAY  CNS-PGM-ID":処理件数("CNS-6")=["
      *D             WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":識別子("CNS-6")  =["                    20090818
      D             WK-TBL-ID           OF  WK-DB-MSG(CNS-6)"]"         20090818
      D    DISPLAY  CNS-PGM-ID":対象処理("CNS-6")=["                    20090818
      D             WK-TBL-SYORI-NAME   OF  WK-DB-MSG(CNS-6)"]"         20090818
      D    DISPLAY  CNS-PGM-ID":処理件数("CNS-6")=["                    20090818
      D             WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-6)"]"         20090818
      D    DISPLAY  CNS-PGM-ID":識別子("CNS-7")  =["                    20090508 20090818
      D             WK-TBL-ID           OF  WK-DB-MSG(CNS-7)"]"         20090508 20090818
      D    DISPLAY  CNS-PGM-ID":対象処理("CNS-7")=["                    20090508 20090818
      D             WK-TBL-SYORI-NAME   OF  WK-DB-MSG(CNS-7)"]"         20090508 20090818
      D    DISPLAY  CNS-PGM-ID":処理件数("CNS-7")=["                    20090508 20090818
      D             WK-TBL-SYORI-COUNT  OF  WK-DB-MSG(CNS-7)"]"         20090508 20090818
      *-------------------<DEBUG>---------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** DB更新情報編集処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-UPD-MSG-EXT.
           EXIT.
      ******************************************************************
      *    3.3 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.3.1 コミットリリース処理
           PERFORM  COMMIT-ORA-REL-RTN
      *----------  3.3.2 処理件数出力
           PERFORM  OUT-KENSUU-RTN
      *----------  3.3.3 バッチ終了メッセージ出力
           PERFORM  OUT-END-MSG-RTN
      *----------  3.3.4 プログラム終了
      *----------  プログラム正常終了（リターンコード：0,2,4,6,8,10）
           MOVE  WK-RTN-CD              TO  WK-PGM-END-STS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":プログラム終了ステータス = [" WK-PGM-END-STS "]"
      D    DISPLAY  CNS-PGM-ID":***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           STOP RUN  WK-PGM-END-STS.
      ******************************************************************
      *    3.3.1 コミットリリース処理
      ******************************************************************
       COMMIT-ORA-REL-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  コミットリリース処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  COMMIT
           IF  FLG-ORA-CONNECT = CNS-ON
           THEN
             EXEC SQL
               COMMIT RELEASE
             END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT RELEASE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-OFF            TO  FLG-ORA-CONNECT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":コミットリリース処理 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
             ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":コミットリリース処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-015
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-COM-RELEASE-ERR
                 TO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  コミットリリース処理  異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
             END-IF
           ELSE
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT NOT= CNS-ON"
      *-----------------------------------------------------------------
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  コミットリリース処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       COMMIT-ORA-REL-EXT.
           EXIT.
      ******************************************************************
      *    3.3.2 処理件数出力
      ******************************************************************
       OUT-KENSUU-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  処理件数出力 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7040-INOUT
      *----------  テーブル・ファイル数
           MOVE  CNS-7                                                  20090508 20090818
             TO  TABLE-FILE-NUM         OF  PARM-SCZY7040-INOUT
      *----------  識別子(1)
           MOVE  WK-TBL-ID              OF  WK-DB-MSG(CNS-1)
             TO  IDENT-ID               OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-1)
      *----------  対象処理(1)
           MOVE  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-1)
             TO  OBJECT-DISPOSAL        OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-1)
      *----------  処理件数(1)
           MOVE  WK-TBL-SYORI-COUNT     OF  WK-DB-MSG(CNS-1)
             TO  DISPOSAL-NUM           OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-1)
      *----------  識別子(2)
           MOVE  WK-TBL-ID              OF  WK-DB-MSG(CNS-2)
             TO  IDENT-ID               OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-2)
      *----------  対象処理(2)
           MOVE  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-2)
             TO  OBJECT-DISPOSAL        OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-2)
      *----------  処理件数(2)
           MOVE  WK-TBL-SYORI-COUNT     OF  WK-DB-MSG(CNS-2)
             TO  DISPOSAL-NUM           OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-2)
      *----------  識別子(3)
           MOVE  WK-TBL-ID              OF  WK-DB-MSG(CNS-3)
             TO  IDENT-ID               OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-3)
      *----------  対象処理(3)
           MOVE  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-3)
             TO  OBJECT-DISPOSAL        OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-3)
      *----------  処理件数(3)
           MOVE  WK-TBL-SYORI-COUNT     OF  WK-DB-MSG(CNS-3)
             TO  DISPOSAL-NUM           OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-3)
      *----------  識別子(4)
           MOVE  WK-TBL-ID              OF  WK-DB-MSG(CNS-4)
             TO  IDENT-ID               OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-4)
      *----------  対象処理(4)
           MOVE  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-4)
             TO  OBJECT-DISPOSAL        OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-4)
      *----------  処理件数(4)
           MOVE  WK-TBL-SYORI-COUNT     OF  WK-DB-MSG(CNS-4)
             TO  DISPOSAL-NUM           OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-4)
      *----------  識別子(5)
           MOVE  WK-TBL-ID              OF  WK-DB-MSG(CNS-5)
             TO  IDENT-ID               OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-5)
      *----------  対象処理(5)
           MOVE  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-5)
             TO  OBJECT-DISPOSAL        OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-5)
      *----------  処理件数(5)
           MOVE  WK-TBL-SYORI-COUNT     OF  WK-DB-MSG(CNS-5)
             TO  DISPOSAL-NUM           OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-5)
      *----------  識別子(6)
           MOVE  WK-TBL-ID              OF  WK-DB-MSG(CNS-6)
             TO  IDENT-ID               OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-6)
      *----------  対象処理(6)
           MOVE  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-6)
             TO  OBJECT-DISPOSAL        OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-6)
      *----------  処理件数(6)
           MOVE  WK-TBL-SYORI-COUNT     OF  WK-DB-MSG(CNS-6)
             TO  DISPOSAL-NUM           OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-6)
      *----------  識別子(7)
           MOVE  WK-TBL-ID              OF  WK-DB-MSG(CNS-7)
             TO  IDENT-ID               OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-7)
      *----------  対象処理(7)
           MOVE  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-7)
             TO  OBJECT-DISPOSAL        OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-7)
      *----------  処理件数(7)
           MOVE  WK-TBL-SYORI-COUNT     OF  WK-DB-MSG(CNS-7)
             TO  DISPOSAL-NUM           OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-7)
      **----------  識別子(8)                                            20090508
      *     MOVE  WK-TBL-ID              OF  WK-DB-MSG(CNS-8)            20090508
      *       TO  IDENT-ID               OF  ARG2                        20090508
      *                                  OF  PARM-SCZY7040-INOUT(CNS-8)  20090508
      **----------  対象処理(8)                                          20090508
      *     MOVE  WK-TBL-SYORI-NAME      OF  WK-DB-MSG(CNS-8)            20090508
      *       TO  OBJECT-DISPOSAL        OF  ARG2                        20090508
      *                                  OF  PARM-SCZY7040-INOUT(CNS-8)  20090508
      **----------  処理件数(8)                                          20090508
      *     MOVE  WK-TBL-SYORI-COUNT     OF  WK-DB-MSG(CNS-8)            20090508
      *       TO  DISPOSAL-NUM           OF  ARG2                        20090508
      *                                  OF  PARM-SCZY7040-INOUT(CNS-8)  20090508
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブル・ファイル数=["
      D             TABLE-FILE-NUM      OF PARM-SCZY7040-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":識別子(1)  =["
      D             IDENT-ID            OF PARM-SCZY7040-INOUT(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(1)=["
      D             OBJECT-DISPOSAL     OF PARM-SCZY7040-INOUT(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(1)=["
      D             DISPOSAL-NUM        OF PARM-SCZY7040-INOUT(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(2)  =["
      D             IDENT-ID            OF PARM-SCZY7040-INOUT(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(2)=["
      D             OBJECT-DISPOSAL     OF PARM-SCZY7040-INOUT(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(2)=["
      D             DISPOSAL-NUM        OF PARM-SCZY7040-INOUT(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(3)  =["
      D             IDENT-ID            OF PARM-SCZY7040-INOUT(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(3)=["
      D             OBJECT-DISPOSAL     OF PARM-SCZY7040-INOUT(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(3)=["
      D             DISPOSAL-NUM        OF PARM-SCZY7040-INOUT(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(4)  =["
      D             IDENT-ID            OF PARM-SCZY7040-INOUT(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(4)=["
      D             OBJECT-DISPOSAL     OF PARM-SCZY7040-INOUT(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(4)=["
      D             DISPOSAL-NUM        OF PARM-SCZY7040-INOUT(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(5)  =["
      D             IDENT-ID            OF PARM-SCZY7040-INOUT(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(5)=["
      D             OBJECT-DISPOSAL     OF PARM-SCZY7040-INOUT(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(5)=["
      D             DISPOSAL-NUM        OF PARM-SCZY7040-INOUT(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(6)  =["
      D             IDENT-ID            OF PARM-SCZY7040-INOUT(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(6)=["
      D             OBJECT-DISPOSAL     OF PARM-SCZY7040-INOUT(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(6)=["
      D             DISPOSAL-NUM        OF PARM-SCZY7040-INOUT(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(7)  =["
      D             IDENT-ID            OF PARM-SCZY7040-INOUT(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(7)=["
      D             OBJECT-DISPOSAL     OF PARM-SCZY7040-INOUT(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(7)=["
      D             DISPOSAL-NUM        OF PARM-SCZY7040-INOUT(CNS-7)"]"
      *D    DISPLAY  CNS-PGM-ID":識別子(8)  =["                          20090508
      *D             IDENT-ID            OF PARM-SCZY7040-INOUT(CNS-8)"]"20090508
      *D    DISPLAY  CNS-PGM-ID":対象処理(8)=["                          20090508
      *D             OBJECT-DISPOSAL     OF PARM-SCZY7040-INOUT(CNS-8)"]"20090508
      *D    DISPLAY  CNS-PGM-ID":処理件数(8)=["                          20090508
      *D             DISPOSAL-NUM        OF PARM-SCZY7040-INOUT(CNS-8)"]"20090508
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7040 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7040"             USING  PARM-SCZY7040-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7040 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  処理件数出力 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       OUT-KENSUU-EXT.
           EXIT.
      ******************************************************************
      *    3.3.3 バッチ終了メッセージ出力
      ******************************************************************
       OUT-END-MSG-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  バッチ終了メッセージ出力 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7020-INOUT
                       PARM-RTNPKG
      *----------  エラー種別
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
           IF  WK-RTN-CD = CNS-RTN-000
           THEN
             MOVE  CNS-N
               TO  ERR-SYUBETU          OF  PARM-SCZY7020-ARG1
           ELSE
             IF  WK-RTN-CD = CNS-RTN-BT2  OR
                 WK-RTN-CD = CNS-RTN-BT4  OR
                 WK-RTN-CD = CNS-RTN-BT6  OR
                 WK-RTN-CD = CNS-RTN-BT8  OR
                 WK-RTN-CD = CNS-RTN-BT10
             THEN
               MOVE  CNS-U
                 TO  ERR-SYUBETU        OF  PARM-SCZY7020-ARG1
             ELSE
               CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード= '002','004',"
      D             "'006','008','010'以外"
      *-----------------------------------------------------------------
             END-IF
           END-IF
      *----------  プログラム名
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7020-ARG2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7020-ARG2
      *----------  基準日
           MOVE  WK-SYORI-YMD
             TO  KJN-YMD                OF  PARM-SCZY7020-ARG2
      *----------  実行処理ID
           MOVE  SPACE
             TO  JIKOU-SYORI-ID         OF  PARM-SCZY7020-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7020-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー種別=["
      D             ERR-SYUBETU         OF  PARM-SCZY7020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":プログラム名=["
      D             PGM-ID              OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":実行処理ID=["
      D             JIKOU-SYORI-ID      OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7020"             USING  PARM-SCZY7020-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  バッチ終了メッセージ出力 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       OUT-END-MSG-EXT.
           EXIT.
      ******************************************************************
      *    3.4 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-CR1-OPEN=["FLG-CR1-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
           IF  FLG-CR1-OPEN = CNS-ON
           THEN
             EXEC  SQL
               CLOSE CR1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR CLOSE)  =["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-OFF       TO  FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR1-OPEN =["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF  FLG-ORA-CONNECT = CNS-ON
           THEN
      *----------  3.4.1 ロールバックリリース処理
             PERFORM  ROLLBACK-ORA-REL-RTN
           ELSE
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク接続ステータス NOT ＝1（接続中）"
      *-----------------------------------------------------------------
           END-IF
      *----------  3.4.2 処理件数出力
           PERFORM  OUT-KENSUU-RTN
      *----------  3.4.3 リターンパッケージセット
           PERFORM  SET-RTNPKGS-RTN
      *----------  3.4.4 バッチ終了メッセージ出力
           PERFORM  PUT-END-MSG-RTN
      *----------  3.4.5 プログラム終了
           MOVE  CNS-RTN-BT16        TO  WK-PGM-END-STS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":プログラム終了ステータス = [" WK-PGM-END-STS "]"
      D    DISPLAY  CNS-PGM-ID
      D             ":◆◇◆◇◆◇◆◇ MMHJ0010 END   ◇◆◇◆◇◆◇◆"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           STOP RUN  WK-PGM-END-STS.
      ******************************************************************
      *    3.4.1 ロールバックリリース処理
      ******************************************************************
       ROLLBACK-ORA-REL-RTN   SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ロールバックリリース処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  ROLLBACK
           EXEC SQL
               ROLLBACK RELEASE
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(ROLLBACK RELEASE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ロールバック リリース処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ロールバック リリース処理エラー"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-016
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  "ロールバック リリース処理"
               DELIMITED BY SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ロールバック リリース処理  異常  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ロールバックリリース処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ROLLBACK-ORA-REL-EXT.
           EXIT.
      ******************************************************************
      *    3.4.3 リターンパッケージセット
      ******************************************************************
       SET-RTNPKGS-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** リターンパッケージセット START ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG                     =["
      D             PARM-RTNPKG                               "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
           CALL   "SCZY1170"            USING  PARM-SCZY1170-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG           =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG(SCZY1170) =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":***  リターンパッケージセット  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SET-RTNPKGS-EXT.
           EXIT.
      ******************************************************************
      *    3.4.4 バッチ終了メッセージ出力
      ******************************************************************
       PUT-END-MSG-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** バッチ終了メッセージ出力 START ***"
      *--------------------<DEBUG>--------------------------------------
           INITIALIZE  PARM-SCZY7020-INOUT
      *----------  エラー種別
           MOVE  CNS-S
             TO  ERR-SYUBETU            OF  PARM-SCZY7020-INOUT
      *----------  プログラム名
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7020-INOUT
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7020-INOUT
      *----------  基準日
           MOVE  WK-SYORI-YMD
             TO  KJN-YMD                OF  PARM-SCZY7020-INOUT
      *----------  実行処理ID
           MOVE  SPACE
             TO  JIKOU-SYORI-ID         OF  PARM-SCZY7020-INOUT
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7020-INOUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7020-ARG1:"
      D    DISPLAY  CNS-PGM-ID":エラー種別    =["
      D             ERR-SYUBETU          OF  PARM-SCZY7020-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":プログラム名  =["
      D             PGM-ID               OF  PARM-SCZY7020-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD          OF  PARM-SCZY7020-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":基準日        =["
      D             KJN-YMD              OF  PARM-SCZY7020-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":実行処理ID    =["
      D             JIKOU-SYORI-ID       OF  PARM-SCZY7020-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":起動ID        =["
      D             KIDOU-ID             OF  PARM-SCZY7020-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":RTNパッケージ =[" PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 START  ***"
      *--------------------<DEBUG>--------------------------------------
           CALL  "SCZY7020"             USING  PARM-SCZY7020-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 END  ***"
      D    DISPLAY  CNS-PGM-ID":*** バッチ終了メッセージ出力 END ***"
      *--------------------<DEBUG>--------------------------------------
           CONTINUE.
       PUT-END-MSG-EXT.
           EXIT.
