      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ1920.pco
      * プログラム名称 : 異動簿価・損益計算(資金)
      * 処理概要       : 資金の異動簿価・損益計算を行う
      * 参照ＤＢ       : 資金異動（TKMXSI00）
      *                :
      * 更新ＤＢ       : 資金異動（TKMXSI00）
      *                : 資金簿価異動計算データ（TKMZBW07）
      * 引数           : IN  資金取引データ
      *                : IN  異動計算パターン
      *                : IN  直前資金簿価異動
      *                : IN  通貨デフォールト端数処理
      *                : IN  銘柄別断面情報
      *                : IN  対象資金取引情報
      *                : IN  運用通貨コード
      *                : OUT 資金簿価異動計算データ
      *                : OUT 警告情報数
      *                : OUT 警告情報
      *                : OUT RTNパッケージ
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- ----  ---------  ------  ------------------------
      * 20080526   新規  SCS        趙迎慶   新規作成
      * 20081208   修正  SCS        張凌翔   連結障害0000502対応
      * 20090115   修正  SCS        徐曉俊
      * 20090121   修正  SCS        顧建鋒   残タスク094対応
      * 20090226   修正  SCS        徐曉俊   連結障害0001461対応
      * 20090302   修正  SCS        徐曉俊   残タスク179対応
      * 20090309   修正  SCS        徐曉俊   残タスク196対応
      * 20090422   修正  SCS        徐曉俊   テーマ14対応
      * 20090610   修正  SCS        何傑文   総合障害893
      * 20090617   修正  SCS        王飛     テーマ761対応
      * 20090707   修正  SCS        何傑文   総合障害1266
      * 20090707   修正  SCS        顧建鋒   連結障害1974
      * 20091009   修正  SCS        顧建鋒   テーマ917
      * 20091009   修正  SCS        顧建鋒   連結障害2785
      * 20091222   修正  SCS        顧建鋒   テーマ1075
      * 20100107   修正  SCS        王飛     テーマ2436
      * 20100223   修正  SCS        高帥     テーマ2495
      * 20100423   修正  SCS        高帥     テーマ2679
      * 20100426   修正  SCS        高帥     テーマ2661
      * 20100726   修正  SCS        陳幸縁   テーマ2953
      * 20101015   修正  SCS        陳幸縁   テーマ3068
      * 20110426   修正  SCS        楊 超    テーマ3212-1
      ******************************************************************
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ1920.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-05-26.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ1920".
      *----------  資金異動
         05  CNS-TBL-TKMXSI00      PIC  X(08)  VALUE  "TKMXSI00".
         05  CNS-TBL-TKMZBW07      PIC  X(08)  VALUE  "TKMZBW07".
         05  CNS-TBL-TKMXTR00      PIC  X(08)  VALUE  "TKMXTR00".
         05  CNS-TBL-TKMZBW06      PIC  X(08)  VALUE  "TKMZBW06".
         05  CNS-TBL-TKMZZI00      PIC  X(08)  VALUE  "TKMZZI00".
         05  CNS-TBL-TKMXST00      PIC  X(08)  VALUE  "TKMXST00".
      *----------  対象資金取引情報.資金種別
         05  CNS-SIKIN-SBT-0       PIC  X(01)  VALUE  "0".
         05  CNS-SIKIN-SBT-1       PIC  X(01)  VALUE  "1".
      *----------  資金異動.運用通貨払出簿価
         05  CNS-UYTK-H-BOKA       PIC  S9(15)V9(03)
           VALUE  +999999999999999.999.
      *----------  資金異動.為替差損益
         05  CNS-UYTK-KWS-SNEKI    PIC  S9(15)V9(03)
           VALUE  +999999999999999.999.
      *----------  リターンパッケージ.増減フラグ
         05  CNS-ZG-KBN-1          PIC  X(01)  VALUE  "1".
         05  CNS-ZG-KBN-2          PIC  X(01)  VALUE  "2".
      *----------  計算種類  "08" (資金計算)
         05  CNS-SHRU-08           PIC  X(02)  VALUE  "08".
      *----------  資金簿価異動計算データ.作成フラグ
         05  CNS-SK-FLG-3          PIC  X(01)  VALUE  "3".
         05  CNS-SK-FLG-4          PIC  X(01)  VALUE  "4".
      *----------  資金簿価異動計算データ.更新フラグ
         05  CNS-UPD-FLG-3         PIC  X(01)  VALUE  "3".
         05  CNS-UPD-FLG-4         PIC  X(01)  VALUE  "4".
      *----------  編集フラグ
         05  CNS-EDIT-FLG-1        PIC  X(01)  VALUE  "1".
      *----------  増減区分:'2'(資金)
         05  CNS-HANTEI-TARGET-KBN-2
                                   PIC  X(01)  VALUE  "2".
      *----------  異動確定区分:'１'(異動情報確定済)
         05  CNS-IDO-KBN-1         PIC  X(01)  VALUE  "1".
      *----------  バランスフラグ:'1'(オフバランス)
         05  CNS-BALANCE-FLG-1     PIC  X(01)  VALUE  "1".
      *----------  運用通貨コード
         05  CNS-NAI-GAI-KBN-0     PIC  X(01)  VALUE  "0".
         05  CNS-NAI-GAI-KBN-1     PIC  X(01)  VALUE  "1".
      *----------  基本会計ベースフラグ
         05  CNS-KH-KAIKEI-BASE-FLG-1
                                   PIC  X(01)  VALUE  "1".
         05  CNS-KH-KAIKEI-BASE-FLG-2
                                   PIC  X(01)  VALUE  "2".
      *----------  資金種別
         05  CNS-SIKIN-SBT-8       PIC  X(01)  VALUE  "8".
         05  CNS-SIKIN-SBT-9       PIC  X(01)  VALUE  "9".
      *----------  増幅フラ
         05  CNS-ZOUHUKU-FLG-0     PIC  X(01)  VALUE  "0".
         05  CNS-ZOUHUKU-FLG-1     PIC  X(01)  VALUE  "1".
      *----------  赤黒区分
         05  CNS-AKA-KBN-A         PIC  X(01)  VALUE  "A".
         05  CNS-AKA-KBN-B         PIC  X(01)  VALUE  "B".
      *----------  経過利息区分
         05  CNS-KKRS-KBN-4        PIC  X(01)  VALUE  "4".
      *----------  仕訳基準パターンコード
         05  CNS-SWK-KJN-PTN-CD-0  PIC  X(01)  VALUE  "0".
         05  CNS-SWK-KJN-PTN-CD-1  PIC  X(01)  VALUE  "1".
         05  CNS-SWK-KJN-PTN-CD-2  PIC  X(01)  VALUE  "2".
         05  CNS-SWK-KJN-PTN-CD-3  PIC  X(01)  VALUE  "3".
         05  CNS-SWK-KJN-PTN-CD-4  PIC  X(01)  VALUE  "4".
         05  CNS-SWK-KJN-PTN-CD-5  PIC  X(01)  VALUE  "5".
         05  CNS-SWK-KJN-PTN-CD-6  PIC  X(01)  VALUE  "6".
         05  CNS-SWK-KJN-PTN-CD-Z  PIC  X(01)  VALUE  "Z".
      *----------  警告フラグ
         05  CNS-WARN-FLG-B1       PIC  X(02)  VALUE  "B1".
      *----------  警告フラグ最大個数
         05  CNS-WARN-30           PIC  9(02)  VALUE  30.
         05  CNS-1                 PIC  9(01)  VALUE  1.
         05  CNS-2                 PIC  9(01)  VALUE  2.
         05  CNS-X-1               PIC  X(01)  VALUE  "1".
         05  CNS-X-2               PIC  X(01)  VALUE  "2".
         05  CNS-X-6               PIC  X(01)  VALUE  "6".
         05  CNS-X-0               PIC  X(01)  VALUE  "0".
      *----------  パラメータエラーメッセージ
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
      *---------- 乗算/除算区分
         05  CNS-JZ-JS-KBN-1       PIC  X(01)  VALUE  "1".
      *---------- 資金決済方法:外貨決済
         05  CNS-KESAI-HOHO-3      PIC  X(01)  VALUE  "3".
      *---------- 勘定異動／残高作成:作成しない
         05  CNS-KJIDO-ZANSK-2     PIC  9(01)  VALUE  2.
      *---------- 取引事由(為替送回金)
         05  CNS-TORI-JIYU-CFFA    PIC  X(04)  VALUE  "CFFA".
      *---------- 証券種別(外国債券証拠金)
         05  CNS-SEC-SBT-MAFB      PIC  X(04)  VALUE  "MAFB".
      *---------- 証券種別(外国株式証拠金)
         05  CNS-SEC-SBT-MAFS      PIC  X(04)  VALUE  "MAFS".
         05  CNS-JPY               PIC  X(04)  VALUE  "JPY ".
      *---------- 更新ユーザー
         05  CNS-UPD-SID-RSIKOZ1   PIC  X(07)  VALUE  "RSIKOZ1".
         05  CNS-UPD-SID-RSIKOZ2   PIC  X(07)  VALUE  "RSIKOZ2".
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
      *----------  TABLEＩＤ
         05  WK-TABLE-TKMXSI00     PIC  X(13).
         05  WK-TABLE-TKMZBW07     PIC  X(13).
         05  WK-TABLE-TKMXTR00     PIC  X(13).
         05  WK-TABLE-TKMZBW06     PIC  X(13).
         05  WK-TABLE-TKMZZI00     PIC  X(13).
         05  WK-TABLE-TKMXST00     PIC  X(13).
         05  WK-DATA-IN.
      *----------  資金取引データ
           10  WK-SIKIN-TORI-DATA.
      *----------  決済口座通貨コード
             15  WK-KOZA-TUKA-CD   PIC  X(04).
      *----------  市場通貨コード
             15  WK-SIJO-TUKA-CD   PIC  X(04).
      *----------  取引連関ＩＤ
             15  WK-THRK-ID        PIC  S9(10).
      *----------  決済通貨異動額
             15  WK-KSTK-IDOG      PIC  S9(15)V9(03).
      *----------  運用通貨異動額
             15  WK-UYTK-IDOG      PIC  S9(15)V9(03).
      *----------  取引事由
             15  WK-TORI-JIYU      PIC  X(04).
      *----------  異動確定区分
             15  WK-IDO-KBN        PIC  X(01).
      *----------  証券種別コード
             15  WK-SEC-SBT-CD     PIC  X(04).
      *----------  取引内容
             15  WK-TORI-NAIY      PIC  X(04).
      *----------  異動計算パターン
           10  WK-YIDOU-CALC-PARM.
      *----------  払出簿価計算方法
             15  WK-DEBET-BOKA-CALC-HOU
                                   PIC  X(01).
      *----------  払出簿価端数（市場通貨）
             15  WK-DEBET-BOKA-HASU-BC
                                   PIC  X(01).
      *----------  払出単価桁数（市場通貨）
             15  WK-DEBET-TNK-KETASU-BC
                                   PIC  S9(02).
      *----------  払出単価端数（市場通貨）
             15  WK-DEBET-TNK-HASU-BC
                                   PIC  X(01).
      *----------  払出簿価端数（運用通貨）
             15  WK-DEBET-BOKA-HASU-LC
                                   PIC  X(01).
      *----------  払出単価桁数（運用通貨）
             15  WK-DEBET-TNK-KETASU-LC
                                   PIC  S9(02).
      *----------  払出単価端数（運用通貨）
             15  WK-DEBET-TNK-HASU-LC
                                   PIC  X(01).
      *----------  簿価為替レート適用フラグ
             15  WK-BOKA-KWS-TEKIYO-FLG
                                   PIC  X(01).
      *----------  簿価為替レート端数
             15  WK-BOKA-KWS-HASU  PIC  X(01).
      *----------  簿価為替レート桁数
             15  WK-BOKA-KWS-KETASU
                                   PIC  S9(02).
      *----------  按分簿価端数
             15  WK-ANB-BOKA-HASU  PIC  X(01).
      *----------  按分単価端数
             15  WK-ANB-TNK-HASU   PIC  X(01).
      *----------  按分単価桁数
             15  WK-ANB-TNK-KETASU PIC  S9(02).
      *----------  前払金償却分端数
             15  WK-MAEKIN-SHOUKYK-HASU
                                   PIC  X(01).
      *----------  直前の資金簿価異動
           10  WK-TZ-SK-BOKA-IDO-PARM.
      *----------  市場通貨異動後未収入金残高（内物）
             15  WK-SJTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（内物）
             15  WK-UYTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（外物）
             15  WK-SJTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（外物）
             15  WK-UYTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（内物）
             15  WK-SJTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（内物）
             15  WK-UYTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（外物）
             15  WK-SJTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（外物）
             15  WK-UYTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後CASH残高
             15  WK-SJTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後CASH残高
             15  WK-UYTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  異動計上順序
             15  WK-IDO-KJY-JUN    PIC  S9(08).
      *----------  通貨デフォールト端数処理
           10  WK-TUKA-DEF-HASU-SYRI-PARM.
      *----------  運用通貨端数処理方法
             15  WK-LC-HS          PIC  X(01).
      *----------  運用通貨小数・以下桁数
             15  WK-LC-SYOSU-TENYIKA-KETASU
                                   PIC  S9(02).
      *----------  市場通貨端数処理方法
             15  WK-BC-HS          PIC  X(01).
      *----------  市場通貨小数・以下桁数
             15  WK-BC-SYOSU-TENYIKA-KETASU
                                   PIC  S9(02).
      *----------  銘柄別断面情報
           10  WK-MEG-BETU-DMN-INFO.
      *----------  処理実行日
             15  WK-SYORI-YMD      PIC  S9(08).
      *----------  起動ID
             15  WK-KIDOU-ID       PIC  X(04).
      *----------  利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  銘柄コード
             15  WK-MEG-CD         PIC  X(15).
      *----------  証券種別コード
             15  WK-SEC-SBT-CD     PIC  X(04).
      *----------  対象資金取引情報
           10  WK-TAGET-SIKIN-TORI-INFO.
      *----------  原取引ＩＤ
             15  WK-TORI-ID        PIC  S9(10).
      *----------  資金種別
             15  WK-SIKIN-SBT      PIC  X(01).
      *----------  異動日
             15  WK-IDO-YMD        PIC  S9(08).
      *----------  増減区分
             15  WK-ZG-KBN         PIC  X(01).
      *----------  処理順
             15  WK-SRJUN          PIC  S9(08).
      *----------  運用通貨コード
           10  WK-CAPITAL-TUKA-CD  PIC  X(04).
      *----------  基準日断面情報
           10  WK-KYJ-YMD-DMN-INFO.
      *----------  仕訳基準パターンコード
             15  WK-SWK-KJN-PTN-CD PIC  X(08).
      *----------  基本会計ベースフラグ
             15  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  キャッシュフロー2回有効フラグ
           10  WK-CASH-FLOW-2-FLG  PIC  X(01).
      *---------- 乗算/除算区分
           10  WK-JZ-JS-KBN        PIC  X(01).
      *---------- 受渡計上切替対象フラグ
           10  WK-UKE-KIRIKAE-FLG  PIC  X(01).
      *---------- 受渡計上切替対象情報
           10  WK-UKE-KIRIKAE-INF.
      *---------- 仕訳基準パターンコード
             15  WK-SWK-KN-PN-CD   PIC  X(08).
      *---------- キャッシュフロー2回有効フラグ
             15  WK-CASH-FLOW-TWO-FLG
                                   PIC  X(01).
      *----------  基本会計ベースフラグ
             15  WK-KH-KAIKEI-BS-FLG
                                   PIC  X(01).
      *----------  勘定異動／残高作成
           10  WK-KJIDO-ZANSK      PIC  9(01).
      *----------  ワーク資金計算結果
         05  WK-SIKIN-CALC-KEKKA.
      *----------  市場通貨資金簿価異動額
           10  WK-SJTK-SK-BOKA-IDOGK
                                   PIC  S9(15)V9(03).
      *----------  運用通貨資金簿価異動額
           10  WK-UYTK-SK-BOKA-IDOGK
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後CASH残高
           10  WK-SJTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後CASH残高
           10  WK-UYTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（内物）
           10  WK-SJTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（内物）
           10  WK-UYTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（外物）
           10  WK-SJTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（外物）
           10  WK-UYTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（内物）
           10  WK-SJTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（内物）
           10  WK-UYTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（外物）
           10  WK-SJTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（外物）
           10  WK-UYTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨払出簿価
           10  WK-SJTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  運用通貨払出簿価
           10  WK-UYTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  市場通貨払出単価
           10  WK-SJTK-H-TNK       PIC  S9(08)V9(10).
      *----------  運用通貨払出単価
           10  WK-UYTK-H-TNK       PIC  S9(08)V9(10).
      *----------  簿価為替レート
           10  WK-BOKA-KWS         PIC  S9(08)V9(10).
      *----------  為替差損益
           10  WK-UYTK-KWS-SNEKI   PIC  S9(15)V9(03).
      *----------  市場通貨利金等損益勘定
           10  WK-SJTK-RKSEKJ      PIC  S9(15)V9(03).
      *----------  運用通貨利金等損益勘定
           10  WK-UYTK-RKSEKJ      PIC  S9(15)V9(03).
      *----------  資金簿価異動計算データ
         05  WK-SIKIN-BOKA-IDO-CALC-DATA.
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
      *----------  原取引ID
           10  WK-TORI-ID          PIC  S9(10).
      *----------  決済口座番号
           10  WK-KS-KOZA-NO       PIC  X(15).
      *----------  資金種別
           10  WK-SIKIN-SBT        PIC  X(01).
      *----------  異動日
           10  WK-IDO-YMD          PIC  S9(08).
      *----------  増減区分
           10  WK-ZG-KBN           PIC  X(01).
      *----------  赤黒区分
           10  WK-AKA-KBN          PIC  X(01).
      *----------  誤計上№
           10  WK-ERR-KJY-NO       PIC  S9(10).
      *----------  誤計上区分
           10  WK-ERR-KJY-KBN      PIC  X(01).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  取引連関ID
           10  WK-THRK-ID          PIC  S9(10).
      *----------  決済口座通貨コード
           10  WK-KOZA-TUKA-CD     PIC  X(04).
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
      *----------  市場通貨資金簿価異動額
           10  WK-SJTK-SK-BOKA-IDOGK
                                   PIC  S9(15)V9(03).
      *----------  運用通貨資金簿価異動額
           10  WK-UYTK-SK-BOKA-IDOGK
                                   PIC  S9(15)V9(03).
      *----------  市場通貨払出簿価
           10  WK-SJTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  運用通貨払出簿価
           10  WK-UYTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  市場通貨払出単価
           10  WK-SJTK-H-TNK       PIC  S9(08)V9(10).
      *----------  運用通貨払出単価
           10  WK-UYTK-H-TNK       PIC  S9(08)V9(10).
      *----------  簿価為替レート
           10  WK-BOKA-KWS         PIC  S9(08)V9(10).
      *----------  市場通貨異動後ＣＡＳＨ残高
           10  WK-SJTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後ＣＡＳＨ残高
           10  WK-UYTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（内物）
           10  WK-SJTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（内物）
           10  WK-UYTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（外物）
           10  WK-SJTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（外物）
           10  WK-UYTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（内物）
           10  WK-SJTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（内物）
           10  WK-UYTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（外物）
           10  WK-SJTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（外物）
           10  WK-UYTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  為替差損益
           10  WK-UYTK-KWS-SNEKI   PIC  S9(15)V9(03).
      *----------  市場通貨利金等損益勘定
           10  WK-SJTK-RKSEKJ      PIC  S9(15)V9(03).
      *----------  運用通貨利金等損益勘定
           10  WK-UYTK-RKSEKJ      PIC  S9(15)V9(03).
      *----------  異動計上順序
           10  WK-IDO-KJY-JUN      PIC  S9(08).
      *----------  削除区分
           10  WK-SAKUJO-KBN       PIC  X(01).
      *----------  作成フラグ
           10  WK-SK-FLG           PIC  X(01).
      *----------  作成日時
           10  WK-SK-DATE          PIC  X(14).
      *----------  作成ログインユーザ会社コード
           10  WK-SK-LOGIN-CMP-CD  PIC  X(04).
      *----------  作成ユーザＩＤ
           10  WK-SK-SID           PIC  X(20).
      *----------  作成プログラムＩＤ
           10  WK-SK-PGMID         PIC  X(16).
      *----------  更新フラグ
           10  WK-UPD-FLG          PIC  X(01).
      *----------  更新日時
           10  WK-UPD-DATE         PIC  X(14).
      *----------  更新ログインユーザ会社コード
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
      *----------  更新ユーザＩＤ
           10  WK-UPD-SID          PIC  X(20).
      *----------  更新プログラムＩＤ
           10  WK-UPD-PGMID        PIC  X(16).
      *----------  ワーク資金簿価異動計算増幅データ１
         05  WK-SKBK-IDC-ZHK-DATA-1.
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
      *----------  原取引ID
           10  WK-TORI-ID          PIC  S9(10).
      *----------  決済口座番号
           10  WK-KS-KOZA-NO       PIC  X(15).
      *----------  資金種別
           10  WK-SIKIN-SBT        PIC  X(01).
      *----------  異動日
           10  WK-IDO-YMD          PIC  S9(08).
      *----------  増減区分
           10  WK-ZG-KBN           PIC  X(01).
      *----------  赤黒区分
           10  WK-AKA-KBN          PIC  X(01).
      *----------  誤計上№
           10  WK-ERR-KJY-NO       PIC  S9(10).
      *----------  誤計上区分
           10  WK-ERR-KJY-KBN      PIC  X(01).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  取引連関ID
           10  WK-THRK-ID          PIC  S9(10).
      *----------  決済口座通貨コード
           10  WK-KOZA-TUKA-CD     PIC  X(04).
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
      *----------  市場通貨資金簿価異動額
           10  WK-SJTK-SK-BOKA-IDOGK
                                   PIC  S9(15)V9(03).
      *----------  運用通貨資金簿価異動額
           10  WK-UYTK-SK-BOKA-IDOGK
                                   PIC  S9(15)V9(03).
      *----------  市場通貨払出簿価
           10  WK-SJTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  運用通貨払出簿価
           10  WK-UYTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  市場通貨払出単価
           10  WK-SJTK-H-TNK       PIC  S9(08)V9(10).
      *----------  運用通貨払出単価
           10  WK-UYTK-H-TNK       PIC  S9(08)V9(10).
      *----------  簿価為替レート
           10  WK-BOKA-KWS         PIC  S9(08)V9(10).
      *----------  市場通貨異動後ＣＡＳＨ残高
           10  WK-SJTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後ＣＡＳＨ残高
           10  WK-UYTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（内物）
           10  WK-SJTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（内物）
           10  WK-UYTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（外物）
           10  WK-SJTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（外物）
           10  WK-UYTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（内物）
           10  WK-SJTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（内物）
           10  WK-UYTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（外物）
           10  WK-SJTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（外物）
           10  WK-UYTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  為替差損益
           10  WK-UYTK-KWS-SNEKI   PIC  S9(15)V9(03).
      *----------  市場通貨利金等損益勘定
           10  WK-SJTK-RKSEKJ      PIC  S9(15)V9(03).
      *----------  運用通貨利金等損益勘定
           10  WK-UYTK-RKSEKJ      PIC  S9(15)V9(03).
      *----------  異動計上順序
           10  WK-IDO-KJY-JUN      PIC  S9(08).
      *----------  削除区分
           10  WK-SAKUJO-KBN       PIC  X(01).
      *----------  作成フラグ
           10  WK-SK-FLG           PIC  X(01).
      *----------  作成日時
           10  WK-SK-DATE          PIC  X(14).
      *----------  作成ログインユーザ会社コード
           10  WK-SK-LOGIN-CMP-CD  PIC  X(04).
      *----------  作成ユーザＩＤ
           10  WK-SK-SID           PIC  X(20).
      *----------  作成プログラムＩＤ
           10  WK-SK-PGMID         PIC  X(16).
      *----------  更新フラグ
           10  WK-UPD-FLG          PIC  X(01).
      *----------  更新日時
           10  WK-UPD-DATE         PIC  X(14).
      *----------  更新ログインユーザ会社コード
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
      *----------  更新ユーザＩＤ
           10  WK-UPD-SID          PIC  X(20).
      *----------  更新プログラムＩＤ
           10  WK-UPD-PGMID        PIC  X(16).
      *----------  ワーク資金簿価異動計算増幅データ２
         05  WK-SKBK-IDC-ZHK-DATA-2.
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
      *----------  原取引ID
           10  WK-TORI-ID          PIC  S9(10).
      *----------  決済口座番号
           10  WK-KS-KOZA-NO       PIC  X(15).
      *----------  資金種別
           10  WK-SIKIN-SBT        PIC  X(01).
      *----------  異動日
           10  WK-IDO-YMD          PIC  S9(08).
      *----------  増減区分
           10  WK-ZG-KBN           PIC  X(01).
      *----------  赤黒区分
           10  WK-AKA-KBN          PIC  X(01).
      *----------  誤計上№
           10  WK-ERR-KJY-NO       PIC  S9(10).
      *----------  誤計上区分
           10  WK-ERR-KJY-KBN      PIC  X(01).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  取引連関ID
           10  WK-THRK-ID          PIC  S9(10).
      *----------  決済口座通貨コード
           10  WK-KOZA-TUKA-CD     PIC  X(04).
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
      *----------  市場通貨資金簿価異動額
           10  WK-SJTK-SK-BOKA-IDOGK
                                   PIC  S9(15)V9(03).
      *----------  運用通貨資金簿価異動額
           10  WK-UYTK-SK-BOKA-IDOGK
                                   PIC  S9(15)V9(03).
      *----------  市場通貨払出簿価
           10  WK-SJTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  運用通貨払出簿価
           10  WK-UYTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  市場通貨払出単価
           10  WK-SJTK-H-TNK       PIC  S9(08)V9(10).
      *----------  運用通貨払出単価
           10  WK-UYTK-H-TNK       PIC  S9(08)V9(10).
      *----------  簿価為替レート
           10  WK-BOKA-KWS         PIC  S9(08)V9(10).
      *----------  市場通貨異動後ＣＡＳＨ残高
           10  WK-SJTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後ＣＡＳＨ残高
           10  WK-UYTK-IDOG-SK-BOKAZN
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（内物）
           10  WK-SJTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（内物）
           10  WK-UYTK-IDOG-MSNKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未収入金残高（外物）
           10  WK-SJTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未収入金残高（外物）
           10  WK-UYTK-IDOG-MSNKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（内物）
           10  WK-SJTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（内物）
           10  WK-UYTK-IDOG-MBKZN-UM
                                   PIC  S9(15)V9(03).
      *----------  市場通貨異動後未払金残高（外物）
           10  WK-SJTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  運用通貨異動後未払金残高（外物）
           10  WK-UYTK-IDOG-MBKZN-SM
                                   PIC  S9(15)V9(03).
      *----------  為替差損益
           10  WK-UYTK-KWS-SNEKI   PIC  S9(15)V9(03).
      *----------  市場通貨利金等損益勘定
           10  WK-SJTK-RKSEKJ      PIC  S9(15)V9(03).
      *----------  運用通貨利金等損益勘定
           10  WK-UYTK-RKSEKJ      PIC  S9(15)V9(03).
      *----------  異動計上順序
           10  WK-IDO-KJY-JUN      PIC  S9(08).
      *----------  削除区分
           10  WK-SAKUJO-KBN       PIC  X(01).
      *----------  作成フラグ
           10  WK-SK-FLG           PIC  X(01).
      *----------  作成日時
           10  WK-SK-DATE          PIC  X(14).
      *----------  作成ログインユーザ会社コード
           10  WK-SK-LOGIN-CMP-CD  PIC  X(04).
      *----------  作成ユーザＩＤ
           10  WK-SK-SID           PIC  X(20).
      *----------  作成プログラムＩＤ
           10  WK-SK-PGMID         PIC  X(16).
      *----------  更新フラグ
           10  WK-UPD-FLG          PIC  X(01).
      *----------  更新日時
           10  WK-UPD-DATE         PIC  X(14).
      *----------  更新ログインユーザ会社コード
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
      *----------  更新ユーザＩＤ
           10  WK-UPD-SID          PIC  X(20).
      *----------  更新プログラムＩＤ
           10  WK-UPD-PGMID        PIC  X(16).
      *----------  ワーク資金異動
         05  WK-SIKIN-IDO.
      *----------  運用通貨払出簿価
           10  WK-UYTK-H-BOKA      PIC  S9(15)V9(03).
      *----------  為替差損益
           10  WK-UYTK-KWS-SNEKI   PIC  S9(15)V9(03).
      *----------  ワーク計算パターン
         05  WK-CALC-PTN.
      *----------  資金計算方法
           10  WK-SIKIN-CALC-HOU   PIC  9(03).
      *----------  ワーク作成データフラグ１
         05  WK-SAKUSEI-FLG-1      PIC  X(01).
      *----------  ワーク作成データフラグ２
         05  WK-SAKUSEI-FLG-2      PIC  X(01).
      *----------  ワーク増幅フラグ
         05  WK-ZOUHUKU-FLG        PIC  X(01).
      *----------  警告情報グループ循環フラグ
         05  WK-WARN-INFO-INDEX    PIC  9(02).
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      ******************************************************************
      *    フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  資金異動カーソルオープンフラグ
         05  FLG-TKMXSI00-CR-OPEN  PIC  9(01).
      *----------  資金簿価異動計算カーソルオープンフラグ
         05  FLG-TKMZBW07-CR-OPEN  PIC  9(01).
      *----------  取残異動計算カーソルオープンフラグ
         05  FLG-TKMXABC-CR-OPEN   PIC  9(01).
      *----------  移行データ対応する取引各費用計算カーソルオープンフラグ
         05  FLG-TKMXABC-2-CR-OPEN PIC  9(01).
      ******************************************************************
      *                複数回起動チェック用スイッチ
      ******************************************************************
       01  FIRST-SW                PIC  X(03)  VALUE 'YES'.             @3212SEINO@@
      ******************************************************************
      *    ＯＲＡＣＬＥホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  資金異動(別紙1-1)
         05  H-TKMXSI00.
      *----------  運用通貨払出簿価
           10  H-UYTK-H-BOKA       PIC  S9(15)V9(03).
      *----------  為替差損益
           10  H-UYTK-KWS-SNEKI    PIC  S9(15)V9(03).
      *----------  資金異動(別紙1-1)
         05  H-TKMXSI00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  決済口座番号
           10  H-KS-KOZA-NO        PIC  X(15).
      *----------  資金種別
           10  H-SIKIN-SBT         PIC  X(01).
      *----------  増減区分
           10  H-ZG-KBN            PIC  X(01).
      *----------  取引（TKMXTR00）,残高異動計算（TKMZBW06）,残高異動（TKMZZI00）(別紙1-2)
         05  H-TKMXABC.
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  既経過利息（市場通貨換算額）
           10  H-S-KSG-G-KKKRS     PIC  S9(15)V9(03).
      *----------  既経過利息（運用通貨換算額）
           10  H-U-KSG-G-KKKRS     PIC  S9(15)V9(03).
      *----------  経過利息区分
           10  H-KKRS-KBN          PIC  X(01).
      *----------  現地通貨コード
           10  H-G-TUKA-CD         PIC  X(04).
      *----------  資金決済方法
           10  H-KESAI-HOHO        PIC  X(01).
      *----------  市場通貨手数料
           10  H-SJTK-TSR          PIC  S9(15)V9(03).
      *----------  運用通貨手数料
           10  H-UYTK-TSR          PIC  S9(15)V9(03).
      *----------  市場通貨消費税
           10  H-SJTK-S-TAX        PIC  S9(15)V9(03).
      *----------  運用通貨消費税
           10  H-UYTK-S-TAX        PIC  S9(15)V9(03).
      *----------  市場通貨その他費用
           10  H-SJTK-OTR-FATE     PIC  S9(15)V9(03).
      *----------  運用通貨その他費用
           10  H-UYTK-OTR-FATE     PIC  S9(15)V9(03).
      *----------  取引（TKMXTR00）,残高異動計算（TKMZBW06）,残高異動（TKMZZI00）(別紙1-2)
         05  H-TKMXABC-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  資金簿価異動計算データ(別紙1-3)
         05  H-TKMZBW07.
      *----------  原取引ID
           10  H-TORI-ID           PIC  S9(10).
      *----------  資金簿価異動計算データ(別紙1-3)
         05  H-TKMZBW07-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  決済口座通貨コード
           10  H-KOZA-TUKA-CD      PIC  X(04).
      *----------  取引（TKMXTR00）a,資金取引（TKMXST00）b(別紙1-4)
      *----------  b.更新ユーザーID
         05  H-UPD-SID             PIC  X(20).
      *----------  a.現地消費税（運用通貨換算額）
         05  H-U-KSG-G-SHZ         PIC  S9(15)V9(03).
      *----------  取引（TKMXTR00）a,資金取引（TKMXST00）b(別紙1-4)
         05  H-TKMXABC-2-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資金種別
           10  H-SIKIN-SBT         PIC  X(01).
      *----------  増減区分
           10  H-ZG-KBN            PIC  X(01).
         05  SQLSTMT-1             PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT-2             PIC  X(1100) VARYING.                @3212SEINO@@
         05  SQLSTMT-3             PIC  X(300)  VARYING.                @3212SEINO@@
         05  SQLSTMT-4             PIC  X(600)  VARYING.                @3212SEINO@@
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *            SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  資金異動SQL文(別紙1-1)
         05  SQL-SELECT-1-1.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  運用通貨払出簿価
           10  FILLER              PIC  X(13)  VALUE
               "UYTK_H_BOKA, ".
      *----------  為替差損益
           10  FILLER              PIC  X(15)  VALUE
               "UYTK_KWS_SNEKI ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-1        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  FILLER              PIC  X(10)  VALUE ":P_TORI_ID".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(10)  VALUE ":P_FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(09)  VALUE ":P_PTF_CD".
      *----------  決済口座番号
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "KS_KOZA_NO = ".
           10  FILLER              PIC  X(13)  VALUE ":P_KS_KOZA_NO".
      *----------  資金種別
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE "SIKIN_SBT = ".
           10  FILLER              PIC  X(12)  VALUE ":P_SIKIN_SBT".
      *----------  増減区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "ZG_KBN = ".
           10  FILLER              PIC  X(09)  VALUE ":P_ZG_KBN".
      *----------  削除区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "SAKUJO_KBN = ".
           10  FILLER              PIC  X(03)  VALUE "' '".
      *----------  赤黒区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "AKA_KBN = ".
           10  FILLER              PIC  X(03)  VALUE  "' '".
      *----------  取引（TKMXTR00）,残高異動計算（TKMZBW06）,残高異動（TKMZZI00）(別紙1-2)
         05  SQL-SELECT-1-2.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  A.受渡日
           10  FILLER              PIC  X(11)  VALUE  "A.UKE_YMD, ".
      *----------  A.既経過利息（市場通貨換算額）
           10  FILLER              PIC  X(17)  VALUE
               "A.S_KSG_G_KKKRS, ".
      *----------  A.既経過利息（運用通貨換算額）
           10  FILLER              PIC  X(17)  VALUE
               "A.U_KSG_G_KKKRS, ".
      *----------  A.経過利息区分
           10  FILLER              PIC  X(12)  VALUE  "A.KKRS_KBN, ".
      *----------  A.現地通貨コード
           10  FILLER              PIC  X(13)  VALUE  "A.G_TUKA_CD, ".
      *----------  A.資金決済方法
           10  FILLER              PIC  X(14)  VALUE  "A.KESAI_HOHO, ".
      *----------  市場通貨手数料
           10  FILLER              PIC  X(19)  VALUE
               "NVL(D.SJTK_TSR,0), ".
      *----------  運用通貨手数料
           10  FILLER              PIC  X(19)  VALUE
               "NVL(D.UYTK_TSR,0), ".
      *----------  市場通貨消費税
           10  FILLER              PIC  X(21)  VALUE
               "NVL(D.SJTK_S_TAX,0), ".
      *----------  運用通貨消費税
           10  FILLER              PIC  X(21)  VALUE
               "NVL(D.UYTK_S_TAX,0), ".
      *----------  市場通貨その他費用
           10  FILLER              PIC  X(24)  VALUE
               "NVL(D.SJTK_OTR_FATE,0), ".
      *----------  運用通貨その他費用
           10  FILLER              PIC  X(23)  VALUE
               "NVL(D.UYTK_OTR_FATE,0) ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  受渡日
           10  FILLER              PIC  X(09)  VALUE  "UKE_YMD, ".
      *----------  既経過利息（市場通貨換算額）
           10  FILLER              PIC  X(15)  VALUE
               "S_KSG_G_KKKRS, ".
      *----------  既経過利息（運用通貨換算額）
           10  FILLER              PIC  X(15)  VALUE
               "U_KSG_G_KKKRS, ".
      *----------  経過利息区分
           10  FILLER              PIC  X(10)  VALUE  "KKRS_KBN, ".
      *----------  現地通貨コード
           10  FILLER              PIC  X(11)  VALUE  "G_TUKA_CD, ".
      *----------  資金決済方法
           10  FILLER              PIC  X(12)  VALUE  "KESAI_HOHO, ".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(09)  VALUE  "TORI_ID, ".
      *----------  利用会社コード
           10  FILLER              PIC  X(12)  VALUE  "RIYO_CMP_CD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-1        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  FILLER              PIC  X(16)  VALUE ":P_TORI_ID) A, (".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  市場通貨手数料
           10  FILLER              PIC  X(10)  VALUE
               "SJTK_TSR, ".
      *----------  運用通貨手数料
           10  FILLER              PIC  X(10)  VALUE
               "UYTK_TSR, ".
      *----------  市場通貨消費税
           10  FILLER              PIC  X(12)  VALUE
               "SJTK_S_TAX, ".
      *----------  運用通貨消費税
           10  FILLER              PIC  X(12)  VALUE
               "UYTK_S_TAX, ".
      *----------  市場通貨その他費用
           10  FILLER              PIC  X(20)  VALUE
               "SJTK_ELS_SNEKI*(-1) ".
           10  FILLER              PIC  X(18)  VALUE
               "AS SJTK_OTR_FATE, ".
      *----------  運用通貨その他費用
           10  FILLER              PIC  X(20)  VALUE
               "UYTK_ELS_SNEKI*(-1) ".
           10  FILLER              PIC  X(19)  VALUE
               "AS UYTK_OTR_FATE, ".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(09)  VALUE  "TORI_ID, ".
      *----------  利用会社コード
           10  FILLER              PIC  X(12)  VALUE  "RIYO_CMP_CD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-2        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  FILLER              PIC  X(10)  VALUE ":P_TORI_ID".
      *----------   処理実行日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------   起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE ":P_KIDOU_ID".
      *----------  赤黒区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "AKA_KBN = ".
           10  FILLER              PIC  X(06)  VALUE  "' ')  ".
           10  FILLER              PIC  X(07)  VALUE  " UNION ".
           10  FILLER              PIC  X(08)  VALUE  "(SELECT ".
      *----------  市場通貨手数料
           10  FILLER              PIC  X(10)  VALUE
               "SJTK_TSR, ".
      *----------  運用通貨手数料
           10  FILLER              PIC  X(10)  VALUE
               "UYTK_TSR, ".
      *----------  市場通貨消費税
           10  FILLER              PIC  X(12)  VALUE
               "SJTK_S_TAX, ".
      *----------  運用通貨消費税
           10  FILLER              PIC  X(12)  VALUE
               "UYTK_S_TAX, ".
      *----------  市場通貨その他費用
           10  FILLER              PIC  X(20)  VALUE
               "SJTK_ELS_SNEKI*(-1) ".
           10  FILLER              PIC  X(18)  VALUE
               "AS SJTK_OTR_FATE, ".
      *----------  運用通貨その他費用
           10  FILLER              PIC  X(20)  VALUE
               "UYTK_ELS_SNEKI*(-1) ".
           10  FILLER              PIC  X(19)  VALUE
               "AS UYTK_OTR_FATE, ".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(09)  VALUE  "TORI_ID, ".
      *----------  利用会社コード
           10  FILLER              PIC  X(12)  VALUE  "RIYO_CMP_CD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-3        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  FILLER              PIC  X(12)  VALUE ":P_TORI_ID) ".
           10  FILLER              PIC  X(04)  VALUE " ) D".
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(24)  VALUE
               "A.TORI_ID = D.TORI_ID(+)".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
      *----------  利用会社コード
           10  FILLER              PIC  X(32)  VALUE
               "A.RIYO_CMP_CD = D.RIYO_CMP_CD(+)".
      *----------  資金簿価異動計算データ(別紙1-3)
         05  SQL-SELECT-1-3.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  原取引ID
           10  FILLER              PIC  X(08)  VALUE
               "TORI_ID ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-1        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------   処理実行日
           10  FILLER              PIC  X(12)  VALUE  "SYORI_YMD = ".
           10  FILLER              PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------   起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "KIDOU_ID = ".
           10  FILLER              PIC  X(11)  VALUE ":P_KIDOU_ID".
      *----------  利用会社コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  FILLER              PIC  X(10)  VALUE ":P_TORI_ID".
      *----------  決済口座番号
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(14)  VALUE "KS_KOZA_NO <> ".
           10  FILLER              PIC  X(09)  VALUE ":P_MEG_CD".
      *----------  資金種別
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "SIKIN_SBT IN ".
           10  FILLER              PIC  X(09)  VALUE "('8','9')".
      *----------  決済口座通貨コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE "KOZA_TUKA_CD = ".
           10  FILLER              PIC  X(15)  VALUE ":P_KOZA_TUKA_CD".
      *----------  赤黒区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "AKA_KBN = ".
           10  FILLER              PIC  X(03)  VALUE  "' '".
      *----------  取引（TKMXTR00）a,資金取引（TKMXST00）b(別紙1-4)
         05  SQL-SELECT-1-4.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  a.受渡日
           10  FILLER              PIC  X(11)  VALUE  "a.UKE_YMD, ".
      *----------  a.既経過利息（市場通貨換算額）
           10  FILLER              PIC  X(17)  VALUE
               "a.S_KSG_G_KKKRS, ".
      *----------  a.既経過利息（運用通貨換算額）
           10  FILLER              PIC  X(17)  VALUE
               "a.U_KSG_G_KKKRS, ".
      *----------  a.経過利息区分
           10  FILLER              PIC  X(12)  VALUE  "a.KKRS_KBN, ".
      *----------  a.現地通貨コード
           10  FILLER              PIC  X(13)  VALUE  "a.G_TUKA_CD, ".
      *----------  a.資金決済方法
           10  FILLER              PIC  X(14)  VALUE  "a.KESAI_HOHO, ".
      *----------  市場通貨手数料
           10  FILLER              PIC  X(15)  VALUE
               "0 AS SJTK_TSR, ".
      *----------  運用通貨手数料
           10  FILLER              PIC  X(15)  VALUE
               "0 AS UYTK_TSR, ".
      *----------  市場通貨消費税
           10  FILLER              PIC  X(29)  VALUE
               "a.S_KSG_G_SHZ AS SJTK_S_TAX, ".
      *----------  運用通貨消費税
           10  FILLER              PIC  X(29)  VALUE
               "a.U_KSG_U_SHZ AS UYTK_S_TAX, ".
      *----------  市場通貨その他費用
           10  FILLER              PIC  X(20)  VALUE
               "0 AS SJTK_OTR_FATE, ".
      *----------  運用通貨その他費用
           10  FILLER              PIC  X(20)  VALUE
               "0 AS UYTK_OTR_FATE, ".
      *----------  b.更新ユーザーID
           10  FILLER              PIC  X(11)  VALUE  "b.UPD_SID, ".
      *----------  a.現地消費税（運用通貨換算額）
           10  FILLER              PIC  X(14)  VALUE
               "a.U_KSG_G_SHZ ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-1        PIC  X(13).
           10  FILLER              PIC  X(03)  VALUE  " a,".
           10  SQL-TBL-ID-2        PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE  " b".
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)  VALUE  "a.RIYO_CMP_CD =".
           10  FILLER              PIC  X(15)  VALUE  " :P_RIYO_CMP_CD".
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE "a.TORI_ID = ".
           10  FILLER              PIC  X(10)  VALUE ":P_TORI_ID".
      *----------  a.原取引ＩＤ＝b.原取引ＩＤ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE "a.TORI_ID = ".
           10  FILLER              PIC  X(10)  VALUE "b.TORI_ID ".
      *----------  決済口座番号
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE "b.KS_KOZA_NO = ".
           10  FILLER              PIC  X(09)  VALUE ":P_MEG_CD".
      *----------  資金種別
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(14)  VALUE "b.SIKIN_SBT = ".
           10  FILLER              PIC  X(12)  VALUE ":P_SIKIN_SBT".
      *----------  増減区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "b.ZG_KBN = ".
           10  FILLER              PIC  X(09)  VALUE ":P_ZG_KBN".
      *----------  異動日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE "b.IDO_YMD = ".
           10  FILLER              PIC  X(09)  VALUE "a.UKE_YMD".
      *----------  削除区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(15)  VALUE "b.SAKUJO_KBN = ".
           10  FILLER              PIC  X(03)  VALUE "' '".
      *----------  赤黒区分
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE  "b.AKA_KBN = ".
           10  FILLER              PIC  X(03)  VALUE  "' '".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- SELECT SQL文(別紙1-1)
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMXSI00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(15)  VALUE
               "' AND TORI_ID =".
           10  WK-TORI-ID          PIC  S9(10).
      *----------  ファンドコード
           10  FILLER              PIC  X(15)  VALUE
               " AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
      *----------  決済口座番号
           10  FILLER              PIC  X(19)  VALUE
               "' AND KS_KOZA_NO ='".
           10  WK-KS-KOZA-NO       PIC  X(15).
      *----------  資金種別
           10  FILLER              PIC  X(18)  VALUE
               "' AND SIKIN_SBT ='".
           10  WK-SIKIN-SBT        PIC  X(01).
      *----------  増減区分
           10  FILLER              PIC  X(15)  VALUE
               "' AND ZG_KBN ='".
           10  WK-ZG-KBN           PIC  X(01).
      *----------  削除区分
           10  FILLER              PIC  X(20)  VALUE
               "' AND SAKUJO_KBN =' ".
      *----------  赤黒区分
           10  FILLER              PIC  X(18)  VALUE
               "' AND AKA_KBN =' '".
      *---------- SELECT SQL文(別紙1-2)
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMXTR00     PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TBL-TKMZBW06     PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ",".
           10  WK-TBL-TKMZZI00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(16)  VALUE
               "' AND TORI_ID ='".
           10  WK-TORI-ID          PIC  S9(10).
      *----------   処理実行日
           10  FILLER              PIC  X(17)  VALUE
               "' AND SYORI_YMD =".
           10  WK-SYORI-YMD        PIC  X(08).
      *----------   起動ID
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  赤黒区分
           10  FILLER              PIC  X(18)  VALUE
               "' AND AKA_KBN =' '".
      *---------- SELECT SQL文(別紙1-3)
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW07     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------   処理実行日
           10  FILLER              PIC  X(13)  VALUE
               "  SYORI_YMD =".
           10  WK-SYORI-YMD        PIC  X(08).
      *----------   起動ID
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  利用会社コード
           10  FILLER              PIC  X(20)  VALUE
               "' AND RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(15)  VALUE
               "' AND TORI_ID =".
           10  WK-TORI-ID          PIC  S9(10).
      *----------  決済口座番号
           10  FILLER              PIC  X(20)  VALUE
               "' AND KS_KOZA_NO <>'".
           10  WK-MEG-CD           PIC  X(15).
      *----------  資金種別
           10  FILLER              PIC  X(28)  VALUE
               "' AND SIKIN_SBT IN ('8','9')".
      *----------  決済口座通貨コード
           10  FILLER              PIC  X(20)  VALUE
               " AND KOZA_TUKA_CD =".
           10  WK-KOZA-TUKA-CD     PIC  X(04).
      *----------  赤黒区分
           10  FILLER              PIC  X(17)  VALUE
               " AND AKA_KBN =' '".
      *---------- SELECT SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(10)  VALUE
               " TBL-ID(a ".
           10  WK-TBL-TKMXTR00     PIC  X(13).
           10  FILLER              PIC  X(03)  VALUE
               ",b ".
           10  WK-TBL-TKMXST00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(18)  VALUE
               "' a.RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(18)  VALUE
               "' AND a.TORI_ID ='".
           10  WK-TORI-ID          PIC  S9(10).
      *----------  原取引ＩＤ
           10  FILLER              PIC  X(27)  VALUE
               "' AND a.TORI_ID = b.TORI_ID".
      *----------  決済口座番号
           10  FILLER              PIC  X(19)  VALUE
               "' AND KS_KOZA_NO ='".
           10  WK-MEG-CD           PIC  X(15).
      *----------  資金種別
           10  FILLER              PIC  X(18)  VALUE
               "' AND SIKIN_SBT ='".
           10  WK-SIKIN-SBT        PIC  X(01).
      *----------  増減区分
           10  FILLER              PIC  X(15)  VALUE
               "' AND ZG_KBN ='".
           10  WK-ZG-KBN           PIC  X(01).
      *----------  異動日
           10  FILLER              PIC  X(29)  VALUE
               "' AND b.IDO_YMD = a.G_UKE_YMD".
      *----------  削除区分
           10  FILLER              PIC  X(20)  VALUE
               "' AND SAKUJO_KBN =' ".
      *----------  赤黒区分
           10  FILLER              PIC  X(18)  VALUE
               "' AND AKA_KBN =' '".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *---------- 計算パターン決定に接続用パラメータ
       01  PARM-SMZJ4015-INOUT.
           COPY  "SMZJ4015.cpy".
      *---------- テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *---------- TKMZBW07挿入ルーチン
       01  PARM-INSERT-INOUT.
         05  PARM-INSERT-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-INSERT-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
             COPY  "TKMZBW07.cpy".
       01  PARM-INSERT-RTNPKG.
         05  PARM-INSERT-ARG3.
      *----------  RTNパッケージ
           10  RTN-PACKAGE.
             COPY  "CZRTNPACKAGE.cpy".
      *----------  SMZJ1921 増減情報判断ルーチン
       01  PARM-SMZJ1921-INOUT.
           COPY  "SMZJ1921.cpy".
      *----------  SMZC1958 資金計算コールルーチン
       01  PARM-SMZC1958-INOUT.
           COPY  "SMZC1958.cpy".
      *----------  SMZJ1940 仕訳計算（資金）コールルーチン
       01  PARM-SMZJ1940-INOUT.
           COPY  "SMZJ1940.cpy".
      *----------  SMZJ4014 バランスチェックルーチン
       01  PARM-SMZJ4014-INOUT.
           COPY  "SMZJ4014.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
      *----------  リターンパッケージセットルーチンコピー句
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  ARG2リターンパッケージセットルーチン
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ1920-INOUT.
           COPY  "SMZJ1920.cpy".
       01  PARM-SMZJ1920-RTNPKG.
         05  PARM-SMZJ1920-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ1920-INOUT
                  PARM-SMZJ1920-RTNPKG.
      ******************************************************************
      *                 異動簿価・損益計算(資金)
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1920処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1920処理  正常終了  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *                 3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBLID-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     WORK-AREA
      *                   FLG-AREA                                      @3212SEINO@
                          HST-AREA
                          SQL-AREA
                          E-MSG-TBL
                          PARM-SMZJ1921-INOUT
                          PARM-SMZC1958-INOUT
                          PARM-SMZJ4015-INOUT
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-RTNPKG
                          PARM-SMZJ1920-ARG2  OF  PARM-SMZJ1920-INOUT
                          PARM-SMZJ1920-RTNPKG
      *-----------------------------------------------------------------@3212SEINO@
      D    DISPLAY  CNS-PGM-ID":FIRST-SW            =["FIRST-SW"]"      @3212SEINO@
      *-----------------------------------------------------------------@3212SEINO@
      *-----  初回ＣＡＬＬ時のみフラグエリアの初期化を行う
           IF     FIRST-SW = 'YES'                                      @3212SEINO@@
           THEN                                                         @3212SEINO@@
                  INITIALIZE              FLG-AREA                      @3212SEINO@@
                  MOVE  'NO '         TO  FIRST-SW                      @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FIRST-SW  = ["FIRST-SW"]"               @3212SEINO@
      D    DISPLAY  CNS-PGM-ID":WORK-AREA        = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLG-AREA         = ["FLG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HST-AREA         = ["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA         = ["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL        = ["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1921-INOUT = ["
      D             PARM-SMZJ1921-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZC1958-INOUT = ["
      D             PARM-SMZC1958-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ4015-INOUT = ["
      D             PARM-SMZJ4015-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN = ["PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG= ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG = ["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1920-ARG2  = ["
      D             PARM-SMZJ1920-ARG2   OF  PARM-SMZJ1920-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1920-RTNPKG  = ["
      D             PARM-SMZJ1920-RTNPKG"]"
      *-----------------------------------------------------------------
      *----------  資金取引データ
           MOVE  SIKIN-TORI-PARM         OF  PARM-SMZJ1920-ARG1
             TO  WK-SIKIN-TORI-DATA      OF  WK-DATA-IN
      *----------  異動計算パターン
           MOVE  YIDOU-CALC-PARM         OF  PARM-SMZJ1920-ARG1
             TO  WK-YIDOU-CALC-PARM      OF  WK-DATA-IN
      *----------  直前資金簿価異動
           MOVE  TZ-SK-BOKA-IDO-PARM     OF  PARM-SMZJ1920-ARG1
             TO  WK-TZ-SK-BOKA-IDO-PARM  OF  WK-DATA-IN
      *----------  通貨デフォールト端数処理
           MOVE  TUKA-DEF-HASU-SYRI-PARM OF  PARM-SMZJ1920-ARG1
             TO  WK-TUKA-DEF-HASU-SYRI-PARM
                                         OF  WK-DATA-IN
      *----------  銘柄別断面情報
           MOVE  MEG-BETU-DMN-INFO       OF  PARM-SMZJ1920-ARG1
             TO  WK-MEG-BETU-DMN-INFO    OF  WK-DATA-IN
      *----------  対象資金取引情報
           MOVE  TAGET-SIKIN-TORI-INFO   OF  PARM-SMZJ1920-ARG1
             TO  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
      *----------  運用通貨コード
           MOVE  CAPITAL-TUKA-CD         OF  PARM-SMZJ1920-ARG1
             TO  WK-CAPITAL-TUKA-CD      OF  WK-DATA-IN
      *----------  基準日断面情報
           MOVE  KYJ-YMD-DMN-INFO        OF  PARM-SMZJ1920-ARG1
             TO  WK-KYJ-YMD-DMN-INFO     OF  WK-DATA-IN
      *----------  キャッシュフロー2回有効フラグ
           MOVE  CASH-FLOW-2-FLG         OF  PARM-SMZJ1920-ARG1
             TO  WK-CASH-FLOW-2-FLG      OF  WK-DATA-IN
      *----------  乗算/除算区分
           MOVE  JZ-JS-KBN               OF  PARM-SMZJ1920-ARG1
             TO  WK-JZ-JS-KBN            OF  WK-DATA-IN
      *---------- 受渡計上切替対象フラグ
           MOVE  UKE-KIRIKAE-FLG         OF  PARM-SMZJ1920-ARG1
             TO  WK-UKE-KIRIKAE-FLG      OF  WK-DATA-IN
      *---------- 受渡計上切替対象情報
           MOVE  UKE-KIRIKAE-INF         OF  PARM-SMZJ1920-ARG1
             TO  WK-UKE-KIRIKAE-INF      OF  WK-DATA-IN
      *---------- 勘定異動／残高作成
           MOVE  KJIDO-ZANSK             OF  PARM-SMZJ1920-ARG1
             TO  WK-KJIDO-ZANSK          OF  WK-DATA-IN
      *----------  SCZY1170 RTN-CD 初期化
           MOVE  CNS-RTN-000
             TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金取引データ.決済口座通貨コード    =["
      D             WK-KOZA-TUKA-CD      OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID":資金取引データ.市場通貨コード        =["
      D             WK-SIJO-TUKA-CD      OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID":資金取引データ.取引連関ＩＤ          =["
      D             WK-THRK-ID           OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID":資金取引データ.決済通貨異動額        =["
      D             WK-KSTK-IDOG         OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID":資金取引データ.運用通貨異動額        =["
      D             WK-UYTK-IDOG         OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID":資金取引データ.取引事由              =["
      D             WK-TORI-JIYU         OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID":資金取引データ.異動確定区分          =["
      D             WK-IDO-KBN           OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID":異動計算パターン                     =["
      D             WK-YIDOU-CALC-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "市場通貨異動後未収入金残高（内物）              =["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "運用通貨異動後未収入金残高（内物）              =["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "市場通貨異動後未収入金残高（外物）              =["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "運用通貨異動後未収入金残高（外物）              =["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "市場通貨異動後未払金残高（内物）                =["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "運用通貨異動後未払金残高（内物）                =["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "市場通貨異動後未払金残高（外物）                =["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "運用通貨異動後未払金残高（外物）                =["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "市場通貨異動後CASH残高                          =["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "運用通貨異動後CASH残高                          =["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                                  OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":直前の資金簿価異動."
      D             "異動計上順序                                    =["
      D             WK-IDO-KJY-JUN       OF  WK-TZ-SK-BOKA-IDO-PARM"]"
      D    DISPLAY  CNS-PGM-ID":通貨デフォールト端数処理             =["
      D             WK-TUKA-DEF-HASU-SYRI-PARM
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.処理実行日          =["
      D             WK-SYORI-YMD         OF  WK-MEG-BETU-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.起動ID              =["
      D             WK-KIDOU-ID          OF  WK-MEG-BETU-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.利用会社コード      =["
      D             WK-RIYO-CMP-CD       OF  WK-MEG-BETU-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.ファンドコード      =["
      D             WK-FUND-CD           OF  WK-MEG-BETU-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報."
      D             "ポートフォリオコード =["
      D             WK-PTF-CD            OF  WK-MEG-BETU-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.銘柄コード          =["
      D             WK-MEG-CD            OF  WK-MEG-BETU-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.証券種別コード      =["
      D             WK-SEC-SBT-CD        OF  WK-MEG-BETU-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報.原取引ＩＤ          =["
      D             WK-TORI-ID           OF  WK-TAGET-SIKIN-TORI-INFO"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報.資金種別            =["
      D             WK-SIKIN-SBT         OF  WK-TAGET-SIKIN-TORI-INFO"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報.異動日              =["
      D             WK-IDO-YMD           OF  WK-TAGET-SIKIN-TORI-INFO"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報.増減区分            =["
      D             WK-ZG-KBN            OF  WK-TAGET-SIKIN-TORI-INFO"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報.処理順              =["
      D             WK-SRJUN             OF  WK-TAGET-SIKIN-TORI-INFO"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨コード                       =["
      D             WK-CAPITAL-TUKA-CD   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面情報.仕訳基準パターンコード=["
      D             WK-SWK-KJN-PTN-CD    OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面情報.基本会計ベースフラグ  =["
      D             WK-KH-KAIKEI-BASE-FLG
      D                                  OF  WK-KYJ-YMD-DMN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":キャッシュフロー2回有効フラグ        =["
      D             WK-CASH-FLOW-2-FLG   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":乗算/除算区分                        =["
      D             WK-JZ-JS-KBN         OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":受渡計上切替対象フラグ               =["
      D             WK-UKE-KIRIKAE-FLG   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":受渡計上切替対象情報                 =["
      D             WK-UKE-KIRIKAE-INF   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動／残高作成                   =["
      D             WK-KJIDO-ZANSK       OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1170 RTN-CD           =["
      D             RTN-CD                OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE                   PARM-SCZY1160-INOUT
                                        PARM-RTNPKG
      *---------- テーブルID取得処理
           MOVE  WK-RIYO-CMP-CD         OF  WK-MEG-BETU-DMN-INFO
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
           MOVE  CNS-TBL-TKMXSI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
           MOVE  CNS-TBL-TKMZBW07
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
           MOVE  CNS-TBL-TKMXTR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
           MOVE  CNS-TBL-TKMZBW06
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
           MOVE  CNS-TBL-TKMZZI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
           MOVE  CNS-TBL-TKMXST00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(6)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID1=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID2=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID3=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID4=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID5=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID5=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(6)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SCZY1160)=["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TABLE-TKMXSI00
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TABLE-TKMZBW07
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TABLE-TKMXTR00
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TABLE-TKMZBW06
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TABLE-TKMZZI00
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(6)
               TO  WK-TABLE-TKMXST00
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID1  TKMXSI00=["
      D             WK-TABLE-TKMXSI00"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID2  TKMZBW07=["
      D             WK-TABLE-TKMZBW07"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID3  TKMXTR00=["
      D             WK-TABLE-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID4  TKMZBW06=["
      D             WK-TABLE-TKMZBW06"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID5  TKMZZI00=["
      D             WK-TABLE-TKMZZI00"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID6  TKMXST00=["
      D             WK-TABLE-TKMXST00"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブルID取得エラー"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD  OF  PARM-RTNPKG( COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *                 3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  主処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.2.1.異動・損益計算
           PERFORM  IDO-SNEKI-CALC-RTN
      *----------  3.2.2.資金異動データセット
           PERFORM  SIKN-IDO-ASSET-RTN
      *----------  3.2.3.勘定異動作成
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動／残高作成                   =["
      D             WK-KJIDO-ZANSK        OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           IF  WK-KJIDO-ZANSK             OF  WK-DATA-IN  NOT
            =  CNS-KJIDO-ZANSK-2
           THEN
             PERFORM  KNJ-IDOK-CRE-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  3.2.5.資金簿価異動計算データインサート
           PERFORM  SKBK-IDOC-INSERT-RTN
      *----------  3.2.6.ARG2セット
           PERFORM  ARG2-SET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *        4.1.異動・損益計算
      ******************************************************************
       IDO-SNEKI-CALC-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  異動・損益計算  START  ***"
      D    DISPLAY  CNS-PGM-ID  ":ARG1.受渡計上切替対象フラグ=["
      D                          WK-UKE-KIRIKAE-FLG OF WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID
      D     ":ARG1.受渡計上切替対象情報.キャッシュフロー2回有効フラグ=["
      D             WK-CASH-FLOW-TWO-FLG  OF  WK-UKE-KIRIKAE-INF
      D                                   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID
      D            ":ARG1.受渡計上切替対象情報.仕訳基準パターンコード=["
      D             WK-SWK-KN-PN-CD       OF  WK-UKE-KIRIKAE-INF
      D                                   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID
      D              ":ARG1.受渡計上切替対象情報.基本会計ベースフラグ=["
      D             WK-KH-KAIKEI-BS-FLG   OF  WK-UKE-KIRIKAE-INF
      D                                   OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  4.1.0.資金切替処理
      *----------  ARG1.受渡計上切替対象フラグ＝'1'(対象)の場合
           IF  WK-UKE-KIRIKAE-FLG OF WK-DATA-IN = CNS-X-1
           THEN
      *----------  ARG1.キャッシュフロー2回有効フラグ
      *----------  ←ARG1.受渡計上切替対象情報.キャッシュフロー2回有効フラグ
             MOVE  WK-CASH-FLOW-TWO-FLG  OF  WK-UKE-KIRIKAE-INF
                                         OF  WK-DATA-IN
               TO  WK-CASH-FLOW-2-FLG    OF  WK-DATA-IN
      *----------  ARG1.基準日断面情報.仕訳基準パターンコード
      *----------  ←ARG1.受渡計上切替対象情報.仕訳基準パターンコード
             MOVE  WK-SWK-KN-PN-CD       OF  WK-UKE-KIRIKAE-INF
                                         OF  WK-DATA-IN
               TO  WK-SWK-KJN-PTN-CD     OF  WK-KYJ-YMD-DMN-INFO
                                         OF  WK-DATA-IN
      *----------  ARG1.基準日断面情報.基本会計ベースフラグ
      *----------  ←ARG1.受渡計上切替対象情報.基本会計ベースフラグ
             MOVE  WK-KH-KAIKEI-BS-FLG   OF  WK-UKE-KIRIKAE-INF
                                         OF  WK-DATA-IN
               TO  WK-KH-KAIKEI-BASE-FLG OF  WK-KYJ-YMD-DMN-INFO
                                         OF  WK-DATA-IN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                          ":ARG1.キャッシュフロー2回有効フラグ=["
      D             WK-CASH-FLOW-2-FLG    OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID
      D            ":ARG1.基準日断面情報.仕訳基準パターンコード=["
      D             WK-SWK-KJN-PTN-CD     OF  WK-KYJ-YMD-DMN-INFO
      D                                   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID
      D              ":ARG1.基準日断面情報.基本会計ベースフラグ=["
      D             WK-KH-KAIKEI-BASE-FLG OF  WK-KYJ-YMD-DMN-INFO
      D                                   OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  4.1.1.計算パターン決定
           PERFORM  CALC-PTN-RTN
      *----------  4.1.2.各項目計算
           PERFORM  ONO-KOMK-CALC-RTN
      *----------  4.1.3.ワーク増幅フラグを設定
           PERFORM  WK-ZOUHUKU-SET-RTN
      *----------  4.1.5.資金簿価異動データ編集
           PERFORM  TKMZBW07-EDIT-RTN
      *----------  4.1.6.ワーク資金簿価異動計算増幅データ編集
           PERFORM  SKBK-IDOC-ZHK-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  異動・損益計算  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       IDO-SNEKI-CALC-EXT.
           EXIT.
      ******************************************************************
      *    4.1.1.計算パターン決定
      ******************************************************************
       CALC-PTN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  計算パターン決定 START  ***"
      D    DISPLAY  CNS-PGM-ID  ":【SMZJ4015】計算パターン決定に接続"
      D             "用パラメータの設定を行なう"
      *-----------------------------------------------------------------
           INITIALIZE     PARM-SMZJ4015-INOUT
                          PARM-RTNPKG
      *----------  資金種別
           MOVE  WK-SIKIN-SBT           OF  WK-TAGET-SIKIN-TORI-INFO
             TO  SIKIN-SBT              OF  PARM-SMZJ4015-ARG1
      *----------  増減区分
           MOVE  WK-ZG-KBN              OF  WK-TAGET-SIKIN-TORI-INFO
             TO  ZG-KBN                 OF  PARM-SMZJ4015-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-2
             TO  HANTEI-TARGET-KBN      OF  PARM-SMZJ4015-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":証券種別コード               =["
      D             SEC-SBT-CD          OF  PARM-SMZJ4015-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":取引事由                     =["
      D             TORI-JIYU           OF  PARM-SMZJ4015-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":資産負債・買建売建フラグ     =["
      D             TATE-FLG            OF  PARM-SMZJ4015-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":約定主義会計フラグ           =["
      D             YKJ-SYUGI-KAIKEI    OF  PARM-SMZJ4015-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":新株発行なしフラグ           =["
      D             SKB-HK-NS-FLG       OF  PARM-SMZJ4015-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":経過利息区分                 =["
      D             KKRS-KBN            OF  PARM-SMZJ4015-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":資金種別                     =["
      D             SIKIN-SBT           OF  PARM-SMZJ4015-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":増減区分                     =["
      D             ZG-KBN              OF  PARM-SMZJ4015-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分                 =["
      D             HANTEI-TARGET-KBN   OF  PARM-SMZJ4015-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ4015"             USING  PARM-SMZJ4015-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SMZJ4015 ARG2.計算パターン(資金)."
      D    "資金計算方法=["SIKIN-CALC-HOU
      D                                 OF  CALC-PTN-SIKIN
      D                                 OF  PARM-SMZJ4015-ARG2"]"
      *-----------------------------------------------------------------
           MOVE  SIKIN-CALC-HOU         OF  CALC-PTN-SIKIN
                                        OF  PARM-SMZJ4015-ARG2
             TO  WK-SIKIN-CALC-HOU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":ワーク計算パターン=["
      D             WK-SIKIN-CALC-HOU"]"
      D    DISPLAY  CNS-PGM-ID  ":***  計算パターン決定  END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-PTN-EXT.
           EXIT.
      ******************************************************************
      *    4.1.2.各項目計算
      ******************************************************************
       ONO-KOMK-CALC-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 各項目計算 START ***"
      *-----------------------------------------------------------------
           INITIALIZE     PARM-SMZC1958-INOUT
                          PARM-RTNPKG
      *----------  資金計算方法
           MOVE  WK-SIKIN-CALC-HOU
             TO  SIKIN-CALC-HOU          OF  PARM-SMZC1958-ARG1
      *----------  資金取引.決済口座通貨コード
           MOVE  WK-KOZA-TUKA-CD         OF  WK-SIKIN-TORI-DATA
             TO  KOZA-TUKA-CD            OF  SIKIN-TRHK-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  資金取引.市場通貨コード
           MOVE  WK-SIJO-TUKA-CD         OF  WK-SIKIN-TORI-DATA
             TO  SIJO-TUKA-CD            OF  SIKIN-TRHK-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  資金取引.決済通貨異動額
           MOVE  WK-KSTK-IDOG            OF  WK-SIKIN-TORI-DATA
             TO  KSTK-IDOG               OF  SIKIN-TRHK-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  資金取引.運用通貨異動額
           MOVE  WK-UYTK-IDOG            OF  WK-SIKIN-TORI-DATA
             TO  UYTK-IDOG               OF  SIKIN-TRHK-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  対象資金取引情報.資金種別
           MOVE  WK-SIKIN-SBT            OF  WK-TAGET-SIKIN-TORI-INFO
             TO  SIKIN-SBT               OF  SIKIN-TRHK-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  対象資金取引情報.増減区分
           MOVE  WK-ZG-KBN               OF  WK-TAGET-SIKIN-TORI-INFO
             TO  ZG-KBN                  OF  SIKIN-TRHK-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.市場通貨異動後未収入金残高（内物）
           MOVE  WK-SJTK-IDOG-MSNKZN-UM  OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  SJTK-IDOG-MSNKZN-UM     OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.運用通貨異動後未収入金残高（内物）
           MOVE  WK-UYTK-IDOG-MSNKZN-UM  OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  UYTK-IDOG-MSNKZN-UM     OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.市場通貨異動後未収入金残高（外物）
           MOVE  WK-SJTK-IDOG-MSNKZN-SM  OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  SJTK-IDOG-MSNKZN-SM     OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.運用通貨異動後未収入金残高（外物）
           MOVE  WK-UYTK-IDOG-MSNKZN-SM  OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  UYTK-IDOG-MSNKZN-SM     OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.市場通貨異動後未払金残高（内物）
           MOVE  WK-SJTK-IDOG-MBKZN-UM   OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  SJTK-IDOG-MBKZN-UM      OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.運用通貨異動後未払金残高（内物）
           MOVE  WK-UYTK-IDOG-MBKZN-UM   OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  UYTK-IDOG-MBKZN-UM      OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.市場通貨異動後未払金残高（外物）
           MOVE  WK-SJTK-IDOG-MBKZN-SM   OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  SJTK-IDOG-MBKZN-SM      OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.運用通貨異動後未払金残高（外物）
           MOVE  WK-UYTK-IDOG-MBKZN-SM   OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  UYTK-IDOG-MBKZN-SM      OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.市場通貨異動後CASH残高
           MOVE  WK-SJTK-IDOG-SK-BOKAZN  OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  SJTK-IDOG-SK-BOKAZN     OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  直前の資金簿価異動.運用通貨異動後CASH残高
           MOVE  WK-UYTK-IDOG-SK-BOKAZN  OF  WK-TZ-SK-BOKA-IDO-PARM
             TO  UYTK-IDOG-SK-BOKAZN     OF  TZ-SK-BOKA-IDO-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  運用通貨コード
           MOVE  WK-CAPITAL-TUKA-CD
             TO  CAPITAL-TUKA-CD         OF  PARM-SMZC1958-ARG1
      *----------  通貨デフォールト端数処理.運用通貨小数点以下桁数
           MOVE  WK-LC-SYOSU-TENYIKA-KETASU
                                         OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  LC-SYOSU-TENYIKA-KETASU OF  TUKA-DEF-HASU-SYRI-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  通貨デフォールト端数処理.運用通貨端数処理方法
           MOVE  WK-LC-HS                OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  LC-HS                   OF  TUKA-DEF-HASU-SYRI-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  通貨デフォールト端数処理.市場通貨小数点以下桁数
           MOVE  WK-BC-SYOSU-TENYIKA-KETASU
                                         OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  BC-SYOSU-TENYIKA-KETASU OF  TUKA-DEF-HASU-SYRI-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  通貨デフォールト端数処理.市場通貨端数処理方法
           MOVE  WK-BC-HS                OF  WK-TUKA-DEF-HASU-SYRI-PARM
             TO  BC-HS                   OF  TUKA-DEF-HASU-SYRI-PARM
                                         OF  PARM-SMZC1958-ARG1
      *----------  異動計算パターン
           MOVE  WK-YIDOU-CALC-PARM
             TO  YIDOU-CALC-PARM         OF  PARM-SMZC1958-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 資金計算方法                      = ["
      D             SIKIN-CALC-HOU       OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 資金取引.決済口座通貨コード       = ["
      D             KOZA-TUKA-CD         OF  SIKIN-TRHK-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 資金取引.市場通貨コード           = ["
      D             SIJO-TUKA-CD         OF  SIKIN-TRHK-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 資金取引.決済通貨異動額           = ["
      D             KSTK-IDOG            OF  SIKIN-TRHK-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 資金取引.運用通貨異動額           = ["
      D             UYTK-IDOG            OF  SIKIN-TRHK-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 資金取引.資金種別                 = ["
      D             SIKIN-SBT            OF  SIKIN-TRHK-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 資金取引.増減区分                 = ["
      D             ZG-KBN               OF  SIKIN-TRHK-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "市場通貨異動後未収入金残高（内物） = ["
      D             SJTK-IDOG-MSNKZN-UM  OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "運用通貨異動後未収入金残高（内物） = ["
      D             UYTK-IDOG-MSNKZN-UM  OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "市場通貨異動後未収入金残高（外物） = ["
      D             SJTK-IDOG-MSNKZN-SM  OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "運用通貨異動後未収入金残高（外物） = ["
      D             UYTK-IDOG-MSNKZN-SM  OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "市場通貨異動後未払金残高（内物） = ["
      D             SJTK-IDOG-MBKZN-UM   OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "運用通貨異動後未払金残高（内物） = ["
      D             UYTK-IDOG-MBKZN-UM   OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "市場通貨異動後未払金残高（外物） = ["
      D             SJTK-IDOG-MBKZN-SM   OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "運用通貨異動後未払金残高（外物） = ["
      D             UYTK-IDOG-MBKZN-SM   OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "市場通貨異動後CASH残高           = ["
      D             SJTK-IDOG-SK-BOKAZN  OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 直前の資金簿価異動."
      D             "運用通貨異動後CASH残高           = ["
      D             UYTK-IDOG-SK-BOKAZN  OF  TZ-SK-BOKA-IDO-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 運用通貨コード                    = ["
      D             CAPITAL-TUKA-CD      OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ": 通貨デフォールト端数処理          = ["
      D             TUKA-DEF-HASU-SYRI-PARM
      D                                  OF  PARM-SMZC1958-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":異動計算パターン                     =["
      D             YIDOU-CALC-PARM      OF  PARM-SMZC1958-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZC1958"              USING  PARM-SMZC1958-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC1958)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC1958資金計算コールルーチン 正常 ***"
      D    DISPLAY  CNS-PGM-ID ":PARM-SMZC1958-ARG2=["
      D                         PARM-SMZC1958-ARG2"]"
      *-----------------------------------------------------------------
      *----------  ワーク資金計算結果編集
             PERFORM  CALC-KEKKA-EDIT-RTN
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG           TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-002
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  SMZC1958資金計算コールルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 各項目計算  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ONO-KOMK-CALC-EXT.
           EXIT.
      ******************************************************************
      *    4.1.3.ワーク増幅フラグを設定
      ******************************************************************
       WK-ZOUHUKU-SET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 4.1.3.ワーク増幅フラグを設定"
      D                       " START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.基本会計"
      D                       "ベースフラグ   =["
      D             WK-KH-KAIKEI-BASE-FLG
      D                                  OF  WK-KYJ-YMD-DMN-INFO
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象資金取引情報.資金種別     =["
      D             WK-SIKIN-SBT         OF  WK-TAGET-SIKIN-TORI-INFO
      D                                  OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  ARG1.基準日断面情報.基本会計ベースフラグ＝'1'
      *   (約定ベース)  且つ  ARG1.対象資金取引情報.資金種別 IN('8','9')
           IF  WK-KH-KAIKEI-BASE-FLG     OF  WK-KYJ-YMD-DMN-INFO
                                         OF  WK-DATA-IN
             = CNS-KH-KAIKEI-BASE-FLG-1  AND
              (WK-SIKIN-SBT              OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             = CNS-SIKIN-SBT-8           OR
               WK-SIKIN-SBT              OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             = CNS-SIKIN-SBT-9)
           THEN
      *----------  1) ワーク増幅フラグの初期化
             INITIALIZE  WK-ZOUHUKU-FLG
      *----------  ワーク増幅フラグ←'0'
             MOVE  CNS-ZOUHUKU-FLG-0     TO  WK-ZOUHUKU-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク増幅フラグ                =["
      D             WK-ZOUHUKU-FLG"]"
      *-----------------------------------------------------------------
      *----------  2) 対象取引データ取得処理 (「別紙1-2 SQL説明｣を参照)
             PERFORM  TKMXABC-2-GET-RTN
      *-----------------------------------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク更新ユーザー=["H-UPD-SID "]"
      *-----------------------------------------------------------------
             IF  (H-UPD-SID = CNS-UPD-SID-RSIKOZ1  OR
                 H-UPD-SID = CNS-UPD-SID-RSIKOZ2)
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.資金取引データ.市場通貨コード=["
      D             WK-SIJO-TUKA-CD  OF  WK-SIKIN-TORI-DATA "]"
      D    DISPLAY  CNS-PGM-ID":ARG1.運用通貨コード               =["
      D             WK-CAPITAL-TUKA-CD  "]"
      D    DISPLAY  CNS-PGM-ID":運用通貨消費税=["H-UYTK-S-TAX "]"
      D    DISPLAY  CNS-PGM-ID":現地消費税（運用通貨換算額）=["
      D             H-U-KSG-G-SHZ "]"
      *-----------------------------------------------------------------
               IF  WK-SIJO-TUKA-CD  OF  WK-SIKIN-TORI-DATA
                =  WK-CAPITAL-TUKA-CD
               THEN
                 MOVE  H-U-KSG-G-SHZ
                   TO  H-UYTK-S-TAX   OF  H-TKMXABC
               ELSE
                 CONTINUE
               END-IF
             ELSE
               PERFORM  TKMXABC-GET-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":運用通貨消費税=["
      D             H-UYTK-S-TAX   OF  H-TKMXABC  "]"
      D    DISPLAY  CNS-PGM-ID":現地消費税（運用通貨換算額）=["
      D             H-U-KSG-G-SHZ "]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":別紙1-2.資金決済方法                 =["
      D             H-KESAI-HOHO         OF  H-TKMXABC "]"
      D    DISPLAY  CNS-PGM-ID":ARG1資金取引データ.決済口座通貨コード=["
      D             WK-KOZA-TUKA-CD      OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID":別紙1-2.現地通貨コード             =["
      D             H-G-TUKA-CD          OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.運用通貨コード                  =["
      D             WK-CAPITAL-TUKA-CD   OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
             IF (H-KESAI-HOHO            OF  H-TKMXABC
              =  CNS-KESAI-HOHO-3  AND
                 WK-KOZA-TUKA-CD         OF  WK-SIKIN-TORI-DATA
              =  H-G-TUKA-CD             OF  H-TKMXABC)  OR
                (H-KESAI-HOHO            OF  H-TKMXABC   NOT
              =  CNS-KESAI-HOHO-3  AND
                 WK-KOZA-TUKA-CD         OF  WK-SIKIN-TORI-DATA
              =  WK-CAPITAL-TUKA-CD      OF  WK-DATA-IN)
             THEN
      *----------  3)資金簿価異動計算データ処理
               PERFORM  TKMZBW07-GET-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
      *----------  ワーク増幅フラグ←'0'
             MOVE  CNS-ZOUHUKU-FLG-0     TO  WK-ZOUHUKU-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク増幅フラグ                =["
      D             WK-ZOUHUKU-FLG"]"
      *-----------------------------------------------------------------
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  4.1.3.ワーク増幅フラグを設定"
      D                        "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-ZOUHUKU-SET-EXT.
           EXIT.
      ******************************************************************
      *    資金簿価異動計算データCURSOR PREPARE
      ******************************************************************
       TKMZBW07-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ処理"
      *-----------------------------------------------------------------
      *----------  資金簿価異動計算データCURSOR PREPARE
             PERFORM  TKMZBW07-PREPARE-RTN
      *----------  資金簿価異動計算データCURSOR OPEN
             PERFORM  TKMZBW07-OPEN-RTN
      *----------  資金簿価異動計算データCURSOR FETCH
             PERFORM  TKMZBW07-FETCH-RTN
      *----------  資金簿価異動計算データCURSOR CLOSE
      *      PERFORM  TKMZBW07-CLOSE-RTN                                @3212SEINO@@
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW07-GET-EXT.
           EXIT.
      ******************************************************************
      *    資金簿価異動計算データCURSOR PREPARE
      ******************************************************************
       TKMZBW07-PREPARE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 資金簿価異動計算データ CURSOR "
      D                        "PREPARE START ***"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
           INITIALIZE  SQLSTMT-3-ARR                                    @3212SEINO@@
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMZBW07
             TO  SQL-TBL-ID-1            OF  SQL-SELECT-1-3,
                 WK-TBL-TKMZBW07         OF  WK-MSG-1-3
      *----------    処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-SYORI-YMD             OF  H-TKMZBW07-S,
                 WK-SYORI-YMD            OF  WK-MSG-1-3
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-KIDOU-ID              OF  H-TKMZBW07-S,
                 WK-KIDOU-ID             OF  WK-MSG-1-3
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMZBW07-S,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-3
      *----------  原取引ＩＤ
           MOVE  WK-TORI-ID              OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  H-TORI-ID               OF  H-TKMZBW07-S,
                 WK-TORI-ID              OF  WK-MSG-1-3
      *----------  決済口座番号
           MOVE  WK-MEG-CD               OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-MEG-CD                OF  H-TKMZBW07-S,
                 WK-MEG-CD               OF  WK-MSG-1-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":別紙1-2.資金決済方法=["
      D             H-KESAI-HOHO         OF  H-TKMXABC "]"
      *-----------------------------------------------------------------
      *----------  決済口座通貨コード
           IF  H-KESAI-HOHO              OF  H-TKMXABC
            =  CNS-KESAI-HOHO-3
           THEN
             MOVE  H-G-TUKA-CD           OF  H-TKMXABC
               TO  H-KOZA-TUKA-CD        OF  H-TKMZBW07-S,
                   WK-KOZA-TUKA-CD       OF  WK-MSG-1-3
           ELSE
             MOVE  WK-CAPITAL-TUKA-CD    OF  WK-DATA-IN
               TO  H-KOZA-TUKA-CD        OF  H-TKMZBW07-S,
                   WK-KOZA-TUKA-CD       OF  WK-MSG-1-3
           END-IF
      *    MOVE  SQL-SELECT-1-3          TO  SQLSTMT                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブル名称  =["
      D             SQL-TBL-ID-1         OF  SQL-SELECT-1-3"]"
      D    DISPLAY  CNS-PGM-ID ": 処理実行日   =["
      D             H-SYORI-YMD          OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID        =["
      D             H-KIDOU-ID           OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D             H-RIYO-CMP-CD        OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID ":原取引ＩＤ    =["
      D             H-TORI-ID            OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード    =["
      D             H-MEG-CD             OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID ":決済口座通貨コード=["
      D             H-KOZA-TUKA-CD       OF  H-TKMZBW07-S"]"
      D    DISPLAY  CNS-PGM-ID ":赤黒区分      =[ ]"
      *    DISPLAY  CNS-PGM-ID ":SQLSTMT=[" SQLSTMT "]"                 @3212SEINO@@
      *-----------------------------------------------------------------
           MOVE  1                       TO  SQLSTMT-3-LEN              @3212SEINO@@
           STRING  SQL-SELECT-1-3                                       @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT-3-ARR                                  @3212SEINO@@
                   WITH  POINTER  SQLSTMT-3-LEN                         @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-3-ARR=["SQLSTMT-3-ARR"]"        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW07-CR-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW07-CR-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMZBW07-CR-OPEN  =  CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  資金簿価異動計算データ計算データCURSOR PREPARE
             EXEC  SQL
               PREPARE  S3  FROM  :SQLSTMT-3
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":資金簿価異動計算データ"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-003
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE DECLARE 回数削減"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金簿価異動計算データCURSOR "
      D                       "PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW07-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    資金簿価異動計算データCURSOR OPEN
      ******************************************************************
       TKMZBW07-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金簿価異動計算データCURSOR OPEN"
      D                       " START ***"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW07-CR-OPEN=["                 @3212SEINO@@
      D             FLG-TKMZBW07-CR-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------
           IF  FLG-TKMZBW07-CR-OPEN  =  CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMZBW07_CUR  CURSOR  FOR  S3
             END-EXEC
             CONTINUE                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCUR DECLARE "
      D                       "SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMZBW07_CUR
               USING :H-TKMZBW07-S.H-SYORI-YMD,
                     :H-TKMZBW07-S.H-KIDOU-ID,
                     :H-TKMZBW07-S.H-RIYO-CMP-CD,
                     :H-TKMZBW07-S.H-TORI-ID,
                     :H-TKMZBW07-S.H-MEG-CD,
                     :H-TKMZBW07-S.H-KOZA-TUKA-CD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCUR OPEN "
      D                       "SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON                TO  FLG-TKMZBW07-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":CURSOR OPEN FLAG=["
      D             FLG-TKMZBW07-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-004
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金簿価異動計算データCURSOR OPEN "
      D                       "END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW07-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    資金簿価異動計算データCURSOR FETCH
      ******************************************************************
       TKMZBW07-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金簿価異動計算データCURSOR FETCH "
      D                       "START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH TKMZBW07_CUR
             INTO  :H-TKMZBW07.H-TORI-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           "資金簿価異動計算データCUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCURSOR FETCH 正常"
      D    DISPLAY  CNS-PGM-ID":原取引ID                         =["
      D             H-TORI-ID            OF  H-TKMZBW07"]"
      *-----------------------------------------------------------------
      *----------  ワーク増幅フラグ←'0'
               MOVE  CNS-ZOUHUKU-FLG-0   TO  WK-ZOUHUKU-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク増幅フラグ                =["
      D             WK-ZOUHUKU-FLG"]"
      *-----------------------------------------------------------------
      *----------  データなし
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCURSOR FETCH "
      D                       "NOTFOUNDの場合"
      *-----------------------------------------------------------------
      *----------  ワーク増幅フラグ←'1'
               MOVE  CNS-ZOUHUKU-FLG-1   TO  WK-ZOUHUKU-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク増幅フラグ                =["
      D             WK-ZOUHUKU-FLG"]"
      *-----------------------------------------------------------------
      *----------  異常
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCURSOR FETCH 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-005
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金簿価異動計算データCURSOR FETCH "
      D                       "END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW07-FETCH-EXT.
           EXIT.
      ******************************************************************@3212SEINO@@
      *   資金簿価異動計算データCURSOR CLOSE                            @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *TKMZBW07-CLOSE-RTN     SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":*** 資金簿価異動計算データCURSOR CLOSE "@3212SEINO@@
      *                       "START ***"                               @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMZBW07-CR-OPEN= ["               @3212SEINO@@
      *             FLG-TKMZBW07-CR-OPEN "]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    EXEC  SQL                                                    @3212SEINO@@
      *      CLOSE TKMZBW07_CUR                                         @3212SEINO@@
      *    END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID"資金簿価異動計算データCUR CLOSE "        @3212SEINO@@
      *                       "SQLCODE=["SQLCODE"]"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEINO@@
      *    THEN                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCURSOR CLOSE 正常"@3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      MOVE  CNS-OFF               TO  FLG-TKMZBW07-CR-OPEN       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":CUR OPEN FLAG =["                      @3212SEINO@@
      *             FLG-TKMZBW07-CR-OPEN "]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    ELSE                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":資金簿価異動計算データCURSOR CLOSE 異常"@3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *      MOVE  CNS-PGM-ID                                           @3212SEINO@@
      *        TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *      MOVE  CNS-POS-006                                          @3212SEINO@@
      *        TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *      MOVE  CNS-RTN-900                                          @3212SEINO@@
      *        TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *      MOVE  SQLCODE                                              @3212SEINO@@
      *        TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      *        TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      *              WK-MSG-1-3         DELIMITED  BY  SIZE             @3212SEINO@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      *             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      *             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      *             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      *             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      *             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      *             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
      *      PERFORM  ERR-RTN                                           @3212SEINO@@
      *    END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":***資金簿価異動計算データCURSOR CLOSE" @3212SEINO@@
      *                        " END ***"                               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    CONTINUE.                                                    @3212SEINO@@
      *TKMZBW07-CLOSE-EXT.                                              @3212SEINO@@
      *    EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *    ワーク資金計算結果編集
      ******************************************************************
       CALC-KEKKA-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク資金計算結果編集  START ***"
      *-----------------------------------------------------------------
      *----------  ワーク簿価計算結果を初期化(0に)
           INITIALIZE    WK-SIKIN-CALC-KEKKA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク簿価計算結果を初期化(0に)"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨資金簿価異動額                         = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨資金簿価異動額                         = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後CASH残高                         = ["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後CASH残高                         = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後未収入金残高（内物）             = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後未収入金残高（内物）             = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後未収入金残高（外物）             = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後未収入金残高（外物）             = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後未払金残高（内物）               = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後未払金残高（内物）               = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後未払金残高（外物）               = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後未払金残高（外物）               = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨払出簿価                               = ["
      D             WK-SJTK-H-BOKA       OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨払出簿価                               = ["
      D             WK-UYTK-H-BOKA       OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨払出単価                               = ["
      D             WK-SJTK-H-TNK        OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨払出単価                               = ["
      D             WK-UYTK-H-TNK        OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果.簿価為替レート   = ["
      D             WK-BOKA-KWS          OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果.為替差損益       = ["
      D             WK-UYTK-KWS-SNEKI    OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨利金等損益勘定                         = ["
      D             WK-SJTK-RKSEKJ       OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨利金等損益勘定                         = ["
      D             WK-UYTK-RKSEKJ       OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SMZC1958-ARG2 : "
      D    DISPLAY  CNS-PGM-ID ":市場通貨資金簿価異動額:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-SK-BOKA-IDOGK
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-SK-BOKA-IDOGK
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨資金簿価異動額:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-SK-BOKA-IDOGK
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-SK-BOKA-IDOGK
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨異動後CASH残高:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-IDOG-SK-BOKAZN
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-IDOG-SK-BOKAZN
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨異動後CASH残高:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-IDOG-SK-BOKAZN
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-IDOG-SK-BOKAZN
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY CNS-PGM-ID":市場通貨異動後未収入金残高（内物）:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-IDOG-MSNKZN-UM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-IDOG-MSNKZN-UM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY CNS-PGM-ID":運用通貨異動後未収入金残高（内物）:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-IDOG-MSNKZN-UM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-IDOG-MSNKZN-UM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY CNS-PGM-ID":市場通貨異動後未収入金残高（外物）:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-IDOG-MSNKZN-SM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-IDOG-MSNKZN-SM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY CNS-PGM-ID":運用通貨異動後未収入金残高（外物）:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-IDOG-MSNKZN-SM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-IDOG-MSNKZN-SM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨異動後未払金残高（内物）:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-IDOG-MBKZN-UM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-IDOG-MBKZN-UM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨異動後未払金残高（内物）:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-IDOG-MBKZN-UM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-IDOG-MBKZN-UM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨異動後未払金残高（外物）:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-IDOG-MBKZN-SM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-IDOG-MBKZN-SM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨異動後未払金残高（外物）:"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-IDOG-MBKZN-SM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-IDOG-MBKZN-SM
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨払出簿価 :"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-H-BOKA
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-H-BOKA
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨払出簿価 :"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-H-BOKA
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-H-BOKA
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨払出単価 :"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-H-TNK
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-H-TNK
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨払出単価 :"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-H-TNK
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-H-TNK
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":簿価為替レート :"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  BOKA-KWS
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  BOKA-KWS
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":為替差損益 :"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-KWS-SNEKI
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-KWS-SNEKI
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨利金等損益勘定 :"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  SJTK-RKSEKJ
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  SJTK-RKSEKJ
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨利金等損益勘定 :"
      D    DISPLAY  "バリュー  =["
      D             OUT-VALUES               OF  UYTK-RKSEKJ
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "編集フラグ  =["
      D             EDIT-FLG                 OF  UYTK-RKSEKJ
      D                                      OF  PARM-SMZC1958-ARG2"]"
      D    DISPLAY  "警告フラグ           =["
      D             WARN-FLG                 OF  PARM-SMZC1958-ARG2"]"
      *-----------------------------------------------------------------
      *----------  資金計算結果編集
      *----------  市場通貨資金簿価異動額
           IF  EDIT-FLG  OF  SJTK-SK-BOKA-IDOGK  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-SK-BOKA-IDOGK
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-SK-BOKA-IDOGK OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  運用通貨資金簿価異動額
           IF  EDIT-FLG  OF  UYTK-SK-BOKA-IDOGK  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-SK-BOKA-IDOGK
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-SK-BOKA-IDOGK OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  市場通貨異動後CASH残高
           IF  EDIT-FLG  OF  SJTK-IDOG-SK-BOKAZN  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-IDOG-SK-BOKAZN
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-IDOG-SK-BOKAZN
                                         OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-SJTK-IDOG-SK-BOKAZN
                                         OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-SJTK-IDOG-SK-BOKAZN
                                         OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  運用通貨異動後CASH残高
           IF  EDIT-FLG  OF  UYTK-IDOG-SK-BOKAZN  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-IDOG-SK-BOKAZN
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-IDOG-SK-BOKAZN
                                         OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-UYTK-IDOG-SK-BOKAZN
                                         OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-UYTK-IDOG-SK-BOKAZN
                                         OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  市場通貨異動後未収入金残高（内物）
           IF  EDIT-FLG  OF  SJTK-IDOG-MSNKZN-UM  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-IDOG-MSNKZN-UM
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  運用通貨異動後未収入金残高（内物）
           IF  EDIT-FLG  OF  UYTK-IDOG-MSNKZN-UM  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-IDOG-MSNKZN-UM
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  市場通貨異動後未収入金残高（外物）
           IF  EDIT-FLG  OF  SJTK-IDOG-MSNKZN-SM  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-IDOG-MSNKZN-SM
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  運用通貨異動後未収入金残高（外物）
           IF  EDIT-FLG  OF  UYTK-IDOG-MSNKZN-SM  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-IDOG-MSNKZN-SM
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  市場通貨異動後未払金残高（内物）
           IF  EDIT-FLG  OF  SJTK-IDOG-MBKZN-UM  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-IDOG-MBKZN-UM
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-IDOG-MBKZN-UM OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-SJTK-IDOG-MBKZN-UM OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-SJTK-IDOG-MBKZN-UM OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  運用通貨異動後未払金残高（内物）
           IF  EDIT-FLG  OF  UYTK-IDOG-MBKZN-UM  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-IDOG-MBKZN-UM
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-IDOG-MBKZN-UM OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-UYTK-IDOG-MBKZN-UM OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-UYTK-IDOG-MBKZN-UM OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  市場通貨異動後未払金残高（外物）
           IF  EDIT-FLG  OF  SJTK-IDOG-MBKZN-SM  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-IDOG-MBKZN-SM
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-IDOG-MBKZN-SM OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-SJTK-IDOG-MBKZN-SM OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-SJTK-IDOG-MBKZN-SM OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  運用通貨異動後未払金残高（外物）
           IF  EDIT-FLG  OF  UYTK-IDOG-MBKZN-SM  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-IDOG-MBKZN-SM
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-IDOG-MBKZN-SM OF  WK-SIKIN-CALC-KEKKA
           ELSE
             MOVE  WK-UYTK-IDOG-MBKZN-SM OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
               TO  WK-UYTK-IDOG-MBKZN-SM OF  WK-SIKIN-CALC-KEKKA
           END-IF
      *----------  市場通貨払出簿価
           IF  EDIT-FLG  OF  SJTK-H-BOKA  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-H-BOKA
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-H-BOKA        OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  運用通貨払出簿価
           IF  EDIT-FLG  OF  UYTK-H-BOKA  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-H-BOKA
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-H-BOKA        OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  市場通貨払出単価
           IF  EDIT-FLG  OF  SJTK-H-TNK  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-H-TNK
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-H-TNK         OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  運用通貨払出単価
           IF  EDIT-FLG  OF  UYTK-H-TNK  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-H-TNK
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-H-TNK         OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  為替差損益
           IF  EDIT-FLG  OF  UYTK-KWS-SNEKI  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-KWS-SNEKI
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-KWS-SNEKI     OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  市場通貨利金等損益勘定
           IF  EDIT-FLG  OF  SJTK-RKSEKJ  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  SJTK-RKSEKJ
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-SJTK-RKSEKJ        OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  運用通貨利金等損益勘定
           IF  EDIT-FLG  OF  UYTK-RKSEKJ  OF  PARM-SMZC1958-ARG2
             =  CNS-EDIT-FLG-1
           THEN
             MOVE  OUT-VALUES            OF  UYTK-RKSEKJ
                                         OF  PARM-SMZC1958-ARG2
               TO  WK-UYTK-RKSEKJ        OF  WK-SIKIN-CALC-KEKKA
           ELSE
             CONTINUE
           END-IF
      *----------  警告フラグ
           IF   WARN-FLG  OF  PARM-SMZC1958-ARG2  NOT  =  SPACE
           THEN
             COMPUTE  WARN-INFO-SU OF PARM-SMZJ1920-ARG2
                   =  WARN-INFO-SU OF PARM-SMZJ1920-ARG2 + CNS-1
             MOVE  WARN-FLG               OF  PARM-SMZC1958-ARG2
               TO  WARN-FLG               OF  WARN-INFO
               OF  PARM-SMZJ1920-ARG2(WARN-INFO-SU
                                          OF  PARM-SMZJ1920-ARG2)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.乗算/除算区分= ["WK-JZ-JS-KBN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後CASH残高= ["
      D             WK-SJTK-IDOG-SK-BOKAZN   OF   WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後CASH残高= ["
      D             WK-UYTK-IDOG-SK-BOKAZN   OF   WK-SIKIN-CALC-KEKKA"]"
      *-----------------------------------------------------------------
      *----------  簿価為替レート
           IF  WK-JZ-JS-KBN  =  CNS-JZ-JS-KBN-1
           THEN
             IF  WK-SJTK-IDOG-SK-BOKAZN   OF   WK-SIKIN-CALC-KEKKA
               = ZERO
             THEN
               MOVE  ZERO  TO  WK-BOKA-KWS   OF  WK-SIKIN-CALC-KEKKA
             ELSE
               COMPUTE  WK-BOKA-KWS          OF  WK-SIKIN-CALC-KEKKA
                     =  WK-UYTK-IDOG-SK-BOKAZN OF WK-SIKIN-CALC-KEKKA /
                        WK-SJTK-IDOG-SK-BOKAZN OF WK-SIKIN-CALC-KEKKA
             END-IF
           ELSE
             IF  WK-UYTK-IDOG-SK-BOKAZN   OF   WK-SIKIN-CALC-KEKKA
               = ZERO
             THEN
               MOVE  ZERO  TO  WK-BOKA-KWS   OF  WK-SIKIN-CALC-KEKKA
             ELSE
               COMPUTE  WK-BOKA-KWS          OF  WK-SIKIN-CALC-KEKKA
                     =  WK-SJTK-IDOG-SK-BOKAZN OF WK-SIKIN-CALC-KEKKA /
                        WK-UYTK-IDOG-SK-BOKAZN OF WK-SIKIN-CALC-KEKKA
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":編集後:"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨資金簿価異動額                         = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨資金簿価異動額                         = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後CASH残高                         = ["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後CASH残高                         = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後未収入金残高（内物）             = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後未収入金残高（内物）             = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後未収入金残高（外物）             = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後未収入金残高（外物）             = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後未払金残高（内物）               = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後未払金残高（内物）               = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨異動後未払金残高（外物）               = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨異動後未払金残高（外物）               = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                                  OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果.市場通貨払出簿価 = ["
      D             WK-SJTK-H-BOKA       OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果.運用通貨払出簿価 = ["
      D             WK-UYTK-H-BOKA       OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果.市場通貨払出単価 = ["
      D             WK-SJTK-H-TNK        OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果.運用通貨払出単価 = ["
      D             WK-UYTK-H-TNK        OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果.簿価為替レート   = ["
      D             WK-BOKA-KWS          OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果.為替差損益       = ["
      D             WK-UYTK-KWS-SNEKI    OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "市場通貨利金等損益勘定                         = ["
      D             WK-SJTK-RKSEKJ       OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金計算結果."
      D             "運用通貨利金等損益勘定                         = ["
      D             WK-UYTK-RKSEKJ       OF  WK-SIKIN-CALC-KEKKA"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.警告情報数                     = ["
      D             WARN-INFO-SU"]"
      D    INITIALIZE  WK-WARN-INFO-INDEX
      D    PERFORM  UNTIL  WK-WARN-INFO-INDEX  = CNS-WARN-30
      D      COMPUTE  WK-WARN-INFO-INDEX  = WK-WARN-INFO-INDEX + CNS-1
      D    DISPLAY  CNS-PGM-ID":ARG2.警告情報("WK-WARN-INFO-INDEX") = ["
      D             WARN-FLG
      D             OF  PARM-SMZJ1920-ARG2(WK-WARN-INFO-INDEX)"]"
      D    END-PERFORM
      D    DISPLAY  CNS-PGM-ID":*** ワーク資金計算結果編集   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-KEKKA-EDIT-EXT.
           EXIT.
      ******************************************************************
      *        4.1.5.資金簿価異動データ編集
      ******************************************************************
       TKMZBW07-EDIT-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":** 4.1.5資金簿価異動データ編集 START **"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-SYORI-YMD            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-KIDOU-ID             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-RIYO-CMP-CD          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-FUND-CD              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-PTF-CD               OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  原取引ID
           MOVE  WK-TORI-ID              OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  WK-TORI-ID              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  決済口座番号
           MOVE  WK-MEG-CD               OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-KS-KOZA-NO           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  資金種別
           MOVE  WK-SIKIN-SBT            OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  WK-SIKIN-SBT            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  異動日
           MOVE  WK-IDO-YMD              OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  WK-IDO-YMD              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  増減区分
           MOVE  WK-ZG-KBN               OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  WK-ZG-KBN               OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  赤黒区分
           MOVE  SPACE
             TO  WK-AKA-KBN              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  取引事由
           MOVE  WK-TORI-JIYU            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
             TO  WK-TORI-JIYU            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  取引連関ID
           MOVE  WK-THRK-ID              OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
             TO  WK-THRK-ID              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  決済口座通貨コード
           MOVE  WK-KOZA-TUKA-CD         OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
             TO  WK-KOZA-TUKA-CD         OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-SEC-SBT-CD           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨資金簿価異動額
           MOVE  WK-SJTK-SK-BOKA-IDOGK   OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-SK-BOKA-IDOGK   OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨資金簿価異動額
           MOVE  WK-UYTK-SK-BOKA-IDOGK   OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-SK-BOKA-IDOGK   OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨払出簿価
           MOVE  WK-SJTK-H-BOKA          OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-H-BOKA          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨払出簿価
           MOVE  WK-UYTK-H-BOKA          OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-H-BOKA          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨払出単価
           MOVE  WK-SJTK-H-TNK           OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-H-TNK           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨払出単価
           MOVE  WK-UYTK-H-TNK           OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-H-TNK           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  簿価為替レート
           MOVE  WK-BOKA-KWS             OF  WK-SIKIN-CALC-KEKKA
             TO  WK-BOKA-KWS             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨異動後ＣＡＳＨ残高
           MOVE  WK-SJTK-IDOG-SK-BOKAZN  OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-SK-BOKAZN  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨異動後ＣＡＳＨ残高
           MOVE  WK-UYTK-IDOG-SK-BOKAZN  OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-SK-BOKAZN  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨異動後未収入金残高（内物）
           MOVE  WK-SJTK-IDOG-MSNKZN-UM  OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-MSNKZN-UM  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨異動後未収入金残高（内物）
           MOVE  WK-UYTK-IDOG-MSNKZN-UM  OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-MSNKZN-UM  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨異動後未収入金残高（外物）
           MOVE  WK-SJTK-IDOG-MSNKZN-SM  OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-MSNKZN-SM  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨異動後未収入金残高（外物）
           MOVE  WK-UYTK-IDOG-MSNKZN-SM  OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-MSNKZN-SM  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨異動後未払金残高（内物）
           MOVE  WK-SJTK-IDOG-MBKZN-UM   OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-MBKZN-UM   OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨異動後未払金残高（内物）
           MOVE  WK-UYTK-IDOG-MBKZN-UM   OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-MBKZN-UM   OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨異動後未払金残高（外物）
           MOVE  WK-SJTK-IDOG-MBKZN-SM   OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-MBKZN-SM   OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨異動後未払金残高（外物）
           MOVE  WK-UYTK-IDOG-MBKZN-SM   OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-MBKZN-SM   OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  為替差損益
           MOVE  WK-UYTK-KWS-SNEKI       OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-KWS-SNEKI       OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  市場通貨利金等損益勘定
           MOVE  WK-SJTK-RKSEKJ          OF  WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-RKSEKJ          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  運用通貨利金等損益勘定
           MOVE  WK-UYTK-RKSEKJ          OF  WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-RKSEKJ          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報.処理順              =["
      D             WK-SRJUN             OF  WK-TAGET-SIKIN-TORI-INFO"]"
      *-----------------------------------------------------------------
           IF  WK-SRJUN                  OF  WK-TAGET-SIKIN-TORI-INFO
            =  CNS-1
           THEN
      *----------  異動計上順序
             MOVE  CNS-1
               TO  WK-IDO-KJY-JUN        OF  WK-SIKIN-BOKA-IDO-CALC-DATA
           ELSE
      *----------  異動計上順序
             COMPUTE  WK-IDO-KJY-JUN     OF  WK-SIKIN-BOKA-IDO-CALC-DATA
                   =  WK-IDO-KJY-JUN     OF  WK-TZ-SK-BOKA-IDO-PARM
                                         OF  WK-DATA-IN
                   +  CNS-1
           END-IF
      *----------  削除区分
           MOVE  SPACE
             TO  WK-SAKUJO-KBN           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  作成フラグ
           MOVE  CNS-SK-FLG-3
             TO  WK-SK-FLG               OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  作成ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-SK-LOGIN-CMP-CD      OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  作成ユーザＩＤ
           MOVE  SPACE
             TO  WK-SK-SID               OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  作成プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  WK-SK-PGMID             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  更新フラグ
           MOVE  CNS-UPD-FLG-3
             TO  WK-UPD-FLG              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  WK-UPD-LOGIN-CMP-CD     OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  更新ユーザＩＤ
           MOVE  SPACE
             TO  WK-UPD-SID              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  WK-UPD-PGMID            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "処理実行日                               = ["
      D             WK-SYORI-YMD      OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "起動ID                                   = ["
      D             WK-KIDOU-ID       OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "利用会社コード                           = ["
      D             WK-RIYO-CMP-CD    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "ファンドコード                           = ["
      D             WK-FUND-CD        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "ポートフォリオコード                     = ["
      D             WK-PTF-CD         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "原取引ID                                 = ["
      D             WK-TORI-ID        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "決済口座番号                             = ["
      D             WK-KS-KOZA-NO     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "資金種別                                 = ["
      D             WK-SIKIN-SBT      OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "異動日                                   = ["
      D             WK-IDO-YMD        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "赤黒区分                                 = ["
      D             WK-AKA-KBN        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "誤計上№                                 = ["
      D             WK-ERR-KJY-NO     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "誤計上区分                               = ["
      D             WK-ERR-KJY-KBN    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "取引事由                                 = ["
      D             WK-TORI-JIYU      OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "取引連関ID                               = ["
      D             WK-THRK-ID        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "決済口座通貨コード                       = ["
      D             WK-KOZA-TUKA-CD   OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "証券種別コード                           = ["
      D             WK-SEC-SBT-CD     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨資金簿価異動額                   = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨資金簿価異動額                   = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨払出簿価                         = ["
      D             WK-SJTK-H-BOKA    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨払出簿価                         = ["
      D             WK-UYTK-H-BOKA    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨払出単価                         = ["
      D             WK-SJTK-H-TNK     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨払出単価                         = ["
      D             WK-UYTK-H-TNK     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "簿価為替レート                           = ["
      D             WK-BOKA-KWS       OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "為替差損益                               = ["
      D             WK-UYTK-KWS-SNEKI OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨利金等損益勘定                   = ["
      D             WK-SJTK-RKSEKJ    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨利金等損益勘定                   = ["
      D             WK-UYTK-RKSEKJ    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "異動計上順序                             = ["
      D             WK-IDO-KJY-JUN    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "削除区分                                 = ["
      D             WK-SAKUJO-KBN     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "作成フラグ                               = ["
      D             WK-SK-FLG         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "作成ログインユーザ会社コード             = ["
      D             WK-SK-LOGIN-CMP-CD
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "作成ユーザＩＤ                           = ["
      D             WK-SK-SID         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "作成プログラムＩＤ                       = ["
      D             WK-SK-PGMID       OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "更新フラグ                               = ["
      D             WK-UPD-FLG        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "更新ログインユーザ会社コード             = ["
      D             WK-UPD-LOGIN-CMP-CD
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "更新ユーザＩＤ                           = ["
      D             WK-UPD-SID        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "更新プログラムＩＤ                       = ["
      D             WK-UPD-PGMID      OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":*** 資金簿価異動データ編集  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW07-EDIT-EXT.
           EXIT.
      ******************************************************************
      *        ワーク資金簿価異動計算増幅データ１
      ******************************************************************
       SK-ZHK-EDIT-1-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク資金簿価異動計算増幅データ１"
      D                       "編集 START ***"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SYORI-YMD            OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-KIDOU-ID             OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-RIYO-CMP-CD          OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-FUND-CD              OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-PTF-CD               OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  原取引ID
           MOVE  WK-TORI-ID              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-TORI-ID              OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  決済口座番号
           MOVE  WK-KS-KOZA-NO           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-KS-KOZA-NO           OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  資金種別
           MOVE  WK-SIKIN-SBT            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SIKIN-SBT            OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  異動日
           MOVE  WK-IDO-YMD              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-IDO-YMD              OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  増減区分
           PERFORM ZG-KBN-SET-1-RTN
      *----------  赤黒区分
           MOVE  CNS-AKA-KBN-A
             TO  WK-AKA-KBN              OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  誤計上№
           MOVE  WK-ERR-KJY-NO           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-ERR-KJY-NO           OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  誤計上区分
           MOVE  WK-ERR-KJY-KBN          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-ERR-KJY-KBN          OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  取引事由
           MOVE  WK-TORI-JIYU            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-TORI-JIYU            OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  取引連関ID
           MOVE  WK-THRK-ID              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-THRK-ID              OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  決済口座通貨コード
           MOVE  WK-KOZA-TUKA-CD         OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-KOZA-TUKA-CD         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SEC-SBT-CD           OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  市場通貨資金簿価異動額  と運用通貨資金簿価異動額
      *     PERFORM SK-BOKA-IDOGK-SET-RTN
      *----------  市場通貨払出簿価
           MOVE  WK-SJTK-H-BOKA          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SJTK-H-BOKA          OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨払出簿価
           MOVE  WK-UYTK-H-BOKA          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-H-BOKA          OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  市場通貨払出単価
           MOVE  WK-SJTK-H-TNK           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SJTK-H-TNK           OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨払出単価
           MOVE  WK-UYTK-H-TNK           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-H-TNK           OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  簿価為替レート
           MOVE  WK-BOKA-KWS             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-BOKA-KWS             OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  市場通貨異動後ＣＡＳＨ残高
           MOVE  WK-SJTK-IDOG-SK-BOKAZN  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SJTK-IDOG-SK-BOKAZN  OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後ＣＡＳＨ残高
           MOVE  WK-UYTK-IDOG-SK-BOKAZN  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-IDOG-SK-BOKAZN  OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  市場通貨異動後未収入金残高（内物）
           MOVE  WK-SJTK-IDOG-MSNKZN-UM  OF   WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-MSNKZN-UM  OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未収入金残高（内物）
           MOVE  WK-UYTK-IDOG-MSNKZN-UM  OF   WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-MSNKZN-UM  OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  市場通貨異動後未収入金残高（外物）
           MOVE  WK-SJTK-IDOG-MSNKZN-SM  OF   WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-MSNKZN-SM  OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未収入金残高（外物）
           MOVE  WK-UYTK-IDOG-MSNKZN-SM  OF   WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-MSNKZN-SM  OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  市場通貨異動後未払金残高（内物）
           MOVE  WK-SJTK-IDOG-MBKZN-UM   OF   WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-MBKZN-UM   OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未払金残高（内物）
           MOVE  WK-UYTK-IDOG-MBKZN-UM   OF   WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-MBKZN-UM   OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  市場通貨異動後未払金残高（外物）
           MOVE  WK-SJTK-IDOG-MBKZN-SM   OF   WK-SIKIN-CALC-KEKKA
             TO  WK-SJTK-IDOG-MBKZN-SM   OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未払金残高（外物）
           MOVE  WK-UYTK-IDOG-MBKZN-SM   OF   WK-SIKIN-CALC-KEKKA
             TO  WK-UYTK-IDOG-MBKZN-SM   OF  WK-SKBK-IDC-ZHK-DATA-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      *-----------------------------------------------------------------
           PERFORM IDOG-MBKZN-SET-1-RTN
      *----------  為替差損益
           MOVE  WK-UYTK-KWS-SNEKI       OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-KWS-SNEKI       OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  市場通貨利金等損益勘定
           MOVE  WK-SJTK-RKSEKJ          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SJTK-RKSEKJ          OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨利金等損益勘定
           MOVE  WK-UYTK-RKSEKJ          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-RKSEKJ          OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  異動計上順序
           COMPUTE WK-IDO-KJY-JUN        OF  WK-SKBK-IDC-ZHK-DATA-1
                 = WK-IDO-KJY-JUN        OF  WK-SIKIN-BOKA-IDO-CALC-DATA
                 + CNS-1
      *----------  削除区分
           MOVE  SPACE
             TO  WK-SAKUJO-KBN           OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  作成フラグ
           MOVE  CNS-SK-FLG-3
             TO  WK-SK-FLG               OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  作成ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SK-LOGIN-CMP-CD      OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  作成ユーザＩＤ
           MOVE  SPACE
             TO  WK-SK-SID               OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  作成プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  WK-SK-PGMID             OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  更新フラグ
           MOVE  CNS-UPD-FLG-3
             TO  WK-UPD-FLG              OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UPD-LOGIN-CMP-CD     OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  更新ユーザＩＤ
           MOVE  SPACE
             TO  WK-UPD-SID              OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  WK-UPD-PGMID            OF  WK-SKBK-IDC-ZHK-DATA-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "処理実行日                               = ["
      D             WK-SYORI-YMD      OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "起動ID                                   = ["
      D             WK-KIDOU-ID       OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "利用会社コード                           = ["
      D             WK-RIYO-CMP-CD    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "ファンドコード                           = ["
      D             WK-FUND-CD        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "ポートフォリオコード                     = ["
      D             WK-PTF-CD         OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "原取引ID                                 = ["
      D             WK-TORI-ID        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "決済口座番号                             = ["
      D             WK-KS-KOZA-NO     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "資金種別                                 = ["
      D             WK-SIKIN-SBT      OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "異動日                                   = ["
      D             WK-IDO-YMD        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN         OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "赤黒区分                                 = ["
      D             WK-AKA-KBN        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "誤計上№                                 = ["
      D             WK-ERR-KJY-NO     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "誤計上区分                               = ["
      D             WK-ERR-KJY-KBN    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "取引事由                                 = ["
      D             WK-TORI-JIYU      OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "取引連関ID                               = ["
      D             WK-THRK-ID        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "決済口座通貨コード                       = ["
      D             WK-KOZA-TUKA-CD   OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "証券種別コード                           = ["
      D             WK-SEC-SBT-CD     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨資金簿価異動額                   = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨資金簿価異動額                   = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨払出簿価                         = ["
      D             WK-SJTK-H-BOKA    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨払出簿価                         = ["
      D             WK-UYTK-H-BOKA    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨払出単価                         = ["
      D             WK-SJTK-H-TNK     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨払出単価                         = ["
      D             WK-UYTK-H-TNK     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "簿価為替レート                           = ["
      D             WK-BOKA-KWS       OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "為替差損益                               = ["
      D             WK-UYTK-KWS-SNEKI OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨利金等損益勘定                   = ["
      D             WK-SJTK-RKSEKJ    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨利金等損益勘定                   = ["
      D             WK-UYTK-RKSEKJ    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "異動計上順序                             = ["
      D             WK-IDO-KJY-JUN    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "削除区分                                 = ["
      D             WK-SAKUJO-KBN     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "作成フラグ                               = ["
      D             WK-SK-FLG         OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "作成ログインユーザ会社コード             = ["
      D             WK-SK-LOGIN-CMP-CD
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "作成ユーザＩＤ                           = ["
      D             WK-SK-SID         OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "作成プログラムＩＤ                       = ["
      D             WK-SK-PGMID       OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "更新フラグ                               = ["
      D             WK-UPD-FLG        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "更新ログインユーザ会社コード             = ["
      D             WK-UPD-LOGIN-CMP-CD
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "更新ユーザＩＤ                           = ["
      D             WK-UPD-SID        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "更新プログラムＩＤ                       = ["
      D             WK-UPD-PGMID      OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":*** ワーク資金簿価異動計算増幅データ１"
      D             "  編集END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SK-ZHK-EDIT-1-EXT.
           EXIT.
      ******************************************************************
      *        ワーク資金簿価異動計算増幅データ２
      ******************************************************************
       SK-ZHK-EDIT-2-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク資金簿価異動計算増幅データ２"
      D                       "編集 START ***"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SYORI-YMD            OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-KIDOU-ID             OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-RIYO-CMP-CD          OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-FUND-CD              OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-PTF-CD               OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  原取引ID
           MOVE  WK-TORI-ID              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-TORI-ID              OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  決済口座番号
           MOVE  WK-KS-KOZA-NO           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-KS-KOZA-NO           OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  資金種別
           MOVE  WK-SIKIN-SBT            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SIKIN-SBT            OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  異動日
           MOVE  WK-IDO-YMD              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-IDO-YMD              OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  増減区分
           PERFORM ZG-KBN-SET-2-RTN
      *----------  赤黒区分
           MOVE  CNS-AKA-KBN-B
             TO  WK-AKA-KBN              OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  誤計上№
           MOVE  WK-ERR-KJY-NO           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-ERR-KJY-NO           OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  誤計上区分
           MOVE  WK-ERR-KJY-KBN          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-ERR-KJY-KBN          OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  取引事由
           MOVE  WK-TORI-JIYU            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-TORI-JIYU            OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  取引連関ID
           MOVE  WK-THRK-ID              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-THRK-ID              OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  決済口座通貨コード
           MOVE  WK-KOZA-TUKA-CD         OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-KOZA-TUKA-CD         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SEC-SBT-CD           OF  WK-SKBK-IDC-ZHK-DATA-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":既経過利息（市場通貨換算額）=["
      D             H-S-KSG-G-KKKRS      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":既経過利息（運用通貨換算額）=["
      D             H-U-KSG-G-KKKRS      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID ":別紙1-2.資金決済方法=["
      D             H-KESAI-HOHO         OF  H-TKMXABC "]"
      *-----------------------------------------------------------------
      *----------  決済口座通貨コード
           IF  H-KESAI-HOHO              OF  H-TKMXABC
            =  CNS-KESAI-HOHO-3
           THEN
      *----------  市場通貨資金簿価異動額
             MOVE  H-S-KSG-G-KKKRS       OF  H-TKMXABC
               TO  WK-SJTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-2
           ELSE
      *----------  市場通貨資金簿価異動額
             MOVE  H-U-KSG-G-KKKRS       OF  H-TKMXABC
               TO  WK-SJTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-2
           END-IF
      *----------  運用通貨資金簿価異動額
           MOVE  H-U-KSG-G-KKKRS         OF  H-TKMXABC
             TO  WK-UYTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨払出簿価
           MOVE  WK-SJTK-H-BOKA          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SJTK-H-BOKA          OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨払出簿価
           MOVE  WK-UYTK-H-BOKA          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-H-BOKA          OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨払出単価
           MOVE  WK-SJTK-H-TNK           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SJTK-H-TNK           OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨払出単価
           MOVE  WK-UYTK-H-TNK           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-H-TNK           OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  簿価為替レート
           MOVE  WK-BOKA-KWS             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-BOKA-KWS             OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨異動後ＣＡＳＨ残高
           MOVE  WK-SJTK-IDOG-SK-BOKAZN  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SJTK-IDOG-SK-BOKAZN  OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後ＣＡＳＨ残高
           MOVE  WK-UYTK-IDOG-SK-BOKAZN  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-IDOG-SK-BOKAZN  OF  WK-SKBK-IDC-ZHK-DATA-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ１          =["
      D             WK-SAKUSEI-FLG-1"]"
      *-----------------------------------------------------------------
           IF  WK-SAKUSEI-FLG-1 = CNS-X-1
           THEN
      *----------  市場通貨異動後未収入金残高（内物）
             MOVE  WK-SJTK-IDOG-MSNKZN-UM OF WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-SJTK-IDOG-MSNKZN-UM OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（内物）
             MOVE  WK-UYTK-IDOG-MSNKZN-UM OF WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-UYTK-IDOG-MSNKZN-UM OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨異動後未収入金残高（外物）
             MOVE  WK-SJTK-IDOG-MSNKZN-SM OF WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-SJTK-IDOG-MSNKZN-SM OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（外物）
             MOVE  WK-UYTK-IDOG-MSNKZN-SM OF WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-UYTK-IDOG-MSNKZN-SM OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨異動後未払金残高（内物）
             MOVE  WK-SJTK-IDOG-MBKZN-UM  OF WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-SJTK-IDOG-MBKZN-UM  OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（内物）
             MOVE  WK-UYTK-IDOG-MBKZN-UM  OF WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-UYTK-IDOG-MBKZN-UM  OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨異動後未払金残高（外物）
             MOVE  WK-SJTK-IDOG-MBKZN-SM  OF WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-SJTK-IDOG-MBKZN-SM  OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（外物）
             MOVE  WK-UYTK-IDOG-MBKZN-SM  OF WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-UYTK-IDOG-MBKZN-SM  OF WK-SKBK-IDC-ZHK-DATA-2
           ELSE
      *----------  市場通貨異動後未収入金残高（内物）
             MOVE  WK-SJTK-IDOG-MSNKZN-UM OF WK-SIKIN-CALC-KEKKA
               TO  WK-SJTK-IDOG-MSNKZN-UM OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（内物）
             MOVE  WK-UYTK-IDOG-MSNKZN-UM OF WK-SIKIN-CALC-KEKKA
               TO  WK-UYTK-IDOG-MSNKZN-UM OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨異動後未収入金残高（外物）
             MOVE  WK-SJTK-IDOG-MSNKZN-SM OF WK-SIKIN-CALC-KEKKA
               TO  WK-SJTK-IDOG-MSNKZN-SM OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（外物）
             MOVE  WK-UYTK-IDOG-MSNKZN-SM OF WK-SIKIN-CALC-KEKKA
               TO  WK-UYTK-IDOG-MSNKZN-SM OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨異動後未払金残高（内物）
             MOVE  WK-SJTK-IDOG-MBKZN-UM  OF WK-SIKIN-CALC-KEKKA
               TO  WK-SJTK-IDOG-MBKZN-UM  OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（内物）
             MOVE  WK-UYTK-IDOG-MBKZN-UM  OF WK-SIKIN-CALC-KEKKA
               TO  WK-UYTK-IDOG-MBKZN-UM  OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨異動後未払金残高（外物）
             MOVE  WK-SJTK-IDOG-MBKZN-SM  OF WK-SIKIN-CALC-KEKKA
               TO  WK-SJTK-IDOG-MBKZN-SM  OF WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（外物）
             MOVE  WK-UYTK-IDOG-MBKZN-SM  OF WK-SIKIN-CALC-KEKKA
               TO  WK-UYTK-IDOG-MBKZN-SM  OF WK-SKBK-IDC-ZHK-DATA-2
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      *-----------------------------------------------------------------
           PERFORM IDOG-MBKZN-SET-2-RTN
      *----------  為替差損益
           MOVE  WK-UYTK-KWS-SNEKI       OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-KWS-SNEKI       OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  市場通貨利金等損益勘定
           MOVE  WK-SJTK-RKSEKJ          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SJTK-RKSEKJ          OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨利金等損益勘定
           MOVE  WK-UYTK-RKSEKJ          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UYTK-RKSEKJ          OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  異動計上順序
           IF WK-SAKUSEI-FLG-1 = CNS-X-1
           THEN
             COMPUTE WK-IDO-KJY-JUN      OF  WK-SKBK-IDC-ZHK-DATA-2
                   = WK-IDO-KJY-JUN      OF  WK-SIKIN-BOKA-IDO-CALC-DATA
                   + CNS-2
           ELSE
             COMPUTE WK-IDO-KJY-JUN      OF  WK-SKBK-IDC-ZHK-DATA-2
                   = WK-IDO-KJY-JUN      OF  WK-SIKIN-BOKA-IDO-CALC-DATA
                   + CNS-1
           END-IF
      *----------  削除区分
           MOVE  SPACE
             TO  WK-SAKUJO-KBN           OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  作成フラグ
           MOVE  CNS-SK-FLG-3
             TO  WK-SK-FLG               OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  作成ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-SK-LOGIN-CMP-CD      OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  作成ユーザＩＤ
           MOVE  SPACE
             TO  WK-SK-SID               OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  作成プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  WK-SK-PGMID             OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  更新フラグ
           MOVE  CNS-UPD-FLG-3
             TO  WK-UPD-FLG              OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  WK-UPD-LOGIN-CMP-CD     OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  更新ユーザＩＤ
           MOVE  SPACE
             TO  WK-UPD-SID              OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  WK-UPD-PGMID            OF  WK-SKBK-IDC-ZHK-DATA-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "処理実行日                               = ["
      D             WK-SYORI-YMD      OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "起動ID                                   = ["
      D             WK-KIDOU-ID       OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "利用会社コード                           = ["
      D             WK-RIYO-CMP-CD    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "ファンドコード                           = ["
      D             WK-FUND-CD        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "ポートフォリオコード                     = ["
      D             WK-PTF-CD         OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "原取引ID                                 = ["
      D             WK-TORI-ID        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "決済口座番号                             = ["
      D             WK-KS-KOZA-NO     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "資金種別                                 = ["
      D             WK-SIKIN-SBT      OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "異動日                                   = ["
      D             WK-IDO-YMD        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN         OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "赤黒区分                                 = ["
      D             WK-AKA-KBN        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "誤計上№                                 = ["
      D             WK-ERR-KJY-NO     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "誤計上区分                               = ["
      D             WK-ERR-KJY-KBN    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "取引事由                                 = ["
      D             WK-TORI-JIYU      OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "取引連関ID                               = ["
      D             WK-THRK-ID        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "決済口座通貨コード                       = ["
      D             WK-KOZA-TUKA-CD   OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "証券種別コード                           = ["
      D             WK-SEC-SBT-CD     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨資金簿価異動額                   = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨資金簿価異動額                   = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨払出簿価                         = ["
      D             WK-SJTK-H-BOKA    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨払出簿価                         = ["
      D             WK-UYTK-H-BOKA    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨払出単価                         = ["
      D             WK-SJTK-H-TNK     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨払出単価                         = ["
      D             WK-UYTK-H-TNK     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "簿価為替レート                           = ["
      D             WK-BOKA-KWS       OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "為替差損益                               = ["
      D             WK-UYTK-KWS-SNEKI OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨利金等損益勘定                   = ["
      D             WK-SJTK-RKSEKJ    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨利金等損益勘定                   = ["
      D             WK-UYTK-RKSEKJ    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "異動計上順序                             = ["
      D             WK-IDO-KJY-JUN    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "削除区分                                 = ["
      D             WK-SAKUJO-KBN     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "作成フラグ                               = ["
      D             WK-SK-FLG         OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "作成ログインユーザ会社コード             = ["
      D             WK-SK-LOGIN-CMP-CD
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "作成ユーザＩＤ                           = ["
      D             WK-SK-SID         OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "作成プログラムＩＤ                       = ["
      D             WK-SK-PGMID       OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "更新フラグ                               = ["
      D             WK-UPD-FLG        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "更新ログインユーザ会社コード             = ["
      D             WK-UPD-LOGIN-CMP-CD
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "更新ユーザＩＤ                           = ["
      D             WK-UPD-SID        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "更新プログラムＩＤ                       = ["
      D             WK-UPD-PGMID      OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":*** ワーク資金簿価異動計算増幅データ２"
      D             "編集  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SK-ZHK-EDIT-2-EXT.
           EXIT.
      ******************************************************************
      *    増減区分判定-1
      ******************************************************************
       ZG-KBN-SET-1-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 増減区別判定-1 START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象資金取引情報.資金種別     =["
      D             WK-SIKIN-SBT         OF  WK-TAGET-SIKIN-TORI-INFO
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象資金取引情報.増減区分     =["
      D             WK-ZG-KBN            OF  WK-TAGET-SIKIN-TORI-INFO
      D                                  OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           IF WK-SIKIN-SBT               OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
            = CNS-SIKIN-SBT-8
           THEN
             EVALUATE  WK-ZG-KBN         OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
               WHEN  CNS-ZG-KBN-1
                 MOVE  CNS-ZG-KBN-1
                   TO  WK-ZG-KBN         OF  WK-SKBK-IDC-ZHK-DATA-1
               WHEN  CNS-ZG-KBN-2
                 MOVE  CNS-ZG-KBN-2
                   TO  WK-ZG-KBN         OF  WK-SKBK-IDC-ZHK-DATA-1
               WHEN  OTHER
                 CONTINUE
             END-EVALUATE
           ELSE
             CONTINUE
           END-IF
           IF WK-SIKIN-SBT               OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
            = CNS-SIKIN-SBT-9
           THEN
             EVALUATE  WK-ZG-KBN         OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
               WHEN  CNS-ZG-KBN-1
                 MOVE  CNS-ZG-KBN-2
                   TO  WK-ZG-KBN         OF  WK-SKBK-IDC-ZHK-DATA-1
               WHEN  CNS-ZG-KBN-2
                 MOVE  CNS-ZG-KBN-1
                   TO  WK-ZG-KBN         OF  WK-SKBK-IDC-ZHK-DATA-1
               WHEN  OTHER
                 CONTINUE
             END-EVALUATE
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN            OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID ":***  増減区分判定-1  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ZG-KBN-SET-1-EXT.
           EXIT.
      ******************************************************************
      *    増減区分判定-2
      ******************************************************************
       ZG-KBN-SET-2-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 増減区別判定-2 START ***"
      D    DISPLAY  CNS-PGM-ID":別紙1-2.経過利息区分               =["
      D             H-KKRS-KBN           OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象資金取引情報.資金種別     =["
      D             WK-SIKIN-SBT         OF  WK-TAGET-SIKIN-TORI-INFO
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象資金取引情報.増減区分     =["
      D             WK-ZG-KBN            OF  WK-TAGET-SIKIN-TORI-INFO
      D                                  OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  別紙1-2.経過利息区分=4(マイナス経過利息)
           IF H-KKRS-KBN                 OF  H-TKMXABC
            = CNS-KKRS-KBN-4
           THEN
             IF WK-SIKIN-SBT             OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
              = CNS-SIKIN-SBT-8
             THEN
               EVALUATE  WK-ZG-KBN       OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN  CNS-ZG-KBN-1
                   MOVE  CNS-ZG-KBN-1
                     TO  WK-ZG-KBN       OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN  CNS-ZG-KBN-2
                   MOVE  CNS-ZG-KBN-2
                     TO  WK-ZG-KBN       OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
             IF WK-SIKIN-SBT             OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
              = CNS-SIKIN-SBT-9
             THEN
               EVALUATE  WK-ZG-KBN       OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN  CNS-ZG-KBN-1
                   MOVE  CNS-ZG-KBN-1
                     TO  WK-ZG-KBN       OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN  CNS-ZG-KBN-2
                   MOVE  CNS-ZG-KBN-2
                     TO  WK-ZG-KBN       OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
           ELSE
      *----------  別紙1-2.経過利息区分≠4(マイナス経過利息)
             IF WK-SIKIN-SBT             OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
              = CNS-SIKIN-SBT-8
             THEN
               EVALUATE  WK-ZG-KBN       OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN  CNS-ZG-KBN-1
                   MOVE  CNS-ZG-KBN-2
                     TO  WK-ZG-KBN       OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN  CNS-ZG-KBN-2
                   MOVE  CNS-ZG-KBN-1
                     TO  WK-ZG-KBN       OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
             IF WK-SIKIN-SBT             OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
              = CNS-SIKIN-SBT-9
             THEN
               EVALUATE  WK-ZG-KBN       OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN  CNS-ZG-KBN-1
                   MOVE  CNS-ZG-KBN-2
                     TO  WK-ZG-KBN       OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN  CNS-ZG-KBN-2
                   MOVE  CNS-ZG-KBN-1
                     TO  WK-ZG-KBN       OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN            OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID ":***  増減区分判定-2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ZG-KBN-SET-2-EXT.
           EXIT.
      ******************************************************************
      *    市場/通貨通貨資金簿価異動額
      ******************************************************************
       SK-BOKA-IDOGK-SET-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 市場/通貨通貨資金簿価異動額 "
      D                       "START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報"
      D                       "仕訳基準パターンコードの3桁目   =["
      D             WK-SWK-KJN-PTN-CD        OF  WK-KYJ-YMD-DMN-INFO
      D                                      OF  WK-DATA-IN(3:1)"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨手数料              =["
      D             H-SJTK-TSR               OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨手数料              =["
      D             H-UYTK-TSR               OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨消費税              =["
      D             H-SJTK-S-TAX             OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨消費税              =["
      D             H-UYTK-S-TAX             OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨その他費用          =["
      D             H-SJTK-OTR-FATE          OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨その他費用          =["
      D             H-UYTK-OTR-FATE          OF  H-TKMXABC"]"
      *-----------------------------------------------------------------
           EVALUATE WK-SWK-KJN-PTN-CD        OF  WK-KYJ-YMD-DMN-INFO
                                             OF  WK-DATA-IN(3:1)
             WHEN  CNS-SWK-KJN-PTN-CD-0
      *----------  市場通貨資金簿価異動額
               MOVE  ZERO
                 TO  WK-SJTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨資金簿価異動額
               MOVE  ZERO
                 TO  WK-UYTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-1
             WHEN  CNS-SWK-KJN-PTN-CD-1
      *----------  市場通貨資金簿価異動額
               MOVE  H-SJTK-TSR              OF  H-TKMXABC
                 TO  WK-SJTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨資金簿価異動額
               MOVE  H-UYTK-TSR              OF  H-TKMXABC
                 TO  WK-UYTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-1
             WHEN  CNS-SWK-KJN-PTN-CD-2
      *----------  市場通貨資金簿価異動額
               MOVE  H-SJTK-S-TAX            OF  H-TKMXABC
                 TO  WK-SJTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨資金簿価異動額
               MOVE  H-UYTK-S-TAX            OF  H-TKMXABC
                 TO  WK-UYTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-1
             WHEN  CNS-SWK-KJN-PTN-CD-3
      *----------  市場通貨資金簿価異動額
               MOVE  H-SJTK-OTR-FATE         OF  H-TKMXABC
                 TO  WK-SJTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨資金簿価異動額
               MOVE  H-UYTK-OTR-FATE         OF  H-TKMXABC
                 TO  WK-UYTK-SK-BOKA-IDOGK   OF  WK-SKBK-IDC-ZHK-DATA-1
             WHEN  CNS-SWK-KJN-PTN-CD-4
      *----------  市場通貨資金簿価異動額
               COMPUTE WK-SJTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-1
                     = H-SJTK-TSR            OF  H-TKMXABC
                     + H-SJTK-S-TAX          OF  H-TKMXABC
      *----------  運用通貨資金簿価異動額
               COMPUTE WK-UYTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-1
                     = H-UYTK-TSR            OF  H-TKMXABC
                     + H-UYTK-S-TAX          OF  H-TKMXABC
             WHEN  CNS-SWK-KJN-PTN-CD-5
      *----------  市場通貨資金簿価異動額
               COMPUTE WK-SJTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-1
                     = H-SJTK-TSR            OF  H-TKMXABC
                     + H-SJTK-OTR-FATE       OF  H-TKMXABC
      *----------  運用通貨資金簿価異動額
               COMPUTE WK-UYTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-1
                     = H-UYTK-TSR            OF  H-TKMXABC
                     + H-UYTK-OTR-FATE       OF  H-TKMXABC
             WHEN  CNS-SWK-KJN-PTN-CD-6
      *----------  市場通貨資金簿価異動額
               COMPUTE WK-SJTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-1
                     = H-SJTK-S-TAX          OF  H-TKMXABC
                     + H-SJTK-OTR-FATE       OF  H-TKMXABC
      *----------  運用通貨資金簿価異動額
               COMPUTE WK-UYTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-1
                     = H-UYTK-S-TAX          OF  H-TKMXABC
                     + H-UYTK-OTR-FATE       OF  H-TKMXABC
             WHEN  CNS-SWK-KJN-PTN-CD-Z
      *----------  市場通貨資金簿価異動額
               COMPUTE WK-SJTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-1
                     = H-SJTK-TSR            OF  H-TKMXABC
                     + H-SJTK-S-TAX          OF  H-TKMXABC
                     + H-SJTK-OTR-FATE       OF  H-TKMXABC
      *----------  運用通貨資金簿価異動額
               COMPUTE WK-UYTK-SK-BOKA-IDOGK OF  WK-SKBK-IDC-ZHK-DATA-1
                     = H-UYTK-TSR            OF  H-TKMXABC
                     + H-UYTK-S-TAX          OF  H-TKMXABC
                     + H-UYTK-OTR-FATE       OF  H-TKMXABC
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":別紙1-2.資金決済方法=["
      D             H-KESAI-HOHO             OF  H-TKMXABC "]"
      *-----------------------------------------------------------------
           IF  H-KESAI-HOHO                  OF  H-TKMXABC
            =  CNS-KESAI-HOHO-3
           THEN
             CONTINUE
           ELSE
      *----------  市場通貨資金簿価異動額
             MOVE  WK-UYTK-SK-BOKA-IDOGK     OF  WK-SKBK-IDC-ZHK-DATA-1
               TO  WK-SJTK-SK-BOKA-IDOGK     OF  WK-SKBK-IDC-ZHK-DATA-1
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  市場/通貨通貨資金簿価異動額"
      D                        "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SK-BOKA-IDOGK-SET-EXT.
           EXIT.
      ******************************************************************
      *    異動後未収入/未払金残高（内/外物）設定-1
      ******************************************************************
       IDOG-MBKZN-SET-1-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 異動後未収入/未払金残高（内/外物）"
      D                       "設定-1 START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.資金取引.決済口座通貨コード   =["
      D             WK-KOZA-TUKA-CD      OF  WK-SIKIN-TORI-DATA
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.運用通貨コード                =["
      D             WK-CAPITAL-TUKA-CD   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.資金取引.市場通貨コード       =["
      D             WK-SIJO-TUKA-CD      OF  WK-SIKIN-TORI-DATA
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN            OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象資金取引情報.資金種別     =["
      D             WK-SIKIN-SBT         OF  WK-TAGET-SIKIN-TORI-INFO
      D                                  OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           IF WK-KOZA-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN   AND
              WK-SIJO-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN
           THEN
      *----------  ワーク資金簿価異動計算データ.増減区分:1(増加)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-1
              = CNS-X-1
             THEN
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *----------  市場通貨異動後未収入金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未収入金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN CNS-SIKIN-SBT-9
      *----------  市場通貨異動後未払金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未払金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
      *----------  ワーク資金簿価異動計算データ.増減区分:2(減少)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-1
              = CNS-X-2
             THEN
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *----------  市場通貨異動後未収入金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未収入金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN CNS-SIKIN-SBT-9
      *----------  市場通貨異動後未払金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未払金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF WK-KOZA-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN   AND
              WK-SIJO-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN   NOT
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN
           THEN
      *----------  ワーク資金簿価異動計算データ.増減区分:1(増加)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-1
              = CNS-X-1
             THEN
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *----------  市場通貨異動後未収入金残高（外物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未収入金残高（外物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN CNS-SIKIN-SBT-9
      *----------  市場通貨異動後未払金残高（外物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MBKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未払金残高（外物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MBKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
      *----------  ワーク資金簿価異動計算データ.増減区分:2(減少)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-1
              = CNS-X-2
             THEN
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *----------  市場通貨異動後未収入金残高（外物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未収入金残高（外物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN CNS-SIKIN-SBT-9
      *----------  市場通貨異動後未払金残高（外物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MBKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未払金残高（外物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MBKZN-SM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF WK-KOZA-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN    NOT
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN
           THEN
      *----------  ワーク資金簿価異動計算データ.増減区分:1(増加)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-1
              = CNS-X-1
             THEN
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *----------  市場通貨異動後未収入金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未収入金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN CNS-SIKIN-SBT-9
      *----------  市場通貨異動後未払金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未払金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
      *----------  ワーク資金簿価異動計算データ.増減区分:2(減少)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-1
              = CNS-X-2
             THEN
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *----------  市場通貨異動後未収入金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未収入金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN CNS-SIKIN-SBT-9
      *----------  市場通貨異動後未払金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
      *----------  運用通貨異動後未払金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                         = WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SIKIN-CALC-KEKKA
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-1
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  異動後未収入/未払金残高"
      D                        "（内/外物）設定-1  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       IDOG-MBKZN-SET-1-EXT.
           EXIT.
      ******************************************************************
      *    異動後未収入/未払金残高（内/外物）設定-2
      ******************************************************************
       IDOG-MBKZN-SET-2-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 異動後未収入/未払金残高（内/外物）"
      D                       "設定-2 START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.資金取引.決済口座通貨コード   =["
      D             WK-KOZA-TUKA-CD      OF  WK-SIKIN-TORI-DATA
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.運用通貨コード                =["
      D             WK-CAPITAL-TUKA-CD   OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.資金取引.市場通貨コード       =["
      D             WK-SIJO-TUKA-CD      OF  WK-SIKIN-TORI-DATA
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN            OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象資金取引情報.資金種別     =["
      D             WK-SIKIN-SBT         OF  WK-TAGET-SIKIN-TORI-INFO
      D                                  OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
           IF WK-KOZA-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN   AND
              WK-SIJO-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.資金取引.決済口座通貨コード="
      D                        "ARG1.運用通貨コード且つARG1.資金取引."
      D                        "市場通貨コード＝ARG1.運用通貨コード"
      *-----------------------------------------------------------------
      *----------  ワーク資金簿価異動計算データ.増減区分:1(増加)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-2
              = CNS-X-1
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算増幅データ２."
      D                        "増減区分=1(増加)"
      *-----------------------------------------------------------------
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=8(未収)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未収入金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN CNS-SIKIN-SBT-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=9(未払)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未払金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
      *----------  ワーク資金簿価異動計算データ.増減区分:2(減少)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-2
              = CNS-X-2
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算増幅データ２."
      D                        "増減区分=2(減少)"
      *-----------------------------------------------------------------
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=8(未収)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未収入金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN CNS-SIKIN-SBT-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=9(未払)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未払金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF WK-KOZA-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN   AND
              WK-SIJO-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN   NOT
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.資金取引.決済口座通貨コード="
      D                        "ARG1.運用通貨コード且つARG1.資金取引."
      D                        "市場通貨コード≠ARG1.運用通貨コード"
      *-----------------------------------------------------------------
      *----------  ワーク資金簿価異動計算データ.増減区分:1(増加)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-2
              = CNS-X-1
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算増幅データ２."
      D                        "増減区分=1(増加)"
      *-----------------------------------------------------------------
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=8(未収)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未収入金残高（外物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（外物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN CNS-SIKIN-SBT-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=9(未払)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未払金残高（外物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（外物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
      *----------  ワーク資金簿価異動計算データ.増減区分:2(減少)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-2
              = CNS-X-2
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算増幅データ２."
      D                        "増減区分=2(減少)"
      *-----------------------------------------------------------------
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=8(未収)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未収入金残高（外物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（外物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MSNKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN CNS-SIKIN-SBT-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=9(未払)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未払金残高（外物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（外物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MBKZN-SM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF WK-KOZA-TUKA-CD            OF  WK-SIKIN-TORI-DATA
                                         OF  WK-DATA-IN   NOT
            = WK-CAPITAL-TUKA-CD         OF  WK-DATA-IN
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.資金取引.決済口座通貨コード≠"
      D                        "ARG1.運用通貨コード"
      *-----------------------------------------------------------------
      *----------  ワーク資金簿価異動計算データ.増減区分:1(増加)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-2
              = CNS-X-1
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算増幅データ２."
      D                        "増減区分=1(増加)"
      *-----------------------------------------------------------------
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=8(未収)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未収入金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN CNS-SIKIN-SBT-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=9(未払)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未払金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         + WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
      *----------  ワーク資金簿価異動計算データ.増減区分:2(減少)
             IF WK-ZG-KBN                OF  WK-SKBK-IDC-ZHK-DATA-2
              = CNS-X-2
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算増幅データ２."
      D                        "増減区分=2(減少)"
      *-----------------------------------------------------------------
               EVALUATE WK-SIKIN-SBT     OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
                 WHEN CNS-SIKIN-SBT-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=8(未収)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未収入金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未収入金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MSNKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN CNS-SIKIN-SBT-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.対象資金取引情報.資金種別=9(未払)"
      *-----------------------------------------------------------------
      *----------  市場通貨異動後未払金残高（内物）
                   COMPUTE WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-SJTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-SJTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
      *----------  運用通貨異動後未払金残高（内物）
                   COMPUTE WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         = WK-UYTK-IDOG-MBKZN-UM
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                         - WK-UYTK-SK-BOKA-IDOGK
                                         OF  WK-SKBK-IDC-ZHK-DATA-2
                 WHEN OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 市場/通貨通貨資金簿価異動額 "
      D                       "END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       IDOG-MBKZN-SET-2-EXT.
           EXIT.
      ******************************************************************
      *    4.1.6 ワーク資金簿価異動計算増幅データを計算
      ******************************************************************
       SKBK-IDOC-ZHK-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク資金簿価異動計算増幅データ"
      D                       "を計算 START ***"
      D    DISPLAY  CNS-PGM-ID":ワーク増幅フラグ                =["
      D             WK-ZOUHUKU-FLG"]"
      *-----------------------------------------------------------------
           IF WK-ZOUHUKU-FLG = CNS-X-1
           THEN
      *----------  1)費用データ増幅処理
             PERFORM SK-BOKA-IDOGK-SET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨資金簿価異動額                   = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨資金簿価異動額                   = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      *-----------------------------------------------------------------
             IF WK-SJTK-SK-BOKA-IDOGK    OF  WK-SKBK-IDC-ZHK-DATA-1 NOT
              = ZERO OR
                WK-UYTK-SK-BOKA-IDOGK    OF  WK-SKBK-IDC-ZHK-DATA-1 NOT
              = ZERO
             THEN
      *----------  ワーク作成データフラグ１
               MOVE  CNS-X-1             TO WK-SAKUSEI-FLG-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ１          =["
      D             WK-SAKUSEI-FLG-1"]"
      *-----------------------------------------------------------------
               PERFORM SK-ZHK-EDIT-1-RTN
             ELSE
      *----------  ワーク作成データフラグ１
               MOVE  CNS-X-0             TO WK-SAKUSEI-FLG-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ１          =["
      D             WK-SAKUSEI-FLG-1"]"
      *-----------------------------------------------------------------
             END-IF
      *----------  2)証券種別区分を取得する
             PERFORM  SMZJ4014-RTN
      *----------  3)前払金データ増幅処理
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SMZJ4014】.ARG2.証券種別区分    =["
      D             SEC-SBT-KBN          OF  PARM-SMZJ4014-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.キャッシュフロー2回有効フラグ=["
      D             WK-CASH-FLOW-2-FLG   OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
             IF  SEC-SBT-KBN             OF  PARM-SMZJ4014-ARG2
              =  CNS-X-2 AND
                 WK-CASH-FLOW-2-FLG      OF  WK-DATA-IN
              =  CNS-X-1
             THEN
               PERFORM SK-ZHK-EDIT-2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨資金簿価異動額                   = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨資金簿価異動額                   = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      *-----------------------------------------------------------------
               IF WK-SJTK-SK-BOKA-IDOGK
                                      OF  WK-SKBK-IDC-ZHK-DATA-2 NOT
                = ZERO OR
                  WK-UYTK-SK-BOKA-IDOGK
                                      OF  WK-SKBK-IDC-ZHK-DATA-2 NOT
                = ZERO
               THEN
      *----------  ワーク作成データフラグ２
                 MOVE  CNS-X-1        TO WK-SAKUSEI-FLG-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ２          =["
      D             WK-SAKUSEI-FLG-2"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  ワーク作成データフラグ２
                 MOVE  CNS-X-0        TO WK-SAKUSEI-FLG-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ２          =["
      D             WK-SAKUSEI-FLG-2"]"
      *-----------------------------------------------------------------
               END-IF
             ELSE
               CONTINUE
             END-IF
           ELSE
      *----------  ワーク作成データフラグ１
             MOVE  CNS-X-0               TO WK-SAKUSEI-FLG-1
      *----------  ワーク作成データフラグ２
             MOVE  CNS-X-0               TO WK-SAKUSEI-FLG-2
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク資金簿価異動計算増幅データ"
      D                       "を計算 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SKBK-IDOC-ZHK-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.資金異動データセット
      ******************************************************************
       SIKN-IDO-ASSET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金異動データセット START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.対象資金取引情報.資金種別     =["
      D             WK-SIKIN-SBT         OF  WK-TAGET-SIKIN-TORI-INFO
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.資金取引データ.異動確定区分   =["
      D             WK-IDO-KBN           OF  WK-SIKIN-TORI-DATA
      D                                  OF  WK-DATA-IN"]"
      *-----------------------------------------------------------------
      *----------  ARG1.対象資金取引情報.資金種別＝'0'(CASH) OR '1'
      *            (証拠金)の場合のみ、下記の処理を行う。
           IF (WK-SIKIN-SBT  OF  WK-TAGET-SIKIN-TORI-INFO OF  WK-DATA-IN
             = CNS-SIKIN-SBT-0  OR
               WK-SIKIN-SBT  OF  WK-TAGET-SIKIN-TORI-INFO OF  WK-DATA-IN
             = CNS-SIKIN-SBT-1)  AND
               WK-IDO-KBN  OF  WK-SIKIN-TORI-DATA  OF  WK-DATA-IN
             = CNS-IDO-KBN-1
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動取得処理"
      *-----------------------------------------------------------------
      *----------  資金異動CURSOR PREPARE
             PERFORM  TKMXSI00-PREPARE-RTN
      *----------  資金異動CURSOR OPEN
             PERFORM  TKMXSI00-OPEN-RTN
      *----------  資金異動CURSOR FETCH
             PERFORM  TKMXSI00-FETCH-RTN
      *----------  資金異動CURSOR CLOSE
      *      PERFORM  TKMXSI00-CLOSE-RTN                                @3212SEINO@@
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  資金異動データセット  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SIKN-IDO-ASSET-EXT.
           EXIT.
      ******************************************************************
      *    資金異動CURSOR PREPARE
      ******************************************************************
       TKMXSI00-PREPARE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 資金異動 CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
           INITIALIZE  SQLSTMT-1-ARR                                    @3212SEINO@@
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMXSI00
             TO  SQL-TBL-ID-1            OF  SQL-SELECT-1-1,
                 WK-TBL-TKMXSI00         OF  WK-MSG-1-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMXSI00-S,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-1
      *----------  原取引ＩＤ
           MOVE  WK-TORI-ID              OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  H-TORI-ID               OF  H-TKMXSI00-S,
                 WK-TORI-ID              OF  WK-MSG-1-1
      *----------  ファンドコード
           MOVE  WK-FUND-CD              OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-FUND-CD               OF  H-TKMXSI00-S,
                 WK-FUND-CD              OF  WK-MSG-1-1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD               OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-PTF-CD                OF  H-TKMXSI00-S,
                 WK-PTF-CD               OF  WK-MSG-1-1
      *----------  決済口座番号
           MOVE  WK-MEG-CD               OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-KS-KOZA-NO            OF  H-TKMXSI00-S,
                 WK-KS-KOZA-NO           OF  WK-MSG-1-1
      *----------  資金種別
           MOVE  WK-SIKIN-SBT            OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  H-SIKIN-SBT             OF  H-TKMXSI00-S,
                 WK-SIKIN-SBT            OF  WK-MSG-1-1
      *----------  増減区分
           MOVE  WK-ZG-KBN               OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  H-ZG-KBN                OF  H-TKMXSI00-S,
                 WK-ZG-KBN               OF  WK-MSG-1-1
      *    MOVE  SQL-SELECT-1-1          TO  SQLSTMT                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブル名称  =["
      D             SQL-TBL-ID-1         OF  SQL-SELECT-1-1"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D             H-RIYO-CMP-CD        OF  H-TKMXSI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":原取引ＩＤ    =["
      D             H-TORI-ID            OF  H-TKMXSI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード=["
      D             H-FUND-CD            OF  H-TKMXSI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード=["
      D             H-PTF-CD             OF  H-TKMXSI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":決済口座番号  =["
      D             H-KS-KOZA-NO         OF  H-TKMXSI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":資金種別      =["
      D             H-SIKIN-SBT          OF  H-TKMXSI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":増減区分      =["
      D             H-ZG-KBN             OF  H-TKMXSI00-S"]"
      D    DISPLAY  CNS-PGM-ID ":削除区分      =[ ]"
      D    DISPLAY  CNS-PGM-ID ":赤黒区分      =[ ]"
      *    DISPLAY  CNS-PGM-ID ":SQLSTMT=[" SQLSTMT "]"                 @3212SEINO@@
      *-----------------------------------------------------------------
           MOVE  1                       TO  SQLSTMT-1-LEN              @3212SEINO@@
           STRING  SQL-SELECT-1-1                                       @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT-1-ARR                                  @3212SEINO@@
                   WITH  POINTER  SQLSTMT-1-LEN                         @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-1-ARR=["SQLSTMT-1-ARR"]"        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXSI00-CR-OPEN=["                 @3212SEINO@@
      D             FLG-TKMXSI00-CR-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMXSI00-CR-OPEN  =  CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  資金異動計算データCURSOR PREPARE                     @3212SEINO@@
             EXEC  SQL                                                  @3212SEINO@@
                 PREPARE  S1  FROM  :SQLSTMT-1                          @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":資金異動"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-007
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE DECLARE 回数削減"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金異動CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXSI00-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    資金異動CURSOR OPEN
      ******************************************************************
       TKMXSI00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金異動CURSOR OPEN START ***"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXSI00-CR-OPEN=["                 @3212SEINO@@
      D             FLG-TKMXSI00-CR-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------
           IF  FLG-TKMXSI00-CR-OPEN  =  CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMXSI00_CUR  CURSOR  FOR  S1
             END-EXEC
             CONTINUE                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMXSI00_CUR
               USING :H-TKMXSI00-S.H-RIYO-CMP-CD,
                     :H-TKMXSI00-S.H-TORI-ID,
                     :H-TKMXSI00-S.H-FUND-CD,
                     :H-TKMXSI00-S.H-PTF-CD,
                     :H-TKMXSI00-S.H-KS-KOZA-NO,
                     :H-TKMXSI00-S.H-SIKIN-SBT,
                     :H-TKMXSI00-S.H-ZG-KBN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON                TO  FLG-TKMXSI00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":CURSOR OPEN FLAG=["
      D             FLG-TKMXSI00-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-008
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金異動CURSOR OPEN END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXSI00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    資金異動CURSOR FETCH
      ******************************************************************
       TKMXSI00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金異動CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH TKMXSI00_CUR
             INTO  :H-TKMXSI00.H-UYTK-H-BOKA,
                   :H-TKMXSI00.H-UYTK-KWS-SNEKI
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           "資金異動CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":運用通貨払出簿価                =["
      D             H-UYTK-H-BOKA        OF  H-TKMXSI00"]"
      D    DISPLAY  CNS-PGM-ID":為替差損益                      =["
      D             H-UYTK-KWS-SNEKI     OF  H-TKMXSI00"]"
      *-----------------------------------------------------------------
      *----------  ①ワーク資金異動取得
      *----------  運用通貨払出簿価
               MOVE  H-UYTK-H-BOKA       OF  H-TKMXSI00
                 TO  WK-UYTK-H-BOKA      OF  WK-SIKIN-IDO
      *----------  為替差損益
               MOVE  H-UYTK-KWS-SNEKI    OF  H-TKMXSI00
                 TO  WK-UYTK-KWS-SNEKI   OF  WK-SIKIN-IDO
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金異動取得処理"
      D    DISPLAY  CNS-PGM-ID":運用通貨払出簿価                =["
      D             WK-UYTK-H-BOKA       OF  WK-SIKIN-IDO"]"
      D    DISPLAY  CNS-PGM-ID":為替差損益                      =["
      D             WK-UYTK-KWS-SNEKI    OF  WK-SIKIN-IDO"]"
      *-----------------------------------------------------------------
      *----------  ②資金簿価異動データ再セット
               PERFORM SIKIN-IDO-SET-RTN
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CURSOR FETCH NOTFOUNDの場合"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金異動CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-010
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 資金異動CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXSI00-FETCH-EXT.
           EXIT.
      ******************************************************************@@3212SEINO@@
      *   資金異動CURSOR CLOSE                                          @@3212SEINO@@
      ******************************************************************@@3212SEINO@@
      *TKMXSI00-CLOSE-RTN     SECTION.                                  @@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":*** 資金異動CURSOR CLOSE START ***"     @@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMXSI00-CR-OPEN= ["               @@3212SEINO@@
      *             FLG-TKMXSI00-CR-OPEN "]"                            @@3212SEINO@@
      *-----------------------------------------------------------------@@3212SEINO@@
      *    EXEC  SQL                                                    @@3212SEINO@@
      *      CLOSE TKMXSI00_CUR                                         @@3212SEINO@@
      *    END-EXEC                                                     @@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID"資金異動CUR CLOSE SQLCODE=["SQLCODE"]"   @@3212SEINO@@
      *-----------------------------------------------------------------@@3212SEINO@@
      *    IF  SQLCODE = CNS-SQL-NORMAL                                 @@3212SEINO@@
      *    THEN                                                         @@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":資金異動CURSOR CLOSE  正常"             @@3212SEINO@@
      *-----------------------------------------------------------------@@3212SEINO@@
      *      MOVE  CNS-OFF               TO  FLG-TKMXSI00-CR-OPEN       @@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":CUR OPEN FLAG =["                      @@3212SEINO@@
      *             FLG-TKMXSI00-CR-OPEN "]"                            @@3212SEINO@@
      *-----------------------------------------------------------------@@3212SEINO@@
      *    ELSE                                                         @@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":資金異動CURSOR CLOSE  異常"             @@3212SEINO@@
      *-----------------------------------------------------------------@@3212SEINO@@
      *----------  エラー検知プログラム名                               @@3212SEINO@@
      *      MOVE  CNS-PGM-ID                                           @@3212SEINO@@
      *        TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @@3212SEINO@@
      *----------  ポジション                                           @@3212SEINO@@
      *      MOVE  CNS-POS-011                                          @@3212SEINO@@
      *        TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @@3212SEINO@@
      *----------  リターンコード                                       @@3212SEINO@@
      *      MOVE  CNS-RTN-900                                          @@3212SEINO@@
      *        TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @@3212SEINO@@
      *----------  詳細リターンコード                                   @@3212SEINO@@
      *      MOVE  SQLCODE                                              @@3212SEINO@@
      *        TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @@3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @@3212SEINO@@
      *      MOVE  CNS-DETAIL-1                                         @@3212SEINO@@
      *        TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @@3212SEINO@@
      *---------- フリーメッセージ                                      @@3212SEINO@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @@3212SEINO@@
      *              WK-MSG-1-1         DELIMITED  BY  SIZE             @@3212SEINO@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @@3212SEINO@@
      *             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @@3212SEINO@@
      *             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @@3212SEINO@@
      *             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @@3212SEINO@@
      *             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @@3212SEINO@@
      *             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @@3212SEINO@@
      *             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @@3212SEINO@@
      *-----------------------------------------------------------------@@3212SEINO@@
      *----------  エラー処理                                           @@3212SEINO@@
      *      PERFORM  ERR-RTN                                           @@3212SEINO@@
      *    END-IF                                                       @@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":***資金異動CURSOR CLOSE END ***"       @@3212SEINO@@
      *-----------------------------------------------------------------@@3212SEINO@@
      *    CONTINUE.                                                    @@3212SEINO@@
      *TKMXSI00-CLOSE-EXT.                                              @@3212SEINO@@
      *    EXIT.                                                        @@3212SEINO@@
      ******************************************************************
      *        資金簿価異動データ再セット
      ******************************************************************
       SIKIN-IDO-SET-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  資金簿価異動データ再セット"
      D             "  START  ***"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金異動.運用通貨払出簿価= ["
      D             WK-UYTK-H-BOKA       OF  WK-SIKIN-IDO"]"
      *-----------------------------------------------------------------
      *----------  ワーク資金異動.運用通貨払出簿価≠999999999999999.999の場合
           IF  WK-UYTK-H-BOKA  OF  WK-SIKIN-IDO
             NOT  =  CNS-UYTK-H-BOKA
           THEN
      *----------  A)ワーク資金簿価異動計算データ.運用通貨資金簿価異動額 ← ワーク資金異動.運用通貨払出簿価
             MOVE  WK-UYTK-H-BOKA        OF  WK-SIKIN-IDO
               TO  WK-UYTK-SK-BOKA-IDOGK OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  B)残高項目編集
      *----------  【SMZJ1921】増減情報判断に接続用パラメータの設定を行なう
             INITIALIZE   PARM-SMZJ1921-INOUT
                          PARM-RTNPKG
      *----------  計算種類
             MOVE  CNS-SHRU-08
               TO  CALC-SHRU             OF  PARM-SMZJ1921-INOUT
      *----------  計算項番
             MOVE  WK-SIKIN-CALC-HOU     OF  WK-CALC-PTN
               TO  CALC-KOBN             OF  PARM-SMZJ1921-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":計算種類           = ["
      D             CALC-SHRU            OF  PARM-SMZJ1921-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":計算項番           = ["
      D             CALC-KOBN            OF  PARM-SMZJ1921-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":C/A位置付けフラグ  = ["
      D             CA-POS-FLG           OF  PARM-SMZJ1921-INOUT"]"
      *-----------------------------------------------------------------
             CALL  "SMZJ1921"            USING  PARM-SMZJ1921-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG      =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ1921)       =["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF  PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":【SMZJ1921】増減情報判断をコールして、"
      D             "リターンパッケージを取得する"
      D    DISPLAY  CNS-PGM-ID ":リターンパッケージ.増減フラグ = ["
      D             ZOUGEN-FLG           OF  PARM-SMZJ1921-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ":直前資金簿価異動."
      D             "運用通貨異動後ＣＡＳＨ残高 = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                                  OF WK-TZ-SK-BOKA-IDO-PARM
      D                                  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金異動.  "
      D             "運用通貨払出簿価           = ["
      D             WK-UYTK-H-BOKA       OF  WK-SIKIN-IDO"]"
      *-----------------------------------------------------------------
      *----------  【SMZJ1921】増減情報判断をコールして、リターンパッケージを取得する
      *----------  (a)リターンパッケージ.増減フラグ＝'1'(増加)の場合
             IF  ZOUGEN-FLG  OF  PARM-SMZJ1921-ARG2  =  CNS-ZG-KBN-1
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高←直前資金簿価異動."
      D             "運用通貨異動後ＣＡＳＨ残高＋ワーク資金異動."
      D             "運用通貨払出簿価"
      *-----------------------------------------------------------------
      *----------  ワーク資金簿価異動計算データ.運用通貨異動後ＣＡＳＨ残高
      *            ←直前資金簿価異動.運用通貨異動後ＣＡＳＨ残高＋
      *            ワーク資金異動.運用通貨払出簿価
               COMPUTE  WK-UYTK-IDOG-SK-BOKAZN
                        OF  WK-SIKIN-BOKA-IDO-CALC-DATA
                     =  WK-UYTK-IDOG-SK-BOKAZN OF WK-TZ-SK-BOKA-IDO-PARM
                        OF  WK-DATA-IN
                     +  WK-UYTK-H-BOKA  OF  WK-SIKIN-IDO
             ELSE
      *----------  (b)リターンパッケージ.増減フラグ＝'2'(減少)の場合
               IF  ZOUGEN-FLG  OF  PARM-SMZJ1921-ARG2  =  CNS-ZG-KBN-2
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高←直前資金簿価異動."
      D             "運用通貨異動後ＣＡＳＨ残高－ワーク資金異動."
      D             "運用通貨払出簿価"
      *-----------------------------------------------------------------
      *----------  ワーク資金簿価異動計算データ.運用通貨異動後ＣＡＳＨ残高
      *            ←直前資金簿価異動.運用通貨異動後ＣＡＳＨ残高－
      *            ワーク資金異動.運用通貨払出簿価
                 COMPUTE  WK-UYTK-IDOG-SK-BOKAZN
                          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
                       =  WK-UYTK-IDOG-SK-BOKAZN
                          OF WK-TZ-SK-BOKA-IDO-PARM
                          OF  WK-DATA-IN
                       -  WK-UYTK-H-BOKA  OF  WK-SIKIN-IDO
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算データ."
      D             "運用通貨資金簿価異動額= ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                              OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高           = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                              OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金異動.為替差損益= ["
      D             WK-UYTK-KWS-SNEKI    OF  WK-SIKIN-IDO"]"
      *-----------------------------------------------------------------
      *----------  ワーク資金異動.為替差損益≠999999999999999.999の場合
           IF  WK-UYTK-KWS-SNEKI  OF  WK-SIKIN-IDO
             NOT = CNS-UYTK-KWS-SNEKI
           THEN
             MOVE  WK-UYTK-KWS-SNEKI     OF  WK-SIKIN-IDO
               TO  WK-UYTK-KWS-SNEKI     OF  WK-SIKIN-BOKA-IDO-CALC-DATA
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算データ."
      D             "為替差損益= ["
      D             WK-UYTK-KWS-SNEKI OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      *-----------------------------------------------------------------
      *----------  ◆ワーク資金簿価異動計算データ.作成フラグ←'4'(コピー)
           MOVE  CNS-SK-FLG-4
             TO  WK-SK-FLG               OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *----------  ◆ワーク資金簿価異動計算データ.更新フラグ←'4'(コピー)
           MOVE  CNS-UPD-FLG-4
             TO  WK-UPD-FLG              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算データ."
      D             "作成フラグ= ["
      D             WK-SK-FLG         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金簿価異動計算データ."
      D             "更新フラグ= ["
      D             WK-UPD-FLG        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID ":***  資金簿価異動データ再セット"
      D             "   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SIKIN-IDO-SET-EXT.
           EXIT.
      ******************************************************************
      *        3.2.3.勘定異動作成
      ******************************************************************
       KNJ-IDOK-CRE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  勘定異動作成  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   PARM-SMZJ1940-INOUT
                                        PARM-RTNPKG
      *----------  仕訳基準パターンコード
           MOVE  WK-SWK-KJN-PTN-CD      OF  WK-KYJ-YMD-DMN-INFO
                                        OF  WK-DATA-IN
             TO  SWK-KJN-PTN-CD         OF  PTF-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  国内外国区分
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"ARG1.資金取引データ.取引事由          =["
      D             WK-TORI-JIYU        OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID"ARG1.運用通貨コード                   =["
      D             WK-CAPITAL-TUKA-CD  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID"ARG1.資金取引データ.決済口座通貨コード=["
      D             WK-KOZA-TUKA-CD     OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID"ARG1.資金取引データ.市場通貨コード    =["
      D             WK-SIJO-TUKA-CD     OF  WK-SIKIN-TORI-DATA"]"
      D    DISPLAY  CNS-PGM-ID"ARG1.対象資金取引情報.資金種別        =["
      D             WK-SIKIN-SBT        OF  WK-TAGET-SIKIN-TORI-INFO"]"
      D    DISPLAY  CNS-PGM-ID"ARG1.銘柄別断面情報.証券種別        =["
      D             WK-SEC-SBT-CD       OF  WK-MEG-BETU-DMN-INFO"]"
      *-----------------------------------------------------------------
             IF  (WK-SIKIN-SBT          OF  WK-TAGET-SIKIN-TORI-INFO
               = CNS-SIKIN-SBT-0        OR
                 WK-SIKIN-SBT           OF  WK-TAGET-SIKIN-TORI-INFO
               = CNS-SIKIN-SBT-1)
             THEN
               IF  (WK-SEC-SBT-CD       OF  WK-MEG-BETU-DMN-INFO
                 = CNS-SEC-SBT-MAFB     OR
                   WK-SEC-SBT-CD        OF  WK-MEG-BETU-DMN-INFO
                 = CNS-SEC-SBT-MAFS)
               THEN
                 MOVE  CNS-NAI-GAI-KBN-1
                   TO  NAI-GAI-KBN      OF  PARM-SMZJ1940-ARG1
               ELSE
                 IF  WK-CAPITAL-TUKA-CD OF  WK-DATA-IN
                   = WK-KOZA-TUKA-CD    OF  WK-SIKIN-TORI-DATA
                 THEN
                   MOVE  CNS-NAI-GAI-KBN-0
                     TO  NAI-GAI-KBN    OF  PARM-SMZJ1940-ARG1
                 ELSE
                   MOVE  CNS-NAI-GAI-KBN-1
                     TO  NAI-GAI-KBN    OF  PARM-SMZJ1940-ARG1
                 END-IF
               END-IF
             ELSE
               IF  WK-CAPITAL-TUKA-CD   OF  WK-DATA-IN
                 = WK-SIJO-TUKA-CD      OF  WK-SIKIN-TORI-DATA
               THEN
                 MOVE  CNS-NAI-GAI-KBN-0
                   TO  NAI-GAI-KBN      OF  PARM-SMZJ1940-ARG1
               ELSE
                 MOVE  CNS-NAI-GAI-KBN-1
                   TO  NAI-GAI-KBN      OF  PARM-SMZJ1940-ARG1
               END-IF
             END-IF
      *----------  資金取引データ.証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-SIKIN-TORI-DATA
             TO  SEC-SBT-CD             OF  SIKIN-TORI-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金取引データ.取引内容
           MOVE  WK-TORI-NAIY           OF  WK-SIKIN-TORI-DATA
             TO  TORI-NAIY              OF  SIKIN-TORI-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金取引データ.取引事由
           MOVE  WK-TORI-JIYU           OF  WK-SIKIN-TORI-DATA
             TO  TORI-JIYU              OF  SIKIN-TORI-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金取引データ.運用通貨異動額
           MOVE  WK-UYTK-IDOG           OF  WK-SIKIN-TORI-DATA
             TO  UYTK-IDOG              OF  SIKIN-TORI-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  SYORI-YMD              OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.起動ID
           MOVE  WK-KIDOU-ID            OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  KIDOU-ID               OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  RIYO-CMP-CD            OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.ファンドコード
           MOVE  WK-FUND-CD             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  FUND-CD                OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  PTF-CD                 OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.原取引ID
           MOVE  WK-TORI-ID             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  TORI-ID                OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  取引事由コード
           MOVE  WK-TORI-JIYU           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  TORI-JIYU              OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.決済口座番号
           MOVE  WK-KS-KOZA-NO          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  KS-KOZA-NO             OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.資金種別
           MOVE  WK-SIKIN-SBT           OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  SIKIN-SBT              OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.異動日
           MOVE  WK-IDO-YMD             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  IDO-YMD                OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.増減区分
           MOVE  WK-ZG-KBN              OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  ZG-KBN                 OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.赤黒区分
           MOVE  WK-AKA-KBN             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  AKA-KBN                OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.誤計上№
           MOVE  WK-ERR-KJY-NO          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  ERR-KJY-NO             OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.誤計上区分
           MOVE  WK-ERR-KJY-KBN         OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  ERR-KJY-KBN            OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.取引連関ID
           MOVE  WK-THRK-ID             OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  THRK-ID                OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  SEC-SBT-CD             OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.運用通貨資金簿価異動額
           MOVE  WK-UYTK-SK-BOKA-IDOGK  OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  UYTK-SK-BOKA-IDOGK     OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.為替差損益
           MOVE  WK-UYTK-KWS-SNEKI      OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  UYTK-KWS-SNEKI         OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *----------  資金簿価異動計算データ.運用通貨利金等損益勘定
           MOVE  WK-UYTK-RKSEKJ         OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  UYTK-RKSEKJ            OF  SIKIN-BOKA-IDO-CALC-PARM
                                        OF  PARM-SMZJ1940-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性."
      D    "仕訳基準パターンコード=["SWK-KJN-PTN-CD
      D                                 OF  PTF-PARM
      D                                 OF  PARM-SMZJ1940-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":国内外国区分=["NAI-GAI-KBN
      D                                 OF  PARM-SMZJ1940-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":資金取引データ=["SIKIN-TORI-PARM
      D                                 OF  PARM-SMZJ1940-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ=["
      D             SIKIN-BOKA-IDO-CALC-PARM
      D                                 OF  PARM-SMZJ1940-ARG1"]"
      D    DISPLAY  CNS-PGM-ID"CALL  SMZJ1940"
      *-----------------------------------------------------------------
           CALL  "SMZJ1940"             USING  PARM-SMZJ1940-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ1940)=["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SMZJ1940 仕訳計算(資金)をコール 正常"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SMZJ1940 仕訳計算(資金)をコール エラー"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-012
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD  OF  PARM-RTNPKG( COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  勘定異動作成   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KNJ-IDOK-CRE-EXT.
           EXIT.
      ******************************************************************
      *    対象取引データ取得処理
      ******************************************************************
       TKMXABC-2-GET-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引データ取得処理"
      *-----------------------------------------------------------------
      *----------  移行データ対応する取引各費用取得処理CURSOR PREPARE
             PERFORM  TKMXABC-2-PREPARE-RTN
      *----------  移行データ対応する取引各費用取得処理CURSOR OPEN
             PERFORM  TKMXABC-2-OPEN-RTN
      *----------  移行データ対応する取引各費用取得処理CURSOR FETCH
             PERFORM  TKMXABC-2-FETCH-RTN
      *----------  移行データ対応する取引各費用取得処理CURSOR CLOSE
      *      PERFORM  TKMXABC-2-CLOSE-RTN                               @3212SEINO@@
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXABC-2-GET-EXT.
           EXIT.
      ******************************************************************
      *    移行データ対応する取引各費用取得処理CURSOR PREPARE
      ******************************************************************
       TKMXABC-2-PREPARE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
           INITIALIZE  SQLSTMT-4-ARR                                    @3212SEINO@@
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMXTR00
             TO  SQL-TBL-ID-1            OF  SQL-SELECT-1-4,
                 WK-TBL-TKMXTR00         OF  WK-MSG-1-4
           MOVE  WK-TABLE-TKMXST00
             TO  SQL-TBL-ID-2            OF  SQL-SELECT-1-4,
                 WK-TBL-TKMXST00         OF  WK-MSG-1-4
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMXABC-2-S,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-4
      *----------  原取引ＩＤ
           MOVE  WK-TORI-ID              OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  H-TORI-ID               OF  H-TKMXABC-2-S,
                 WK-TORI-ID              OF  WK-MSG-1-4
      *----------  銘柄別断面情報.銘柄コード
           MOVE  WK-MEG-CD               OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-MEG-CD                OF  H-TKMXABC-2-S,
                 WK-MEG-CD               OF  WK-MSG-1-4
      *----------  対象資金取引情報.資金種別
           MOVE  WK-SIKIN-SBT            OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  H-SIKIN-SBT             OF  H-TKMXABC-2-S,
                 WK-SIKIN-SBT            OF  WK-MSG-1-4
      *----------  対象資金取引情報.増減区分
           MOVE  WK-ZG-KBN               OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  H-ZG-KBN                OF  H-TKMXABC-2-S,
                 WK-ZG-KBN               OF  WK-MSG-1-4
      *    MOVE  SQL-SELECT-1-4          TO  SQLSTMT                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブル名称1 =["
      D             SQL-TBL-ID-1         OF  SQL-SELECT-1-4"]"
      D    DISPLAY  CNS-PGM-ID ":テーブル名称2 =["
      D             SQL-TBL-ID-2         OF  SQL-SELECT-1-4"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D             H-RIYO-CMP-CD        OF  H-TKMXABC-2-S"]"
      D    DISPLAY  CNS-PGM-ID ":原取引ＩＤ    =["
      D             H-TORI-ID            OF  H-TKMXABC-2-S"]"
      D    DISPLAY  CNS-PGM-ID ": 銘柄コード   =["
      D             H-MEG-CD             OF  H-TKMXABC-2-S"]"
      D    DISPLAY  CNS-PGM-ID ":資金種別      =["
      D             H-SIKIN-SBT          OF  H-TKMXABC-2-S"]"
      D    DISPLAY  CNS-PGM-ID ":増減区分      =["
      D             H-ZG-KBN             OF  H-TKMXABC-2-S"]"
      *    DISPLAY  CNS-PGM-ID ":SQLSTMT=[" SQLSTMT "]"                 @3212SEINO@@
      *-----------------------------------------------------------------
           MOVE  1                       TO  SQLSTMT-4-LEN              @3212SEINO@@
           STRING  SQL-SELECT-1-4                                       @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT-4-ARR                                  @3212SEINO@@
                   WITH  POINTER  SQLSTMT-4-LEN                         @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-4-ARR=["SQLSTMT-4-ARR"]"        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXABC-2-CR-OPEN=["                @3212SEINO@@
      D             FLG-TKMXABC-2-CR-OPEN"]"                            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMXABC-2-CR-OPEN  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  取引各費用CURSOR PREPARE
             EXEC  SQL
               PREPARE  S4  FROM  :SQLSTMT-4
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":移行データ対応する取引各費用"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":移行データ対応する取引各費用"
      D             "CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":移行データ対応する取引各費用"
      D             "CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-013
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-4        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE DECLARE 回数削減"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXABC-2-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    移行データ対応する取引各費用取得処理CURSOR OPEN
      ******************************************************************
       TKMXABC-2-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR OPEN START ***"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXABC-2-CR-OPEN=["                @3212SEINO@@
      D             FLG-TKMXABC-2-CR-OPEN"]"                            @3212SEINO@@
      *-----------------------------------------------------------------
           IF  FLG-TKMXABC-2-CR-OPEN  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMXABC_2_CUR  CURSOR  FOR  S4
             END-EXEC
             CONTINUE                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":移行データ対応する取引各費用"
      D             "CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMXABC_2_CUR
               USING :H-TKMXABC-2-S.H-RIYO-CMP-CD,
                     :H-TKMXABC-2-S.H-TORI-ID,
                     :H-TKMXABC-2-S.H-MEG-CD,
                     :H-TKMXABC-2-S.H-SIKIN-SBT,
                     :H-TKMXABC-2-S.H-ZG-KBN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":移行データ対応する取引各費用"
      D             "CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON                TO  FLG-TKMXABC-2-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":移行データ対応する取引各費用"
      D             "CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":CURSOR OPEN FLAG=["
      D             FLG-TKMXABC-2-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":移行データ対応する取引各費用"
      D             "CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-014
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR OPEN END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXABC-2-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    移行データ対応する取引各費用取得処理CURSOR FETCH
      ******************************************************************
       TKMXABC-2-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH TKMXABC_2_CUR
             INTO  :H-TKMXABC.H-UKE-YMD,
                   :H-TKMXABC.H-S-KSG-G-KKKRS,
                   :H-TKMXABC.H-U-KSG-G-KKKRS,
                   :H-TKMXABC.H-KKRS-KBN,
                   :H-TKMXABC.H-G-TUKA-CD,
                   :H-TKMXABC.H-KESAI-HOHO,
                   :H-TKMXABC.H-SJTK-TSR,
                   :H-TKMXABC.H-UYTK-TSR,
                   :H-TKMXABC.H-SJTK-S-TAX,
                   :H-TKMXABC.H-UYTK-S-TAX,
                   :H-TKMXABC.H-SJTK-OTR-FATE,
                   :H-TKMXABC.H-UYTK-OTR-FATE,
                   :H-UPD-SID,
                   :H-U-KSG-G-SHZ
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":受渡日                      =["
      D             H-UKE-YMD            OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":既経過利息（運用通貨換算額）=["
      D             H-U-KSG-G-KKKRS      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":既経過利息（市場通貨換算額）=["
      D             H-S-KSG-G-KKKRS      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":経過利息区分                =["
      D             H-KKRS-KBN           OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":現地通貨コード              =["
      D             H-G-TUKA-CD          OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":資金決済方法                =["
      D             H-KESAI-HOHO         OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨手数料              =["
      D             H-SJTK-TSR           OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨手数料              =["
      D             H-UYTK-TSR           OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨消費税              =["
      D             H-SJTK-S-TAX         OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨消費税              =["
      D             H-UYTK-S-TAX         OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨その他費用          =["
      D             H-SJTK-OTR-FATE      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨その他費用          =["
      D             H-UYTK-OTR-FATE      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザーID              =["
      D             H-UPD-SID"]"
      D    DISPLAY  CNS-PGM-ID":現地消費税（運用通貨換算額）=["
      D             H-U-KSG-G-SHZ"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR FETCH  NOTFOUND"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-015
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "
      D             "CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXABC-2-FETCH-EXT.
           EXIT.
      ******************************************************************@3212SEINO@@
      *   移行データ対応する取引各費用取得処理CURSOR CLOSE              @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *TKMXABC-2-CLOSE-RTN      SECTION.                                @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "     @3212SEINO@@
      *             "CURSOR CLOSE START ***"                            @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMXABC-2-CR-OPEN= ["              @3212SEINO@@
      *             FLG-TKMXABC-CR-OPEN "]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    EXEC  SQL                                                    @3212SEINO@@
      *      CLOSE TKMXABC_2_CUR                                        @3212SEINO@@
      *    END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "     @3212SEINO@@
      *             "CUR CLOSE SQLCODE=["SQLCODE"]"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEINO@@
      *    THEN                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "     @3212SEINO@@
      *             ":CURSOR CLOSE  正常"                               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      MOVE  CNS-OFF               TO  FLG-TKMXABC-2-CR-OPEN      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMXABC-2-CR-OPEN =["              @3212SEINO@@
      *             FLG-TKMXABC-2-CR-OPEN "]"                           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    ELSE                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "     @3212SEINO@@
      *             ":CURSOR CLOSE  異常"                               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *      MOVE  CNS-PGM-ID                                           @3212SEINO@@
      *        TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *      MOVE  CNS-POS-016                                          @3212SEINO@@
      *        TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *      MOVE  CNS-RTN-900                                          @3212SEINO@@
      *        TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *      MOVE  SQLCODE                                              @3212SEINO@@
      *        TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      *        TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      *              WK-MSG-1-4         DELIMITED  BY  SIZE             @3212SEINO@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      *             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      *             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      *             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      *             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      *             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      *             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
      *      PERFORM  ERR-RTN                                           @3212SEINO@@
      *    END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":*** 移行データ対応する取引各費用 "     @3212SEINO@@
      *             "CURSOR CLOSE END ***"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    CONTINUE.                                                    @3212SEINO@@
      *TKMXABC-2-CLOSE-EXT.                                             @3212SEINO@@
      *    EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *    対象取引データ取得処理
      ******************************************************************
       TKMXABC-GET-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引データ取得処理"
      *-----------------------------------------------------------------
      *----------  対象取引データ取得処理CURSOR PREPARE
             PERFORM  TKMXABC-PREPARE-RTN
      *----------  対象取引データ取得処理CURSOR OPEN
             PERFORM  TKMXABC-OPEN-RTN
      *----------  対象取引データ取得処理CURSOR FETCH
             PERFORM  TKMXABC-FETCH-RTN
      *----------  対象取引データ取得処理CURSOR CLOSE
      *      PERFORM  TKMXABC-CLOSE-RTN                                 @3212SEINO@@
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXABC-GET-EXT.
           EXIT.
      ******************************************************************
      *    取残異動CURSOR PREPARE
      ******************************************************************
       TKMXABC-PREPARE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 取残異動 CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
           INITIALIZE  SQLSTMT-2-ARR                                    @3212SEINO@@
      *----------  テーブル名称
           MOVE  WK-TABLE-TKMXTR00
             TO  SQL-TBL-ID-1            OF  SQL-SELECT-1-2,
                 WK-TBL-TKMXTR00         OF  WK-MSG-1-2
           MOVE  WK-TABLE-TKMZBW06
             TO  SQL-TBL-ID-2            OF  SQL-SELECT-1-2,
                 WK-TBL-TKMZBW06         OF  WK-MSG-1-2
           MOVE  WK-TABLE-TKMZZI00
             TO  SQL-TBL-ID-3            OF  SQL-SELECT-1-2,
                 WK-TBL-TKMZZI00         OF  WK-MSG-1-2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD          OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD           OF  H-TKMXABC-S,
                 WK-RIYO-CMP-CD          OF  WK-MSG-1-2
      *----------  原取引ＩＤ
           MOVE  WK-TORI-ID              OF  WK-TAGET-SIKIN-TORI-INFO
                                         OF  WK-DATA-IN
             TO  H-TORI-ID               OF  H-TKMXABC-S,
                 WK-TORI-ID              OF  WK-MSG-1-2
      *----------  処理実行日
           MOVE  WK-SYORI-YMD            OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-SYORI-YMD             OF  H-TKMXABC-S,
                 WK-SYORI-YMD            OF  WK-MSG-1-2
      *----------  起動ID
           MOVE  WK-KIDOU-ID             OF  WK-MEG-BETU-DMN-INFO
                                         OF  WK-DATA-IN
             TO  H-KIDOU-ID              OF  H-TKMXABC-S,
                 WK-KIDOU-ID             OF  WK-MSG-1-2
      *    MOVE  SQL-SELECT-1-2          TO  SQLSTMT                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブル名称1 =["
      D             SQL-TBL-ID-1         OF  SQL-SELECT-1-2"]"
      D    DISPLAY  CNS-PGM-ID ":テーブル名称2 =["
      D             SQL-TBL-ID-2         OF  SQL-SELECT-1-2"]"
      D    DISPLAY  CNS-PGM-ID ":テーブル名称3 =["
      D             SQL-TBL-ID-3         OF  SQL-SELECT-1-2"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D             H-RIYO-CMP-CD        OF  H-TKMXABC-S"]"
      D    DISPLAY  CNS-PGM-ID ":原取引ＩＤ    =["
      D             H-TORI-ID            OF  H-TKMXABC-S"]"
      D    DISPLAY  CNS-PGM-ID ": 処理実行日   =["
      D             H-SYORI-YMD          OF  H-TKMXABC-S"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID        =["
      D             H-KIDOU-ID           OF  H-TKMXABC-S"]"
      D    DISPLAY  CNS-PGM-ID ":赤黒区分      =[ ]"
      *    DISPLAY  CNS-PGM-ID ":SQLSTMT=[" SQLSTMT "]"                 @3212SEINO@@
      *-----------------------------------------------------------------
           MOVE  1                       TO  SQLSTMT-2-LEN              @3212SEINO@@
           STRING  SQL-SELECT-1-2                                       @3212SEINO@@
                   DELIMITED BY SIZE                                    @3212SEINO@@
                   INTO  SQLSTMT-2-ARR                                  @3212SEINO@@
                   WITH  POINTER  SQLSTMT-2-LEN                         @3212SEINO@@
           END-STRING                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-2-ARR=["SQLSTMT-2-ARR"]"        @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXABC-CR-OPEN=["                  @3212SEINO@@
      D             FLG-TKMXABC-CR-OPEN"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  FLG-TKMXABC-CR-OPEN  =  CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  取残異動計算データCURSOR PREPARE
             EXEC  SQL
               PREPARE  S2  FROM  :SQLSTMT-2
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":取残異動"
      D             "CURSOR PREPARE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取残異動CUR PREPARE 正常"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取残異動CUR PREPARE 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-017
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-2        DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID"：性能改善 PREPARE DECLARE 回数削減"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取残異動CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXABC-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    取残異動CURSOR OPEN
      ******************************************************************
       TKMXABC-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取残異動CURSOR OPEN START ***"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXABC-CR-OPEN=["                  @3212SEINO@@
      D             FLG-TKMXABC-CR-OPEN"]"                              @3212SEINO@@
      *-----------------------------------------------------------------
           IF  FLG-TKMXABC-CR-OPEN  =  CNS-OFF                          @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  DECLARE CURSOR
             EXEC  SQL
               DECLARE  TKMXABC_CUR  CURSOR  FOR  S2
             END-EXEC
             CONTINUE                                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取残異動CUR DECLARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  OPEN CURSOR
           EXEC  SQL
             OPEN  TKMXABC_CUR
               USING :H-TKMXABC-S.H-RIYO-CMP-CD,
                     :H-TKMXABC-S.H-TORI-ID,
                     :H-TKMXABC-S.H-RIYO-CMP-CD,
                     :H-TKMXABC-S.H-TORI-ID,
                     :H-TKMXABC-S.H-SYORI-YMD,
                     :H-TKMXABC-S.H-KIDOU-ID,
                     :H-TKMXABC-S.H-RIYO-CMP-CD,
                     :H-TKMXABC-S.H-TORI-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取残異動CUR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON                TO  FLG-TKMXABC-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取残異動CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":CURSOR OPEN FLAG=["
      D             FLG-TKMXABC-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取残異動CURSOR OPEN  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-018
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-2          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取残異動CURSOR OPEN END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXABC-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    取残異動CURSOR FETCH
      ******************************************************************
       TKMXABC-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取残異動CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH TKMXABC_CUR
             INTO  :H-TKMXABC.H-UKE-YMD,
                   :H-TKMXABC.H-S-KSG-G-KKKRS,
                   :H-TKMXABC.H-U-KSG-G-KKKRS,
                   :H-TKMXABC.H-KKRS-KBN,
                   :H-TKMXABC.H-G-TUKA-CD,
                   :H-TKMXABC.H-KESAI-HOHO,
                   :H-TKMXABC.H-SJTK-TSR,
                   :H-TKMXABC.H-UYTK-TSR,
                   :H-TKMXABC.H-SJTK-S-TAX,
                   :H-TKMXABC.H-UYTK-S-TAX,
                   :H-TKMXABC.H-SJTK-OTR-FATE,
                   :H-TKMXABC.H-UYTK-OTR-FATE
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           "取残異動CUR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取残異動CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":受渡日                      =["
      D             H-UKE-YMD            OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":既経過利息（運用通貨換算額）=["
      D             H-U-KSG-G-KKKRS      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":既経過利息（市場通貨換算額）=["
      D             H-S-KSG-G-KKKRS      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":経過利息区分                =["
      D             H-KKRS-KBN           OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":現地通貨コード              =["
      D             H-G-TUKA-CD          OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":資金決済方法                =["
      D             H-KESAI-HOHO         OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨手数料              =["
      D             H-SJTK-TSR           OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨手数料              =["
      D             H-UYTK-TSR           OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨消費税              =["
      D             H-SJTK-S-TAX         OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨消費税              =["
      D             H-UYTK-S-TAX         OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨その他費用          =["
      D             H-SJTK-OTR-FATE      OF  H-TKMXABC"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨その他費用          =["
      D             H-UYTK-OTR-FATE      OF  H-TKMXABC"]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取残異動CURSOR FETCH  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-019
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-2          DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取残異動CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXABC-FETCH-EXT.
           EXIT.
      ******************************************************************@3212SEINO@@
      *   取残異動CURSOR CLOSE                                          @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *TKMXABC-CLOSE-RTN      SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":*** 取残異動CURSOR CLOSE START ***"     @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMXABC-CR-OPEN= ["                @3212SEINO@@
      *             FLG-TKMXABC-CR-OPEN "]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    EXEC  SQL                                                    @3212SEINO@@
      *      CLOSE TKMXABC_CUR                                          @3212SEINO@@
      *    END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID"取残異動CUR CLOSE SQLCODE=["SQLCODE"]"   @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    IF  SQLCODE = CNS-SQL-NORMAL                                 @3212SEINO@@
      *    THEN                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":取残異動CURSOR CLOSE  正常"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *      MOVE  CNS-OFF               TO  FLG-TKMXABC-CR-OPEN        @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":FLG-TKMXABC-CR-OPEN =["                @3212SEINO@@
      *             FLG-TKMXABC-CR-OPEN "]"                             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    ELSE                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":取残異動CURSOR CLOSE  異常"             @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
      *      MOVE  CNS-PGM-ID                                           @3212SEINO@@
      *        TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
      *      MOVE  CNS-POS-020                                          @3212SEINO@@
      *        TO  ERR-POS               OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
      *      MOVE  CNS-RTN-900                                          @3212SEINO@@
      *        TO  RTN-CD                OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
      *      MOVE  SQLCODE                                              @3212SEINO@@
      *        TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
      *      MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      *        TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1         @3212SEINO@@
      *---------- フリーメッセージ                                      @3212SEINO@@
      *      STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      *              WK-MSG-1-2         DELIMITED  BY  SIZE             @3212SEINO@@
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["         @3212SEINO@@
      *             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":ERR-POS                     =["         @3212SEINO@@
      *             ERR-POS              OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":RTN-CD                      =["         @3212SEINO@@
      *             RTN-CD               OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["         @3212SEINO@@
      *             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["         @3212SEINO@@
      *             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["         @3212SEINO@@
      *             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"      @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
      *      PERFORM  ERR-RTN                                           @3212SEINO@@
      *    END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *    DISPLAY  CNS-PGM-ID ":***取残異動CURSOR CLOSE END ***"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *    CONTINUE.                                                    @3212SEINO@@
      *TKMXABC-CLOSE-EXT.                                               @3212SEINO@@
      *    EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *    【SMZJ4014】証券種別判定処理をコール
      ******************************************************************
       SMZJ4014-RTN           SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":***  【SMZJ4014】証券種別判定処理をコールする START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    PARM-SMZJ4014-INOUT
                         PARM-RTNPKG
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-SIKIN-TORI-DATA
             TO  SEC-SBT-CD             OF  PARM-SMZJ4014-ARG1
      *----------  判定対象区分
           MOVE  CNS-X-6
             TO  HANTEI-TARGET-KBN      OF  PARM-SMZJ4014-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券種別コード =["
      D             SEC-SBT-CD          OF  PARM-SMZJ4014-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":判定対象区分   =["
      D             HANTEI-TARGET-KBN   OF  PARM-SMZJ4014-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ4014"             USING  PARM-SMZJ4014-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF  PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ4014)=["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ4014-ARG2 =["
      D             PARM-SMZJ4014-ARG2"]"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ4014-EXT.
           EXIT.
      ******************************************************************
      *        3.2.5.資金簿価異動計算データインサート
      ******************************************************************
       SKBK-IDOC-INSERT-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  資金簿価異動計算データインサート"
      D             "  START  ***"
      *-----------------------------------------------------------------
           PERFORM  TKMZBW07-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ１          =["
      D             WK-SAKUSEI-FLG-1"]"
      *-----------------------------------------------------------------
           IF  WK-SAKUSEI-FLG-1  =  CNS-X-1
           THEN
             PERFORM  TKMZBW07-INSERT-ZHK1-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  2)ワーク資金簿価異動計算増幅"
      D             "データ１を資金簿価異動計算データインサートない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ２          =["
      D             WK-SAKUSEI-FLG-2"]"
      *-----------------------------------------------------------------
           IF  WK-SAKUSEI-FLG-2  =  CNS-X-1
           THEN
             PERFORM  TKMZBW07-INSERT-ZHK2-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  3)ワーク資金簿価異動計算増幅"
      D             "データ２を資金簿価異動計算データインサートない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  資金簿価異動計算データインサート"
      D             "   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SKBK-IDOC-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.5.資金簿価異動計算データインサート
      ******************************************************************
       TKMZBW07-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  1)ワーク資金簿価異動計算データ"
      D             "インサート  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    PARM-INSERT-INOUT
                         PARM-INSERT-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  RIYO-CMP-CD            OF  PARM-INSERT-ARG1
      *----------  DBレイアウトコピー句
           MOVE  WK-SIKIN-BOKA-IDO-CALC-DATA
             TO  TBL-LAYOUT             OF  PARM-INSERT-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-INSERT-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "処理実行日                               = ["
      D             SYORI-YMD      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "起動ID                                   = ["
      D             KIDOU-ID       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "利用会社コード                           = ["
      D             RIYO-CMP-CD    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "ファンドコード                           = ["
      D             FUND-CD        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "ポートフォリオコード                     = ["
      D             PTF-CD         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "原取引ID                                 = ["
      D             TORI-ID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "決済口座番号                             = ["
      D             KS-KOZA-NO     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "資金種別                                 = ["
      D             SIKIN-SBT      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "異動日                                   = ["
      D             IDO-YMD        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             ZG-KBN         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "赤黒区分                                 = ["
      D             AKA-KBN        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "誤計上№                                 = ["
      D             ERR-KJY-NO     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "誤計上区分                               = ["
      D             ERR-KJY-KBN    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "取引事由                                 = ["
      D             TORI-JIYU      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "取引連関ID                               = ["
      D             THRK-ID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "決済口座通貨コード                       = ["
      D             KOZA-TUKA-CD   OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "証券種別コード                           = ["
      D             SEC-SBT-CD     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨資金簿価異動額                   = ["
      D             SJTK-SK-BOKA-IDOGK
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨資金簿価異動額                   = ["
      D             UYTK-SK-BOKA-IDOGK
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨払出簿価                         = ["
      D             SJTK-H-BOKA    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨払出簿価                         = ["
      D             UYTK-H-BOKA    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨払出単価                         = ["
      D             SJTK-H-TNK     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨払出単価                         = ["
      D             UYTK-H-TNK     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "簿価為替レート                           = ["
      D             BOKA-KWS       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             SJTK-IDOG-SK-BOKAZN
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             UYTK-IDOG-SK-BOKAZN
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             SJTK-IDOG-MSNKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             UYTK-IDOG-MSNKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             SJTK-IDOG-MSNKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             UYTK-IDOG-MSNKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             SJTK-IDOG-MBKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             UYTK-IDOG-MBKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             SJTK-IDOG-MBKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             UYTK-IDOG-MBKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "為替差損益                               = ["
      D             UYTK-KWS-SNEKI OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨利金等損益勘定                   = ["
      D             SJTK-RKSEKJ    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨利金等損益勘定                   = ["
      D             UYTK-RKSEKJ    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "異動計上順序                             = ["
      D             IDO-KJY-JUN    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "削除区分                                 = ["
      D             SAKUJO-KBN     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成フラグ                               = ["
      D             SK-FLG         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成ログインユーザ会社コード             = ["
      D             SK-LOGIN-CMP-CD
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成ユーザＩＤ                           = ["
      D             SK-SID         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成プログラムＩＤ                       = ["
      D             SK-PGMID       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新日時                                 = ["
      D             UPD-DATE       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新ログインユーザ会社コード             = ["
      D             UPD-LOGIN-CMP-CD
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新ユーザＩＤ                           = ["
      D             UPD-SID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新プログラムＩＤ                       = ["
      D             UPD-PGMID      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "TIMZBW07"             USING  PARM-INSERT-INOUT
                                               PARM-INSERT-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(TIMZBW07)=["RTN-CD
      D    OF  PARM-INSERT-RTNPKG(COUNTER OF PARM-INSERT-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-INSERT-RTNPKG
                       (COUNTER OF PARM-INSERT-RTNPKG)
             =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":資金簿価異動計算データインサート正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":資金簿価異動計算データインサートエーラ"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-INSERT-RTNPKG   TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-021
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金計算コールルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  1)ワーク資金簿価異動計算データ"
      D             "インサート   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW07-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.5.資金簿価異動計算データインサート
      ******************************************************************
       TKMZBW07-INSERT-ZHK1-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  2)ワーク資金簿価異動計算増幅"
      D             "データ１を資金簿価異動計算データインサート"
      D             "  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    PARM-INSERT-INOUT
                         PARM-INSERT-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-SKBK-IDC-ZHK-DATA-1
             TO  RIYO-CMP-CD            OF  PARM-INSERT-ARG1
      *----------  DBレイアウトコピー句
           MOVE  WK-SKBK-IDC-ZHK-DATA-1
             TO  TBL-LAYOUT             OF  PARM-INSERT-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-INSERT-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "処理実行日                               = ["
      D             SYORI-YMD      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "起動ID                                   = ["
      D             KIDOU-ID       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "利用会社コード                           = ["
      D             RIYO-CMP-CD    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "ファンドコード                           = ["
      D             FUND-CD        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "ポートフォリオコード                     = ["
      D             PTF-CD         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "原取引ID                                 = ["
      D             TORI-ID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "決済口座番号                             = ["
      D             KS-KOZA-NO     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "資金種別                                 = ["
      D             SIKIN-SBT      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "異動日                                   = ["
      D             IDO-YMD        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             ZG-KBN         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "赤黒区分                                 = ["
      D             AKA-KBN        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "誤計上№                                 = ["
      D             ERR-KJY-NO     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "誤計上区分                               = ["
      D             ERR-KJY-KBN    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "取引事由                                 = ["
      D             TORI-JIYU      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "取引連関ID                               = ["
      D             THRK-ID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "決済口座通貨コード                       = ["
      D             KOZA-TUKA-CD   OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "証券種別コード                           = ["
      D             SEC-SBT-CD     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨資金簿価異動額                   = ["
      D             SJTK-SK-BOKA-IDOGK
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨資金簿価異動額                   = ["
      D             UYTK-SK-BOKA-IDOGK
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨払出簿価                         = ["
      D             SJTK-H-BOKA    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨払出簿価                         = ["
      D             UYTK-H-BOKA    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨払出単価                         = ["
      D             SJTK-H-TNK     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨払出単価                         = ["
      D             UYTK-H-TNK     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "簿価為替レート                           = ["
      D             BOKA-KWS       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             SJTK-IDOG-SK-BOKAZN
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             UYTK-IDOG-SK-BOKAZN
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             SJTK-IDOG-MSNKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             UYTK-IDOG-MSNKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             SJTK-IDOG-MSNKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             UYTK-IDOG-MSNKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             SJTK-IDOG-MBKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             UYTK-IDOG-MBKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             SJTK-IDOG-MBKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             UYTK-IDOG-MBKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "為替差損益                               = ["
      D             UYTK-KWS-SNEKI OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨利金等損益勘定                   = ["
      D             SJTK-RKSEKJ    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨利金等損益勘定                   = ["
      D             UYTK-RKSEKJ    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "異動計上順序                             = ["
      D             IDO-KJY-JUN    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "削除区分                                 = ["
      D             SAKUJO-KBN     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成フラグ                               = ["
      D             SK-FLG         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成ログインユーザ会社コード             = ["
      D             SK-LOGIN-CMP-CD
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成ユーザＩＤ                           = ["
      D             SK-SID         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成プログラムＩＤ                       = ["
      D             SK-PGMID       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新日時                                 = ["
      D             UPD-DATE       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新ログインユーザ会社コード             = ["
      D             UPD-LOGIN-CMP-CD
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新ユーザＩＤ                           = ["
      D             UPD-SID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新プログラムＩＤ                       = ["
      D             UPD-PGMID      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "TIMZBW07"             USING  PARM-INSERT-INOUT
                                               PARM-INSERT-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(TIMZBW07)=["RTN-CD
      D    OF  PARM-INSERT-RTNPKG(COUNTER OF PARM-INSERT-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-INSERT-RTNPKG
                       (COUNTER OF PARM-INSERT-RTNPKG)
             =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":資金簿価異動計算データインサート正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":資金簿価異動計算データインサートエーラ"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-INSERT-RTNPKG   TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-022
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金計算コールルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  2)ワーク資金簿価異動計算増幅"
      D             "データ１を資金簿価異動計算データインサート"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW07-INSERT-ZHK1-EXT.
           EXIT.
      ******************************************************************
      *        3.2.5.資金簿価異動計算データインサート
      ******************************************************************
       TKMZBW07-INSERT-ZHK2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  3)ワーク資金簿価異動計算増幅"
      D             "データ２を資金簿価異動計算データインサート"
      D             "  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE    PARM-INSERT-INOUT
                         PARM-INSERT-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-SKBK-IDC-ZHK-DATA-2
             TO  RIYO-CMP-CD            OF  PARM-INSERT-ARG1
      *----------  DBレイアウトコピー句
           MOVE  WK-SKBK-IDC-ZHK-DATA-2
             TO  TBL-LAYOUT             OF  PARM-INSERT-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-INSERT-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "処理実行日                               = ["
      D             SYORI-YMD      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "起動ID                                   = ["
      D             KIDOU-ID       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "利用会社コード                           = ["
      D             RIYO-CMP-CD    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "ファンドコード                           = ["
      D             FUND-CD        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "ポートフォリオコード                     = ["
      D             PTF-CD         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "原取引ID                                 = ["
      D             TORI-ID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "決済口座番号                             = ["
      D             KS-KOZA-NO     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "資金種別                                 = ["
      D             SIKIN-SBT      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "異動日                                   = ["
      D             IDO-YMD        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             ZG-KBN         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "赤黒区分                                 = ["
      D             AKA-KBN        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "誤計上№                                 = ["
      D             ERR-KJY-NO     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "誤計上区分                               = ["
      D             ERR-KJY-KBN    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "取引事由                                 = ["
      D             TORI-JIYU      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "取引連関ID                               = ["
      D             THRK-ID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "決済口座通貨コード                       = ["
      D             KOZA-TUKA-CD   OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "証券種別コード                           = ["
      D             SEC-SBT-CD     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨資金簿価異動額                   = ["
      D             SJTK-SK-BOKA-IDOGK
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨資金簿価異動額                   = ["
      D             UYTK-SK-BOKA-IDOGK
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨払出簿価                         = ["
      D             SJTK-H-BOKA    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨払出簿価                         = ["
      D             UYTK-H-BOKA    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨払出単価                         = ["
      D             SJTK-H-TNK     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨払出単価                         = ["
      D             UYTK-H-TNK     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "簿価為替レート                           = ["
      D             BOKA-KWS       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             SJTK-IDOG-SK-BOKAZN
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             UYTK-IDOG-SK-BOKAZN
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             SJTK-IDOG-MSNKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             UYTK-IDOG-MSNKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             SJTK-IDOG-MSNKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             UYTK-IDOG-MSNKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             SJTK-IDOG-MBKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             UYTK-IDOG-MBKZN-UM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             SJTK-IDOG-MBKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             UYTK-IDOG-MBKZN-SM
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "為替差損益                               = ["
      D             UYTK-KWS-SNEKI OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "市場通貨利金等損益勘定                   = ["
      D             SJTK-RKSEKJ    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "運用通貨利金等損益勘定                   = ["
      D             UYTK-RKSEKJ    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "異動計上順序                             = ["
      D             IDO-KJY-JUN    OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "削除区分                                 = ["
      D             SAKUJO-KBN     OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成フラグ                               = ["
      D             SK-FLG         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成ログインユーザ会社コード             = ["
      D             SK-LOGIN-CMP-CD
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成ユーザＩＤ                           = ["
      D             SK-SID         OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "作成プログラムＩＤ                       = ["
      D             SK-PGMID       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新日時                                 = ["
      D             UPD-DATE       OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新ログインユーザ会社コード             = ["
      D             UPD-LOGIN-CMP-CD
      D                            OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新ユーザＩＤ                           = ["
      D             UPD-SID        OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資金簿価異動計算データ."
      D             "更新プログラムＩＤ                       = ["
      D             UPD-PGMID      OF TBL-LAYOUT OF PARM-INSERT-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "TIMZBW07"             USING  PARM-INSERT-INOUT
                                               PARM-INSERT-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(TIMZBW07)=["RTN-CD
      D    OF  PARM-INSERT-RTNPKG(COUNTER OF PARM-INSERT-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-INSERT-RTNPKG
                       (COUNTER OF PARM-INSERT-RTNPKG)
             =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":資金簿価異動計算データインサート正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":資金簿価異動計算データインサートエーラ"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-INSERT-RTNPKG   TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-023
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金計算コールルーチン 異常 ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  3)ワーク資金簿価異動計算増幅"
      D             "データ２を資金簿価異動計算データインサート"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW07-INSERT-ZHK2-EXT.
           EXIT.
      ******************************************************************
      *        3.2.6.ARG2セット
      ******************************************************************
       ARG2-SET-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  ARG2セット  START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ２          =["
      D             WK-SAKUSEI-FLG-2"]"
      *-----------------------------------------------------------------
           IF  WK-SAKUSEI-FLG-2  =  CNS-X-1
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "ARG2.資金簿価異動計算データ←"
      D             "ワーク資金簿価異動計算増幅データ２"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "処理実行日                               = ["
      D             WK-SYORI-YMD      OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "起動ID                                   = ["
      D             WK-KIDOU-ID       OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "利用会社コード                           = ["
      D             WK-RIYO-CMP-CD    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "ファンドコード                           = ["
      D             WK-FUND-CD        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "ポートフォリオコード                     = ["
      D             WK-PTF-CD         OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "原取引ID                                 = ["
      D             WK-TORI-ID        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "決済口座番号                             = ["
      D             WK-KS-KOZA-NO     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "資金種別                                 = ["
      D             WK-SIKIN-SBT      OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "異動日                                   = ["
      D             WK-IDO-YMD        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN         OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "赤黒区分                                 = ["
      D             WK-AKA-KBN        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "誤計上№                                 = ["
      D             WK-ERR-KJY-NO     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "誤計上区分                               = ["
      D             WK-ERR-KJY-KBN    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "取引事由                                 = ["
      D             WK-TORI-JIYU      OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "取引連関ID                               = ["
      D             WK-THRK-ID        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "決済口座通貨コード                       = ["
      D             WK-KOZA-TUKA-CD   OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "証券種別コード                           = ["
      D             WK-SEC-SBT-CD     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨資金簿価異動額                   = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨資金簿価異動額                   = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨払出簿価                         = ["
      D             WK-SJTK-H-BOKA    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨払出簿価                         = ["
      D             WK-UYTK-H-BOKA    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨払出単価                         = ["
      D             WK-UYTK-H-TNK     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨払出単価                         = ["
      D             WK-SJTK-H-TNK     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "簿価為替レート                          = ["
      D             WK-BOKA-KWS       OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "為替差損益                               = ["
      D             WK-UYTK-KWS-SNEKI OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "市場通貨利金等損益勘定                   = ["
      D             WK-SJTK-RKSEKJ    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "運用通貨利金等損益勘定                   = ["
      D             WK-UYTK-RKSEKJ    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "異動計上順序                             = ["
      D             WK-IDO-KJY-JUN    OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "削除区分                                 = ["
      D             WK-SAKUJO-KBN     OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "作成フラグ                               = ["
      D             WK-SK-FLG         OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "作成ログインユーザ会社コード             = ["
      D             WK-SK-LOGIN-CMP-CD
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "作成ユーザＩＤ                           = ["
      D             WK-SK-SID         OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "作成プログラムＩＤ                       = ["
      D             WK-SK-PGMID       OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "更新フラグ                               = ["
      D             WK-UPD-FLG        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "更新ログインユーザ会社コード             = ["
      D             WK-UPD-LOGIN-CMP-CD
      D                               OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "更新ユーザＩＤ                           = ["
      D             WK-UPD-SID        OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ２."
      D             "更新プログラムＩＤ                       = ["
      D             WK-UPD-PGMID      OF  WK-SKBK-IDC-ZHK-DATA-2"]"
      *-----------------------------------------------------------------
      *----------  ARG2.資金簿価異動計算データ  ←  ワーク資金簿価異動計算増幅データ２
             MOVE  WK-SKBK-IDC-ZHK-DATA-2
               TO  SIKIN-BOKA-IDO-CALC-DATA
                                      OF  PARM-SMZJ1920-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク作成データフラグ１          =["
      D             WK-SAKUSEI-FLG-1"]"
      *-----------------------------------------------------------------
             IF  WK-SAKUSEI-FLG-1  =  CNS-X-1
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "ARG2.資金簿価異動計算データ←"
      D             "ワーク資金簿価異動計算増幅データ１"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "処理実行日                               = ["
      D             WK-SYORI-YMD      OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "起動ID                                   = ["
      D             WK-KIDOU-ID       OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "利用会社コード                           = ["
      D             WK-RIYO-CMP-CD    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "ファンドコード                           = ["
      D             WK-FUND-CD        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "ポートフォリオコード                     = ["
      D             WK-PTF-CD         OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "原取引ID                                 = ["
      D             WK-TORI-ID        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "決済口座番号                             = ["
      D             WK-KS-KOZA-NO     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "資金種別                                 = ["
      D             WK-SIKIN-SBT      OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "異動日                                   = ["
      D             WK-IDO-YMD        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN         OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "赤黒区分                                 = ["
      D             WK-AKA-KBN        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "誤計上№                                 = ["
      D             WK-ERR-KJY-NO     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "誤計上区分                               = ["
      D             WK-ERR-KJY-KBN    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "取引事由                                 = ["
      D             WK-TORI-JIYU      OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "取引連関ID                               = ["
      D             WK-THRK-ID        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "決済口座通貨コード                       = ["
      D             WK-KOZA-TUKA-CD   OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "証券種別コード                           = ["
      D             WK-SEC-SBT-CD     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨資金簿価異動額                   = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨資金簿価異動額                   = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨払出簿価                         = ["
      D             WK-SJTK-H-BOKA    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨払出簿価                         = ["
      D             WK-UYTK-H-BOKA    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨払出単価                         = ["
      D             WK-UYTK-H-TNK     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨払出単価                         = ["
      D             WK-SJTK-H-TNK     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "簿価為替レート                          = ["
      D             WK-BOKA-KWS       OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "為替差損益                               = ["
      D             WK-UYTK-KWS-SNEKI OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "市場通貨利金等損益勘定                   = ["
      D             WK-SJTK-RKSEKJ    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "運用通貨利金等損益勘定                   = ["
      D             WK-UYTK-RKSEKJ    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "異動計上順序                             = ["
      D             WK-IDO-KJY-JUN    OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "削除区分                                 = ["
      D             WK-SAKUJO-KBN     OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "作成フラグ                               = ["
      D             WK-SK-FLG         OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "作成ログインユーザ会社コード             = ["
      D             WK-SK-LOGIN-CMP-CD
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "作成ユーザＩＤ                           = ["
      D             WK-SK-SID         OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "作成プログラムＩＤ                       = ["
      D             WK-SK-PGMID       OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "更新フラグ                               = ["
      D             WK-UPD-FLG        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "更新ログインユーザ会社コード             = ["
      D             WK-UPD-LOGIN-CMP-CD
      D                               OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "更新ユーザＩＤ                           = ["
      D             WK-UPD-SID        OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算増幅データ１."
      D             "更新プログラムＩＤ                       = ["
      D             WK-UPD-PGMID      OF  WK-SKBK-IDC-ZHK-DATA-1"]"
      *-----------------------------------------------------------------
      *----------  ARG2.資金簿価異動計算データ  ←  ワーク資金簿価異動計算増幅データ１
               MOVE  WK-SKBK-IDC-ZHK-DATA-1
                 TO  SIKIN-BOKA-IDO-CALC-DATA
                                      OF  PARM-SMZJ1920-ARG2
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "ARG2.資金簿価異動計算データ←"
      D             "ワーク資金簿価異動計算データ"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "処理実行日                               = ["
      D             WK-SYORI-YMD      OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "起動ID                                   = ["
      D             WK-KIDOU-ID       OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "利用会社コード                           = ["
      D             WK-RIYO-CMP-CD    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "ファンドコード                           = ["
      D             WK-FUND-CD        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "ポートフォリオコード                     = ["
      D             WK-PTF-CD         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "原取引ID                                 = ["
      D             WK-TORI-ID        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "決済口座番号                             = ["
      D             WK-KS-KOZA-NO     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "資金種別                                 = ["
      D             WK-SIKIN-SBT      OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "異動日                                   = ["
      D             WK-IDO-YMD        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             WK-ZG-KBN         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "赤黒区分                                 = ["
      D             WK-AKA-KBN        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "誤計上№                                 = ["
      D             WK-ERR-KJY-NO     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "誤計上区分                               = ["
      D             WK-ERR-KJY-KBN    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "取引事由                                 = ["
      D             WK-TORI-JIYU      OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "取引連関ID                               = ["
      D             WK-THRK-ID        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "決済口座通貨コード                       = ["
      D             WK-KOZA-TUKA-CD   OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "証券種別コード                           = ["
      D             WK-SEC-SBT-CD     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨資金簿価異動額                   = ["
      D             WK-SJTK-SK-BOKA-IDOGK
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨資金簿価異動額                   = ["
      D             WK-UYTK-SK-BOKA-IDOGK
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨払出簿価                         = ["
      D             WK-SJTK-H-BOKA    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨払出簿価                         = ["
      D             WK-UYTK-H-BOKA    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨払出単価                         = ["
      D             WK-UYTK-H-TNK     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨払出単価                         = ["
      D             WK-SJTK-H-TNK     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "簿価為替レート                          = ["
      D             WK-BOKA-KWS       OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             WK-SJTK-IDOG-SK-BOKAZN
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             WK-UYTK-IDOG-SK-BOKAZN
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-UM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-UM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             WK-SJTK-IDOG-MSNKZN-SM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             WK-UYTK-IDOG-MSNKZN-SM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             WK-SJTK-IDOG-MBKZN-UM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             WK-UYTK-IDOG-MBKZN-UM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             WK-SJTK-IDOG-MBKZN-SM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             WK-UYTK-IDOG-MBKZN-SM
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "為替差損益                               = ["
      D             WK-UYTK-KWS-SNEKI OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "市場通貨利金等損益勘定                   = ["
      D             WK-SJTK-RKSEKJ    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "運用通貨利金等損益勘定                   = ["
      D             WK-UYTK-RKSEKJ    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "異動計上順序                             = ["
      D             WK-IDO-KJY-JUN    OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "削除区分                                 = ["
      D             WK-SAKUJO-KBN     OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "作成フラグ                               = ["
      D             WK-SK-FLG         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "作成ログインユーザ会社コード             = ["
      D             WK-SK-LOGIN-CMP-CD
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "作成ユーザＩＤ                           = ["
      D             WK-SK-SID         OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "作成プログラムＩＤ                       = ["
      D             WK-SK-PGMID       OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "更新フラグ                               = ["
      D             WK-UPD-FLG        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "更新ログインユーザ会社コード             = ["
      D             WK-UPD-LOGIN-CMP-CD
      D                               OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "更新ユーザＩＤ                           = ["
      D             WK-UPD-SID        OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動計算データ."
      D             "更新プログラムＩＤ                       = ["
      D             WK-UPD-PGMID      OF  WK-SIKIN-BOKA-IDO-CALC-DATA"]"
      *-----------------------------------------------------------------
      *----------  ARG2.資金簿価異動計算データ←ワーク資金簿価異動計算データ
               MOVE  WK-SIKIN-BOKA-IDO-CALC-DATA
                 TO  SIKIN-BOKA-IDO-CALC-DATA
                                      OF  PARM-SMZJ1920-ARG2
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "処理実行日                               = ["
      D             SYORI-YMD         OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "起動ID                                   = ["
      D             KIDOU-ID          OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "利用会社コード                           = ["
      D             RIYO-CMP-CD       OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "ファンドコード                           = ["
      D             FUND-CD           OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "ポートフォリオコード                     = ["
      D             PTF-CD            OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "原取引ID                                 = ["
      D             TORI-ID           OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "決済口座番号                             = ["
      D             KS-KOZA-NO        OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "資金種別                                 = ["
      D             SIKIN-SBT         OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "異動日                                   = ["
      D             IDO-YMD           OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "増減区分                                 = ["
      D             ZG-KBN            OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "赤黒区分                                 = ["
      D             AKA-KBN           OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "誤計上№                                 = ["
      D             ERR-KJY-NO        OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "誤計上区分                               = ["
      D             ERR-KJY-KBN       OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "取引事由                                 = ["
      D             TORI-JIYU         OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "取引連関ID                               = ["
      D             THRK-ID           OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "決済口座通貨コード                       = ["
      D             KOZA-TUKA-CD      OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "証券種別コード                           = ["
      D             SEC-SBT-CD        OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨資金簿価異動額                   = ["
      D             SJTK-SK-BOKA-IDOGK
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨資金簿価異動額                   = ["
      D             UYTK-SK-BOKA-IDOGK
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨払出簿価                         = ["
      D             SJTK-H-BOKA       OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨払出簿価                         = ["
      D             UYTK-H-BOKA       OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨払出単価                         = ["
      D             SJTK-H-TNK        OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨払出単価                         = ["
      D             UYTK-H-TNK        OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "簿価為替レート                          = ["
      D             BOKA-KWS          OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨異動後ＣＡＳＨ残高               = ["
      D             SJTK-IDOG-SK-BOKAZN
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨異動後ＣＡＳＨ残高               = ["
      D             UYTK-IDOG-SK-BOKAZN
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（内物）       = ["
      D             SJTK-IDOG-MSNKZN-UM
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（内物）       = ["
      D             UYTK-IDOG-MSNKZN-UM
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨異動後未収入金残高（外物）       = ["
      D             SJTK-IDOG-MSNKZN-SM
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨異動後未収入金残高（外物）       = ["
      D             UYTK-IDOG-MSNKZN-SM
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（内物）         = ["
      D             SJTK-IDOG-MBKZN-UM
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（内物）         = ["
      D             UYTK-IDOG-MBKZN-UM
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨異動後未払金残高（外物）         = ["
      D             SJTK-IDOG-MBKZN-SM
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨異動後未払金残高（外物）         = ["
      D             UYTK-IDOG-MBKZN-SM
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "為替差損益                               = ["
      D             UYTK-KWS-SNEKI    OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "市場通貨利金等損益勘定                   = ["
      D             SJTK-RKSEKJ       OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "運用通貨利金等損益勘定                   = ["
      D             UYTK-RKSEKJ       OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "異動計上順序                             = ["
      D             IDO-KJY-JUN       OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "削除区分                                 = ["
      D             SAKUJO-KBN        OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "作成フラグ                               = ["
      D             SK-FLG            OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "作成ログインユーザ会社コード             = ["
      D             SK-LOGIN-CMP-CD
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "作成ユーザＩＤ                           = ["
      D             SK-SID            OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "作成プログラムＩＤ                       = ["
      D             SK-PGMID          OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "更新フラグ                               = ["
      D             UPD-FLG           OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "更新ログインユーザ会社コード             = ["
      D             UPD-LOGIN-CMP-CD
      D                               OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "更新ユーザＩＤ                           = ["
      D             UPD-SID           OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.資金簿価異動計算データ."
      D             "更新プログラムＩＤ                       = ["
      D             UPD-PGMID         OF  PARM-SMZJ1920-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.警告情報数               = ["
      D             WARN-INFO-SU      OF  PARM-SMZJ1920-ARG2"]"
      D    INITIALIZE  WK-WARN-INFO-INDEX
      D    PERFORM  UNTIL  WK-WARN-INFO-INDEX  = CNS-WARN-30
      D      COMPUTE  WK-WARN-INFO-INDEX  = WK-WARN-INFO-INDEX + CNS-1
      D    DISPLAY  CNS-PGM-ID":ARG2.警告情報("WK-WARN-INFO-INDEX") = ["
      D             WARN-FLG
      D             OF  PARM-SMZJ1920-ARG2(WK-WARN-INFO-INDEX)"]"
      D    END-PERFORM
      D    DISPLAY  CNS-PGM-ID ":***  ARG2セット   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ARG2-SET-EXT.
           EXIT.
      ******************************************************************
      *                 3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   後処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1920-ARG1=["
      D             PARM-SMZJ1920-ARG1   OF PARM-SMZJ1920-INOUT"]"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      D    DISPLAY  CNS-PGM-ID":RTN-CD  OF  PARM-SCZY1170-ARG1 = ["
      D             RTN-CD  OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"              USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO  PARM-SMZJ1920-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ1920-ARG3     = ["
      D      PARM-SMZJ1920-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ1920-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ1920-ARG3(COUNTER  OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ1920-ARG3(COUNTER  OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ1920-ARG3(COUNTER  OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ1920-ARG3(COUNTER  OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ1920-ARG3(COUNTER  OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ1920-ARG3(COUNTER  OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *                 3.4.1 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ1920-ARG2    OF PARM-SMZJ1920-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1920-ARG2=["
      D             PARM-SMZJ1920-ARG2  OF PARM-SMZJ1920-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":資金異動カーソルオープン"
      D             "フラグ= ["FLG-TKMXSI00-CR-OPEN"]"
      *-----------------------------------------------------------------
      *----------  資金異動カーソルをクローズする
           IF  FLG-TKMXSI00-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXSI00_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMXSI00_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"資金異動CUR CLOSE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF               TO  FLG-TKMXSI00-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":TKMXSI00_CUR OPEN FLAG =["
      D             FLG-TKMXSI00-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXSI00_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-TKMZBW07-CR-OPEN =["
      D             FLG-TKMZBW07-CR-OPEN"]"
      *-----------------------------------------------------------------
      *----------  資金簿価異動カーソルをクローズする
           IF  FLG-TKMZBW07-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW07_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZBW07_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID"資金簿価異動CUR CLOSE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF               TO  FLG-TKMZBW07-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":TKMZBW07_CUR OPEN FLAG =["
      D             FLG-TKMZBW07-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW07_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-TKMXABC-2-CR-OPEN =["
      D             FLG-TKMXABC-2-CR-OPEN"]"
      *-----------------------------------------------------------------
      *----------  移行データ対応する取引各費用カーソルをクローズする
           IF  FLG-TKMXABC-2-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXABC_2_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMXABC_2_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"移行データ対応する取引各費用"
      D             "CUR CLOSE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF               TO  FLG-TKMXABC-2-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":TKMXABC_2_CUR OPEN FLAG =["
      D             FLG-TKMXABC-2-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXABC_2_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-TKMXABC-CR-OPEN =["
      D             FLG-TKMXABC-CR-OPEN"]"
      *-----------------------------------------------------------------
      *----------  取残異動カーソルをクローズする
           IF  FLG-TKMXABC-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXABC_CUR CLOSE処理を行く"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMXABC_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"取残異動CUR CLOSE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF               TO  FLG-TKMXABC-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":TKMXABC_CUR OPEN FLAG =["
      D             FLG-TKMXABC-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXABC_CUR CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"              USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO  PARM-SMZJ1920-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ1920-ARG3     = ["
      D      PARM-SMZJ1920-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ1920-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ1920-ARG3(COUNTER   OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ1920-ARG3(COUNTER   OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ1920-ARG3(COUNTER   OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ1920-ARG3(COUNTER   OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ1920-ARG3(COUNTER   OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ1920-ARG3(COUNTER   OF PARM-SMZJ1920-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1920処理  異常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
