      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SUSCGP01
      * プログラム名称 : GIPSモード用ポートフォリオ・計算期間取得ルーチン
      * 処理概要       : 再処理要ポートフォリオ一覧テーブルから、
      *                : ポートフォリオ・計算期間を取得する。
      * 参照ＤＢ       : 差分抽出対象ポートフォリオ一覧(時価)(TKDYGP09)
      *                : 差分抽出対象ポートフォリオ一覧(為替)(TKDYGP10)
      *                : 差分抽出対象ポートフォリオ一覧(取引)(TKDYGP12)
      *                : 差分抽出対象ポートフォリオ一覧(補正)(TKDYGP13)
      *                : 再処理要ポートフォリオ一覧(銘柄属性)(TKDYGP16)
      * 更新ＤＢ       : なし
      * 引数           : IN  利用会社コード
      *                  IN  評価系列FLG
      *                  OUT 返却データ
      *                  OUT ヒット件数
      * 改訂履歴
      * 年月日        区分     所属    担当     内容
      * ------------  ----     ------  -------  -------------
      * 20100120      新規     SCS     石敏     新規作成
      * 20100628      修正     SCS     兪ル     テーマ2818対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SUSCGP01.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  10-01-20.
       DATE-COMPILED.
      ******************************************************************
      *
      *        環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *        デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
      *----------  共通コンスタント定義の宣言
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY  "KOMONCNS.cpy".
      *----------  プログラムID
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SUSCGP01".
      *-------- ワーク差分抽出対象ポートフォリオ一覧（時価）テーブルID
         05  CNS-ZIKA-TBL-ID       PIC  X(08)  VALUE  "TKDYGP09".
      *-------- ワーク差分抽出対象ポートフォリオ一覧（為替）テーブルID
         05  CNS-KAWASE-TBL-ID     PIC  X(08)  VALUE  "TKDYGP10".
      *-------- ワーク差分抽出対象ポートフォリオ一覧（取引）テーブルID
         05  CNS-TORIHIKI-TBL-ID   PIC  X(08)  VALUE  "TKDYGP12".
      *-------- ワーク差分抽出対象ポートフォリオ一覧（補正）テーブルID
         05  CNS-HOSEI-TBL-ID      PIC  X(08)  VALUE  "TKDYGP13".
      *-------- ワーク再処理要ポートフォリオ一覧（銘柄属性）テーブルID
         05  CNS-MGZS-TBL-ID       PIC  X(08)  VALUE  "TKDYGP16".
      *-------- ワーク再処理要制御テーブルID
         05  CNS-CONTROL-TBL-ID    PIC  X(08)  VALUE  "TKDYGP17".
      *-------- 抽出件数超過警告
         05  CNS-OVER-MSG          PIC  X(16)  VALUE "抽出件数超過警告".
         05  CNS-50000             PIC  9(05)  VALUE 50000.
         05  CNS-0                 PIC  9(01)  VALUE 0.
         05  CNS-X-0               PIC  X(01)  VALUE "0".
         05  CNS-X-1               PIC  X(01)  VALUE "1".
         05  CNS-X-2               PIC  X(01)  VALUE "2".
         05  CNS-X-07              PIC  X(07)  VALUE "07".
      *----------  TXRX利用区分ポジション
         05  CNS-TXRX-POS          PIC  9(03)  VALUE  667.
      *----------  権限なしデータあり
         05  CNS-MSG-130           PIC  X(20)
                                          VALUE  "一部又は全部権限なし".
      ******************************************************************
      *                フラグ  エリア
      ******************************************************************
       01  FLAG-AREA.
      *----------  メッセージエリアエラーフラグ
         05  WK-CUR-OPEN-FLG1      PIC  9(01).
         05  WK-CUR-OPEN-FLG2      PIC  9(01).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-INOUT.
           COPY "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
           COPY "CZRTNPACKAGE.cpy".
      *----------  SCZY5010 オンライン共通初期ルーチン
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY1130  利用権限チェックルーチン
       01  PARM-SCZY1130-INOUT.
           COPY  "SCZY1130.cpy".
      *----------  SCZY7110  バッチ用監査ログＩＮＳルーチン
       01  PARM-SCZY7110-AIFA-HEADER.
         05  PARM-SCZY7110-ARG1.
           COPY "WOMCMAIFA.CPY".
           COPY "CZCOMMONHEADER.cpy".
       01  PARM-SCZY7110-INOUT.
           COPY  "SCZY7110.cpy".
       01  PARM-SCZY7110-RTNPKG.
         05  PARM-SCZY7110-ARG4.
           COPY "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 ミドル
      ******************************************************************
       01  SQL-AREA.
      *----------  ワーク取引データ取得  ----------SQL1
         05  WK-SQL-SELECT.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE  "A.FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(10)  VALUE  "A.PTF_CD, ".
      *----------  評価系列コード
         05  WK-SQL-HYK-KRTU-CD1.
           10  FILLER              PIC  X(15)  VALUE  "A.HYK_KRTU_CD, ".
         05  WK-SQL-HYK-KRTU-CD2.
           10  FILLER              PIC  X(20)
                                          VALUE  "' ' AS HYK_KRTU_CD, ".
         05  WK-SQL-OTHER.
      *----------  MIN(計算期間FROM)
           10  FILLER              PIC  X(22)
                 VALUE  "MIN(A.CALC_KKN_FROM), ".
      *----------  MAX(計算期間TO)
           10  FILLER              PIC  X(19)
                 VALUE  "MAX(A.CALC_KKN_TO) ".
           10  FILLER              PIC  X(07)  VALUE  "FROM ( ".
         05  WK-SQL-OTHER-2.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  MIN(計算期間FROM)
           10  FILLER              PIC  X(22)
                 VALUE  "MIN(A.CALC_KKN_FROM), ".
      *----------  MAX(計算期間TO)
           10  FILLER              PIC  X(19)
                 VALUE  "MAX(A.CALC_KKN_TO) ".
           10  FILLER              PIC  X(07)  VALUE  "FROM ( ".
      *----------  UNION ALL
         05  WK-SQL-UNION.
           10  FILLER              PIC  X(11)  VALUE  " UNION ALL ".
      *---------- 再処理要ポートフォリオ一覧（時価）（TKDYGP09）
         05  WK-SQL-TKDYGP09.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  評価系列コード
           10  FILLER              PIC  X(13)  VALUE  "HYK_KRTU_CD, ".
      *----------  計算期間FROM
           10  FILLER              PIC  X(15)  VALUE "CALC_KKN_FROM, ".
      *----------  計算期間TO
           10  FILLER              PIC  X(13)  VALUE  "CALC_KKN_TO, ".
      *----------  ＧＸ取引接続対象フラグ
           10  FILLER              PIC  X(20)
                                   VALUE  "GX_TORI_TAISYO_FLG, ".
      *----------  日次関連対象フラグ
           10  FILLER              PIC  X(18)
                                   VALUE  "NITIJI_TAISYO_FLG ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID1         PIC  X(13).
      *---------- 再処理要ポートフォリオ一覧（為替）（TKDYGP10）
         05  WK-SQL-TKDYGP10.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  評価系列コード
           10  FILLER              PIC  X(13)  VALUE  "HYK_KRTU_CD, ".
      *----------  計算期間FROM
           10  FILLER              PIC  X(15)  VALUE "CALC_KKN_FROM, ".
      *----------  計算期間TO
           10  FILLER              PIC  X(13)  VALUE  "CALC_KKN_TO, ".
      *----------  ＧＸ取引接続対象フラグ
           10  FILLER              PIC  X(20)
                                   VALUE  "GX_TORI_TAISYO_FLG, ".
      *----------  日次関連対象フラグ
           10  FILLER              PIC  X(18)
                                   VALUE  "NITIJI_TAISYO_FLG ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID2         PIC  X(13).
      *---------- 再処理要ポートフォリオ一覧（取引）（TKDYGP12）
         05  WK-SQL-TKDYGP12.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  評価系列コード
           10  FILLER              PIC  X(13)  VALUE  "HYK_KRTU_CD, ".
      *----------  計算期間FROM
           10  FILLER              PIC  X(15)  VALUE "CALC_KKN_FROM, ".
      *----------  計算期間TO
           10  FILLER              PIC  X(13)  VALUE  "CALC_KKN_TO, ".
      *----------  ＧＸ取引接続対象フラグ
           10  FILLER              PIC  X(20)
                                   VALUE  "GX_TORI_TAISYO_FLG, ".
      *----------  日次関連対象フラグ
           10  FILLER              PIC  X(18)
                                   VALUE  "NITIJI_TAISYO_FLG ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID4         PIC  X(13).
      *---------- 再処理要ポートフォリオ一覧（補正）（TKDYGP13）
         05  WK-SQL-TKDYGP13.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  評価系列コード
           10  FILLER              PIC  X(13)  VALUE  "HYK_KRTU_CD, ".
      *----------  計算期間FROM
           10  FILLER              PIC  X(15)  VALUE "CALC_KKN_FROM, ".
      *----------  計算期間TO
           10  FILLER              PIC  X(13)  VALUE  "CALC_KKN_TO, ".
      *----------  ＧＸ取引接続対象フラグ
           10  FILLER              PIC  X(20)
                                   VALUE  "GX_TORI_TAISYO_FLG, ".
      *----------  日次関連対象フラグ
           10  FILLER              PIC  X(18)
                                   VALUE  "NITIJI_TAISYO_FLG ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID5         PIC  X(13).
      *---------- 再処理要ポートフォリオ一覧（銘柄属性）（TKDYGP16）
         05  WK-SQL-TKDYGP16.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  評価系列コード
           10  FILLER              PIC  X(13)  VALUE  "HYK_KRTU_CD, ".
      *----------  計算期間FROM
           10  FILLER              PIC  X(15)  VALUE "CALC_KKN_FROM, ".
      *----------  計算期間TO
           10  FILLER              PIC  X(13)  VALUE  "CALC_KKN_TO, ".
      *----------  ＧＸ取引接続対象フラグ
           10  FILLER              PIC  X(20)
                                   VALUE  "GX_TORI_TAISYO_FLG, ".
      *----------  日次関連対象フラグ
           10  FILLER              PIC  X(18)
                                   VALUE  "NITIJI_TAISYO_FLG ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID6         PIC  X(13).
      *---------- A
         05  WK-SQL-A.
           10  FILLER              PIC  X(03)  VALUE  " )A".
      *-----------  ①WK-IN-評価系列FLG＝"1":評価系列有効の場合
         05  WK-SQL-WHERE1.
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  日次関連対象フラグ＝"1"
           10  FILLER              PIC  X(21)
                                   VALUE  "NITIJI_TAISYO_FLG='1'".
      *-----------  ②WK-IN-評価系列FLG＝"0":評価系列無効の場合
         05  WK-SQL-WHERE2.
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  ＧＸ取引接続対象フラグ＝"1"
           10  FILLER              PIC  X(22)
                                   VALUE  "GX_TORI_TAISYO_FLG='1'".
         05  WK-SQL-GROUP-BY1.
           10  FILLER              PIC  X(10)  VALUE  " GROUP BY ".
           10  FILLER              PIC  X(11)  VALUE  " A.FUND_CD,".
           10  FILLER              PIC  X(10)  VALUE  " A.PTF_CD,".
           10  FILLER              PIC  X(14)  VALUE  " A.HYK_KRTU_CD".
         05  WK-SQL-GROUP-BY2.
           10  FILLER              PIC  X(10)  VALUE  " GROUP BY ".
           10  FILLER              PIC  X(11)  VALUE  " A.FUND_CD,".
           10  FILLER              PIC  X(09)  VALUE  " A.PTF_CD".
         05  WK-SQL-ORDER-BY1.
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
           10  FILLER              PIC  X(11)  VALUE  " A.FUND_CD,".
           10  FILLER              PIC  X(10)  VALUE  " A.PTF_CD,".
           10  FILLER              PIC  X(14)  VALUE  " A.HYK_KRTU_CD".
         05  WK-SQL-ORDER-BY2.
           10  FILLER              PIC  X(10)  VALUE  " ORDER BY ".
           10  FILLER              PIC  X(11)  VALUE  " A.FUND_CD,".
           10  FILLER              PIC  X(09)  VALUE  " A.PTF_CD".
         05  WK-SQL-WAIT.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
           10  FILLER              PIC  X(12)  VALUE  "RIYO_CMP_CD ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-WAIT-ID         PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
           10  FILLER              PIC  X(18)
               VALUE  "RIYO_CMP_CD = :V4 ".
           10  FILLER              PIC  X(11)
               VALUE  " FOR UPDATE".
         05  WK-SQL-UPDATE.
           10  FILLER              PIC  X(07)  VALUE  "UPDATE ".
           10  SQL-UPDATE-ID       PIC  X(13).
           10  FILLER              PIC  X(05)  VALUE  " SET ".
           10  FILLER              PIC  X(20)
               VALUE  "GYOMU_TASK_ID = :V1,".
           10  FILLER              PIC  X(19)
               VALUE  "UPD_DATE = SYSDATE,".
           10  FILLER              PIC  X(23)
               VALUE  "UPD_LOGIN_CMP_CD = :V2,".
           10  FILLER              PIC  X(14)  VALUE  "UPD_SID = :V3,".
           10  FILLER              PIC  X(23)
               VALUE  "UPD_PGMID = 'SUSCGP01' ".
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
           10  FILLER              PIC  X(18)
               VALUE  "RIYO_CMP_CD = :V4 ".
      ******************************************************************
      *                ワ－ク  エリア
      ******************************************************************
       01  WORK-AREA.
      *----------  ワークMAX件数
         05  WK-MAX-COUNT          PIC  9(05).
      *----------  WK-IN-ＡＩＦＡ共通ヘッダ
         05  WK-IN-AIFA-HEADER.
           COPY  "WOMCMAIFA.CPY".
           COPY  "CZCOMMONHEADER.cpy".
      *----------  WK-IN-利用会社コード
         05  WK-IN-RIYO-CMP-CD     PIC  X(04).
      *----------  WK-IN-業務タスクＩＤ
         05  WK-IN-GYOUMU-TASK-ID  PIC  X(07).
      *----------  WK-IN-メニューＩＤ
         05  WK-IN-MENU-ID         PIC  X(08).
      *----------  WK-IN-画面アクション区分
         05  WK-IN-GAMEN-ACT-KBN   PIC  X(01).
      *----------  WK-IN-評価系列FLG
         05  WK-IN-HYK-KRTU-FLG    PIC  X(01).
      *----------  WK-IN-ＧＸ接続対象種別
         05  WK-IN-GX-TAISYO-KBN   PIC  X(01).
      *----------  WK-SQL-ファンドコード
         05  WK-SQL-FUND-CD        PIC  X(12).
      *----------  WK-SQL-ポートフォリオコード
         05  WK-SQL-PTF-CD         PIC  X(04).
      *----------  WK-SQL-評価系列コード
         05  WK-SQL-HYK-KRTU-CD    PIC  X(04).
      *----------  WK-SQL-計算期間FROM
         05  WK-SQL-KEISAN-YMD-FROM
                                   PIC  9(08).
      *----------  WK-SQL-計算期間TO
         05  WK-SQL-KEISAN-YMD-TO  PIC  9(08).
      *----------  WK-ヒット件数
         05  WK-HIT-COUNT          PIC  9(05).
      *----------  WK-RETURN-CODE
         05  WK-RETURN-CD          PIC  X(03).
      *-------- ワーク差分抽出対象ポートフォリオ一覧（時価）テーブルID
         05  WK-ZIKA-TBL-ID        PIC  X(13).
      *-------- ワーク差分抽出対象ポートフォリオ一覧（為替）テーブルID
         05  WK-KAWASE-TBL-ID      PIC  X(13).
      *-------- ワーク差分抽出対象ポートフォリオ一覧（取引）テーブルID
         05  WK-TORIHIKI-TBL-ID    PIC  X(13).
      *-------- ワーク差分抽出対象ポートフォリオ一覧（補正）テーブルID
         05  WK-HOSEI-TBL-ID       PIC  X(13).
      *-------- ワーク再処理要ポートフォリオ一覧（銘柄属性）テーブルID
         05  WK-MGZS-TBL-ID        PIC  X(13).
      *-------- ワーク再処理要制御テーブルID
         05  WK-CONTROL-TBL-ID     PIC  X(13).
      *----------  フリーメッセージ
         05  WK-FREE-MSG           PIC  X(20000).
      *----------  INDEX1
         05  WK-IDX1               PIC  9(05).
      ******************************************************************
      *                ORACLE ホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  ORA-WORKING-AREA.
      *----------  SQL条件ワーク
         05  SQLSTMT               PIC  X(20000).
         05  SQLSTMT2              PIC  X(2000).
         05  HST-RTN-DATA.
           10  HST-FUND-CD         PIC  X(12).
           10  HST-PTF-CD          PIC  X(04).
           10  HST-HYK-KRTU-CD     PIC  X(04).
           10  HST-KEISAN-YMD-FROM PIC  9(08).
           10  HST-KEISAN-YMD-TO   PIC  9(08).
         05  HST-YMD-DATA.
           10  HST-KS-YMD-FROM     PIC  9(08).
           10  HST-KS-YMD-TO       PIC  9(08).
         05  HST-RIYO-CMP-CD       PIC  X(04).
         05  HST-GYOUMU-TASK-ID    PIC  X(07).
         05  HST-COMPANY-CODE      PIC  X(04).
         05  HST-JOB-USER-ID       PIC  X(08).
           EXEC  SQL  END      DECLARE  SECTION  END-EXEC.
      ******************************************************************
      *        連絡節
      ******************************************************************
       LINKAGE                SECTION.
      *---------- データソース取得ルーチンコピー句
       01  LINK-IN.
      *----------  AIFA・共通ヘッダ
         05  IN-AIFA.
           COPY  "WOMCMAIFA.CPY".
         05  IN-HEADER.
           COPY  "CZCOMMONHEADER.cpy".
       01  PARM-SUSCGP01-INOUT.
           COPY  "SUSCGP01.cpy".
      *---------- RTNパッケージ
       01  PARM-SUSCGP01-ARG3.
           COPY "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  LINK-IN
                  PARM-SUSCGP01-INOUT
                  PARM-SUSCGP01-ARG3.
      ******************************************************************
      *    GIPSモード用ポートフォリオ・計算期間取得ルーチン
      ******************************************************************
       BASE-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":★☆★☆  SUSCGP01処理  START ★☆★☆"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  START-RTN
      *
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *
      *----------  3.3 後処理
           PERFORM  END-RTN
      *
           CONTINUE.
       BASE-EXT.
           EXIT.
      ******************************************************************
      *    3.1 前処理
      ******************************************************************
       START-RTN              SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INIT-RTN
      *----------  3.1.2 パラメータチェック処理
           PERFORM  PARM-CHECK-RTN
      *----------  3.1.3 テーブルID取得処理
           PERFORM  APL-GET-TBLID-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       START-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1 初期化処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE     FLAG-AREA
                          WORK-AREA
                          PARM-SUSCGP01-ARG2
                          PARM-SUSCGP01-ARG3
                          PARM-SCZY1160-INOUT
                          PARM-SCZY1170-INOUT
                          PARM-SCZY1170-RTNPKG
                          PARM-RTNPKG
                          ORA-WORKING-AREA
                          PARM-SCZY1130-INOUT
                          PARM-SCZY7110-AIFA-HEADER
                          PARM-SCZY7110-INOUT
      *----------  WK-IN-ＡＩＦＡ共通ヘッダ
           MOVE  LINK-IN               TO  WK-IN-AIFA-HEADER
      *----------  WK-IN-利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SUSCGP01-ARG1
                                       TO  WK-IN-RIYO-CMP-CD
      *----------  WK-IN-評価系列FLG
           MOVE  HYK-KRTU-FLG          OF  PARM-SUSCGP01-ARG1
                                       TO  WK-IN-HYK-KRTU-FLG
      *----------  WK-IN-業務タスクＩＤ
           MOVE  GYOUMU-TASK-ID        OF  PARM-SUSCGP01-ARG1
                                       TO  WK-IN-GYOUMU-TASK-ID
      *----------  WK-IN-メニューＩＤ
           MOVE  MENU-ID               OF  PARM-SUSCGP01-ARG1
                                       TO  WK-IN-MENU-ID
      *----------  WK-IN-画面アクション区分
           MOVE  GAMEN-ACT-KBN         OF  PARM-SUSCGP01-ARG1
                                       TO  WK-IN-GAMEN-ACT-KBN
      *----------  WK-IN-ＧＸ接続対象種別
           MOVE  GX-TAISYO-KBN         OF  PARM-SUSCGP01-ARG1
                                       TO  WK-IN-GX-TAISYO-KBN
      *----------  WK-RETURN-CODE
           MOVE  CNS-RTN-000           TO  WK-RETURN-CD
      *----------  WK-MAX-件数
           MOVE  CNS-50000             TO  WK-MAX-COUNT
      *----------  WK-ヒット件数
           MOVE  ZERO                  TO  WK-HIT-COUNT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WORK-AREA =["
      D                         WORK-AREA "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SUSCGP01-ARG2 =["
      D                         PARM-SUSCGP01-ARG2 "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SUSCGP01-ARG3 =["
      D                         PARM-SUSCGP01-ARG3 "]"
      D    DISPLAY  CNS-PGM-ID ":WK-IN-利用会社コード =["
      D                         WK-IN-RIYO-CMP-CD "]"
      D    DISPLAY  CNS-PGM-ID ":WK-IN-評価系列FLG =["
      D                         WK-IN-HYK-KRTU-FLG "]"
      D    DISPLAY  CNS-PGM-ID ":WK-RETURN-CODE =[" WK-RETURN-CD  "]"
      D    DISPLAY  CNS-PGM-ID ":WK-MAX-件数 =[" WK-MAX-COUNT "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT "]"
      D    DISPLAY  CNS-PGM-ID ":WK-IN-ＡＩＦＡ共通ヘッダ =["
      D                          WK-IN-AIFA-HEADER"]"
      D    DISPLAY  CNS-PGM-ID ":WK-IN-業務タスクＩＤ =["
      D                          WK-IN-GYOUMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID ":WK-IN-メニューＩＤ =["WK-IN-MENU-ID"]"
      D    DISPLAY  CNS-PGM-ID ":WK-IN-画面アクション区分 =["
      D                          WK-IN-GAMEN-ACT-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":WK-IN-ＧＸ接続対象種別 =["
      D                          WK-IN-GX-TAISYO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  END    ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 パラメータチェック処理
      ******************************************************************
       PARM-CHECK-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  パラメータチェック処理  START ***"
      D    DISPLAY  CNS-PGM-ID ":WK-IN-利用会社コード = ["
      D                          WK-IN-RIYO-CMP-CD  "]"
      *-----------------------------------------------------------------
           IF  WK-IN-RIYO-CMP-CD <> SPACE
           THEN
               CONTINUE
           ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-001
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-PARM-ERR
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-IN-評価系列FLG = ["
      D                          WK-IN-HYK-KRTU-FLG  "]"
      *-----------------------------------------------------------------
           IF  (WK-IN-HYK-KRTU-FLG = CNS-X-1
             OR WK-IN-HYK-KRTU-FLG = CNS-X-0)
           THEN
               CONTINUE
           ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-008
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-PARM-ERR
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ログインユーザ会社コード = ["
      D                       COMPANY-CODE  OF  WK-IN-AIFA-HEADER  "]"
      *-----------------------------------------------------------------
           IF  COMPANY-CODE  OF  WK-IN-AIFA-HEADER NOT = SPACE
           THEN
               CONTINUE
           ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-009
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-PARM-ERR
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-IN-業務タスクＩＤ = ["
      D                          WK-IN-GYOUMU-TASK-ID  "]"
      *-----------------------------------------------------------------
           IF  WK-IN-GYOUMU-TASK-ID NOT = SPACE
           THEN
               CONTINUE
           ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-010
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-PARM-ERR
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-IN-メニューＩＤ = ["
      D                          WK-IN-MENU-ID  "]"
      *-----------------------------------------------------------------
           IF  WK-IN-MENU-ID NOT = SPACE
           THEN
               CONTINUE
           ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-011
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-PARM-ERR
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-IN-画面アクション区分 = ["
      D                          WK-IN-GAMEN-ACT-KBN  "]"
      *-----------------------------------------------------------------
           IF  WK-IN-GAMEN-ACT-KBN NOT = SPACE
           THEN
               CONTINUE
           ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-012
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-PARM-ERR
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** パラメータチェック処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PARM-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    3.1.3 テーブルID取得処理
      ******************************************************************
       APL-GET-TBLID-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  テーブルID取得処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-IN-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  テーブルTKDYGP09
           MOVE  CNS-ZIKA-TBL-ID
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  テーブルTKDYGP10
           MOVE  CNS-KAWASE-TBL-ID
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *----------  テーブルTKDYGP12
           MOVE  CNS-TORIHIKI-TBL-ID
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *----------  テーブルTKDYGP13
           MOVE  CNS-HOSEI-TBL-ID
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *----------  テーブルTKDYGP16
           MOVE  CNS-MGZS-TBL-ID
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
      *----------  テーブルTKDYGP17
           MOVE  CNS-CONTROL-TBL-ID
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(6)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1160.利用会社コード=["
      D             RIYO-CMP-CD             OF PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1160.テーブル←D(1)=["
      D             TBL-ID                  OF PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1160.テーブル←D(2)=["
      D             TBL-ID                  OF PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1160.テーブル←D(4)=["
      D             TBL-ID                  OF PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1160.テーブル←D(5)=["
      D             TBL-ID                  OF PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1160.テーブル←D(6)=["
      D             TBL-ID                  OF PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1160.テーブル←D(7)=["
      D             TBL-ID                  OF PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1160 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  PARM-RTNPKG
      D             ") OF SCZY1160=[" RTN-CD   OF  PARM-RTNPKG
      D              ( COUNTER        OF  PARM-RTNPKG )           "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1160 END  ***"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  PARM-RTNPKG
                     ( COUNTER        OF  PARM-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY1160正常終了"
      *-----------------------------------------------------------------
               MOVE  HENSYUGO-TBL-ID         OF PARM-SCZY1160-ARG2(1)
                 TO  WK-ZIKA-TBL-ID
               MOVE  HENSYUGO-TBL-ID         OF PARM-SCZY1160-ARG2(2)
                 TO  WK-KAWASE-TBL-ID
               MOVE  HENSYUGO-TBL-ID         OF PARM-SCZY1160-ARG2(3)
                 TO  WK-TORIHIKI-TBL-ID
               MOVE  HENSYUGO-TBL-ID         OF PARM-SCZY1160-ARG2(4)
                 TO  WK-HOSEI-TBL-ID
               MOVE  HENSYUGO-TBL-ID         OF PARM-SCZY1160-ARG2(5)
                 TO  WK-MGZS-TBL-ID
               MOVE  HENSYUGO-TBL-ID         OF PARM-SCZY1160-ARG2(6)
                 TO  WK-CONTROL-TBL-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ZIKA-TBL-ID = [" WK-ZIKA-TBL-ID"]"
      D    DISPLAY  CNS-PGM-ID ":WK-KAWASE-TBL-ID = ["
      D                          WK-KAWASE-TBL-ID"]"
      D    DISPLAY  CNS-PGM-ID ":WK-TORIHIKI-TBL-ID = ["
      D                          WK-TORIHIKI-TBL-ID"]"
      D    DISPLAY  CNS-PGM-ID ":WK-HOSEI-TBL-ID = ["WK-HOSEI-TBL-ID"]"
      D    DISPLAY  CNS-PGM-ID ":WK-MGZS-TBL-ID = ["WK-MGZS-TBL-ID"]"
      D    DISPLAY  CNS-PGM-ID ":WK-CONTROL-TBL-ID = ["
      D                          WK-CONTROL-TBL-ID"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-002
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
               MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":SCZY1160エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブルID取得ルーチン処理終了"
      *-----------------------------------------------------------------
           CONTINUE.
       APL-GET-TBLID-EXT.
           EXIT.
      ******************************************************************
      *    3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  主処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.0 排他ロック処理
           PERFORM  DATA-UPDATE-RTN
      *----------  3.2.1 データ抽出処理
           PERFORM  DATA-SELECT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.評価系列FLG=["WK-IN-HYK-KRTU-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.ＧＸ接続対象種別=["
      D             WK-IN-GX-TAISYO-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-IN-HYK-KRTU-FLG = CNS-X-0
             AND  WK-IN-GX-TAISYO-KBN = CNS-X-1
             AND  WK-HIT-COUNT > CNS-0
           THEN
      *----------  3.2.1-1 データ抽出処理(計算期間FROM,計算期間TO)
             PERFORM  YMD-SELECT-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  3.2.2 リターンコード判定
           PERFORM  RETURN-CD-CHECK-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  主処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      **    3.2.0 排他ロック処理
      ******************************************************************
       DATA-UPDATE-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  排他ロック処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
      *----------  再処理要制御テーブルID（TKDYGP17）
           MOVE  WK-CONTROL-TBL-ID     TO  SQL-WAIT-ID
      *----------  利用会社コード
           MOVE  WK-IN-RIYO-CMP-CD     TO  HST-RIYO-CMP-CD
           MOVE  WK-SQL-WAIT           TO  SQLSTMT
           STRING  SQLSTMT(1:FUNCTION LENGTH(WK-SQL-WAIT))
                       "[:V4=" HST-RIYO-CMP-CD "]"
             DELIMITED BY SIZE INTO  WK-FREE-MSG
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT =["SQLSTMT"]"
      D    DISPLAY  CNS-PGM-ID":WK-FREE-MSG =["WK-FREE-MSG"]"
      *-----------------------------------------------------------------
           EXEC SQL
               PREPARE  S2  FROM :SQLSTMT
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE(WAIT)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WAIT PREPARE異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-013
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-FREE-MSG
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-IF
           EXEC SQL
               EXECUTE S2 USING  :HST-RIYO-CMP-CD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(WAIT) =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID ":SQLERRD(3) =[" SQLERRD(3) "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID             OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-014
                 TO  ERR-POS                OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-FREE-MSG
                 TO  FREE-MSG               OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
           INITIALIZE  SQLSTMT
      *----------  再処理要制御テーブルID（TKDYGP17）
           MOVE  WK-CONTROL-TBL-ID     TO  SQL-UPDATE-ID
           MOVE  WK-IN-GYOUMU-TASK-ID  TO  HST-GYOUMU-TASK-ID
           MOVE  COMPANY-CODE          OF  WK-IN-AIFA-HEADER
                                       TO  HST-COMPANY-CODE
           MOVE  JOB-USER-ID           OF  WK-IN-AIFA-HEADER
                                       TO  HST-JOB-USER-ID
           MOVE  WK-SQL-UPDATE         TO  SQLSTMT
           STRING  SQLSTMT(1:FUNCTION LENGTH(WK-SQL-UPDATE))
                       "[:V1=" HST-GYOUMU-TASK-ID "]"
                       "[:V2=" HST-COMPANY-CODE "]"
                       "[:V3=" HST-JOB-USER-ID "]"
                       "[:V4=" HST-RIYO-CMP-CD "]"
             DELIMITED BY SIZE INTO  WK-FREE-MSG
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT =["SQLSTMT"]"
      D    DISPLAY  CNS-PGM-ID":WK-FREE-MSG =["WK-FREE-MSG"]"
      *-----------------------------------------------------------------
           EXEC SQL
               PREPARE  S3  FROM :SQLSTMT
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE(UPDATE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":UPDATE PREPARE異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-015
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-FREE-MSG
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-IF
           EXEC SQL
               EXECUTE S3  USING
                   :HST-GYOUMU-TASK-ID,
                   :HST-COMPANY-CODE,
                   :HST-JOB-USER-ID,
                   :HST-RIYO-CMP-CD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(UPDATE) =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID ":SQLERRD(3) =[" SQLERRD(3) "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
               CONTINUE
      *----------  データなし
             WHEN  CNS-SQL-NOTFOUND
               PERFORM  END-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID             OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-016
                 TO  ERR-POS                OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-FREE-MSG
                 TO  FREE-MSG               OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  排他ロック処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-UPDATE-EXT.
           EXIT.
      ******************************************************************
      **    3.2.1 データ抽出処理
      ******************************************************************
       DATA-SELECT-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  データ抽出処理  START  ***"
      *-----------------------------------------------------------------
      *---------- 3.2.1.1 カーソルCR1作成処理
           PERFORM  CURSOR1-SELECT-RTN
      *---------- 3.2.1.2 カーソルCR1オープン処理
           PERFORM  CURSOR1-OPEN-RTN
      *---------- 3.2.1.3 カーソルCR1フェッチ処理
           PERFORM  CURSOR1-FETCH-RTN
      *---------- 3.2.1.4 カーソルCR1クロース処理
           PERFORM  CURSOR1-CLOSE-RTN
      *---------- 3.2.1.5 その他処理
           PERFORM  OTHER-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  データ抽出処理    END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-SELECT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.1 カーソルCR1作成処理
      ******************************************************************
       CURSOR1-SELECT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCR1作成処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
      *----------  差分抽出対象ポートフォリオ一覧（時価）（TKDYGP09）
           MOVE  WK-ZIKA-TBL-ID        TO  SQL-TBL-ID1
      *----------  差分抽出対象ポートフォリオ一覧（為替）（TKDYGP10）
           MOVE  WK-KAWASE-TBL-ID      TO  SQL-TBL-ID2
      *----------  差分抽出対象ポートフォリオ一覧（取引）（TKDYGP12）
           MOVE  WK-TORIHIKI-TBL-ID    TO  SQL-TBL-ID4
      *----------  差分抽出対象ポートフォリオ一覧（補正）（TKDYGP13）
           MOVE  WK-HOSEI-TBL-ID       TO  SQL-TBL-ID5
      *----------  再処理要ポートフォリオ一覧（銘柄属性）（TKDYGP16）
           MOVE  WK-MGZS-TBL-ID        TO  SQL-TBL-ID6
           INITIALIZE  WK-FREE-MSG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.評価系列FLG=["WK-IN-HYK-KRTU-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.ＧＸ接続対象種別=["
      D             WK-IN-GX-TAISYO-KBN"]"
      *-----------------------------------------------------------------
      *---------- ①WK-IN-評価系列FLG＝"1":評価系列有効の場合
           IF  WK-IN-HYK-KRTU-FLG = CNS-X-1
           THEN
      *----------  ARG1.ＧＸ接続対象種別＝"2"の場合
             IF  WK-IN-GX-TAISYO-KBN = CNS-X-2
             THEN
               STRING   WK-SQL-SELECT
                        WK-SQL-HYK-KRTU-CD1
                        WK-SQL-OTHER
                        WK-SQL-TKDYGP09
                        WK-SQL-UNION
                        WK-SQL-TKDYGP10
                        WK-SQL-UNION
                        WK-SQL-TKDYGP12
                        WK-SQL-UNION
                        WK-SQL-TKDYGP13
                        WK-SQL-UNION
                        WK-SQL-TKDYGP16
                        WK-SQL-A
                        WK-SQL-WHERE1
                        WK-SQL-GROUP-BY1
                        WK-SQL-ORDER-BY1
                        DELIMITED BY SIZE
                        INTO  SQLSTMT
               END-STRING
               MOVE  SQLSTMT           TO  WK-FREE-MSG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT =["SQLSTMT"]"
      D    DISPLAY  CNS-PGM-ID":WK-FREE-MSG      =["WK-FREE-MSG"]"
      *-----------------------------------------------------------------
      *----------  ARG1.ＧＸ接続対象種別 NOT＝"2"の場合
             ELSE
               STRING   WK-SQL-SELECT
                        WK-SQL-HYK-KRTU-CD1
                        WK-SQL-OTHER
                        WK-SQL-TKDYGP09
                        WK-SQL-UNION
                        WK-SQL-TKDYGP10
                        WK-SQL-UNION
                        WK-SQL-TKDYGP12
                        WK-SQL-UNION
                        WK-SQL-TKDYGP13
                        WK-SQL-UNION
                        WK-SQL-TKDYGP16
                        WK-SQL-A
                        WK-SQL-GROUP-BY1
                        WK-SQL-ORDER-BY1
                        DELIMITED BY SIZE
                        INTO  SQLSTMT
               END-STRING
               MOVE  SQLSTMT           TO  WK-FREE-MSG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT =["SQLSTMT"]"
      D    DISPLAY  CNS-PGM-ID":WK-FREE-MSG      =["WK-FREE-MSG"]"
      *-----------------------------------------------------------------
             END-IF
      *----------- ②WK-IN-評価系列FLG＝"0":評価系列無効の場合
           ELSE
      *----------  ARG1.ＧＸ接続対象種別＝"1"の場合
             IF  WK-IN-GX-TAISYO-KBN = CNS-X-1
             THEN
               STRING   WK-SQL-SELECT
                        WK-SQL-HYK-KRTU-CD2
                        WK-SQL-OTHER
                        WK-SQL-TKDYGP12
                        WK-SQL-UNION
                        WK-SQL-TKDYGP16
                        WK-SQL-A
                        WK-SQL-WHERE2
                        WK-SQL-GROUP-BY2
                        WK-SQL-ORDER-BY2
                        DELIMITED BY SIZE
                        INTO  SQLSTMT
               END-STRING
               MOVE  SQLSTMT           TO  WK-FREE-MSG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT =["SQLSTMT"]"
      D    DISPLAY  CNS-PGM-ID":WK-FREE-MSG      =["WK-FREE-MSG"]"
      *-----------------------------------------------------------------
      *----------  ARG1.ＧＸ接続対象種別 NOT＝"1"の場合
             ELSE
               STRING   WK-SQL-SELECT
                        WK-SQL-HYK-KRTU-CD2
                        WK-SQL-OTHER
                        WK-SQL-TKDYGP12
                        WK-SQL-UNION
                        WK-SQL-TKDYGP16
                        WK-SQL-A
                        WK-SQL-GROUP-BY2
                        WK-SQL-ORDER-BY2
                        DELIMITED BY SIZE
                        INTO  SQLSTMT
               END-STRING
               MOVE  SQLSTMT           TO  WK-FREE-MSG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT =["SQLSTMT"]"
      D    DISPLAY  CNS-PGM-ID":WK-FREE-MSG      =["WK-FREE-MSG"]"
      *-----------------------------------------------------------------
             END-IF
           END-IF
           EXEC  SQL
             PREPARE  S1  FROM  :SQLSTMT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)      =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルPREPARE  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-003
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  WK-FREE-MSG
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCR1作成処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-SELECT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.2 カーソルCR1オープン処理
      ******************************************************************
       CURSOR1-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR1オープン処理  START"
      *-----------------------------------------------------------------
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR1 CURSOR  FOR S1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE1(DECLARE) =[" SQLCODE   "]"
      *-----------------------------------------------------------------
           EXEC SQL
             OPEN  CR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":SQLCODE1(OPEN) =[" SQLCODE  "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常の場合
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON           TO  WK-CUR-OPEN-FLG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":カーソル1 OPEN処理 成功"
      D    DISPLAY  CNS-PGM-ID  ":WK-CUR-OPEN-FLG1=["WK-CUR-OPEN-FLG1"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  検知プログラムID
               MOVE  CNS-PGM-ID       TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-004      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE          TO  DETAIL-RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-FREE-MSG      TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":カーソルCR1オープン処理  END"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.3 カーソルCR1フェッチ処理
      ******************************************************************
       CURSOR1-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***カーソルCR1フェッチ処理 START***"
      *-----------------------------------------------------------------
      *----------  カーソル1 FETCH
           EXEC SQL
               FETCH  CR1
                INTO :HST-RTN-DATA
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":SQLCODE1(FETCH) =[" SQLCODE  "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常の場合
             WHEN  CNS-SQL-NORMAL
      *----------  ファンドコード
                 MOVE  HST-FUND-CD      OF  HST-RTN-DATA
                   TO  WK-SQL-FUND-CD
      *----------  ポートフォリオコード
                 MOVE  HST-PTF-CD       OF  HST-RTN-DATA
                   TO  WK-SQL-PTF-CD
      *----------  評価系列コード
                 MOVE  HST-HYK-KRTU-CD  OF  HST-RTN-DATA
                   TO  WK-SQL-HYK-KRTU-CD
      *----------  計算期間FROM
                 MOVE  HST-KEISAN-YMD-FROM
                   OF  HST-RTN-DATA
                   TO  WK-SQL-KEISAN-YMD-FROM
      *----------  計算期間TO
                 MOVE  HST-KEISAN-YMD-TO OF  HST-RTN-DATA
                   TO  WK-SQL-KEISAN-YMD-TO
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード =[" WK-SQL-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["WK-SQL-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード =[" WK-SQL-HYK-KRTU-CD"]"
      D    DISPLAY  CNS-PGM-ID":計算期間FROM =["
      D             WK-SQL-KEISAN-YMD-FROM"]"
      D    DISPLAY  CNS-PGM-ID":計算期間TO =[" WK-SQL-KEISAN-YMD-TO"]"
      *-----------------------------------------------------------------
                 INITIALIZE  PARM-SCZY1130-INOUT
                             PARM-RTNPKG
                 MOVE  GYOUMU-GROUP-CODE  OF  WK-IN-AIFA-HEADER
                   TO  GYOMU-GRP-CD       OF  PARM-SCZY1130-ARG1
                 MOVE  WK-IN-RIYO-CMP-CD
                   TO  RIYO-CMP-CD        OF  PARM-SCZY1130-ARG1
                 MOVE  COMPANY-CODE       OF  WK-IN-AIFA-HEADER
                   TO  LOGIN-CMP-CD       OF  PARM-SCZY1130-ARG1
                 MOVE  WK-SQL-FUND-CD
                   TO  FUND-CD            OF  PARM-SCZY1130-ARG1
                 MOVE  WK-SQL-PTF-CD
                   TO  PTF-CD             OF  PARM-SCZY1130-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":業務グループコード =["
      D                         GYOMU-GRP-CD  OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D                         RIYO-CMP-CD   OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ログインユーザー会社コード =["
      D                         LOGIN-CMP-CD  OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":メニューID =["
      D                         MENU-ID       OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":実行処理ID =["
      D                        JIKOU-SYORI-ID OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D                         FUND-CD       OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D                         PTF-CD        OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備 =["YOBI  OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1130 START  ***"
      *-----------------------------------------------------------------
      *   【SCZY1130】利用権限チェックルーチン
                 CALL  "SCZY1130"           USING  PARM-SCZY1130-INOUT
                                                   PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  PARM-RTNPKG
      D             ") OF SCZY1130=[" RTN-CD   OF  PARM-RTNPKG
      D              ( COUNTER        OF  PARM-RTNPKG )           "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1130 END  ***"
      *-----------------------------------------------------------------
                 EVALUATE  RTN-CD           OF  PARM-RTNPKG
                           ( COUNTER        OF  PARM-RTNPKG )
                 WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY1130正常終了"
      *-----------------------------------------------------------------
                   COMPUTE  WK-HIT-COUNT = WK-HIT-COUNT + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-ヒット件数 =[" WK-HIT-COUNT"]"
      *-----------------------------------------------------------------
                   IF  (WK-HIT-COUNT < WK-MAX-COUNT
                     OR WK-HIT-COUNT = WK-MAX-COUNT)
                   THEN
                     MOVE  WK-SQL-FUND-CD
                       TO  FUND-CD
                       OF  PARM-SUSCGP01-ARG2(WK-HIT-COUNT)
                     MOVE  WK-SQL-PTF-CD
                       TO  PTF-CD
                       OF  PARM-SUSCGP01-ARG2(WK-HIT-COUNT)
                     MOVE  WK-SQL-HYK-KRTU-CD
                       TO  HYK-KRTU-CD
                       OF  PARM-SUSCGP01-ARG2(WK-HIT-COUNT)
                     MOVE  WK-SQL-KEISAN-YMD-FROM
                       TO  KEISAN-YMD-FROM
                       OF  PARM-SUSCGP01-ARG2(WK-HIT-COUNT)
                     MOVE  WK-SQL-KEISAN-YMD-TO
                       TO  KEISAN-YMD-TO
                       OF  PARM-SUSCGP01-ARG2(WK-HIT-COUNT)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ARG2.ファンドコード(WK-ヒット件数) =["
      D                  FUND-CD OF PARM-SUSCGP01-ARG2(WK-HIT-COUNT)"]"
      D    DISPLAY CNS-PGM-ID":ARG2.ポートフォリオコード(WK-ヒット件数)"
      D             " =["PTF-CD  OF PARM-SUSCGP01-ARG2(WK-HIT-COUNT)"]"
      D    DISPLAY CNS-PGM-ID":ARG2.デフォルト評価系列コード(WK-ヒット"
      D   "件数) =[" HYK-KRTU-CD OF PARM-SUSCGP01-ARG2(WK-HIT-COUNT)"]"
      D    DISPLAY CNS-PGM-ID":ARG2.計算期間FROM(WK-ヒット件数) =["
      D          KEISAN-YMD-FROM OF PARM-SUSCGP01-ARG2(WK-HIT-COUNT)"]"
      D    DISPLAY CNS-PGM-ID":ARG2.計算期間TO(WK-ヒット件数) =["
      D            KEISAN-YMD-TO OF PARM-SUSCGP01-ARG2(WK-HIT-COUNT)"]"
      *-----------------------------------------------------------------
                     PERFORM  CURSOR1-FETCH-RTN
                   ELSE
                     MOVE  CNS-RTN-002      TO  WK-RETURN-CD
      *----------  検知プログラムID
                     MOVE  CNS-PGM-ID       TO  ERR-PGM-ID
                                            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                     MOVE  CNS-POS-005      TO  ERR-POS
                                            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                     MOVE  CNS-RTN-002      TO  RTN-CD
                                            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                     MOVE  ZERO             TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                     MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                     MOVE  CNS-OVER-MSG     TO  FREE-MSG
                                            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                     PERFORM  ERR-RTN
                   END-IF
      *----------  権限なしの場合
                 WHEN  CNS-RTN-130
      *----------  ワークリターンコード
                   MOVE  CNS-RTN-130         TO  WK-RETURN-CD
                   INITIALIZE  PARM-SCZY7110-AIFA-HEADER
                               PARM-SCZY7110-INOUT
                               PARM-RTNPKG
                   MOVE  WK-IN-AIFA-HEADER
                     TO  PARM-SCZY7110-ARG1
                   MOVE  WK-IN-MENU-ID
                     TO  SYS-SYORI-ID        OF  PARM-SCZY7110-ARG2
                   MOVE  WK-IN-GAMEN-ACT-KBN
                     TO  GAMEN-ACT-KBN       OF  PARM-SCZY7110-ARG2
                   MOVE  CNS-X-07
                     TO  NML-ERR-KBN         OF  PARM-SCZY7110-ARG2
                   MOVE  CNS-X-0
                     TO  EE-SEARCH-KBN       OF  PARM-SCZY7110-ARG2
                   MOVE  WK-SQL-KEISAN-YMD-FROM
                     TO  KIJUN-YMD1          OF  PARM-SCZY7110-ARG2
                   MOVE  WK-SQL-KEISAN-YMD-TO
                     TO  KIJUN-YMD2          OF  PARM-SCZY7110-ARG2
                   MOVE  WK-IN-GYOUMU-TASK-ID
                     TO  DATA-ID             OF  PARM-SCZY7110-ARG2
                   MOVE  WK-IN-AIFA-HEADER(CNS-TXRX-POS:1)
                     TO  TXRX-KBN            OF  PARM-SCZY7110-ARG2
                   MOVE  WK-SQL-FUND-CD
                     TO  FUND-CD             OF  PARM-SCZY7110-ARG2
                   MOVE  WK-SQL-PTF-CD
                     TO  PTF-CD              OF  PARM-SCZY7110-ARG2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":AIFA・共通ヘッダ項目 =["
      D                         PARM-SCZY7110-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":システム処理ID =["
      D                         SYS-SYORI-ID   OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D                         KIDOU-ID       OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":画面アクション区分 =["
      D                         GAMEN-ACT-KBN  OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":正常エラー区分 =["
      D                        NML-ERR-KBN     OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":課金用検索区分 =["
      D                         EE-SEARCH-KBN  OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日1 =["
      D                         KIJUN-YMD1     OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日2 =["
      D                         KIJUN-YMD2     OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":委託会社コード =["
      D                         ITK-CMP-CD     OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["
      D                         FND-CD         OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード =["
      D                         MEG-CD         OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":データ特定用ID =["
      D                         DATA-ID        OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":TXRX利用区分 =["
      D                         TXRX-KBN       OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":RXファンドコード =["
      D                         FUND-CD        OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":RXポートフォリオコード =["
      D                         PTF-CD         OF  PARM-SCZY7110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":電文ID =["
      D                         DENBUN-ID      OF  PARM-SCZY7110-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":入力電文 =["
      D                         IN-DENBUN      OF  PARM-SCZY7110-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7110 START  ***"
      *-----------------------------------------------------------------
      *   【SCZY7110】バッチ用監査ログＩＮＳルーチン
                   CALL  "SCZY7110"   USING  PARM-SCZY7110-AIFA-HEADER
                                             PARM-SCZY7110-INOUT
                                             PARM-SCZY7110-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  PARM-SCZY7110-RTNPKG
      D             ") OF SCZY7110=[" RTN-CD   OF  PARM-SCZY7110-RTNPKG
      D              ( COUNTER        OF  PARM-SCZY7110-RTNPKG )     "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7110 END  ***"
      *-----------------------------------------------------------------
                   EVALUATE  RTN-CD           OF  PARM-SCZY7110-RTNPKG
                             ( COUNTER        OF  PARM-SCZY7110-RTNPKG )
      *----------  正常の場合
                   WHEN  CNS-RTN-000
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY7110正常終了"
      *-----------------------------------------------------------------
                     CONTINUE
      *----------  上記以外の場合
                   WHEN  OTHER
                     MOVE  RTN-CD           OF  PARM-SCZY7110-RTNPKG
                         ( COUNTER          OF  PARM-SCZY7110-RTNPKG )
                       TO  WK-RETURN-CD
      *----------  エラー検知プログラム名
                     MOVE  CNS-PGM-ID
                       TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                     MOVE  CNS-POS-017
                       TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                     MOVE  CNS-RTN-901
                       TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                     MOVE  ZERO
                       TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                     MOVE  CNS-DETAIL-0
                       TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                     MOVE  SPACE
                       TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
                     MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D         ":SCZY7110エラー：バッチ用監査ログＩＮＳルーチンエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
                     PERFORM  ERR-RTN
                   END-EVALUATE
                   PERFORM  CURSOR1-FETCH-RTN
      *----------  上記以外の場合
                 WHEN  OTHER
      *----------  エラー検知プログラム名
                   MOVE  CNS-PGM-ID
                     TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-018
                     TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-901
                     TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  ZERO
                     TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-0
                     TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                   MOVE  SPACE
                     TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
                   MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":SCZY1130エラー：利用権限チェックルーチンエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
                   PERFORM  ERR-RTN
                 END-EVALUATE
      *----------  SQLCODE＝1403(データなし)の場合
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
      *----------  上記以外の場合
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID       TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-006      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE          TO  DETAIL-RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-FREE-MSG      TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR1フェッチ処理 END"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.4 カーソルCR1クロース処理
      ******************************************************************
       CURSOR1-CLOSE-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***カーソルCR1クロース処理 START***"
      D    DISPLAY  CNS-PGM-ID ":WK-CUR-OPEN-FLG1 =["WK-CUR-OPEN-FLG1"]"
      *-----------------------------------------------------------------
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(CR1 CLOSE)   =["  SQLCODE  "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  SQLCODE=0(正常)の場合
               WHEN  CNS-SQL-NORMAL
      *----------  カーソルCLOSE判定フラグ
                   MOVE  CNS-OFF      TO  WK-CUR-OPEN-FLG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR1 CLOSE処理 成功"
      D    DISPLAY  CNS-PGM-ID ":WK-CUR-OPEN-FLG1=["WK-CUR-OPEN-FLG1"]"
      *-----------------------------------------------------------------
      *----------  上記以外の場合
               WHEN  OTHER
      *----------  エラー検知プログラム名
                   MOVE  CNS-PGM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-007  TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-900  TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE      TO  DETAIL-RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-1 TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  WK-FREE-MSG  TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                   PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR1クロース処理 END"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR1-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.5 その他処理
      ******************************************************************
       OTHER-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***その他処理 START***"
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT"]"
      *-----------------------------------------------------------------
           MOVE  WK-HIT-COUNT
             TO  HIT-COUNT              OF  PARM-SUSCGP01-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG2.ヒット件数 =["
      D                       HIT-COUNT OF PARM-SUSCGP01-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ":その他処理 END"
      *-----------------------------------------------------------------
           CONTINUE.
       OTHER-EXT.
           EXIT.
      ******************************************************************
      *     3.2.1-1 データ抽出処理(計算期間FROM,計算期間TO)
      ******************************************************************
       YMD-SELECT-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID 
      D    ":***  (計算期間FROM,計算期間TO)抽出処理  START  ***"
      *-----------------------------------------------------------------
      *---------- 3.2.1-1.1 カーソルCR2作成処理
           PERFORM  CURSOR2-SELECT-RTN
      *---------- 3.2.1-1.2 カーソルCR2オープン処理
           PERFORM  CURSOR2-OPEN-RTN
      *---------- 3.2.1-1.3 カーソルCR2フェッチ処理
           PERFORM  CURSOR2-FETCH-RTN
      *---------- 3.2.1-1.4 カーソルCR2クロース処理
           PERFORM  CURSOR2-CLOSE-RTN
      *---------- 3.2.1-1.5 その他処理
           PERFORM  OTHER-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":***  (計算期間FROM,計算期間TO)抽出処理    END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       YMD-SELECT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1-1.1 カーソルCR2作成処理
      ******************************************************************
       CURSOR2-SELECT-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCR2作成処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
      *----------  差分抽出対象ポートフォリオ一覧（取引）（TKDYGP12）
           MOVE  WK-TORIHIKI-TBL-ID    TO  SQL-TBL-ID4
      *----------  再処理要ポートフォリオ一覧（銘柄属性）（TKDYGP16）
           MOVE  WK-MGZS-TBL-ID        TO  SQL-TBL-ID6
           INITIALIZE  WK-FREE-MSG
      *----------  SQLSTMT2
           STRING   WK-SQL-OTHER-2
                    WK-SQL-TKDYGP12
                    WK-SQL-UNION
                    WK-SQL-TKDYGP16
                    WK-SQL-A
                    WK-SQL-WHERE2
                    DELIMITED BY SIZE
                    INTO  SQLSTMT2
           END-STRING
               MOVE  SQLSTMT2          TO  WK-FREE-MSG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT2 =["SQLSTMT2"]"
      D    DISPLAY  CNS-PGM-ID":WK-FREE-MSG      =["WK-FREE-MSG"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S2  FROM  :SQLSTMT2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE2(PREPARE)     =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2PREPARE  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-020
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  WK-FREE-MSG
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルCR2作成処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR2-SELECT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1-1.2 カーソルCR2オープン処理
      ******************************************************************
       CURSOR2-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR2オープン処理  START"
      *-----------------------------------------------------------------
      *----------  カーソル DECLARE
           EXEC SQL
               DECLARE CR2 CURSOR  FOR S2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE2(DECLARE) =[" SQLCODE   "]"
      *-----------------------------------------------------------------
           EXEC SQL
             OPEN  CR2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":SQLCODE2(OPEN) =[" SQLCODE  "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常の場合
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON           TO  WK-CUR-OPEN-FLG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":カーソル2 OPEN処理 成功"
      D    DISPLAY  CNS-PGM-ID  ":WK-CUR-OPEN-FLG2=["WK-CUR-OPEN-FLG2"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  検知プログラムID
               MOVE  CNS-PGM-ID       TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-021      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE          TO  DETAIL-RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-FREE-MSG      TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":カーソルCR2オープン処理  END"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR2-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1-1.3 カーソルCR2フェッチ処理
      ******************************************************************
       CURSOR2-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***カーソルCR2フェッチ処理 START***"
      *-----------------------------------------------------------------
      *----------  カーソル1 FETCH
           EXEC SQL
               FETCH  CR2
                INTO :HST-YMD-DATA
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":SQLCODE1(FETCH) =[" SQLCODE  "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常の場合
             WHEN  CNS-SQL-NORMAL
      *----------  計算期間FROM
                 MOVE  HST-KS-YMD-FROM       OF  HST-YMD-DATA
                   TO  WK-SQL-KEISAN-YMD-FROM
      *----------  計算期間TO
                 MOVE  HST-KS-YMD-TO         OF  HST-YMD-DATA
                   TO  WK-SQL-KEISAN-YMD-TO
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":計算期間FROM =["
      D             WK-SQL-KEISAN-YMD-FROM"]"
      D    DISPLAY  CNS-PGM-ID":計算期間TO =[" WK-SQL-KEISAN-YMD-TO"]"
      D    DISPLAY  CNS-PGM-ID":WK-ヒット件数 =[" WK-HIT-COUNT"]"
      *-----------------------------------------------------------------
                 PERFORM                    VARYING  WK-IDX1
                 FROM  1  BY 1  UNTIL  WK-IDX1  >  WK-HIT-COUNT
                     MOVE  WK-SQL-KEISAN-YMD-FROM
                       TO  KEISAN-YMD-FROM
                       OF  PARM-SUSCGP01-ARG2(WK-IDX1)
                     MOVE  WK-SQL-KEISAN-YMD-TO
                       TO  KEISAN-YMD-TO
                       OF  PARM-SUSCGP01-ARG2(WK-IDX1)
                 END-PERFORM
      *----------  SQLCODE＝1403(データなし)の場合
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
      *----------  上記以外の場合
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID       TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-022      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE          TO  DETAIL-RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-FREE-MSG      TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR2フェッチ処理 END"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR2-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1-1.4 カーソルCR2クロース処理
      ******************************************************************
       CURSOR2-CLOSE-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***カーソルCR2クロース処理 START***"
      D    DISPLAY  CNS-PGM-ID ":WK-CUR-OPEN-FLG2 =["WK-CUR-OPEN-FLG2"]"
      *-----------------------------------------------------------------
      *----------  カーソル CLOSE
           EXEC SQL
               CLOSE CR2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(CR2 CLOSE)   =["  SQLCODE  "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  SQLCODE=0(正常)の場合
               WHEN  CNS-SQL-NORMAL
      *----------  カーソルCLOSE判定フラグ
                   MOVE  CNS-OFF      TO  WK-CUR-OPEN-FLG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR2 CLOSE処理 成功"
      D    DISPLAY  CNS-PGM-ID ":WK-CUR-OPEN-FLG2=["WK-CUR-OPEN-FLG2"]"
      *-----------------------------------------------------------------
      *----------  上記以外の場合
               WHEN  OTHER
      *----------  エラー検知プログラム名
                   MOVE  CNS-PGM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-023  TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-900  TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE      TO  DETAIL-RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-1 TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  WK-FREE-MSG  TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                   PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR2クロース処理 END"
      *-----------------------------------------------------------------
           CONTINUE.
       CURSOR2-CLOSE-EXT.
           EXIT.
      ******************************************************************
      **    3.2.2 リターンコード判定
      ******************************************************************
       RETURN-CD-CHECK-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  リターンコード判定  START  ***"
      D    DISPLAY  CNS-PGM-ID ":WK-RETURN-CD =["WK-RETURN-CD"]"
      *-----------------------------------------------------------------
           IF  WK-RETURN-CD = CNS-RTN-130
           THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":権限なしデータあり"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-019
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-130
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  CNS-MSG-130
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *----------  3.4 エラー処理
               PERFORM  ERR-RTN
           ELSE
               CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  リターンコード判定  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       RETURN-CD-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    3.3．後処理
      ******************************************************************
       END-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***後処理 START***"
      D    DISPLAY  CNS-PGM-ID":WK-RETURN-CD=["WK-RETURN-CD"]"
      *-----------------------------------------------------------------
           MOVE  WK-RETURN-CD
             TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  SCZY1170 リターンパッケージセットルーチン
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD OF  PARM-SCZY1170-ARG1=["
      D                         RTN-CD OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"           USING  PARM-SCZY1170-INOUT
                                             PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG TO  PARM-SUSCGP01-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-SUSCGP01-ARG2 = ["
      D                         PARM-SUSCGP01-ARG2 "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SUSCGP01-ARG3 = ["
      D                         PARM-SUSCGP01-ARG3 "]"
      D    DISPLAY  CNS-PGM-ID":***  後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           GOBACK.
      ******************************************************************
      *    3.4 エラー処理
      ******************************************************************
       ERR-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***エラー処理 START***"
      D    DISPLAY  CNS-PGM-ID ":WK-CUR-OPEN-FLG1 =["WK-CUR-OPEN-FLG1"]"
      *-----------------------------------------------------------------
           IF  WK-CUR-OPEN-FLG1 = CNS-ON
           THEN
               EXEC  SQL
                   CLOSE CR1
               END-EXEC
               MOVE  CNS-OFF   TO  WK-CUR-OPEN-FLG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR1 CLOSE 成功"
      D    DISPLAY  CNS-PGM-ID ":WK-CUR-OPEN-FLG1 =["WK-CUR-OPEN-FLG1"]"
      *-----------------------------------------------------------------
           ELSE
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-CUR-OPEN-FLG2 =["WK-CUR-OPEN-FLG2"]"
      *-----------------------------------------------------------------
           IF  WK-CUR-OPEN-FLG2 = CNS-ON
           THEN
               EXEC  SQL
                   CLOSE CR2
               END-EXEC
               MOVE  CNS-OFF   TO  WK-CUR-OPEN-FLG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":カーソルCR2 CLOSE 成功"
      D    DISPLAY  CNS-PGM-ID ":WK-CUR-OPEN-FLG2 =["WK-CUR-OPEN-FLG2"]"
      *-----------------------------------------------------------------
           ELSE
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-RETURN-CD =["WK-RETURN-CD"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-RETURN-CD
             WHEN  CNS-RTN-002
               MOVE  WK-MAX-COUNT
                 TO  HIT-COUNT          OF  PARM-SUSCGP01-ARG2
             WHEN  CNS-RTN-130
               CONTINUE
             WHEN  OTHER
               MOVE  ZERO               TO  HIT-COUNT
                                        OF  PARM-SUSCGP01-ARG2
               INITIALIZE                   PARM-SUSCGP01-ARG2
           END-EVALUATE
      *----------  SCZY1170 リターンパッケージセットルーチン
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":HIT-COUNT  OF  PARM-SUSCGP01-ARG2 = ["
      D                         HIT-COUNT  OF  PARM-SUSCGP01-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"           USING  PARM-SCZY1170-INOUT
                                             PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO   PARM-SUSCGP01-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-SUSCGP01-ARG2 = ["
      D                         PARM-SUSCGP01-ARG2 "]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD OF PARM-SUSCGP01-ARG3 = ["
      D             DETAIL-RTN-CD OF  PARM-SUSCGP01-ARG3(1) "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SUSCGP01-ARG3 = ["
      D                         PARM-SUSCGP01-ARG3 "]"
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
