      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ1711
      * プログラム名称 : 再計算履歴データ削除
      * 処理概要       : 再計算断面の履歴データを削除する
      * 参照ＤＢ       :
      * 引数           : IN  基準日断面情報
      *                : OUT RTNパッケージ
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- -------------------------------------------
      * 20090727   新規  SCS        王飛    新規作成
      * 20091015   修正  SCS        王飛    総合障害3114
      * 20100924   修正  SCS        兪巧芳  テーマ3044
      * 20110421   修正  SCS        シャ建  性能改善対応
      * 20130312   修正  SCS        孫炯    テーマ3467
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ1711.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  09-07-27.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ1711".
      *----------  残高履歴テーブル
         05  CNS-TBL-TKMZZR00      PIC  X(08)  VALUE  "TKMZZR00".
      *----------  元本残高テーブル
         05  CNS-TBL-TKMZGZ00      PIC  X(08)  VALUE  "TKMZGZ00".
      *----------  資金残履歴テーブル
         05  CNS-TBL-TKMZSR00      PIC  X(08)  VALUE  "TKMZSR00".
      *----------  未収収益
         05  CNS-TBL-TKMZMS00      PIC  X(08)  VALUE  "TKMZMS00".
      *----------  債券過去経過利息
         05  CNS-TBL-TKMZKR00      PIC  X(08)  VALUE  "TKMZKR00".
      *----------  取引差分更新管理
         05  CNS-TBL-TKMZSK00      PIC  X(08)  VALUE  "TKMZSK00".
      *----------  取引
         05  CNS-TBL-TKMXTR00      PIC  X(08)  VALUE  "TKMXTR00".
         05  CNS-ERR-33            PIC  X(22)  VALUE
               "SQL処理エラー（DELETE)".
         05  CNS-ERR-34            PIC  X(22)  VALUE
               "SQL処理エラー（UPDATE)".
         05  CNS-ERR-35            PIC  X(22)  VALUE
               "SQL処理エラー（SELECT)".
         05  CNS-SQL-MSG-DELETE    PIC  X(17)  VALUE
                                               " SQL-MSG(DELETE):".
         05  CNS-SQL-MSG-UPDATE    PIC  X(17)  VALUE
                                               " SQL-MSG(UPDATE):".
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-X-1               PIC  X(01)  VALUE  "1".
         05  CNS-X-2               PIC  X(01)  VALUE  "2".
         05  CNS-SQL-1405          PIC  S9(04) VALUE  -1405.
      *----------  最終有効日
         05  CNS-99991231          PIC  S9(08) VALUE  +99991231.
         05  CNS-C1                PIC  X(01)  VALUE  "1".
         05  CNS-YKJ               PIC  X(07)  VALUE  "YKJ_YMD".
         05  CNS-UKE               PIC  X(07)  VALUE  "UKE_YMD".
      ******************************************************************
      *                 フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  取引差分更新管理カーソルオープンフラグ
      *  10  FLG-TKMZSK00-CR-8     PIC  9(01).                          @3212SEINO@@
      *  10  FLG-TKMXTR00-CR-10    PIC  9(01).                          @3212SEINO@@
         10  FLG-TKMZSK00-FETCH    PIC  9(01).
         10  FLG-MX-TKMZSK00-FETCH PIC  9(01).
      *  10  FLG-TKMXTR00-CR-9     PIC  9(01).                          @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *         フラグエリア２(PREPARE,DECLAREスキップ判定用)           @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FLG-AREA2.                                                   @3212SEINO@@
      *---------- 残高履歴DELカーソルオープンフラグ                     @3212SEINO@@
         05  FLG-DELETE-TKMZZR00   PIC  9(01).                          @3212SEINO@@
      *---------- 元本残高DELカーソルオープンフラグ                     @3212SEINO@@
         05  FLG-DELETE-TKMZGZ00   PIC  9(01).                          @3212SEINO@@
      *---------- 資金残履歴DELカーソルオープンフラグ                    @3212SEINO@@
         05  FLG-DELETE-TKMZSR00   PIC  9(01).                          @3212SEINO@@
      *---------- 未収収益DELカーソルオープンフラグ                     @3212SEINO@@
         05  FLG-DELETE-TKMZMS00   PIC  9(01).                          @3212SEINO@@
      *---------- 未収収益UPDカーソルオープンフラグ                     @3212SEINO@@
         05  FLG-UPDATE-TKMZMS00   PIC  9(01).                          @3212SEINO@@
      *---------- 債券過去経過利息DELカーソルオープンフラグ             @3212SEINO@@
         05  FLG-DELETE-TKMZKR00   PIC  9(01).                          @3212SEINO@@
      *---------- 債券過去経過利息UPDカーソルオープンフラグ             @3212SEINO@@
         05  FLG-UPDATE-TKMZKR00   PIC  9(01).                          @3212SEINO@@
      *---------- 取引差分更新管理カーソルオープンフラグ_1              @3212SEINO@@
         05  FLG-TKMZSK00-CR-8     PIC  9(01).                          @3212SEINO@@
      *---------- 取引SELカーソルオープンフラグ_1                       @3212SEINO@@
         05  FLG-TKMXTR00-CR-9     PIC  9(01).                          @3212SEINO@@
      *---------- 取引SELカーソルオープンフラグ_2                       @3212SEINO@@
         05  FLG-TKMXTR00-CR-10    PIC  9(01).                          @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *                複数回起動チェック用スイッチ                     @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FIRST-SW                PIC  X(03)  VALUE 'YES'.             @3212SEINO@@
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-DATA-IN.
      *----------  基準日断面情報
           10  WK-TKMZBW02.
      *----------  利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  開始基準日
             15  WK-KAISI-KJN-YMD  PIC  S9(08).
      *----------  基準日
             15  WK-KJN-YMD        PIC  S9(08).
      *----------  開始基準日の翌日
             15  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  計算パターン
             15  WK-CALC-PTN       PIC  X(01).
      *----------  基本会計ベースフラグ
             15  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  起動ログインユーザ会社コード
           10  WK-KIDOU-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  起動ユーザーID
           10  WK-KIDOU-SID        PIC  X(20).
      *----------  20100212(GIPS2.0)  START
           10  WK-IN-GIPS-MODE     PIC  X(01).
      *----------  20100212(GIPS2.0)  END
      *----------  ワーク残高履歴テーブル
         05  WK-TBL-TKMZZR00       PIC  X(13).
      *----------  ワーク元本残高テーブル
         05  WK-TBL-TKMZGZ00       PIC  X(13).
      *----------  ワーク資金残履歴テーブル
         05  WK-TBL-TKMZSR00       PIC  X(13).
      *----------  ワーク未収収益テーブル
         05  WK-TBL-TKMZMS00       PIC  X(13).
      *----------  ワーク債券過去経過利息テーブル
         05  WK-TBL-TKMZKR00       PIC  X(13).
      *----------  取引差分更新管理
         05  WK-TBL-TKMZSK00       PIC  X(13).
      *----------  取引
         05  WK-TBL-TKMXTR00       PIC  X(13).
      ******************************************************************
      *    ＯＲＡＣＬＥホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  残高履歴TBL(別紙1-1)
         05  H-TKMZZR00-D.
      *----------  利用会社コード
      *    10  H-RIYO-CMP-CD-D     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-D         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-D          PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD-D         PIC  S9(08).
      *----------  元本残高TBL(別紙1-2)
         05  H-TKMZGZ00-D.
      *----------  利用会社コード
      *    10  H-RIYO-CMP-CD-D     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-D         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-D          PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD-D         PIC  S9(08).
      *----------  資金残履歴TBL(別紙1-3)
         05  H-TKMZSR00-D.
      *----------  利用会社コード
      *    10  H-RIYO-CMP-CD-D     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-D         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-D          PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD-D         PIC  S9(08).
      *----------  未収収益TBL(別紙1-4 DELETE)
         05  H-TKMZMS00-D.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-D     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-D         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-D          PIC  X(04).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD-D   PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD-D         PIC  S9(08).
      *----------  未収収益TBL(別紙1-5 UPDATE)
         05  H-TKMZMS00-U.
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD-U
                                   PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID-U         PIC  X(20).
      *----------  更新プログラムＩＤ
           10  H-UPD-PGMID-U       PIC  X(16).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-U     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-U         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-U          PIC  X(04).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD-U   PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD-U         PIC  S9(08).
      *----------  債券過去経過利息TBL(別紙1-6 DELETE)
         05  H-TKMZKR00-D.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-D     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-D         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-D          PIC  X(04).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD-D   PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD-D         PIC  S9(08).
      *----------  債券過去経過利息TBL(別紙1-7 UPDATE)
         05  H-TKMZKR00-U.
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD-U
                                   PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID-U         PIC  X(20).
      *----------  更新プログラムＩＤ
           10  H-UPD-PGMID-U       PIC  X(16).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-U     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-U         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-U          PIC  X(04).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD-U   PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD-U         PIC  S9(08).
      *----------  取引差分更新管理(別紙1-8)
         05  H-TKMZSK00.
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産/負債・買建/売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
         05  H-TKMZSK00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  取引(別紙1-9)
         05  H-TKMXTR00.
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  約定日
           10  H-YKJ-YMD           PIC  S9(08).
      *----------  COUNT(約定日)
           10  H-COUNT-YKJ-YMD     PIC  S9(08).
         05  H-TKMXTR00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  基本会計ベースフラグ
           10  H-KIHON-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  開始基準日の翌日
           10  H-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  C/A、CB転換(別紙1-10)
         05  H-TKMXTR00-CA.
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産/負債・買建/売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  約定日
           10  H-YKJ-YMD           PIC  S9(08).
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
         05  H-TKMXTR00-CA-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基本会計ベースフラグ
           10  H-KIHON-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  開始基準日の翌日
           10  H-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *  05  SQLSTMT               PIC  X(2500).                        @3212SEINO@@
         05  SQLSTMT1              PIC  X(150).                         @3212SEINO@@
         05  SQLSTMT2              PIC  X(150).                         @3212SEINO@@
         05  SQLSTMT3              PIC  X(150).                         @3212SEINO@@
         05  SQLSTMT4              PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT5              PIC  X(700).                         @3212SEINO@@
         05  SQLSTMT6              PIC  X(550).                         @3212SEINO@@
         05  SQLSTMT7              PIC  X(750).                         @3212SEINO@@
         05  SQLSTMT8              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT9              PIC  X(750).                         @3212SEINO@@
         05  SQLSTMT10             PIC  X(550).                         @3212SEINO@@
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *            SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  残高履歴SQL文(別紙1-1)
         05  SQL-DELETE-1-1.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-1        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
      *    10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
      *    10  FILLER              PIC  X(17)  VALUE
      *                                        ":P_RIYO_CMP_CD_ZR".
      *----------  ファンドコード
      *    10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_ZR".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_ZR".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "KJN_YMD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_ZR".
      *----------  元本残高SQL文(別紙1-2)
         05  SQL-DELETE-1-2.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-2        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
      *    10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
      *    10  FILLER              PIC  X(17)  VALUE
      *                                        ":P_RIYO_CMP_CD_GZ".
      *----------  ファンドコード
      *    10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_GZ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_GZ".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "KJN_YMD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_GZ".
      *----------  資金残履歴SQL文(別紙1-3)
         05  SQL-DELETE-1-3.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-3        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
      *    10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
      *    10  FILLER              PIC  X(17)  VALUE
      *                                        ":P_RIYO_CMP_CD_SR".
      *----------  ファンドコード
      *    10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_SR".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_SR".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "KJN_YMD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_SR".
      *----------  別紙1-4 SQL
         05  SQL-DELETE-1-4.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-4        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(31)  VALUE
               "RIYO_CMP_CD = :P_RIYO_CMP_CD_MB".
      *----------  ファンドコード
           10  FILLER              PIC  X(28)  VALUE
               " AND FUND_CD = :P_FUND_CD_MB".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(26)  VALUE
               " AND PTF_CD = :P_PTF_CD_MB".
      *----------  適用開始日
           10  FILLER              PIC  X(35)  VALUE
               " AND :P_KAISI_KJN_YMD < TEKIYO_FROM".
           10  FILLER              PIC  X(30)  VALUE
               " AND TEKIYO_FROM <= :P_KJN_YMD".
      *----------  市場通貨未収収益（入力値）
           10  FILLER              PIC  X(44)  VALUE
               " AND (SJTK_MS_SHEKI_IN = 999999999999999.999".
      *----------  市場通貨源泉税（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " AND SJTK_GENSEN_TAX_IN = 999999999999999.999".
      *----------  未入金対象数量残高（入力値）
           10  FILLER              PIC  X(44)  VALUE
               " AND MNK_TSHO_SRYZN_IN = 999999999999.999999".
      *----------  運用通貨未収収益（入力値）
           10  FILLER              PIC  X(43)  VALUE
               " AND UYTK_MS_SHEKI_IN = 999999999999999.999".
      *----------  運用通貨源泉税（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " AND UYTK_GENSEN_TAX_IN = 999999999999999.999".
      *----------  評価為替レート（入力値）
           10  FILLER              PIC  X(37)  VALUE
               " AND HYK_KWS_IN = 99999999.9999999999".
      *----------  源泉税評価為替レート（入力値）
           10  FILLER              PIC  X(47)  VALUE
               " AND GENS_TAX_HYK_KWS_IN = 99999999.9999999999)".
      *----------  別紙1-5 SQL
         05  SQL-UPDATE-1-5.
           10  FILLER              PIC  X(07)  VALUE  "UPDATE ".
           10  SQL-TBL-ID-5        PIC  X(13).
           10  FILLER              PIC  X(05)  VALUE  " SET ".
      *----------  市場通貨未収収益
           10  FILLER              PIC  X(18)  VALUE
               "SJTK_MS_SHEKI = 0,".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(20)  VALUE
               "SJTK_GENSEN_TAX = 0,".
      *----------  未入金対象数量残高
           10  FILLER              PIC  X(19)  VALUE
               "MNK_TSHO_SRYZN = 0,".
      *----------  更新フラグ
           10  FILLER              PIC  X(12)  VALUE
               "UPD_FLG = 3,".
      *----------  更新日時
           10  FILLER              PIC  X(19)  VALUE
               "UPD_DATE = SYSDATE,".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(39)  VALUE
               "UPD_LOGIN_CMP_CD = :P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(21)  VALUE
               "UPD_SID = :P_UPD_SID,".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(24)  VALUE
               "UPD_PGMID = :P_UPD_PGMID".
      *----------  WHERE
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(31)  VALUE
               "RIYO_CMP_CD = :P_RIYO_CMP_CD_MB".
      *----------  ファンドコード
           10  FILLER              PIC  X(28)  VALUE
               " AND FUND_CD = :P_FUND_CD_MB".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(26)  VALUE
               " AND PTF_CD = :P_PTF_CD_MB".
      *----------  適用開始日
           10  FILLER              PIC  X(35)  VALUE
               " AND :P_KAISI_KJN_YMD < TEKIYO_FROM".
           10  FILLER              PIC  X(30)  VALUE
               " AND TEKIYO_FROM <= :P_KJN_YMD".
      *----------  市場通貨未収収益（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " AND (SJTK_MS_SHEKI_IN <> 999999999999999.999".
      *----------  市場通貨源泉税（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " OR SJTK_GENSEN_TAX_IN <> 999999999999999.999".
      *----------  未入金対象数量残高（入力値）
           10  FILLER              PIC  X(44)  VALUE
               " OR MNK_TSHO_SRYZN_IN <> 999999999999.999999".
      *----------  運用通貨未収収益（入力値）
           10  FILLER              PIC  X(43)  VALUE
               " OR UYTK_MS_SHEKI_IN <> 999999999999999.999".
      *----------  運用通貨源泉税（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " OR UYTK_GENSEN_TAX_IN <> 999999999999999.999".
      *----------  評価為替レート（入力値）
           10  FILLER              PIC  X(37)  VALUE
               " OR HYK_KWS_IN <> 99999999.9999999999".
      *----------  源泉税評価為替レート（入力値）
           10  FILLER              PIC  X(47)  VALUE
               " OR GENS_TAX_HYK_KWS_IN <> 99999999.9999999999)".
      *----------  別紙1-6 SQL
         05  SQL-DELETE-1-6.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-6        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(31)  VALUE
               "RIYO_CMP_CD = :P_RIYO_CMP_CD_MB".
      *----------  ファンドコード
           10  FILLER              PIC  X(28)  VALUE
               " AND FUND_CD = :P_FUND_CD_MB".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(26)  VALUE
               " AND PTF_CD = :P_PTF_CD_MB".
      *----------  適用開始日
           10  FILLER              PIC  X(35)  VALUE
               " AND :P_KAISI_KJN_YMD < TEKIYO_FROM".
           10  FILLER              PIC  X(30)  VALUE
               " AND TEKIYO_FROM <= :P_KJN_YMD".
      *----------  市場通貨経過利息（入力値）
           10  FILLER              PIC  X(44)  VALUE
               " AND (SJTK_KEKA_RSK_IN = 999999999999.999999".
      *----------  市場通貨源泉税（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " AND SJTK_GENSEN_TAX_IN = 999999999999999.999".
      *----------  運用通貨経過利息（入力値）
           10  FILLER              PIC  X(43)  VALUE
               " AND UYTK_KEKA_RSK_IN = 999999999999.999999".
      *----------  運用通貨源泉税（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " AND UYTK_GENSEN_TAX_IN = 999999999999999.999".
      *----------  評価為替レート（入力値）
           10  FILLER              PIC  X(37)  VALUE
               " AND HYK_KWS_IN = 99999999.9999999999".
      *----------  源泉税評価為替レート（入力値）
           10  FILLER              PIC  X(46)  VALUE
               " AND GENS_TAX_HYK_KWS_IN = 99999999.9999999999".
      *----------  ファクター・連動係数（入力値）
           10  FILLER              PIC  X(48)  VALUE
               " AND FACTOR_RENDOU_KESU_IN = 99999999.9999999999".
      *----------  未入金対象額面残高（入力値）
           10  FILLER              PIC  X(48)  VALUE
               " AND MNK_TSHO_FACE_ZAN_IN = 999999999999.999999)".
      *----------  別紙1-7 SQL
         05  SQL-UPDATE-1-7.
           10  FILLER              PIC  X(07)  VALUE  "UPDATE ".
           10  SQL-TBL-ID-7        PIC  X(13).
           10  FILLER              PIC  X(05)  VALUE  " SET ".
      *----------  市場通貨経過利息
           10  FILLER              PIC  X(18)  VALUE
               "SJTK_KEKA_RSK = 0,".
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(20)  VALUE
               "SJTK_GENSEN_TAX = 0,".
      *----------  未入金対象額面残高
           10  FILLER              PIC  X(22)  VALUE
               "MNK_TSHO_FACE_ZAN = 0,".
      *----------  ファクター・連動係数
           10  FILLER              PIC  X(23)  VALUE
               "FACTOR_RENDOU_KESU = 0,".
      *----------  更新フラグ
           10  FILLER              PIC  X(12)  VALUE
               "UPD_FLG = 3,".
      *----------  更新日時
           10  FILLER              PIC  X(19)  VALUE
               "UPD_DATE = SYSDATE,".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(39)  VALUE
               "UPD_LOGIN_CMP_CD = :P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(21)  VALUE
               "UPD_SID = :P_UPD_SID,".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(24)  VALUE
               "UPD_PGMID = :P_UPD_PGMID".
      *----------  WHERE
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(31)  VALUE
               "RIYO_CMP_CD = :P_RIYO_CMP_CD_MB".
      *----------  ファンドコード
           10  FILLER              PIC  X(28)  VALUE
               " AND FUND_CD = :P_FUND_CD_MB".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(26)  VALUE
               " AND PTF_CD = :P_PTF_CD_MB".
      *----------  適用開始日
           10  FILLER              PIC  X(35)  VALUE
               " AND :P_KAISI_KJN_YMD < TEKIYO_FROM".
           10  FILLER              PIC  X(30)  VALUE
               " AND TEKIYO_FROM <= :P_KJN_YMD".
      *----------  市場通貨経過利息（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " AND (SJTK_KEKA_RSK_IN <> 999999999999.999999".
      *----------  市場通貨源泉税（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " OR SJTK_GENSEN_TAX_IN <> 999999999999999.999".
      *----------  運用通貨経過利息（入力値）
           10  FILLER              PIC  X(43)  VALUE
               " OR UYTK_KEKA_RSK_IN <> 999999999999.999999".
      *----------  運用通貨源泉税（入力値）
           10  FILLER              PIC  X(45)  VALUE
               " OR UYTK_GENSEN_TAX_IN <> 999999999999999.999".
      *----------  評価為替レート（入力値）
           10  FILLER              PIC  X(37)  VALUE
               " OR HYK_KWS_IN <> 99999999.9999999999".
      *----------  源泉税評価為替レート（入力値）
           10  FILLER              PIC  X(46)  VALUE
               " OR GENS_TAX_HYK_KWS_IN <> 99999999.9999999999".
      *----------  ファクター・連動係数（入力値）
           10  FILLER              PIC  X(48)  VALUE
               " OR FACTOR_RENDOU_KESU_IN <> 99999999.9999999999".
      *----------  未入金対象額面残高（入力値）
           10  FILLER              PIC  X(48)  VALUE
               " OR MNK_TSHO_FACE_ZAN_IN <> 999999999999.999999)".
      *----------  別紙1-8 SQL
         05  SQL-SELECT-1-8.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(12)  VALUE  "SIJO_TUKA_CD".
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  取引差分更新管理
           10  SQL-TBL-ID-8        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
           10  FILLER              PIC  X(29)  VALUE
               "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
           10  FILLER              PIC  X(25)  VALUE
               "AND FUND_CD = :P_FUND_CD ".
           10  FILLER              PIC  X(23)  VALUE
               "AND PTF_CD = :P_PTF_CD ".
           10  FILLER              PIC  X(18)  VALUE
               "AND SEC_SBT_CD IN ".
           10  FILLER              PIC  X(50)  VALUE
               "('S   ','DSMS','FSMS','ET  ','ETB ','ETS ','ETCB',".
           10  FILLER              PIC  X(49)  VALUE
               "'REIT','ETDB','ETDS','ETDC','ETFS','ETFB','ETF ',".
           10  FILLER              PIC  X(49)  VALUE
               "'XMOB','XMOS','SM  ','B   ','DBMS','FBMS','CB  ',".
           10  FILLER              PIC  X(49)  VALUE
               "'WB  ','CBMS','CALL','DA  ','NCD ','XMOC','CASH')".
      *----------  別紙1-9 SQL
         05  SQL-SELECT-1-9.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
           10  FILLER              PIC  X(14)  VALUE  "MIN(UKE_YMD), ".
           10  FILLER              PIC  X(14)  VALUE  "MIN(YKJ_YMD), ".
           10  FILLER              PIC  X(14)  VALUE  "COUNT(YKJ_YMD)".
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  取引
           10  SQL-TBL-ID-9        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
           10  FILLER              PIC  X(29)  VALUE
               "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
           10  FILLER              PIC  X(27)  VALUE
               "AND ((FUND_CD = :P_FUND_CD ".
           10  FILLER              PIC  X(24)  VALUE
               "AND PTF_CD = :P_PTF_CD) ".
           10  FILLER              PIC  X(25)  VALUE
               "OR (FUND_CD = :P_FUND_CD ".
           10  FILLER              PIC  X(22)  VALUE
               "AND PTF_CD = '    ')) ".
           10  FILLER              PIC  X(31)  VALUE
               "AND SEC_SBT_CD = :P_SEC_SBT_CD ".
           10  FILLER              PIC  X(23)  VALUE
               "AND MEG_CD = :P_MEG_CD ".
           10  FILLER              PIC  X(29)  VALUE
               "AND ((TATE_FLG = :P_TATE_FLG ".
           10  FILLER              PIC  X(28)  VALUE
               "AND GYOKU_ID = :P_GYOKU_ID) ".
           10  FILLER              PIC  X(27)  VALUE
               "OR :P_SEC_SBT_CD = 'CASH') ".
           10  FILLER              PIC  X(40)  VALUE
               "AND (TORI_JIYU IN ('FTSQ','DIVS','DVAP',".
           10  FILLER              PIC  X(15)  VALUE
               "'DVAI','CPN ') ".
           10  FILLER              PIC  X(26)  VALUE
               "OR (TORI_JIYU IN ('INTA') ".
           10  FILLER              PIC  X(40)  VALUE
               "AND SEC_SBT_CD IN ('CALL','DA  ','NCD ',".
           10  FILLER              PIC  X(16)  VALUE
               "'XMOC','CASH')) ".
           10  FILLER              PIC  X(26)  VALUE
               "OR (TORI_JIYU IN ('MATU') ".
           10  FILLER              PIC  X(36)  VALUE
               "AND SEC_SBT_CD IN ('CALL','DA  '))) ".
           10  FILLER              PIC  X(34)  VALUE
               "AND ((:P_KH_KAIKEI_BASE_FLG = '1' ".
           10  FILLER              PIC  X(42)  VALUE
               "AND YKJ_YMD BETWEEN :P_KAISI_KJN_YMD_NEXT ".
           10  FILLER              PIC  X(16)  VALUE
               "AND :P_KJN_YMD) ".
           10  FILLER              PIC  X(32)  VALUE
               "OR (:P_KH_KAIKEI_BASE_FLG = '2' ".
           10  FILLER              PIC  X(42)  VALUE
               "AND UKE_YMD BETWEEN :P_KAISI_KJN_YMD_NEXT ".
           10  FILLER              PIC  X(16)  VALUE
               "AND :P_KJN_YMD))".
      *----------  別紙1-10 SQL
         05  SQL-SELECT-1-10.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(13)  VALUE  "SIJO_TUKA_CD,".
      *----------  約定日
           10  FILLER              PIC  X(08)  VALUE  "YKJ_YMD,".
      *----------  受渡日
           10  FILLER              PIC  X(07)  VALUE  "UKE_YMD".
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
      *----------  取引差分更新管理
           10  SQL-TBL-ID-10       PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
           10  FILLER              PIC  X(29)  VALUE
               "RIYO_CMP_CD = :P_RIYO_CMP_CD ".
           10  FILLER              PIC  X(25)  VALUE
               "AND FUND_CD = :P_FUND_CD ".
           10  FILLER              PIC  X(23)  VALUE
               "AND PTF_CD = :P_PTF_CD ".
           10  FILLER              PIC  X(17)  VALUE
               "AND TORI_JIYU IN ".
           10  FILLER              PIC  X(43)  VALUE
               " ('MRGD','CONS','CID','SDID','CIQD','CISD',".
           10  FILLER              PIC  X(52)  VALUE
               "'OCID','ISD','MRG','CONI','CII','ISI','SDII','CIQI',".
           10  FILLER              PIC  X(40)  VALUE
               "'CISI','OCII','CBC','CBB','OEXW','OSIW')".
           10  FILLER              PIC  X(34)  VALUE
               "AND ((:P_KH_KAIKEI_BASE_FLG = '1' ".
           10  FILLER              PIC  X(42)  VALUE
               "AND YKJ_YMD BETWEEN :P_KAISI_KJN_YMD_NEXT ".
           10  FILLER              PIC  X(16)  VALUE
               "AND :P_KJN_YMD) ".
           10  FILLER              PIC  X(32)  VALUE
               "OR (:P_KH_KAIKEI_BASE_FLG = '2' ".
           10  FILLER              PIC  X(42)  VALUE
               "AND UKE_YMD BETWEEN :P_KAISI_KJN_YMD_NEXT ".
           10  FILLER              PIC  X(16)  VALUE
               "AND :P_KJN_YMD))".
           10  FILLER              PIC  X(17)  VALUE
               " ORDER BY TORI_ID".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- SELECT SQL文(別紙1-1)
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZZR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *    10  FILLER              PIC  X(15)  VALUE
      *        " RIYO_CMP_CD ='".
      *    10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(11)  VALUE
               " FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND KJN_YMD = ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- SELECT SQL文(別紙1-2)
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZGZ00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *    10  FILLER              PIC  X(15)  VALUE
      *        " RIYO_CMP_CD ='".
      *    10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(11)  VALUE
               " FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND KJN_YMD = ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- SELECT SQL文(別紙1-3)
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *    10  FILLER              PIC  X(15)  VALUE
      *        " RIYO_CMP_CD ='".
      *    10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(11)  VALUE
               " FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND KJN_YMD = ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- DELETE SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMS00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE  "' AND ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(14)  VALUE  " < TEKIYO_FROM".
           10  FILLER              PIC  X(20)  VALUE
               " AND TEKIYO_FROM <= ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- UPDATE SQL文(別紙1-5)
         05  WK-MSG-1-5.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMS00         PIC  X(13).
           10  FILLER              PIC  X(06)  VALUE
               "),SET ".
           10  FILLER              PIC  X(20)  VALUE
               "UPD-LOGIN-CMP-CD = '".
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(13)  VALUE
               "',UPD_SID = '".
           10  WK-UPD-SID          PIC  X(20).
           10  FILLER              PIC  X(15)  VALUE
               "',UPD_PGMID = '".
           10  WK-UPD-PGMID        PIC  X(16).
           10  FILLER              PIC  X(08)  VALUE  "' WHERE ".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE  "' AND ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(14)  VALUE  " < TEKIYO_FROM".
           10  FILLER              PIC  X(20)  VALUE
               " AND TEKIYO_FROM <= ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- DELETE SQL文(別紙1-6)
         05  WK-MSG-1-6.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE  "' AND ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(14)  VALUE  " < TEKIYO_FROM".
           10  FILLER              PIC  X(20)  VALUE
               " AND TEKIYO_FROM <= ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- UPDATE SQL文(別紙1-7)
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKR00         PIC  X(13).
           10  FILLER              PIC  X(06)  VALUE
               "),SET ".
           10  FILLER              PIC  X(20)  VALUE
               "UPD-LOGIN-CMP-CD = '".
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(13)  VALUE
               "',UPD_SID = '".
           10  WK-UPD-SID          PIC  X(20).
           10  FILLER              PIC  X(15)  VALUE
               "',UPD_PGMID = '".
           10  WK-UPD-PGMID        PIC  X(16).
           10  FILLER              PIC  X(08)  VALUE  "' WHERE ".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE  "' AND ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(14)  VALUE  " < TEKIYO_FROM".
           10  FILLER              PIC  X(20)  VALUE
               " AND TEKIYO_FROM <= ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- SELECT SQL文(別紙1-8)
         05  WK-MSG-1-8.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSK00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND FUND_CD = '".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' AND PTF_CD = '".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(20)  VALUE
               "' AND SEC_SBT_CD IN ".
           10  FILLER              PIC  X(50)  VALUE
               "('S   ','DSMS','FSMS','ET  ','ETB ','ETS ','ETCB',".
           10  FILLER              PIC  X(49)  VALUE
               "'REIT','ETDB','ETDS','ETDC','ETFS','ETFB','ETF ',".
           10  FILLER              PIC  X(49)  VALUE
               "'XMOB','XMOS','SM  ','B   ','DBMS','FBMS','CB  ',".
           10  FILLER              PIC  X(49)  VALUE
               "'WB  ','CBMS','CALL','DA  ','NCD ','XMOC','CASH')".
      *---------- SELECT SQL文(別紙1-9)
         05  WK-MSG-1-9.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMXTR00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(17)  VALUE
               "H-RIYO-CMP-CD = '".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' , H-FUND-CD = '".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' , H-PTF-CD = '".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(20)  VALUE
               "' , H-SEC-SBT-CD = '".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' , H-MEG-CD = '".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(18)  VALUE
               "' , H-TATE-FLG = '".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(18)  VALUE
               "' , H-GYOKU-ID = '".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(29)  VALUE
               "' , KIHON-KAIKEI-BASE-FLG = '".
           10  WK-KIHON-KAIKEI-BASE-FLG
                                   PIC  X(01).
           10  FILLER              PIC  X(27)  VALUE
               "' , H-KAISI-KJN-YMD-NEXT = ".
           10  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
           10  FILLER              PIC  X(15)  VALUE
               " , H-KJN-YMD = ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- SELECT SQL文(別紙1-10)
         05  WK-MSG-1-10.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  市場通貨コード
           10  FILLER              PIC  X(13)  VALUE  "SIJO_TUKA_CD,".
      *----------  約定日
           10  FILLER              PIC  X(08)  VALUE  "YKJ_YMD,".
      *----------  受渡日
           10  FILLER              PIC  X(07)  VALUE  "UKE_YMD".
           10  FILLER              PIC  X(06)  VALUE  " FROM ".
           10  WK-TKMXTR00         PIC  X(13).
           10  FILLER              PIC  X(06)  VALUE
               "WHERE ".
           10  FILLER              PIC  X(15)  VALUE
               "RIYO_CMP_CD = '".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND FUND_CD = '".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(16)  VALUE
               "' AND PTF_CD = '".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND TORI_JIYU IN ".
           10  FILLER              PIC  X(49)  VALUE
               "('MRGD','CONS','CID','SDID','CIQD','CISD','OCID',".
           10  FILLER              PIC  X(45)  VALUE
               "'ISD','MRG','CONI','CII','ISI','SDII','CIQI',".
           10  FILLER              PIC  X(40)  VALUE
               "'CISI','OCII','CBC','CBB','OEXW','OSIW')".
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  WK-KYJ-UKE          PIC  X(07) . 
           10  FILLER              PIC  X(09)  VALUE  " BETWEEN ".
           10  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(17)  VALUE
               " ORDER BY TORI_ID".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  SMZC9200 取引差分更新管理更新
       01  PARM-SMZC9200-INOUT.
           COPY  "SMZC9200.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
      *----------  リターンパッケージセットルーチンコピー句
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ1711-INOUT.
           COPY  "SMZJ1711.cpy".
       01  PARM-SMZJ1711-RTNPKG.
         05  PARM-SMZJ1711-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ1711-INOUT
                  PARM-SMZJ1711-RTNPKG.
      ******************************************************************
      *                 再計算履歴データ削除
      ******************************************************************
       BASE-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1711処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1711処理  正常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *                 3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBLID-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     WORK-AREA
                          HST-AREA
                          SQL-AREA
                          E-MSG-TBL
                          PARM-SCZY1160-INOUT
                          PARM-SMZC9200-INOUT
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-RTNPKG
                          PARM-SMZJ1711-ARG3  OF  PARM-SMZJ1711-RTNPKG
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-----  初回ＣＡＬＬ時のみフラグエリア２の初期化を行う            @3212SEINO@@
           IF     FIRST-SW = 'YES'                                      @3212SEINO@@
           THEN                                                         @3212SEINO@@
                  INITIALIZE                FLG-AREA2                   @3212SEINO@@
                  MOVE  'NO '           TO  FIRST-SW                    @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WORK-AREA        = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HST-AREA         = ["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA         = ["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL        = ["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID ":FLG-AREA2 =["FLG-AREA2 "]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT = ["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZC9200-INOUT = ["
      D             PARM-SMZC9200-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN = ["PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG= ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG = ["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1711-ARG3  = ["
      D             PARM-SMZJ1711-ARG3       OF  PARM-SMZJ1711-RTNPKG"]"
      *-----------------------------------------------------------------
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD                 OF  TKMZBW02
             TO  WK-RIYO-CMP-CD              OF  WK-TKMZBW02
      *----------  ファンドコード
           MOVE  FUND-CD                     OF  TKMZBW02
             TO  WK-FUND-CD                  OF  WK-TKMZBW02
      *----------  ポートフォリオコード
           MOVE  PTF-CD                      OF  TKMZBW02
             TO  WK-PTF-CD                   OF  WK-TKMZBW02
      *----------  開始基準日
           MOVE  KAISI-KJN-YMD               OF  TKMZBW02
             TO  WK-KAISI-KJN-YMD            OF  WK-TKMZBW02
      *----------  基準日
           MOVE  KJN-YMD                     OF  TKMZBW02
             TO  WK-KJN-YMD                  OF  WK-TKMZBW02
      *----------  開始基準日の翌日
           MOVE  KAISI-KJN-YMD-NEXT          OF  TKMZBW02
             TO  WK-KAISI-KJN-YMD-NEXT       OF  WK-TKMZBW02
      *----------  計算パターン
           MOVE  CALC-PTN                    OF  TKMZBW02
             TO  WK-CALC-PTN                 OF  WK-TKMZBW02
      *----------  基本会計ベースフラグ
           MOVE  KH-KAIKEI-BASE-FLG          OF  TKMZBW02
             TO  WK-KH-KAIKEI-BASE-FLG       OF  WK-TKMZBW02
      *----------  起動ログインユーザ会社コード
           MOVE  KIDOU-LOGIN-CMP-CD          OF  PARM-SMZJ1711-ARG1
             TO  WK-KIDOU-LOGIN-CMP-CD       OF  WK-DATA-IN
      *----------  起動ユーザーID
           MOVE  KIDOU-SID                   OF  PARM-SMZJ1711-ARG1
             TO  WK-KIDOU-SID                OF  WK-DATA-IN
      *----------  20100212(GIPS2.0)  START
      *----------  ＧＩＰＳモード
           MOVE  GIPS-MODE                   OF  PARM-SMZJ1711-ARG1
             TO  WK-IN-GIPS-MODE
      *----------  20100212(GIPS2.0)  END
      *----------  SCZY1170 RTN-CD 初期化
           MOVE  CNS-RTN-000
             TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード       =["
      D             WK-RIYO-CMP-CD           OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード       =["
      D             WK-FUND-CD               OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["
      D             WK-PTF-CD                OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日           =["
      D             WK-KAISI-KJN-YMD         OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":基準日               =["
      D             WK-KJN-YMD               OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日     =["
      D             WK-KAISI-KJN-YMD-NEXT    OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":計算パターン         =["
      D             WK-CALC-PTN              OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ =["
      D             WK-KH-KAIKEI-BASE-FLG    OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":起動ログインユーザ会社コード=["
      D             WK-KIDOU-LOGIN-CMP-CD    OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":起動ユーザーID              =["
      D             WK-KIDOU-SID             OF  WK-DATA-IN"]"
      *----------  20100212(GIPS2.0)  START
      D    DISPLAY  CNS-PGM-ID ":WK-IN-GIPS-MODE  =["WK-IN-GIPS-MODE"]"
      *----------  20100212(GIPS2.0)  END
      D    DISPLAY  CNS-PGM-ID":SCZY1170 RTN-CD      =["
      D             RTN-CD                   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  残高履歴
           MOVE  CNS-TBL-TKMZZR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  元本残高
           MOVE  CNS-TBL-TKMZGZ00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *----------  資金残履歴
           MOVE  CNS-TBL-TKMZSR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *----------  未収収益
           MOVE  CNS-TBL-TKMZMS00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *----------  債券過去経過利息
           MOVE  CNS-TBL-TKMZKR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
      *----------  取引差分更新管理
           MOVE  CNS-TBL-TKMZSK00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(6)
      *----------  取引
           MOVE  CNS-TBL-TKMXTR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(7)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD  OF PARM-SCZY1160-ARG1=["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(1)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(2)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(3)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(4)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(5)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(6)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(7)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(7)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG          =["
      D             COUNTER                         OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD      OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  残高履歴
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKMZZR00
      *----------  元本残高
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TBL-TKMZGZ00
      *----------  資金残履歴
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TBL-TKMZSR00
      *----------  未収収益
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TBL-TKMZMS00
      *----------  債券過去経過利息
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TBL-TKMZKR00
      *----------  取引差分更新管理
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(6)
               TO  WK-TBL-TKMZSK00
      *----------  取引
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(7)
               TO  WK-TBL-TKMXTR00
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク残高履歴テーブル    =["
      D             WK-TBL-TKMZZR00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク元本残高テーブル    =["
      D             WK-TBL-TKMZGZ00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金残履歴テーブル  =["
      D             WK-TBL-TKMZSR00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク未収収益テーブル    =["
      D             WK-TBL-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク債券過去経過利息テーブル =["
      D             WK-TBL-TKMZKR00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク取引差分更新管理テーブル =["
      D             WK-TBL-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク取引テーブル        =["
      D             WK-TBL-TKMXTR00"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD      OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得処理  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *                 3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  主処理  START  *****"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.GIPSモード=["
      D             WK-IN-GIPS-MODE"]"
      *-----------------------------------------------------------------
      *----------  20100212(GIPS2.0)  START
           IF  WK-IN-GIPS-MODE = CNS-C1
           THEN
             CONTINUE
           ELSE
      *----------  3.2.1対象銘柄データの基準日の残高履歴データを物理削除
             PERFORM  TKMZZR00-DEL-RTN
      *----------  3.2.2対象銘柄データの基準日の元本残高データを物理削除
             PERFORM  TKMZGZ00-DEL-RTN
      *----------  3.2.3対象銘柄データの基準日の資金残履歴データを物理削除
             PERFORM  TKMZSR00-DEL-RTN
      *----------  3.2.4.未収収益データ削除
             PERFORM  TKMZMS00-DEL-RTN
      *----------  3.2.5.債券過去経過利息データ削除
             PERFORM  TKMZKR00-DEL-RTN
           END-IF
      *----------  3.2.6 入金取引の取引差分更新管理再セット
           IF  WK-CALC-PTN   OF  WK-TKMZBW02  =  CNS-X-1
           THEN
             PERFORM  TKMZSK00-SEL-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.計算パターン=["
      D             WK-CALC-PTN   OF  WK-TKMZBW02"]"
      *-----------------------------------------------------------------
      *----------  3.2.7 C/A取引の取引差分更新管理再セット
           IF  WK-CALC-PTN   OF  WK-TKMZBW02  =  CNS-X-1
           THEN
             PERFORM  MX-TKMZSK00-SEL-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1対象銘柄データの基準日の残高履歴データを物理削除
      ******************************************************************
       TKMZZR00-DEL-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-1 SQL START  ***"
      *-----------------------------------------------------------------
      *----------  残高履歴TBL
           MOVE  WK-TBL-TKMZZR00        TO  SQL-TBL-ID-1,
                 WK-TKMZZR00            OF  WK-MSG-1-1
      *----------  利用会社コード
      *    MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
      *      TO  H-RIYO-CMP-CD-D        OF  H-TKMZZR00-D,
      *          WK-RIYO-CMP-CD         OF  WK-MSG-1-1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD-D            OF  H-TKMZZR00-D,
                 WK-FUND-CD             OF  WK-MSG-1-1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD-D             OF  H-TKMZZR00-D,
                 WK-PTF-CD              OF  WK-MSG-1-1
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-DATA-IN
             TO  H-KJN-YMD-D            OF  H-TKMZZR00-D,
                 WK-KJN-YMD             OF  WK-MSG-1-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-TBL-ID-1     =["SQL-TBL-ID-1"]"
      *D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-D  OF  H-TKMZZR00-D=["
      *D             H-RIYO-CMP-CD-D     OF  H-TKMZZR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD-D      OF  H-TKMZZR00-D=["
      D             H-FUND-CD-D         OF  H-TKMZZR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD-D       OF  H-TKMZZR00-D=["
      D             H-PTF-CD-D          OF  H-TKMZZR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-D      OF  H-TKMZZR00-D=["
      D             H-KJN-YMD-D         OF  H-TKMZZR00-D"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT1                                         @3212SEINO@@
           MOVE  SQL-DELETE-1-1         TO  SQLSTMT1                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴 SQLSTMT1    =["SQLSTMT1"]"     @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00 "]"                             @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZZR00  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D1 FROM :SQLSTMT1 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *---------- エラー処理
             PERFORM  ERR-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D1                                          @3212SEINO@@
      *      USING  :H-TKMZZR00-D.H-RIYO-CMP-CD-D,
             USING  :H-TKMZZR00-D.H-FUND-CD-D,
                    :H-TKMZZR00-D.H-PTF-CD-D,
                    :H-TKMZZR00-D.H-KJN-YMD-D
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZZR00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZZR00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                      ":TKMZZR00-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-003
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-1 SQL END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-DEL-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2対象銘柄データの基準日の元本残高データを物理削除
      ******************************************************************
       TKMZGZ00-DEL-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-2 SQL START  ***"
      *-----------------------------------------------------------------
      *----------  元本残高TBL
           MOVE  WK-TBL-TKMZGZ00        TO  SQL-TBL-ID-2,
                 WK-TKMZGZ00            OF  WK-MSG-1-2
      *----------  利用会社コード
      *    MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
      *      TO  H-RIYO-CMP-CD-D        OF  H-TKMZGZ00-D,
      *          WK-RIYO-CMP-CD         OF  WK-MSG-1-2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD-D            OF  H-TKMZGZ00-D,
                 WK-FUND-CD             OF  WK-MSG-1-2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD-D             OF  H-TKMZGZ00-D,
                 WK-PTF-CD              OF  WK-MSG-1-2
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-DATA-IN
             TO  H-KJN-YMD-D            OF  H-TKMZGZ00-D,
                 WK-KJN-YMD             OF  WK-MSG-1-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-TBL-ID-2     =["SQL-TBL-ID-2"]"
      *D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-D  OF  H-TKMZGZ00-D=["
      *D             H-RIYO-CMP-CD-D     OF  H-TKMZGZ00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD-D      OF  H-TKMZGZ00-D=["
      D             H-FUND-CD-D         OF  H-TKMZGZ00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD-D       OF  H-TKMZGZ00-D=["
      D             H-PTF-CD-D          OF  H-TKMZGZ00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-D      OF  H-TKMZGZ00-D=["
      D             H-KJN-YMD-D         OF  H-TKMZGZ00-D"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
           MOVE  SQL-DELETE-1-2         TO  SQLSTMT2                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高 SQLSTMT2    =["SQLSTMT2"]"     @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00 "]"                             @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZGZ00  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D2 FROM :SQLSTMT2 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZGZ00-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZGZ00-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-004
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D2                                          @3212SEINO@@
      *      USING  :H-TKMZGZ00-D.H-RIYO-CMP-CD-D,
             USING  :H-TKMZGZ00-D.H-FUND-CD-D,
                    :H-TKMZGZ00-D.H-PTF-CD-D,
                    :H-TKMZGZ00-D.H-KJN-YMD-D
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZGZ00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZGZ00-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZGZ00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                      ":TKMZGZ00-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-005
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-2       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-2 SQL END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZGZ00-DEL-EXT.
           EXIT.
      ******************************************************************
      *        3.2.3対象銘柄データの基準日の資金残履歴データを物理削除
      ******************************************************************
       TKMZSR00-DEL-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-3 SQL START  ***"
      *-----------------------------------------------------------------
      *----------  資金残履歴TBL
           MOVE  WK-TBL-TKMZSR00        TO  SQL-TBL-ID-3,
                 WK-TKMZSR00            OF  WK-MSG-1-3
      *----------  利用会社コード
      *    MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
      *      TO  H-RIYO-CMP-CD-D        OF  H-TKMZSR00-D,
      *          WK-RIYO-CMP-CD         OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD-D            OF  H-TKMZSR00-D,
                 WK-FUND-CD             OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD-D             OF  H-TKMZSR00-D,
                 WK-PTF-CD              OF  WK-MSG-1-3
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-DATA-IN
             TO  H-KJN-YMD-D            OF  H-TKMZSR00-D,
                 WK-KJN-YMD             OF  WK-MSG-1-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-TBL-ID-3     =["SQL-TBL-ID-3"]"
      *D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-D  OF  H-TKMZSR00-D=["
      *D             H-RIYO-CMP-CD-D     OF  H-TKMZSR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD-D      OF  H-TKMZSR00-D=["
      D             H-FUND-CD-D         OF  H-TKMZSR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD-D       OF  H-TKMZSR00-D=["
      D             H-PTF-CD-D          OF  H-TKMZSR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-D      OF  H-TKMZSR00-D=["
      D             H-KJN-YMD-D         OF  H-TKMZSR00-D"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT3                                         @3212SEINO@@
           MOVE  SQL-DELETE-1-3         TO  SQLSTMT3                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴 SQLSTMT3    =["SQLSTMT3"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00 "]"                             @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZSR00  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D3 FROM :SQLSTMT3 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSR00-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZSR00-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-006
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D3                                          @3212SEINO@@
      *      USING  :H-TKMZSR00-D.H-RIYO-CMP-CD-D,
             USING  :H-TKMZSR00-D.H-FUND-CD-D,
                    :H-TKMZSR00-D.H-PTF-CD-D,
                    :H-TKMZSR00-D.H-KJN-YMD-D
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZSR00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZSR00-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZSR00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                      ":TKMZSR00-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-007
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-3 SQL END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSR00-DEL-EXT.
           EXIT.
      ******************************************************************
      *        3.2.4.未収収益データ削除
      ******************************************************************
       TKMZMS00-DEL-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-4 SQL START  ***"
      *-----------------------------------------------------------------
      *----------  未収収益TBL
           MOVE  WK-TBL-TKMZMS00        TO  SQL-TBL-ID-4,
                 WK-TKMZMS00            OF  WK-MSG-1-4
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD-D        OF  H-TKMZMS00-D,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-4
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD-D            OF  H-TKMZMS00-D,
                 WK-FUND-CD             OF  WK-MSG-1-4
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD-D             OF  H-TKMZMS00-D,
                 WK-PTF-CD              OF  WK-MSG-1-4
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD       OF  WK-DATA-IN
             TO  H-KAISI-KJN-YMD-D      OF  H-TKMZMS00-D,
                 WK-KAISI-KJN-YMD       OF  WK-MSG-1-4
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-DATA-IN
             TO  H-KJN-YMD-D            OF  H-TKMZMS00-D,
                 WK-KJN-YMD             OF  WK-MSG-1-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-TBL-ID-4     =["SQL-TBL-ID-4"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-D  OF  H-TKMZMS00-D=["
      D             H-RIYO-CMP-CD-D     OF  H-TKMZMS00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD-D      OF  H-TKMZMS00-D=["
      D             H-FUND-CD-D         OF  H-TKMZMS00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD-D       OF  H-TKMZMS00-D=["
      D             H-PTF-CD-D          OF  H-TKMZMS00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD-D  OF  H-TKMZMS00-D=["
      D             H-KAISI-KJN-YMD-D   OF  H-TKMZMS00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-D      OF  H-TKMZMS00-D=["
      D             H-KJN-YMD-D         OF  H-TKMZMS00-D"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
           MOVE  SQL-DELETE-1-4        TO  SQLSTMT4                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT4(1-4)   =["SQLSTMT4"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":未収収益DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZMS00 "]"                             @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZMS00  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D4 FROM :SQLSTMT4 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-008
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-4        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D4                                          @3212SEINO@@
             USING  :H-TKMZMS00-D.H-RIYO-CMP-CD-D,
                    :H-TKMZMS00-D.H-FUND-CD-D,
                    :H-TKMZMS00-D.H-PTF-CD-D,
                    :H-TKMZMS00-D.H-KAISI-KJN-YMD-D,
                    :H-TKMZMS00-D.H-KJN-YMD-D
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZMS00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZMS00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZMS00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZMS00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                      ":TKMZMS00-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-009
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-4        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-4 SQL END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-5 SQL START  ***"
      *-----------------------------------------------------------------
      *----------  未収収益TBL
           MOVE  WK-TBL-TKMZMS00        TO  SQL-TBL-ID-5,
                 WK-TKMZMS00            OF  WK-MSG-1-5
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD  OF  WK-DATA-IN
             TO  H-UPD-LOGIN-CMP-CD-U   OF  H-TKMZMS00-U,
                 WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-5
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID           OF  WK-DATA-IN
             TO  H-UPD-SID-U            OF  H-TKMZMS00-U,
                 WK-UPD-SID             OF  WK-MSG-1-5
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  H-UPD-PGMID-U          OF  H-TKMZMS00-U,
                 WK-UPD-PGMID           OF  WK-MSG-1-5
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD-U        OF  H-TKMZMS00-U,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-5
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD-U            OF  H-TKMZMS00-U,
                 WK-FUND-CD             OF  WK-MSG-1-5
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD-U             OF  H-TKMZMS00-U,
                 WK-PTF-CD              OF  WK-MSG-1-5
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD       OF  WK-DATA-IN
             TO  H-KAISI-KJN-YMD-U      OF  H-TKMZMS00-U,
                 WK-KAISI-KJN-YMD       OF  WK-MSG-1-5
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-DATA-IN
             TO  H-KJN-YMD-U            OF  H-TKMZMS00-U,
                 WK-KJN-YMD             OF  WK-MSG-1-5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-TBL-ID-5     =["SQL-TBL-ID-5"]"
      D    DISPLAY  CNS-PGM-ID":H-UPD-LOGIN-CMP-CD-U  OF H-TKMZMS00-U=["
      D             H-UPD-LOGIN-CMP-CD-U  OF H-TKMZMS00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-UPD-SID-U  OF  H-TKMZMS00-U=["
      D             H-UPD-SID-U         OF  H-TKMZMS00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-UPD-PGMID-U OF H-TKMZMS00-U=["
      D             H-UPD-PGMID-U       OF  H-TKMZMS00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-U  OF  H-TKMZMS00-U=["
      D             H-RIYO-CMP-CD-U     OF  H-TKMZMS00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD-U      OF  H-TKMZMS00-U=["
      D             H-FUND-CD-U         OF  H-TKMZMS00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD-U       OF  H-TKMZMS00-U=["
      D             H-PTF-CD-U          OF  H-TKMZMS00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD-U  OF  H-TKMZMS00-U=["
      D             H-KAISI-KJN-YMD-U   OF  H-TKMZMS00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-U      OF  H-TKMZMS00-U=["
      D             H-KJN-YMD-U         OF  H-TKMZMS00-U"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT5                                         @3212SEINO@@
           MOVE  SQL-UPDATE-1-5        TO  SQLSTMT5                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT5(1-5)   =["SQLSTMT5"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":未収収益UPDカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-UPDATE-TKMZMS00 "]"                             @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-UPDATE-TKMZMS00  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE U5 FROM :SQLSTMT5 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-UPDATE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-UPDATE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-010
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-34,
                     CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-5        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE U5                                          @3212SEINO@@
             USING  :H-TKMZMS00-U.H-UPD-LOGIN-CMP-CD-U,
                    :H-TKMZMS00-U.H-UPD-SID-U,
                    :H-TKMZMS00-U.H-UPD-PGMID-U,
                    :H-TKMZMS00-U.H-RIYO-CMP-CD-U,
                    :H-TKMZMS00-U.H-FUND-CD-U,
                    :H-TKMZMS00-U.H-PTF-CD-U,
                    :H-TKMZMS00-U.H-KAISI-KJN-YMD-U,
                    :H-TKMZMS00-U.H-KJN-YMD-U
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-UPDATE-TKMZMS00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益UPDカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-UPDATE-TKMZMS00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-UPDATE-SQL処理正常（UPDATE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-UPDATE-TKMZMS00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益UPDカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-UPDATE-TKMZMS00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                      ":TKMZMS00-UPDATE-SQL処理NOTFOUND（UPDATE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-011
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-34,
                     CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-5        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-5 SQL END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-DEL-EXT.
           EXIT.
      ******************************************************************
      *        3.2.5.債券過去経過利息データ削除
      ******************************************************************
       TKMZKR00-DEL-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-6 SQL START  ***"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息TBL
           MOVE  WK-TBL-TKMZKR00        TO  SQL-TBL-ID-6,
                 WK-TKMZKR00            OF  WK-MSG-1-6
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD-D        OF  H-TKMZKR00-D,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-6
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD-D            OF  H-TKMZKR00-D,
                 WK-FUND-CD             OF  WK-MSG-1-6
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD-D             OF  H-TKMZKR00-D,
                 WK-PTF-CD              OF  WK-MSG-1-6
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD       OF  WK-DATA-IN
             TO  H-KAISI-KJN-YMD-D      OF  H-TKMZKR00-D,
                 WK-KAISI-KJN-YMD       OF  WK-MSG-1-6
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-DATA-IN
             TO  H-KJN-YMD-D            OF  H-TKMZKR00-D,
                 WK-KJN-YMD             OF  WK-MSG-1-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-TBL-ID-6     =["SQL-TBL-ID-6"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-D  OF  H-TKMZKR00-D=["
      D             H-RIYO-CMP-CD-D     OF  H-TKMZKR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD-D      OF  H-TKMZKR00-D=["
      D             H-FUND-CD-D         OF  H-TKMZKR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD-D       OF  H-TKMZKR00-D=["
      D             H-PTF-CD-D          OF  H-TKMZKR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD-D  OF  H-TKMZKR00-D=["
      D             H-KAISI-KJN-YMD-D   OF  H-TKMZKR00-D"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-D      OF  H-TKMZKR00-D=["
      D             H-KJN-YMD-D         OF  H-TKMZKR00-D"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT6                                         @3212SEINO@@
           MOVE  SQL-DELETE-1-6        TO  SQLSTMT6                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT6(1-6)   =["SQLSTMT6"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息DELカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-DELETE-TKMZKR00 "]"                       @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZKR00  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D6 FROM :SQLSTMT6 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-012
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-6        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D6                                          @3212SEINO@@
             USING  :H-TKMZKR00-D.H-RIYO-CMP-CD-D,
                    :H-TKMZKR00-D.H-FUND-CD-D,
                    :H-TKMZKR00-D.H-PTF-CD-D,
                    :H-TKMZKR00-D.H-KAISI-KJN-YMD-D,
                    :H-TKMZKR00-D.H-KJN-YMD-D
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKR00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息DELカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-DELETE-TKMZKR00 "]"                       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKR00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息DELカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-DELETE-TKMZKR00 "]"                       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                      ":TKMZKR00-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-013
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-6        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-6 SQL END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-7 SQL START  ***"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息TBL
           MOVE  WK-TBL-TKMZKR00        TO  SQL-TBL-ID-7,
                 WK-TKMZKR00            OF  WK-MSG-1-7
      *----------  更新ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD  OF  WK-DATA-IN
             TO  H-UPD-LOGIN-CMP-CD-U   OF  H-TKMZKR00-U,
                 WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-7
      *----------  更新ユーザＩＤ
           MOVE  WK-KIDOU-SID           OF  WK-DATA-IN
             TO  H-UPD-SID-U            OF  H-TKMZKR00-U,
                 WK-UPD-SID             OF  WK-MSG-1-7
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  H-UPD-PGMID-U          OF  H-TKMZKR00-U,
                 WK-UPD-PGMID           OF  WK-MSG-1-7
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD-U        OF  H-TKMZKR00-U,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-7
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD-U            OF  H-TKMZKR00-U,
                 WK-FUND-CD             OF  WK-MSG-1-7
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD-U             OF  H-TKMZKR00-U,
                 WK-PTF-CD              OF  WK-MSG-1-7
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD       OF  WK-DATA-IN
             TO  H-KAISI-KJN-YMD-U      OF  H-TKMZKR00-U,
                 WK-KAISI-KJN-YMD       OF  WK-MSG-1-7
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-DATA-IN
             TO  H-KJN-YMD-U            OF  H-TKMZKR00-U,
                 WK-KJN-YMD             OF  WK-MSG-1-7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL-TBL-ID-7     =["SQL-TBL-ID-7"]"
      D    DISPLAY  CNS-PGM-ID":H-UPD-LOGIN-CMP-CD-U  OF H-TKMZKR00-U=["
      D             H-UPD-LOGIN-CMP-CD-U  OF H-TKMZKR00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-UPD-SID-U  OF  H-TKMZKR00-U=["
      D             H-UPD-SID-U         OF  H-TKMZKR00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-UPD-PGMID-U OF H-TKMZKR00-U=["
      D             H-UPD-PGMID-U       OF  H-TKMZKR00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-U  OF  H-TKMZKR00-U=["
      D             H-RIYO-CMP-CD-U     OF  H-TKMZKR00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD-U      OF  H-TKMZKR00-U=["
      D             H-FUND-CD-U         OF  H-TKMZKR00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD-U       OF  H-TKMZKR00-U=["
      D             H-PTF-CD-U          OF  H-TKMZKR00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD-U  OF  H-TKMZKR00-U=["
      D             H-KAISI-KJN-YMD-U   OF  H-TKMZKR00-U"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD-U      OF  H-TKMZKR00-U=["
      D             H-KJN-YMD-U         OF  H-TKMZKR00-U"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT7                                         @3212SEINO@@
           MOVE  SQL-UPDATE-1-7        TO  SQLSTMT7                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT7(1-7)   =["SQLSTMT7"]"          @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息UPDカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-UPDATE-TKMZKR00 "]"                       @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-UPDATE-TKMZKR00  = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE U7 FROM :SQLSTMT7 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-014
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-34,
                     CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-7        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE U7                                          @3212SEINO@@
             USING  :H-TKMZKR00-U.H-UPD-LOGIN-CMP-CD-U,
                    :H-TKMZKR00-U.H-UPD-SID-U,
                    :H-TKMZKR00-U.H-UPD-PGMID-U,
                    :H-TKMZKR00-U.H-RIYO-CMP-CD-U,
                    :H-TKMZKR00-U.H-FUND-CD-U,
                    :H-TKMZKR00-U.H-PTF-CD-U,
                    :H-TKMZKR00-U.H-KAISI-KJN-YMD-U,
                    :H-TKMZKR00-U.H-KJN-YMD-U
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-UPDATE-TKMZKR00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息UPDカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-UPDATE-TKMZKR00 "]"                       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-UPDATE-SQL処理正常（UPDATE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-UPDATE-TKMZKR00         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息UPDカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-UPDATE-TKMZKR00 "]"                       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                      ":TKMZKR00-UPDATE-SQL処理NOTFOUND（UPDATE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-015
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-34,
                     CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-7        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  別紙1-7 SQL END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-DEL-EXT.
           EXIT.
      ******************************************************************
      *         取引差分更新管理
      ******************************************************************
       TKMZSK00-SEL-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***    取引差分更新管理から  START  ***"
      *-----------------------------------------------------------------
      *----------  取引差分更新管理(別紙1-8)CURSOR PREPARE
             PERFORM  TKMZSK00-PRE-RTN
      *----------  取引差分更新管理(別紙1-8)CURSOR OPEN
             PERFORM  TKMZSK00-OPEN-RTN
      *----------  取引差分更新管理(別紙1-8)CURSOR FETCH
             MOVE  CNS-ON               TO  FLG-TKMZSK00-FETCH
             PERFORM  TKMZSK00-FETCH-RTN
               UNTIL  FLG-TKMZSK00-FETCH = CNS-OFF
      *----------  取引差分更新管理(別紙1-8)CURSOR CLOSE
      *      PERFORM  TKMZSK00-CLOSE-RTN                                @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***    取引差分更新管理から  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSK00-SEL-EXT.
           EXIT.
      ******************************************************************
      *          取引差分更新管理(別紙1-8)CURSOR PREPARE
      ******************************************************************
       TKMZSK00-PRE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引差分更新管理(別紙1-8) "
      D             "CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZSK00,
                       H-TKMZSK00-S
      *----------  取引差分更新管理TBL
           MOVE  WK-TBL-TKMZSK00        TO  SQL-TBL-ID-8,
                 WK-TKMZSK00            OF  WK-MSG-1-8
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW02
             TO  H-RIYO-CMP-CD          OF  H-TKMZSK00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-8
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW02
             TO  H-FUND-CD              OF  H-TKMZSK00-S,
                 WK-FUND-CD             OF  WK-MSG-1-8
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW02
             TO  H-PTF-CD               OF  H-TKMZSK00-S,
                 WK-PTF-CD              OF  WK-MSG-1-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理TBL =["
      D             SQL-TBL-ID-8        OF  SQL-SELECT-1-8"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["
      D             H-RIYO-CMP-CD       OF  H-TKMZSK00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["
      D             H-FUND-CD           OF  H-TKMZSK00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMZSK00-S"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT8                                         @3212SEINO@@
           MOVE  SQL-SELECT-1-8        TO  SQLSTMT8                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT8    =["SQLSTMT8"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフラ"   @3212SEINO@@
      D             "グ_1=["FLG-TKMZSK00-CR-8"]"                        @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZSK00-CR-8 = CNS-OFF                              @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE S8 FROM :SQLSTMT8 END-EXEC                  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理 PREPARE 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取引差分更新管理SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-016
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-35,
                     CNS-SQL-MSG-SELECT,
                     WK-MSG-1-8         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL DECLARE  TKMZSK00_CUR8  CURSOR  FOR  S8  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"            @3212SEINO@@
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 取引差分更新管理(別紙1-8) "
      D             "CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSK00-PRE-EXT.
           EXIT.
      ******************************************************************
      *           取引差分更新管理(別紙1-8)CURSOR OPEN
      ******************************************************************
       TKMZSK00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引差分更新管理(別紙1-8) "
      D             "CURSOR OPEN START ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZSK00_CUR8
               USING  :H-TKMZSK00-S.H-RIYO-CMP-CD,
                      :H-TKMZSK00-S.H-FUND-CD,
                      :H-TKMZSK00-S.H-PTF-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZSK00-CR-8
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR-8=["
      D             FLG-TKMZSK00-CR-8"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取引差分更新管理SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-017
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-35,
                     CNS-SQL-MSG-SELECT,
                     WK-MSG-1-8         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引差分更新管理(別紙1-8) "
      D             "CURSOR OPEN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSK00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *           取引差分更新管理(別紙1-8)CURSOR FETCH
      ******************************************************************
       TKMZSK00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引差分更新管理(別紙1-8) "
      D             "CURSOR FETCH START ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZSK00
           EXEC  SQL
               FETCH  TKMZSK00_CUR8
                INTO  :H-TKMZSK00.H-MEG-CD,
                      :H-TKMZSK00.H-SEC-SBT-CD,
                      :H-TKMZSK00.H-TATE-FLG,
                      :H-TKMZSK00.H-GYOKU-ID,
                      :H-TKMZSK00.H-SIJO-TUKA-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード                 = ["
      D             H-MEG-CD            OF  H-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード             = ["
      D             H-SEC-SBT-CD        OF  H-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ = ["
      D             H-TATE-FLG          OF  H-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                     = ["
      D             H-GYOKU-ID          OF  H-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード             = ["
      D             H-SIJO-TUKA-CD      OF  H-TKMZSK00"]"
      *-----------------------------------------------------------------
      *----------  ①取引TBLより入金取引のデータを探す
               PERFORM  TKMXTR00-SEL-RTN
               IF  H-COUNT-YKJ-YMD      OF  H-TKMXTR00  NOT = ZERO
               THEN
                 PERFORM  CALL-SMZC9200-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取引差分更新管理 FETCH NOTFOUND"
      *-----------------------------------------------------------------
               MOVE  CNS-OFF            TO  FLG-TKMZSK00-FETCH
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":取引差分更新管理SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-018
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-35,
                       CNS-SQL-MSG-SELECT,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引差分更新管理(別紙1-8) "
      D             "CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZSK00-FETCH-EXT.
           EXIT.
      ******************************************************************
      *           取引差分更新管理(別紙1-8)CURSOR CLOSE
      ******************************************************************
      *TKMZSK00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":*** 取引差分更新管理(別紙1-8) "
      *D             "CURSOR CLOSE START ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZSK00_CUR8
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE  =["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR-8
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR-8=["
      *D             FLG-TKMZSK00-CR-8"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D             ":取引差分更新管理SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-019
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-ERR-35,
      *              CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-8         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":*** 取引差分更新管理(別紙1-8) "
      *D             "CURSOR CLOSE  END ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZSK00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *         取引TBLより入金取引のデータを探す
      ******************************************************************
       TKMXTR00-SEL-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D      ":***    取引TBLより入金取引のデータを探すから  START  ***"
      *-----------------------------------------------------------------
      *----------  (別紙1-9 SQL)CURSOR PREPARE
             PERFORM  TKMXTR00-PRE-RTN
      *----------  (別紙1-9 SQL)CURSOR OPEN
             PERFORM  TKMXTR00-OPEN-RTN
      *----------  (別紙1-9 SQL)CURSOR FETCH
             PERFORM  TKMXTR00-FETCH-RTN
      *----------  (別紙1-9 SQL)CURSOR CLOSE
      *      PERFORM  TKMXTR00-CLOSE-RTN                                @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D        ":***    取引TBLより入金取引のデータを探すから  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-SEL-EXT.
           EXIT.
      ******************************************************************
      *          (別紙1-9 SQL)CURSOR PREPARE
      ******************************************************************
       TKMXTR00-PRE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 別紙1-9 CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMXTR00,
                       H-TKMXTR00-S
      *----------  取引
           MOVE  WK-TBL-TKMXTR00        TO  SQL-TBL-ID-9,
                 WK-TKMXTR00            OF  WK-MSG-1-9
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW02
             TO  H-RIYO-CMP-CD          OF  H-TKMXTR00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-9
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW02
             TO  H-FUND-CD              OF  H-TKMXTR00-S,
                 WK-FUND-CD             OF  WK-MSG-1-9
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW02
             TO  H-PTF-CD               OF  H-TKMXTR00-S,
                 WK-PTF-CD              OF  WK-MSG-1-9
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZSK00
             TO  H-SEC-SBT-CD           OF  H-TKMXTR00-S,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-9
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZSK00
             TO  H-MEG-CD               OF  H-TKMXTR00-S,
                 WK-MEG-CD              OF  WK-MSG-1-9
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZSK00
             TO  H-TATE-FLG             OF  H-TKMXTR00-S,
                 WK-TATE-FLG            OF  WK-MSG-1-9
      *----------  玉ＩＤ
           MOVE  H-GYOKU-ID             OF  H-TKMZSK00
             TO  H-GYOKU-ID             OF  H-TKMXTR00-S,
                 WK-GYOKU-ID            OF  WK-MSG-1-9
      *----------  基本会計ベースフラグ
           MOVE  WK-KH-KAIKEI-BASE-FLG    OF  WK-TKMZBW02
             TO  H-KIHON-KAIKEI-BASE-FLG  OF  H-TKMXTR00-S,
                 WK-KIHON-KAIKEI-BASE-FLG OF  WK-MSG-1-9
      *----------  開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT  OF  WK-TKMZBW02
             TO  H-KAISI-KJN-YMD-NEXT   OF  H-TKMXTR00-S,
                 WK-KAISI-KJN-YMD-NEXT  OF  WK-MSG-1-9
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW02
             TO  H-KJN-YMD              OF  H-TKMXTR00-S,
                 WK-KJN-YMD             OF  WK-MSG-1-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引                = ["
      D             SQL-TBL-ID-9        OF  SQL-SELECT-1-9"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      = ["
      D             H-RIYO-CMP-CD       OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      = ["
      D             H-FUND-CD           OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード= ["
      D             H-PTF-CD            OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード      = ["
      D             H-SEC-SBT-CD        OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          = ["
      D             H-MEG-CD            OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ= ["
      D             H-TATE-FLG          OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ              = ["
      D             H-GYOKU-ID          OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ= ["
      D             H-KIHON-KAIKEI-BASE-FLG    OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日    = ["
      D             H-KAISI-KJN-YMD-NEXT OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":基準日              = ["
      D             H-KJN-YMD           OF  H-TKMXTR00-S"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT9                                         @3212SEINO@@
           MOVE  SQL-SELECT-1-9        TO  SQLSTMT9                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT9    =["SQLSTMT9"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引SELカーソルオープンフラグ_1=["      @3212SEINO@@
      D             FLG-TKMXTR00-CR-9"]"                                @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMXTR00-CR-9 = CNS-OFF                              @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE S9 FROM :SQLSTMT9 END-EXEC                  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":別紙1-9 CURSOR PREPARE 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":別紙1-9  SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-020
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-35,
                     CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL DECLARE  TKMXTR00_CUR9  CURSOR  FOR  S9  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"            @3212SEINO@@
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 別紙1-9 CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-PRE-EXT.
           EXIT.
      ******************************************************************
      *           (別紙1-9 SQL)CURSOR OPEN
      ******************************************************************
       TKMXTR00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** (別紙1-9 SQL) CURSOR OPEN START ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMXTR00_CUR9
               USING  :H-TKMXTR00-S.H-RIYO-CMP-CD,
                      :H-TKMXTR00-S.H-FUND-CD,
                      :H-TKMXTR00-S.H-PTF-CD,
                      :H-TKMXTR00-S.H-FUND-CD,
                      :H-TKMXTR00-S.H-SEC-SBT-CD,
                      :H-TKMXTR00-S.H-MEG-CD,
                      :H-TKMXTR00-S.H-TATE-FLG,
                      :H-TKMXTR00-S.H-GYOKU-ID,
                      :H-TKMXTR00-S.H-SEC-SBT-CD,
                      :H-TKMXTR00-S.H-KIHON-KAIKEI-BASE-FLG,
                      :H-TKMXTR00-S.H-KAISI-KJN-YMD-NEXT,
                      :H-TKMXTR00-S.H-KJN-YMD,
                      :H-TKMXTR00-S.H-KIHON-KAIKEI-BASE-FLG,
                      :H-TKMXTR00-S.H-KAISI-KJN-YMD-NEXT,
                      :H-TKMXTR00-S.H-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMXTR00-CR-9
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-9=["
      D             FLG-TKMXTR00-CR-9"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":別紙1-9  SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-021
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-35,
                     CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** (別紙1-9 SQL) CURSOR OPEN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *           (別紙1-9 SQL)  CURSOR FETCH
      ******************************************************************
       TKMXTR00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 別紙1-9  CURSOR FETCH START ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMXTR00
           EXEC  SQL
               FETCH  TKMXTR00_CUR9
                INTO  :H-TKMXTR00.H-UKE-YMD,
                      :H-TKMXTR00.H-YKJ-YMD,
                      :H-TKMXTR00.H-COUNT-YKJ-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH = ["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":MIN(受渡日)   = ["
      D             H-UKE-YMD           OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":MIN(約定日)   = ["
      D             H-YKJ-YMD           OF  H-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID":COUNT(約定日) = ["
      D             H-COUNT-YKJ-YMD     OF  H-TKMXTR00"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
             WHEN  CNS-SQL-NOTFOUND
             WHEN  CNS-SQL-1405
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":別紙1-9  SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-022
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-35,
                       CNS-SQL-MSG-SELECT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 別紙1-9  CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-FETCH-EXT.
           EXIT.
      ******************************************************************
      *           (別紙1-9 SQL)CURSOR CLOSE
      ******************************************************************
      *TKMXTR00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  別紙1-9  CURSOR CLOSE START ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMXTR00_CUR9
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE  =["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMXTR00-CR-9
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-9=["
      *D             FLG-TKMXTR00-CR-9"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":別紙1-9  SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-023
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-ERR-35,
      *              CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-9         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  別紙1-9  CURSOR CLOSE END ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMXTR00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *       【SMZC9200】取引差分更新管理更新用ルーチン
      ******************************************************************
       CALL-SMZC9200-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL  SMZC9200 START  ***"
      *-----------------------------------------------------------------
      *----------  機能区分
           MOVE  CNS-X-1
             TO  MENU-KINOU-KBN         OF  PARM-SMZC9200-ARG1
      *----------  更新データ区分
           MOVE  CNS-X-1
             TO  UPD-DATA-KBN           OF  PARM-SMZC9200-ARG1
      *----------  OL/BT区分
           MOVE  CNS-BT
             TO  OL-BT-KBN              OF  PARM-SMZC9200-ARG1
      *----------  物の更新データ
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW02
             TO  RIYO-CMP-CD            OF  PARM-SMZC9200-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW02
             TO  FUND-CD                OF  PARM-SMZC9200-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW02
             TO  PTF-CD                 OF  PARM-SMZC9200-ARG2
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZSK00
             TO  SEC-SBT-CD             OF  PARM-SMZC9200-ARG2
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZSK00
             TO  MEG-CD                 OF  PARM-SMZC9200-ARG2
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZSK00
             TO  TATE-FLG               OF  PARM-SMZC9200-ARG2
      *----------  玉ID
           MOVE  H-GYOKU-ID             OF  H-TKMZSK00
             TO  GYOKU-ID               OF  PARM-SMZC9200-ARG2
      *----------  市場通貨コード
           MOVE  H-SIJO-TUKA-CD         OF  H-TKMZSK00
             TO  SIJO-TUKA-CD           OF  PARM-SMZC9200-ARG2
      *----------  約定日
           MOVE  H-YKJ-YMD              OF  H-TKMXTR00
             TO  YKJ-YMD                OF  PARM-SMZC9200-ARG2
      *----------  受渡日
           MOVE  H-UKE-YMD              OF  H-TKMXTR00
             TO  UKE-YMD                OF  PARM-SMZC9200-ARG2
      *----------  最終有効日
           MOVE  CNS-99991231
             TO  LAST-YUKO-YMD          OF  PARM-SMZC9200-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":機能区分                = ["
      D             MENU-KINOU-KBN      OF  PARM-SMZC9200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新データ区分          = ["
      D             UPD-DATA-KBN        OF  PARM-SMZC9200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":OL/BT区分               = ["
      D             OL-BT-KBN           OF  PARM-SMZC9200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":物の更新データ"
      D    DISPLAY  CNS-PGM-ID":利用会社コード          = ["
      D             RIYO-CMP-CD         OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード          = ["
      D             FUND-CD             OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード    = ["
      D             PTF-CD              OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード          = ["
      D             SEC-SBT-CD          OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード              = ["
      D             MEG-CD              OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ= ["
      D             TATE-FLG            OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                    = ["
      D             GYOKU-ID            OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード          = ["
      D             SIJO-TUKA-CD        OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":約定日                  = ["
      D             YKJ-YMD             OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":受渡日                  = ["
      D             UKE-YMD             OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":最終有効日              = ["
      D             LAST-YUKO-YMD       OF  PARM-SMZC9200-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "SMZC9200"             USING  PARM-SMZC9200-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC9200)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG          =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             CONTINUE
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-024
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL  SMZC9200 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SMZC9200-EXT.
           EXIT.
      ******************************************************************
      *          C/A取引の取引差分更新管理再セット
      ******************************************************************
       MX-TKMZSK00-SEL-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***    C/A取引の取引差分更新管理から"
      D                       "  START  ***"
      *-----------------------------------------------------------------
      *----------  取引TBLよりC/A取引のデータを探す(別紙1-10)CURSOR PREPARE
             PERFORM  MX-MZ-PRE-RTN
      *----------  取引TBLよりC/A取引のデータを探す(別紙1-10)CURSOR OPEN
             PERFORM  MX-MZ-OPEN-RTN
      *----------  取引TBLよりC/A取引のデータを探す(別紙1-10)CURSOR FETCH
             MOVE  CNS-ON               TO  FLG-MX-TKMZSK00-FETCH
             PERFORM  MX-MZ-FETCH-RTN
               UNTIL  FLG-MX-TKMZSK00-FETCH = CNS-OFF
      *----------  取引TBLよりC/A取引のデータを探す(別紙1-10)CURSOR CLOSE
      *      PERFORM  MX-MZ-CLOSE-RTN                                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***    C/A取引の取引差分更新管理から"
      D    DISPLAY            "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MX-TKMZSK00-SEL-EXT.
           EXIT.
      ******************************************************************
      *          C/A取引の取引差分更新管理(別紙1-10)CURSOR PREPARE
      ******************************************************************
       MX-MZ-PRE-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  C/A取引の取引差分更新管理"
      D             "(別紙1-10) CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMXTR00-CA
                       H-TKMXTR00-CA-S
      *----------  取引TBL
           MOVE  WK-TBL-TKMXTR00        TO  SQL-TBL-ID-10,
                 WK-TKMXTR00            OF  WK-MSG-1-10
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW02
             TO  H-RIYO-CMP-CD          OF  H-TKMXTR00-CA-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-10
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW02
             TO  H-FUND-CD              OF  H-TKMXTR00-CA-S,
                 WK-FUND-CD             OF  WK-MSG-1-10
      *----------  ポートフォリオコード
           MOVE  SPACE
             TO  H-PTF-CD               OF  H-TKMXTR00-CA-S,
                 WK-PTF-CD              OF  WK-MSG-1-10
      *----------  基本会計ベースフラグ
           MOVE  WK-KH-KAIKEI-BASE-FLG  OF  WK-TKMZBW02
             TO  H-KIHON-KAIKEI-BASE-FLG  OF  H-TKMXTR00-CA-S
           IF WK-KH-KAIKEI-BASE-FLG     OF  WK-TKMZBW02 = CNS-X-1 THEN
             MOVE  CNS-YKJ
               TO  WK-KYJ-UKE           OF  WK-MSG-1-10
           ELSE
             CONTINUE
           END-IF
           IF WK-KH-KAIKEI-BASE-FLG     OF  WK-TKMZBW02 = CNS-X-2 THEN
             MOVE  CNS-UKE
               TO  WK-KYJ-UKE           OF  WK-MSG-1-10
           ELSE
             CONTINUE
           END-IF
      *----------  開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT  OF  WK-TKMZBW02
             TO  H-KAISI-KJN-YMD-NEXT   OF  H-TKMXTR00-CA-S,
                 WK-KAISI-KJN-YMD-NEXT  OF  WK-MSG-1-10
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW02
             TO  H-KJN-YMD              OF  H-TKMXTR00-CA-S,
                 WK-KJN-YMD             OF  WK-MSG-1-10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引TBL =["
      D             SQL-TBL-ID-10       OF  SQL-SELECT-1-10"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["
      D             H-RIYO-CMP-CD       OF  H-TKMXTR00-CA-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["
      D             H-FUND-CD           OF  H-TKMXTR00-CA-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-TKMXTR00-CA-S"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日    =["
      D             H-KAISI-KJN-YMD-NEXT OF  H-TKMXTR00-CA-S"]"
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ=["
      D             H-KIHON-KAIKEI-BASE-FLG  OF  H-TKMXTR00-CA-S"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["
      D             H-KJN-YMD           OF  H-TKMXTR00-CA-S"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT10                                        @3212SEINO@@
           MOVE  SQL-SELECT-1-10        TO  SQLSTMT10                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT10    =["SQLSTMT10"]"            @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引SELカーソルオープンフラグ_2=["      @3212SEINO@@
      D             FLG-TKMXTR00-CR-10"]"                               @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMXTR00-CR-10 = CNS-OFF                             @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE S10 FROM :SQLSTMT10 END-EXEC                @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":C/A取引の取引差分更新管理 PREPARE 正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":C/A取引の取引差分更新管理SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-35,
                     CNS-SQL-MSG-SELECT,
                     WK-MSG-1-10         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL DECLARE  TKMXTR00_CUR10  CURSOR  FOR  S10  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"            @3212SEINO@@
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"           @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** C/A取引の取引差分更新管理(別紙1-10)"
      D             " CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MX-MZ-PRE-EXT.
           EXIT.
      ******************************************************************
      *           C/A取引の取引差分更新管理(別紙1-10)CURSOR OPEN
      ******************************************************************
       MX-MZ-OPEN-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** C/A取引の取引差分更新管理(別紙1-10)"
      D             " CURSOR OPEN START ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMXTR00_CUR10
               USING  :H-TKMXTR00-CA-S.H-RIYO-CMP-CD,
                      :H-TKMXTR00-CA-S.H-FUND-CD,
                      :H-TKMXTR00-CA-S.H-PTF-CD,
                      :H-TKMXTR00-CA-S.H-KIHON-KAIKEI-BASE-FLG,
                      :H-TKMXTR00-CA-S.H-KAISI-KJN-YMD-NEXT,
                      :H-TKMXTR00-CA-S.H-KJN-YMD,
                      :H-TKMXTR00-CA-S.H-KIHON-KAIKEI-BASE-FLG,
                      :H-TKMXTR00-CA-S.H-KAISI-KJN-YMD-NEXT,
                      :H-TKMXTR00-CA-S.H-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMXTR00-CR-10
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-10=["
      D             FLG-TKMXTR00-CR-10"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":C/A取引取引差分更新管理SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-026
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-35,
                     CNS-SQL-MSG-SELECT,
                     WK-MSG-1-10        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** C/A取引の取引差分更新管理(別紙1-10)"
      D             " CURSOR OPEN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MX-MZ-OPEN-EXT.
           EXIT.
      ******************************************************************
      *           C/A取引の取引差分更新管理(別紙1-10)CURSOR FETCH
      ******************************************************************
       MX-MZ-FETCH-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** C/A取引の取引差分更新管理(別紙1-10)"
      D             " CURSOR FETCH START ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMXTR00-CA
           EXEC  SQL
               FETCH  TKMXTR00_CUR10
                INTO  :H-TKMXTR00-CA.H-SEC-SBT-CD,
                      :H-TKMXTR00-CA.H-MEG-CD,
                      :H-TKMXTR00-CA.H-TATE-FLG,
                      :H-TKMXTR00-CA.H-GYOKU-ID,
                      :H-TKMXTR00-CA.H-SIJO-TUKA-CD,
                      :H-TKMXTR00-CA.H-YKJ-YMD,
                      :H-TKMXTR00-CA.H-UKE-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券種別コード             = ["
      D             H-SEC-SBT-CD        OF  H-TKMXTR00-CA"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード                 = ["
      D             H-MEG-CD            OF  H-TKMXTR00-CA"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ = ["
      D             H-TATE-FLG          OF  H-TKMXTR00-CA"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ                     = ["
      D             H-GYOKU-ID          OF  H-TKMXTR00-CA"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード             = ["
      D             H-SIJO-TUKA-CD      OF  H-TKMXTR00-CA"]"
      D    DISPLAY  CNS-PGM-ID":約定日                     = ["
      D             H-YKJ-YMD           OF  H-TKMXTR00-CA"]"
      D    DISPLAY  CNS-PGM-ID":受渡日                     = ["
      D             H-UKE-YMD           OF  H-TKMXTR00-CA"]"
      *-----------------------------------------------------------------
      *----------  【SMZC9200】取引差分更新管理更新用ルーチンに接続用パラメータの設定を行なう
               PERFORM  CALL-SMZC9200-2-RTN
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":C/A取引の取引差分更新管理 FETCH NOTFOUND"
      *-----------------------------------------------------------------
               MOVE  CNS-OFF            TO  FLG-MX-TKMZSK00-FETCH
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":C/A取引の取引差分更新管理SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-027
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-35,
                       CNS-SQL-MSG-SELECT,
                       WK-MSG-1-10       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** C/A取引の取引差分更新管理(別紙1-10)"
      D             " CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MX-MZ-FETCH-EXT.
           EXIT.
      ******************************************************************
      *           C/A取引の取引差分更新管理(別紙1-10)CURSOR CLOSE
      ******************************************************************
      *MX-MZ-CLOSE-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":*** C/A取引の取引差分更新管理(別紙1-10)"
      *D             " CURSOR CLOSE START ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMXTR00_CUR10
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE  =["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMXTR00-CR-10
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-10=["
      *D             FLG-TKMXTR00-CR-10"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D             ":C/A取引の取引差分更新管理SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-028
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-ERR-35,
      *              CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-10         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":*** C/A取引の取引差分更新管理(別紙1-10)"
      *D             " CURSOR CLOSE  END ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *MX-MZ-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *       【SMZC9200】取引差分更新管理更新用ルーチン
      ******************************************************************
       CALL-SMZC9200-2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL  SMZC9200 START  ***"
      *-----------------------------------------------------------------
      *----------  機能区分
           MOVE  CNS-X-1
             TO  MENU-KINOU-KBN         OF  PARM-SMZC9200-ARG1
      *----------  更新データ区分
           MOVE  CNS-X-1
             TO  UPD-DATA-KBN           OF  PARM-SMZC9200-ARG1
      *----------  OL/BT区分
           MOVE  CNS-BT
             TO  OL-BT-KBN              OF  PARM-SMZC9200-ARG1
      *----------  物の更新データ
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW02
             TO  RIYO-CMP-CD            OF  PARM-SMZC9200-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW02
             TO  FUND-CD                OF  PARM-SMZC9200-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW02
             TO  PTF-CD                 OF  PARM-SMZC9200-ARG2
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMXTR00-CA
             TO  SEC-SBT-CD             OF  PARM-SMZC9200-ARG2
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMXTR00-CA
             TO  MEG-CD                 OF  PARM-SMZC9200-ARG2
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMXTR00-CA
             TO  TATE-FLG               OF  PARM-SMZC9200-ARG2
      *----------  玉ID
           MOVE  H-GYOKU-ID             OF  H-TKMXTR00-CA
             TO  GYOKU-ID               OF  PARM-SMZC9200-ARG2
      *----------  市場通貨コード
           MOVE  H-SIJO-TUKA-CD         OF  H-TKMXTR00-CA
             TO  SIJO-TUKA-CD           OF  PARM-SMZC9200-ARG2
      *----------  約定日
           MOVE  H-YKJ-YMD              OF  H-TKMXTR00-CA
             TO  YKJ-YMD                OF  PARM-SMZC9200-ARG2
      *----------  受渡日
           MOVE  H-UKE-YMD              OF  H-TKMXTR00-CA
             TO  UKE-YMD                OF  PARM-SMZC9200-ARG2
      *----------  最終有効日
           MOVE  CNS-99991231
             TO  LAST-YUKO-YMD          OF  PARM-SMZC9200-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":機能区分                = ["
      D             MENU-KINOU-KBN      OF  PARM-SMZC9200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新データ区分          = ["
      D             UPD-DATA-KBN        OF  PARM-SMZC9200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":OL/BT区分               = ["
      D             OL-BT-KBN           OF  PARM-SMZC9200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":物の更新データ"
      D    DISPLAY  CNS-PGM-ID":利用会社コード          = ["
      D             RIYO-CMP-CD         OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード          = ["
      D             FUND-CD             OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード    = ["
      D             PTF-CD              OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード          = ["
      D             SEC-SBT-CD          OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード              = ["
      D             MEG-CD              OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ= ["
      D             TATE-FLG            OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                    = ["
      D             GYOKU-ID            OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード          = ["
      D             SIJO-TUKA-CD        OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":約定日                  = ["
      D             YKJ-YMD             OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":受渡日                  = ["
      D             UKE-YMD             OF  PARM-SMZC9200-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":最終有効日              = ["
      D             LAST-YUKO-YMD       OF  PARM-SMZC9200-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "SMZC9200"             USING  PARM-SMZC9200-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC9200)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG          =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             CONTINUE
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-029
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL  SMZC9200 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SMZC9200-2-EXT.
           EXIT.
      ******************************************************************
      *                 3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   後処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1711-ARG1=["
      D             PARM-SMZJ1711-ARG1  OF PARM-SMZJ1711-INOUT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1711-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ1711-ARG3     = ["
      D      PARM-SMZJ1711-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ1711-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ1711-ARG3(COUNTER  OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ1711-ARG3(COUNTER  OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ1711-ARG3(COUNTER  OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ1711-ARG3(COUNTER  OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ1711-ARG3(COUNTER  OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ1711-ARG3(COUNTER  OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *                 3.4.1 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":取引SELカーソルオープンフラグ_1=["      @3212SEINO@@
      D             FLG-TKMXTR00-CR-9"]"
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフラ"   @3212SEINO@@
      D             "グ_1= ["FLG-TKMZSK00-CR-8"]"
      D    DISPLAY  CNS-PGM-ID":取引SELカーソルオープンフラグ_2=["      @3212SEINO@@
      D             FLG-TKMXTR00-CR-10"]"                               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":未収収益DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZMS00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":未収収益UPDカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-UPDATE-TKMZMS00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息DELカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-DELETE-TKMZKR00 "]"                       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息UPDカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-UPDATE-TKMZKR00 "]"                       @3212SEINO@@
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ1711-ARG1    OF PARM-SMZJ1711-INOUT
      *----------  残高履歴DELカーソルオープンフラグ                    @3212SEINO@@
           IF  FLG-DELETE-TKMZZR00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZZR00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  元本残高DELカーソルオープンフラグ                    @3212SEINO@@
           IF  FLG-DELETE-TKMZGZ00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZGZ00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  資金残履歴DELカーソルオープンフラグ                  @3212SEINO@@
           IF  FLG-DELETE-TKMZSR00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZSR00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  未収収益DELカーソルオープンフラグ                    @3212SEINO@@
           IF  FLG-DELETE-TKMZMS00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZMS00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  未収収益UPDカーソルオープンフラグ                    @3212SEINO@@
           IF  FLG-UPDATE-TKMZMS00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-UPDATE-TKMZMS00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  債券過去経過利息DELカーソルオープンフラグ            @3212SEINO@@
           IF  FLG-DELETE-TKMZKR00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZKR00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  債券過去経過利息UPDカーソルオープンフラグ            @3212SEINO@@
           IF  FLG-UPDATE-TKMZKR00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-UPDATE-TKMZKR00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  SQL1-9 CURSOR CLOSE処理
           IF  FLG-TKMXTR00-CR-9  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMXTR00_CUR9"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMXTR00_CUR9
             END-EXEC
             MOVE  CNS-OFF            TO  FLG-TKMXTR00-CR-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-9=["
      D             FLG-TKMXTR00-CR-9"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00_CUR9 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  SQL1-8 CURSOR CLOSE処理
           IF  FLG-TKMZSK00-CR-8  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZSK00_CUR8"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZSK00_CUR8
             END-EXEC
             MOVE  CNS-OFF            TO  FLG-TKMZSK00-CR-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR-8=["
      D             FLG-TKMZSK00-CR-8"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSK00_CUR8 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  SQL1-10 CURSOR CLOSE処理
           IF  FLG-TKMXTR00-CR-10  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE FLG-TKMXTR00-CR-10"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMXTR00_CUR10
             END-EXEC
             MOVE  CNS-OFF            TO  FLG-TKMXTR00-CR-10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE =[" SQLCODE "]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-10=["
      D             FLG-TKMXTR00-CR-10"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMXTR00-CR-10 CLOSE処理を行かない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":未収収益DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZMS00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":未収収益UPDカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-UPDATE-TKMZMS00 "]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息DELカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-DELETE-TKMZKR00 "]"                       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息UPDカーソルオープンフラ"@3212SEINO@@
      D             "グ=["FLG-UPDATE-TKMZKR00 "]"                       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1711-ARG1=["
      D             PARM-SMZJ1711-ARG1       OF PARM-SMZJ1711-INOUT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1711-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ1711-ARG3     = ["
      D      PARM-SMZJ1711-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ1711-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ1711-ARG3(COUNTER   OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ1711-ARG3(COUNTER   OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ1711-ARG3(COUNTER   OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ1711-ARG3(COUNTER   OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ1711-ARG3(COUNTER   OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ1711-ARG3(COUNTER   OF PARM-SMZJ1711-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1711処理  異常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
