      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ1820.pco
      * プログラム名称 : 対象取引決定と処理順決定（資金）
      * 処理概要       : 資金取引テーブルからデータを抽出して、ソート処理を行って、対象資金取引に挿入する
      * 参照ＤＢ       : 処理資金取引（TKMZBW18）
      *                : 対象資金取引情報（TKMZBW05）
      *                : 資金取引（TKMXST00）
      * 更新ＤＢ       : 処理資金取引（TKMZBW18）
      *                : 対象資金取引情報（TKMZBW05）
      * 引数           : IN  銘柄別断面情報
      *                : IN  基準日断面情報
      *                : IN  異動計算パターン
      *                : OUT 資金取引SELECT件数
      *                : OUT RTNパッケージ
      * VERSION  1.00
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- ----  ---------  ------  ------------------------
      * 20080317  新規  SCS        趙迎慶  新規作成
      * 20080813  修正  SCS        趙迎慶  残タスク20 残高
      * 20090305  修正  SCS        顧建鋒  残タスク196対応
      * 20090309  修正  SCS        顧建鋒  残タスク195対応
      * 20090625  修正  SCS        王飛    総合障害1163
      * 20090702  修正  SCS        徐曉俊  総合障害690
      * 20091203  修正  SCS        王飛    テーマ2078
      * 20100201  修正  SCS        楊歓    GIPS2.0性能
      * 20110421  修正  SCS        シャ建  性能改善対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ1820.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-03-17.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ1820".
         05  CNS-TBL-TKMXST00      PIC  X(08)  VALUE  "TKMXST00".
         05  CNS-TBL-TKMZBW05      PIC  X(08)  VALUE  "TKMZBW05".
         05  CNS-TBL-TKMZBW18      PIC  X(08)  VALUE  "TKMZBW18".
         05  CNS-RTN-140           PIC  X(03)  VALUE  "140".
         05  CNS-1                 PIC  9(01)  VALUE  1.
         05  CNS-3                 PIC  9(01)  VALUE  3.
         05  CNS-0                 PIC  9(01)  VALUE  0.
         05  CNS-X-1               PIC  X(01)  VALUE  '1'.
         05  CNS-X-2               PIC  X(01)  VALUE  '2'.
         05  CNS-X-8               PIC  X(01)  VALUE  '8'.
         05  CNS-X-9               PIC  X(01)  VALUE  '9'.
      *----------  異動計算パターン.処理順序
         05  CNS-SYRI-JUN-1        PIC  X(01)  VALUE  "1".
         05  CNS-SYRI-JUN-2        PIC  X(01)  VALUE  "2".
         05  CNS-SYRI-JUN-3        PIC  X(01)  VALUE  "3".
         05  CNS-SYRI-JUN-4        PIC  X(01)  VALUE  "4".
         05  CNS-SYRI-JUN-5        PIC  X(01)  VALUE  "5".
         05  CNS-SYRI-JUN-6        PIC  X(01)  VALUE  "6".
         05  CNS-SYRI-JUN-7        PIC  X(01)  VALUE  "7".
         05  CNS-SYRI-JUN-8        PIC  X(01)  VALUE  "8".
      *----------  異動計算パターン.増減取引順
         05  CNS-ZOUGEN-TORI-JUN-1 PIC  X(01)  VALUE  "1".
         05  CNS-ZOUGEN-TORI-JUN-2 PIC  X(01)  VALUE  "2".
      *----------  資金取引.増減区分
         05  CNS-ZG-KBN-1          PIC  X(01)  VALUE  "1".
         05  CNS-ZG-KBN-2          PIC  X(01)  VALUE  "2".
      *----------  判定対象区分
         05  CNS-HANTEI-TARGET-KBN-1
                                   PIC  X(01)  VALUE  "1".
      *----------  b:資金取引処理順区分
         05  CNS-SIKIN-JUN-KBN-B   PIC  X(01)  VALUE  "b".
      *----------  異動計算パターン.増加取引処理順序
         05  CNS-GKYK-SYRI-JUN-1
                                   PIC  X(01)  VALUE  "1".
         05  CNS-GKYK-SYRI-JUN-2
                                   PIC  X(01)  VALUE  "2".
         05  CNS-GKYK-SYRI-JUN-3
                                   PIC  X(01)  VALUE  "3".
      *----------  処理順決定摘要
         05  CNS-SRJUN-KT-TEKIYO-01
                                   PIC  S9(01)  VALUE  +1.
         05  CNS-SRJUN-KT-TEKIYO-02
                                   PIC  S9(01)  VALUE  +2.
         05  CNS-SRJUN-KT-TEKIYO-03
                                   PIC  S9(01)  VALUE  +3.
         05  CNS-SRJUN-KT-TEKIYO-04
                                   PIC  S9(01)  VALUE  +4.
         05  CNS-SRJUN-KT-TEKIYO-05
                                   PIC  S9(01)  VALUE  +5.
         05  CNS-SRJUN-KT-TEKIYO-06
                                   PIC  S9(01)  VALUE  +6.
         05  CNS-SRJUN-KT-TEKIYO-07
                                   PIC  S9(01)  VALUE  +7.
         05  CNS-SRJUN-KT-TEKIYO-08
                                   PIC  S9(01)  VALUE  +8.
         05  CNS-SRJUN-KT-TEKIYO-09
                                   PIC  S9(01)  VALUE  +9.
         05  CNS-SRJUN-KT-TEKIYO-10
                                   PIC  S9(02)  VALUE  +10.
         05  CNS-SRJUN-KT-TEKIYO-11
                                   PIC  S9(02)  VALUE  +11.
         05  CNS-SRJUN-KT-TEKIYO-12
                                   PIC  S9(02)  VALUE  +12.
         05  CNS-SRJUN-KT-TEKIYO-13
                                   PIC  S9(02)  VALUE  +13.
         05  CNS-SRJUN-KT-TEKIYO-14
                                   PIC  S9(02)  VALUE  +14.
         05  CNS-SRJUN-KT-TEKIYO-15
                                   PIC  S9(02)  VALUE  +15.
         05  CNS-SRJUN-KT-TEKIYO-16
                                   PIC  S9(02)  VALUE  +16.
         05  CNS-SRJUN-KT-TEKIYO-17
                                   PIC  S9(02)  VALUE  +17.
         05  CNS-SRJUN-KT-TEKIYO-18
                                   PIC  S9(02)  VALUE  +18.
         05  CNS-SRJUN-KT-TEKIYO-19
                                   PIC  S9(02)  VALUE  +19.
      *----------  処理順決定増減
         05  CNS-SRJUN-KT-ZOUGEN-01
                                   PIC  9(02)  VALUE  1.
         05  CNS-SRJUN-KT-ZOUGEN-02
                                   PIC  9(02)  VALUE  2.
         05  CNS-SRJUN-KT-ZOUGEN-03
                                   PIC  9(02)  VALUE  3.
         05  CNS-SRJUN-KT-ZOUGEN-04
                                   PIC  9(02)  VALUE  4.
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
             " SQL-MSG(SELECT):".
         05  CNS-SQL-MSG-INSERT    PIC  X(17)  VALUE
             " SQL-MSG(INSERT):".
         05  CNS-SQL-MSG-UPDATE    PIC  X(17)  VALUE
             " SQL-MSG(UPDATE):".
      ******************************************************************
      *    フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  処理資金取引カーソルオープンフラグ
      *  05  FLG-TKMZBW18-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  処理資金取引循環フラグ
         05  FLG-TKMZBW18-CR-FETCH
                                   PIC  9(01).
      *----------  対象資金取引情報1 カーソルオープンフラグ
      *  05  FLG-TKMZBW05-CR-OPEN-1                                     @3212SEINO@@
      *                            PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引情報2 カーソルオープンフラグ
      *  05  FLG-TKMZBW05-CR-OPEN-2                                     @3212SEINO@@
      *                            PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引情報1フラグ
         05  FLG-TKMZBW05-CR-FETCH-1
                                   PIC  9(01).
      *----------  対象資金取引情報2フラグ
         05  FLG-TKMZBW05-CR-FETCH-2
                                   PIC  9(01).
      ******************************************************************@3212SEINO@@
      *         フラグエリア２(PREPARE,DECLAREスキップ判定用)           @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FLG-AREA2.                                                   @3212SEINO@@
      *----------  処理資金取引カーソルオープンフラグ                   @3212SEINO@@
         05  FLG-TKMZBW18-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引カーソルオープンフラグA                  @3212SEINO@@
         05  FLG-TKMZBW18-TKMXST00-A                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引カーソルオープンフラグB                  @3212SEINO@@
         05  FLG-TKMZBW18-TKMXST00-B                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引情報INSカーソルオープンフラグ１          @3212SEINO@@
         05  FLG-INSERT-TKMZBW05-CR1                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引情報INSカーソルオープンフラグ２          @3212SEINO@@
         05  FLG-INSERT-TKMZBW05-CR2                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引情報カーソルオープンフラグ_1             @3212SEINO@@
         05  FLG-TKMZBW05-CR-OPEN-1                                     @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引情報カーソルオープンフラグ_1             @3212SEINO@@
         05  FLG-TKMZBW05-CR-OPEN-2                                     @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  対象資金取引情報UPDカーソルオープンフラグ            @3212SEINO@@
         05  FLG-UPDATE-TKMZBW05   PIC  9(01).                          @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *                複数回起動チェック用スイッチ                     @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FIRST-SW                PIC  X(03)  VALUE 'YES'.             @3212SEINO@@
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      *----------  ワーク増幅用処理順決定増減
         05  WK-SB-SRJ-KT-ZOUGEN   PIC  S9(02).
         05  WK-SMZJ1820.
           10  WK-PARM-SMZJ1820-ARG1.
      *----------  銘柄別断面情報
             15  WK-TKMZBW03.
      *----------  処理実行日
               20  WK-SYORI-YMD    PIC  S9(08).
      *----------  起動ID
               20  WK-KIDOU-ID     PIC  X(04).
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  開始基準日
               20  WK-KAISI-KJN-YMD
                                   PIC  S9(08).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  差分更新From日
               20  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *----------  基準日断面情報
             15  WK-TKMZBW02.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  基本会計ベースフラグ
               20  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  開始基準日の翌日
               20  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  仕訳基準パターンコード
               20  WK-SWK-KJN-PTN-CD
                                   PIC  X(08).
      *----------  異動計算パターン
             15  WK-IDO-CALC-PATTERN.
      *----------  適用（先処理）１
               20  WK-TEKIYO-SAKI-SYRI1
                                   PIC  X(04).
      *----------  適用（先処理）２
               20  WK-TEKIYO-SAKI-SYRI2
                                   PIC  X(04).
      *----------  適用（先処理）３
               20  WK-TEKIYO-SAKI-SYRI3
                                   PIC  X(04).
      *----------  適用（先処理）４
               20  WK-TEKIYO-SAKI-SYRI4
                                   PIC  X(04).
      *----------  適用（先処理）５
               20  WK-TEKIYO-SAKI-SYRI5
                                   PIC  X(04).
      *----------  適用（先処理）６
               20  WK-TEKIYO-SAKI-SYRI6
                                   PIC  X(04).
      *----------  適用（先処理）７
               20  WK-TEKIYO-SAKI-SYRI7
                                   PIC  X(04).
      *----------  適用（先処理）８
               20  WK-TEKIYO-SAKI-SYRI8
                                   PIC  X(04).
      *----------  適用（先処理）９
               20  WK-TEKIYO-SAKI-SYRI9
                                   PIC  X(04).
      *----------  適用（後処理）１
               20  WK-TEKIYO-ATO-SYRI1
                                   PIC  X(04).
      *----------  適用（後処理）２
               20  WK-TEKIYO-ATO-SYRI2
                                   PIC  X(04).
      *----------  適用（後処理）３
               20  WK-TEKIYO-ATO-SYRI3
                                   PIC  X(04).
      *----------  適用（後処理）４
               20  WK-TEKIYO-ATO-SYRI4
                                   PIC  X(04).
      *----------  適用（後処理）５
               20  WK-TEKIYO-ATO-SYRI5
                                   PIC  X(04).
      *----------  適用（後処理）６
               20  WK-TEKIYO-ATO-SYRI6
                                   PIC  X(04).
      *----------  適用（後処理）７
               20  WK-TEKIYO-ATO-SYRI7
                                   PIC  X(04).
      *----------  適用（後処理）８
               20  WK-TEKIYO-ATO-SYRI8
                                   PIC  X(04).
      *----------  適用（後処理）９
               20  WK-TEKIYO-ATO-SYRI9
                                   PIC  X(04).
      *----------  増減取引順
               20  WK-ZOUGEN-TORI-JUN
                                   PIC  X(01).
      *----------  増加取引処理順序
               20  WK-GKYK-PLUS-SYRI-JUN
                                   PIC  X(01).
      *----------  減少取引処理順序
               20  WK-GKYK-MINUS-SYRI-JUN
                                   PIC  X(01).
      *----------  処理順序
               20  WK-SYRI-JUN
                                   PIC  X(01).
      *----------  TABLEＩＤ
         05  WK-TABLE-TKMXST00     PIC  X(13).
         05  WK-TABLE-TKMZBW05     PIC  X(13).
         05  WK-TABLE-TKMZBW18     PIC  X(13).
      *----------  適用グループ
         05  WK-TKYU-GROUP         OCCURS  19.
      *----------  適用処理
           10  WK-TKYU-SYORI       PIC  X(04).
      *----------  ワーク処理順
         05  WK-SRZ                PIC  S9(08).
      *----------  ワーク処理順決定摘要
         05  WK-SRJUN-KT-TEKIYO-1  PIC  S9(02).
      *----------  処理順決定評価
         05  WK-SRJUN-KT-HYOKA-1   PIC  S9(02).
         05  WK-TKMZBW18-1-1.
      *----------  原取引ＩＤ
           10  WK-TORI-ID          PIC  S9(10).
      *----------  資金種別
           10  WK-SIKIN-SBT        PIC  X(01).
      *----------  異動日
           10  WK-IDO-YMD          PIC  S9(08).
      *----------  増減区分
           10  WK-ZG-KBN           PIC  X(01).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
         05  WK-SMZJ1922.
      *---------- 受渡計上切替対象フラグ
           10  WK-UKE-KIRIKAE-FLG  PIC  X(01).
      *---------- 受渡計上切替対象情報
           10  WK-UKE-KIRIKAE-INF.
      *---------- 仕訳基準パターンコード
             15  WK-SWK-KJN-PTN-CD PIC  X(08).
      *---------- キャッシュフロー2回有効フラグ
             15  WK-CASH-FLOW-2-FLG
                                   PIC  X(01).
      *----------  基本会計ベースフラグ
             15  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *---------- 受渡増幅未払未収処理フラグ
           10  WK-UKE-MIMI-FLG     PIC  X(01).
      *---------- ワーク資金取引処理順区分
         05  WK-SIKIN-JUN-KBN      PIC  X(01).
      *---------- バルクINSERT用COUNT IDX1
         05  WK-IDX1               PIC  9(04).
      *---------- バルクINSERT増幅データ用COUNT IDX2
         05  WK-IDX2               PIC  9(04).
      *---------- 順序決定用COUNT IDX3
         05  WK-IDX3               PIC  9(04).
      *---------- ワーク区間件数
         05  WK-KUKAN-KENSUU       PIC  9(04).
      *---------- ワーク合計件数
         05  WK-GOUKEI-KENSUU      PIC  9(04).
      *---------- ワーク区間件数順序決定用
         05  WK-KUKAN-KENSUU-2     PIC  9(04).
      *---------- ワーク合計件数順序決定用
         05  WK-GOUKEI-KENSUU-2    PIC  9(04).
      ******************************************************************
      *    ＯＲＡＣＬＥホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  処理資金取引(別紙1-1)
         05  H-TKMZBW18.
           10  H-TKMZBW18-O             OCCURS  100.
      *----------  原取引ＩＤ
             15  H-TORI-ID         PIC  S9(10).
      *----------  資金種別
             15  H-SIKIN-SBT       PIC  X(01).
      *----------  異動日
             15  H-IDO-YMD         PIC  S9(08).
      *----------  増減区分
             15  H-ZG-KBN          PIC  X(01).
      *----------  取引事由
             15  H-TORI-JIYU       PIC  X(04).
      *----------  証券種別コード
             15  H-SEC-SBT-CD      PIC  X(04).
      *----------  処理資金取引(別紙1-1)
         05  H-TKMZBW18-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  決済口座番号
           10  H-KS-KOZA-NO        PIC  X(15).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  対象資金取引情報(別紙1-2)
         05  H-TKMZBW05-I.
           10  H-TKMZBW05-I-O           OCCURS  100.
      *----------  処理実行日
             15  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
             15  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
             15  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD            PIC  X(04).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD     PIC  S9(08).
      *----------  基準日
             15  H-KJN-YMD           PIC  S9(08).
      *----------  銘柄コード
             15  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
             15  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID          PIC  X(10).
      *----------  原取引ID
             15  H-TORI-ID           PIC  S9(10).
      *----------  資金種別
             15  H-SIKIN-SBT         PIC  X(01).
      *----------  異動日
             15  H-IDO-YMD           PIC  S9(08).
      *----------  増減区分
             15  H-ZG-KBN            PIC  X(01).
      *----------  処理順決定摘要
             15  H-SRJUN-KT-TEKIYO   PIC  S9(02).
      *----------  処理順決定増減
             15  H-SRJUN-KT-ZOUGEN   PIC  S9(02).
      *----------  処理順決定評価
             15  H-SRJUN-KT-HYOKA    PIC  S9(02).
      *---------- 受渡計上切替対象フラグ
             15  H-UKE-KIRIKAE-FLG   PIC  X(01).
      *---------- 仕訳基準パターンコード
             15  H-SWK-KJN-PTN-CD    PIC  X(08).
      *---------- キャッシュフロー2回有効フラグ
             15  H-CASH-FLOW-2-FLG   PIC  X(01).
      *----------  基本会計ベースフラグ
             15  H-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  受渡未払未収増幅フラグ
             15  H-UKE-MBMS-ZF-FLG   PIC  X(01).
      *----------  更新ログインユーザ会社コード
             15  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  対象資金取引情報増幅データ(別紙1-7)
         05  H-TKMZBW05-II.
           10  H-TKMZBW05-II-O          OCCURS  100.
      *----------  処理実行日
             15  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
             15  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
             15  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD            PIC  X(04).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD     PIC  S9(08).
      *----------  基準日
             15  H-KJN-YMD           PIC  S9(08).
      *----------  銘柄コード
             15  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
             15  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID          PIC  X(10).
      *----------  原取引ID
             15  H-TORI-ID           PIC  S9(10).
      *----------  資金種別
             15  H-SIKIN-SBT         PIC  X(01).
      *----------  異動日
             15  H-IDO-YMD           PIC  S9(08).
      *----------  増減区分
             15  H-ZG-KBN            PIC  X(01).
      *----------  処理順決定摘要
             15  H-SRJUN-KT-TEKIYO   PIC  S9(02).
      *----------  処理順決定増減
             15  H-SRJUN-KT-ZOUGEN   PIC  S9(02).
      *----------  処理順決定評価
             15  H-SRJUN-KT-HYOKA    PIC  S9(02).
      *---------- 受渡計上切替対象フラグ
             15  H-UKE-KIRIKAE-FLG   PIC  X(01).
      *---------- 仕訳基準パターンコード
             15  H-SWK-KJN-PTN-CD    PIC  X(08).
      *---------- キャッシュフロー2回有効フラグ
             15  H-CASH-FLOW-2-FLG   PIC  X(01).
      *----------  基本会計ベースフラグ
             15  H-KH-KAIKEI-BASE-FLG
                                     PIC  X(01).
      *----------  受渡未払未収増幅フラグ
             15  H-UKE-MBMS-ZF-FLG   PIC  X(01).
      *----------  更新ログインユーザ会社コード
             15  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  対象資金取引情報(別紙1-3)
         05  H-TKMZBW05-1.
           10  H-TKMZBW05-1-O           OCCURS  100.
      *----------  原取引ID
             15  H-TORI-ID           PIC  S9(10).
      *----------  資金種別
             15  H-SIKIN-SBT         PIC  X(01).
      *----------  異動日
             15  H-IDO-YMD           PIC  S9(08).
      *----------  増減区分
             15  H-ZG-KBN            PIC  X(01).
      *----------  対象資金取引情報(別紙1-3)
         05  H-TKMZBW05-S-1.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  対象資金取引情報(別紙1-4)
         05  H-TKMZBW05-2.
           10  H-TKMZBW05-2-O           OCCURS  100.
      *----------  処理順
             15  H-SRJUN             PIC  S9(08).
      *----------  対象資金取引情報(別紙1-4)
         05  H-TKMZBW05-U-2.
           10  H-TKMZBW05-U-2-O         OCCURS  100.
      *----------  処理実行日
             15  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
             15  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
             15  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD            PIC  X(04).
      *----------  基準日
             15  H-KJN-YMD           PIC  S9(08).
      *----------  銘柄コード
             15  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
             15  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID          PIC  X(10).
      *----------  原取引ID
             15  H-TORI-ID           PIC  S9(10).
      *----------  資金種別
             15  H-SIKIN-SBT         PIC  X(01).
      *----------  異動日
             15  H-IDO-YMD           PIC  S9(08).
      *----------  増減区分
             15  H-ZG-KBN            PIC  X(01).
      *----------  対象資金取引情報(別紙1-5)
         05  H-TKMZBW05-3.
           10  H-TKMZBW05-3-O           OCCURS  100.
      *----------  原取引ID
             15  H-TORI-ID           PIC  S9(10).
      *----------  資金種別
             15  H-SIKIN-SBT         PIC  X(01).
      *----------  異動日
             15  H-IDO-YMD           PIC  S9(08).
      *----------  増減区分
             15  H-ZG-KBN            PIC  X(01).
      *----------  対象資金取引情報(別紙1-5)
         05  H-TKMZBW05-S-3.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  処理資金取引（TKMZBW18）資金取引（TKMXST00）(別紙1-6)
         05  H-TKMZBW18-TKMXST00.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  処理資金取引（TKMZBW18）資金取引（TKMXST00）(別紙1-6)
         05  H-TKMZBW18-TKMXST00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  決済口座番号
           10  H-KS-KOZA-NO        PIC  X(15).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  HST-基準日
         05  H-KJN-YMD-H           PIC  S9(08).
      *----------  件数
         05  HST-CNT               PIC  S9(03)  COMP.
      *  05  SQLSTMT               PIC  X(5000).                        @3212SEINO@@
         05  SQLSTMT1              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT2              PIC  X(750).                         @3212SEINO@@
         05  SQLSTMT3              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT4              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT5              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT6A             PIC  X(900).                         @3212SEINO@@
         05  SQLSTMT6B             PIC  X(900).                         @3212SEINO@@
         05  SQLSTMT7              PIC  X(800).                         @3212SEINO@@
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *            SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  処理資金取引SQL文(別紙1-1)
         05  SQL-SELECT-1-1.
           10  S-SELECT-1-1.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID1       PIC  X(13).
           10  S-WHERE-1-1.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND (".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(19)  VALUE
               " PTF_CD=:P_PTF_CD )".
             15  FILLER            PIC  X(04)  VALUE
               " OR ".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(16)  VALUE
               " PTF_CD='    ' )".
             15  FILLER            PIC  X(06)  VALUE
               ") AND ".
      *----------  決済口座番号
             15  FILLER            PIC  X(22)  VALUE
               " KS_KOZA_NO =:P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  異動日
             15  FILLER            PIC  X(46)  VALUE
               " IDO_YMD BETWEEN :P_HST_KJN_YMD AND :P_KJN_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  処理実行日
             15  FILLER            PIC  X(25)  VALUE
               " SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(23)  VALUE
               " KIDOU_ID = :P_KIDOU_ID".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
               " ORDER BY ".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               " IDO_YMD".
      *----------  対象資金取引SQL文(別紙1-2)
         05  SQL-INSERT-1-2.
           10  S-INSERT-1-2.
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID2       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  処理実行日
             15  FILLER            PIC  X(10)  VALUE
               "SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(09)  VALUE
               "KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  開始基準日
             15  FILLER            PIC  X(14)  VALUE
               "KAISI_KJN_YMD,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ID
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  処理順
             15  FILLER            PIC  X(06)  VALUE
               "SRJUN,".
      *----------  処理順決定摘要
             15  FILLER            PIC  X(16)  VALUE
               "SRJUN_KT_TEKIYO,".
      *----------  処理順決定増減
             15  FILLER            PIC  X(16)  VALUE
               "SRJUN_KT_ZOUGEN,".
      *----------  処理順決定評価
             15  FILLER            PIC  X(15)  VALUE
               "SRJUN_KT_HYOKA,".
      *----------  受渡計上切替対象フラグ
             15  FILLER            PIC  X(17)  VALUE
               "UKE_KJ_KK_TS_FLG,".
      *----------  切替仕訳基準パターンコード
             15  FILLER            PIC  X(18)  VALUE
               "KK_SWK_KJN_PTN_CD,".
      *----------  切替キャッシュフロー２回有効フラグ
             15  FILLER            PIC  X(16)  VALUE
               "KK_CF_NK_YK_FLG,".
      *----------  切替基本会計ベースフラグ
             15  FILLER            PIC  X(18)  VALUE
               "KK_KH_KK_BASE_FLG,".
      *----------  受渡未払未収増幅フラグ
             15  FILLER            PIC  X(16)  VALUE
               "UKE_MBMS_ZF_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
             15  FILLER            PIC  X(08)  VALUE
               " VALUES(".
      *----------  処理実行日
             15  FILLER            PIC  X(13)  VALUE
               ":P_SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(12)  VALUE
               ":P_KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE
               ":P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE
               ":P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE
               ":P_PTF_CD,".
      *----------  開始基準日
             15  FILLER            PIC  X(17)  VALUE
               ":P_KAISI_KJN_YMD,".
      *----------  基準日
             15  FILLER            PIC  X(11)  VALUE
               ":P_KJN_YMD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(10)  VALUE
               ":P_MEG_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(14)  VALUE
               ":P_SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE
               ":P_TATE_FLG,".
      *----------  玉ID
             15  FILLER            PIC  X(12)  VALUE
               ":P_GYOKU_ID,".
      *----------  原取引ID
             15  FILLER            PIC  X(11)  VALUE
               ":P_TORI_ID,".
      *----------  資金種別
             15  FILLER            PIC  X(13)  VALUE
               ":P_SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(11)  VALUE
               ":P_IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(10)  VALUE
               ":P_ZG_KBN,".
      *----------  処理順
             15  FILLER            PIC  X(02)  VALUE
               "0,".
      *----------  処理順決定摘要
             15  FILLER            PIC  X(19)  VALUE
               ":P_SRJUN_KT_TEKIYO,".
      *----------  処理順決定増減
             15  FILLER            PIC  X(19)  VALUE
               ":P_SRJUN_KT_ZOUGEN,".
      *----------  処理順決定評価
             15  FILLER            PIC  X(18)  VALUE
               ":P_SRJUN_KT_HYOKA,".
      *----------  受渡計上切替対象フラグ
             15  FILLER            PIC  X(20)  VALUE
               ":P_UKE_KJ_KK_TS_FLG,".
      *----------  切替仕訳基準パターンコード
             15  FILLER            PIC  X(21)  VALUE
               ":P_KK_SWK_KJN_PTN_CD,".
      *----------  切替キャッシュフロー２回有効フラグ
             15  FILLER            PIC  X(19)  VALUE
               ":P_KK_CF_NK_YK_FLG,".
      *----------  切替基本会計ベースフラグ
             15  FILLER            PIC  X(21)  VALUE
               ":P_KK_KH_KK_BASE_FLG,".
      *----------  受渡未払未収増幅フラグ
             15  FILLER            PIC  X(19)  VALUE
               ":P_UKE_MBMS_ZF_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(04)  VALUE
               "' ',".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "'SMZJ1820')".
      *----------  対象資金取引SQL文(別紙1-3)
         05  SQL-SELECT-1-3.
           10  S-SELECT-1-3.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID3       PIC  X(13).
           10  S-WHERE-1-3.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(16)  VALUE
               "PTF_CD=:P_PTF_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  基準日
             15  FILLER            PIC  X(18)  VALUE
               "KJN_YMD=:P_KJN_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(16)  VALUE
               "MEG_CD=:P_MEG_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(24)  VALUE
               "SEC_SBT_CD=:P_SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(20)  VALUE
               "TATE_FLG=:P_TATE_FLG".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  玉ID
             15  FILLER            PIC  X(20)  VALUE
               "GYOKU_ID=:P_GYOKU_ID".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
               " ORDER BY ".
      *----------  異動日
             15  FILLER            PIC  X(09)  VALUE
               " IDO_YMD,".
      *----------  処理順決定評価
             15  FILLER            PIC  X(16)  VALUE
               " SRJUN_KT_HYOKA,".
      *----------  処理順決定摘要
             15  FILLER            PIC  X(17)  VALUE
               " SRJUN_KT_TEKIYO,".
      *----------  原取引ID
             15  FILLER            PIC  X(13)  VALUE
               " TORI_ID ASC,".
      *----------  資金種別
             15  FILLER            PIC  X(15)  VALUE
               " SIKIN_SBT DESC".
      *----------  対象資金取引SQL文(別紙1-4)
         05  SQL-UPDATE-1-4.
           10  S-UPDATE-1-4.
             15  FILLER            PIC  X(07)  VALUE
               "UPDATE ".
             15  SQL-TBL-ID4       PIC  X(13).
             15  FILLER            PIC  X(05)  VALUE
               " SET ".
      *----------  処理順
             15  FILLER            PIC  X(14)  VALUE
               "SRJUN=:P_SRJUN".
           10  S-WHERE-1-4.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(16)  VALUE
               "PTF_CD=:P_PTF_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  基準日
             15  FILLER            PIC  X(18)  VALUE
               "KJN_YMD=:P_KJN_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(16)  VALUE
               "MEG_CD=:P_MEG_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(24)  VALUE
               "SEC_SBT_CD=:P_SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(20)  VALUE
               "TATE_FLG=:P_TATE_FLG".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  玉ID
             15  FILLER            PIC  X(20)  VALUE
               "GYOKU_ID=:P_GYOKU_ID".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  原取引ID
             15  FILLER            PIC  X(18)  VALUE
               "TORI_ID=:P_TORI_ID".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  資金種別
             15  FILLER            PIC  X(22)  VALUE
               "SIKIN_SBT=:P_SIKIN_SBT".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  異動日
             15  FILLER            PIC  X(18)  VALUE
               "IDO_YMD=:P_IDO_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  増減区分
             15  FILLER            PIC  X(18)  VALUE
               "ZG_KBN=:PZG_KBN".
      *----------  対象資金取引SQL文(別紙1-5)
         05  SQL-SELECT-1-5.
           10  S-SELECT-1-5.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID5       PIC  X(13).
           10  S-WHERE-1-5.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(22)  VALUE
               "SYORI_YMD=:P_SYORI_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(20)  VALUE
               "KIDOU_ID=:P_KIDOU_ID".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(16)  VALUE
               "PTF_CD=:P_PTF_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  基準日
             15  FILLER            PIC  X(18)  VALUE
               "KJN_YMD=:P_KJN_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(16)  VALUE
               "MEG_CD=:P_MEG_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(24)  VALUE
               "SEC_SBT_CD=:P_SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(20)  VALUE
               "TATE_FLG=:P_TATE_FLG".
             15  FILLER            PIC  X(06)  VALUE
               " AND ".
      *----------  玉ID
             15  FILLER            PIC  X(20)  VALUE
               "GYOKU_ID=:P_GYOKU_ID".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
               " ORDER BY ".
      *----------  異動日
             15  FILLER            PIC  X(09)  VALUE
               " IDO_YMD,".
      *----------  処理順決定評価
             15  FILLER            PIC  X(16)  VALUE
               " SRJUN_KT_HYOKA,".
      *----------  処理順決定増減
             15  FILLER            PIC  X(17)  VALUE
               " SRJUN_KT_ZOUGEN,".
      *----------  原取引ID
             15  FILLER            PIC  X(13)  VALUE
               " TORI_ID ASC,".
      *----------  資金種別
             15  FILLER            PIC  X(15)  VALUE
               " SIKIN_SBT DESC".
      *----------  処理資金取引（TKMZBW18）資金取引（TKMXST00）(別紙1-6)
         05  SQL-INSERT-1-6.
           10  S-INSERT-1-6.
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID6       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  処理実行日
             15  FILLER            PIC  X(10)  VALUE
               "SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(09)  VALUE
               "KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  決済口座番号
             15  FILLER            PIC  X(11)  VALUE
               "KS_KOZA_NO,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "KOZA_TUKA_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  取引連関ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "THRK_ID,".
      *----------  入力管理ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "NRKR_ID,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  取引内容
             15  FILLER            PIC  X(10)  VALUE
               "TORI_NAIY,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  決済通貨異動額
             15  FILLER            PIC  X(10)  VALUE
               "KSTK_IDOG,".
      *----------  運用通貨異動額
             15  FILLER            PIC  X(10)  VALUE
               "UYTK_IDOG,".
      *----------  異動確定区分
             15  FILLER            PIC  X(08)  VALUE
               "IDO_KBN,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE
               "UPD_PGMID ) ".
           10  S-SELECT-1-6.
      *----------  SELECT
             15  FILLER            PIC  X(08)  VALUE
               "(SELECT ".
      *----------  処理実行日
             15  FILLER            PIC  X(13)  VALUE
               ":P_SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(12)  VALUE
               ":P_KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  決済口座番号
             15  FILLER            PIC  X(11)  VALUE
               "KS_KOZA_NO,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "KOZA_TUKA_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE
               "SIJO_TUKA_CD,".
      *----------  取引連関ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "THRK_ID,".
      *----------  入力管理ＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "NRKR_ID,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE
               "SAKUJO_KBN,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE
               "AKA_KBN,".
      *----------  取引内容
             15  FILLER            PIC  X(10)  VALUE
               "TORI_NAIY,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE
               "TORI_JIYU,".
      *----------  決済通貨異動額
             15  FILLER            PIC  X(10)  VALUE
               "KSTK_IDOG,".
      *----------  運用通貨異動額
             15  FILLER            PIC  X(10)  VALUE
               "UYTK_IDOG,".
      *----------  異動確定区分
             15  FILLER            PIC  X(08)  VALUE
               "IDO_KBN,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(10)  VALUE
               "UPD_PGMID ".
             15  FILLER            PIC  X(05)  VALUE
               "FROM ".
             15  SQL-TBL-ID6-1     PIC  X(13).
           10  S-WHERE-1-6.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE
               " AND (".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(19)  VALUE
               " PTF_CD=:P_PTF_CD )".
             15  FILLER            PIC  X(04)  VALUE
               " OR ".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(16)  VALUE
               " PTF_CD='    ' )".
             15  FILLER            PIC  X(06)  VALUE
               ") AND ".
      *----------  決済口座番号
             15  FILLER            PIC  X(22)  VALUE
               " KS_KOZA_NO =:P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE
               " AND ".
      *----------  異動日
             15  FILLER            PIC  X(47)  VALUE
               " IDO_YMD BETWEEN :P_HST_KJN_YMD AND :P_KJN_YMD ".
         05  SQL-WHERE-1-6-2.
      *----------  資金種別
           10  FILLER              PIC  X(32)  VALUE
               "AND ( SIKIN_SBT IN ('0','1') OR ".
      *----------  資金種別
           10  FILLER              PIC  X(29)  VALUE
               " (SIKIN_SBT IN ('8','9') AND ".
      *----------  増減区分
           10  FILLER              PIC  X(15)  VALUE
               "ZG_KBN = '2')))".
         05  SQL-WHERE-1-6-3.
           10  FILLER              PIC  X(01)  VALUE
               ")".
      *----------  対象資金取引情報に増幅データSQL文(別紙1-7)
         05  SQL-INSERT-1-7.
           10  S-INSERT-1-7.
             15  FILLER            PIC  X(12)  VALUE  "INSERT INTO ".
             15  SQL-TBL-ID7       PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " (".
      *----------  処理実行日
             15  FILLER            PIC  X(10)  VALUE
               "SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(09)  VALUE
               "KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  開始基準日
             15  FILLER            PIC  X(14)  VALUE
               "KAISI_KJN_YMD,".
      *----------  基準日
             15  FILLER            PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ID
             15  FILLER            PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  資金種別
             15  FILLER            PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  処理順
             15  FILLER            PIC  X(06)  VALUE
               "SRJUN,".
      *----------  処理順決定摘要
             15  FILLER            PIC  X(16)  VALUE
               "SRJUN_KT_TEKIYO,".
      *----------  処理順決定増減
             15  FILLER            PIC  X(16)  VALUE
               "SRJUN_KT_ZOUGEN,".
      *----------  処理順決定評価
             15  FILLER            PIC  X(15)  VALUE
               "SRJUN_KT_HYOKA,".
      *----------  受渡計上切替対象フラグ
             15  FILLER            PIC  X(17)  VALUE
               "UKE_KJ_KK_TS_FLG,".
      *----------  切替仕訳基準パターンコード
             15  FILLER            PIC  X(18)  VALUE
               "KK_SWK_KJN_PTN_CD,".
      *----------  切替キャッシュフロー２回有効フラグ
             15  FILLER            PIC  X(16)  VALUE
               "KK_CF_NK_YK_FLG,".
      *----------  切替基本会計ベースフラグ
             15  FILLER            PIC  X(18)  VALUE
               "KK_KH_KK_BASE_FLG,".
      *----------  受渡未払未収増幅フラグ
             15  FILLER            PIC  X(16)  VALUE
               "UKE_MBMS_ZF_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "UPD_PGMID) ".
             15  FILLER            PIC  X(08)  VALUE
               " VALUES(".
      *----------  処理実行日
             15  FILLER            PIC  X(13)  VALUE
               ":P_SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(12)  VALUE
               ":P_KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE
               ":P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE
               ":P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE
               ":P_PTF_CD,".
      *----------  開始基準日
             15  FILLER            PIC  X(17)  VALUE
               ":P_KAISI_KJN_YMD,".
      *----------  基準日
             15  FILLER            PIC  X(11)  VALUE
               ":P_KJN_YMD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(10)  VALUE
               ":P_MEG_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(14)  VALUE
               ":P_SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE
               ":P_TATE_FLG,".
      *----------  玉ID
             15  FILLER            PIC  X(12)  VALUE
               ":P_GYOKU_ID,".
      *----------  原取引ID
             15  FILLER            PIC  X(11)  VALUE
               ":P_TORI_ID,".
      *----------  資金種別
             15  FILLER            PIC  X(13)  VALUE
               ":P_SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(11)  VALUE
               ":P_IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(10)  VALUE
               ":P_ZG_KBN,".
      *----------  処理順
             15  FILLER            PIC  X(02)  VALUE
               "0,".
      *----------  処理順決定摘要
             15  FILLER            PIC  X(19)  VALUE
               ":P_SRJUN_KT_TEKIYO,".
      *----------  処理順決定増減
             15  FILLER            PIC  X(19)  VALUE
               ":P_SRJUN_KT_ZOUGEN,".
      *----------  処理順決定評価
             15  FILLER            PIC  X(18)  VALUE
               ":P_SRJUN_KT_HYOKA,".
      *----------  受渡計上切替対象フラグ
             15  FILLER            PIC  X(20)  VALUE
               ":P_UKE_KJ_KK_TS_FLG,".
      *----------  切替仕訳基準パターンコード
             15  FILLER            PIC  X(21)  VALUE
               ":P_KK_SWK_KJN_PTN_CD,".
      *----------  切替キャッシュフロー２回有効フラグ
             15  FILLER            PIC  X(19)  VALUE
               ":P_KK_CF_NK_YK_FLG,".
      *----------  切替基本会計ベースフラグ
             15  FILLER            PIC  X(21)  VALUE
               ":P_KK_KH_KK_BASE_FLG,".
      *----------  受渡未払未収増幅フラグ
             15  FILLER            PIC  X(19)  VALUE
               ":P_UKE_MBMS_ZF_FLG,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
               "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
               ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(04)  VALUE
               "' ',".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(11)  VALUE
               "'SMZJ1820')".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- SELECT SQL文(別紙1-1)
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW18         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE
               "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE
               "' AND (".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE
               "( FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE
               " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE
               "' ) OR ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE
               "( FUND_CD='".
           10  WK-FUND-CD-1        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(16)  VALUE
               " PTF_CD='    ' )".
           10  FILLER              PIC  X(06)  VALUE
               ") AND ".
      *----------  決済口座番号
           10  FILLER              PIC  X(13)  VALUE
               " KS_KOZA_NO='".
           10  WK-KS-KOZA-NO       PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  異動日
           10  FILLER              PIC  X(17)  VALUE
               " IDO_YMD BETWEEN ".
           10  WK-H-KJN-YMD-H      PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  処理実行日
           10  FILLER              PIC  X(13)  VALUE
               " SYORI_YMD = ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(12)  VALUE
               " KIDOU_ID = ".
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE
               " ORDER BY ".
      *----------  異動日
           10  FILLER              PIC  X(08)  VALUE
               " IDO_YMD".
      *---------- INSERT SQL文(別紙1-2)
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW05         PIC  X(13).
           10  FILLER              PIC  X(17)  VALUE
               "), INSERT DATA ( ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD,".
      *----------  起動ID
           10  FILLER              PIC  X(09)  VALUE
               "KIDOU_ID,".
      *----------  利用会社コード
           10  FILLER              PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  開始基準日
           10  FILLER              PIC  X(14)  VALUE
               "KAISI_KJN_YMD,".
      *----------  基準日
           10  FILLER              PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  銘柄コード
           10  FILLER              PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  証券種別コード
           10  FILLER              PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ID
           10  FILLER              PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  原取引ID
           10  FILLER              PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  資金種別
           10  FILLER              PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
           10  FILLER              PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
           10  FILLER              PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  処理順
           10  FILLER              PIC  X(06)  VALUE
               "SRJUN,".
      *----------  処理順決定摘要
           10  FILLER              PIC  X(16)  VALUE
               "SRJUN_KT_TEKIYO,".
      *----------  処理順決定増減
           10  FILLER              PIC  X(16)  VALUE
               "SRJUN_KT_ZOUGEN,".
      *----------  処理順決定評価
           10  FILLER              PIC  X(15)  VALUE
               "SRJUN_KT_HYOKA,".
      *----------  受渡計上切替対象フラグ
           10  FILLER              PIC  X(17)  VALUE
               "UKE_KJ_KK_TS_FLG,".
      *----------  切替仕訳基準パターンコード
           10  FILLER              PIC  X(18)  VALUE
               "KK_SWK_KJN_PTN_CD,".
      *----------  切替キャッシュフロー２回有効フラグ
           10  FILLER              PIC  X(16)  VALUE
               "KK_CF_NK_YK_FLG,".
      *----------  切替基本会計ベースフラグ
           10  FILLER              PIC  X(18)  VALUE
               "KK_KH_KK_BASE_FLG,".
      *----------  受渡未払未収増幅フラグ
           10  FILLER              PIC  X(16)  VALUE
               "UKE_MBMS_ZF_FLG,".
      *----------  更新日時
           10  FILLER              PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE
               "UPD_PGMID) ".
           10  FILLER              PIC  X(08)  VALUE
               " VALUES(".
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  開始基準日
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  基準日
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  銘柄コード
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  資産負債・買建売建フラグ
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  玉ID
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  原取引ID
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  資金種別
           10  WK-SIKIN-SBT        PIC  X(01).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  異動日
           10  WK-IDO-YMD          PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  増減区分
           10  WK-ZG-KBN           PIC  X(01).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  処理順
           10  FILLER              PIC  X(02)  VALUE
               "0,".
      *----------  処理順決定摘要
           10  WK-SRJUN-KT-TEKIYO
                                   PIC  S9(02).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  処理順決定増減
           10  WK-SRJUN-KT-ZOUGEN
                                   PIC  S9(02).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  処理順決定評価
           10  WK-SRJUN-KT-HYOKA
                                   PIC  S9(02).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  受渡計上切替対象フラグ
           10  WK-UKE-KIRIKAE-FLG  PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  仕訳基準パターンコード
           10  WK-SWK-KJN-PTN-CD   PIC  X(08).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  キャッシュフロー2回有効フラグ
           10  WK-CASH-FLOW-2-FLG  PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  基本会計ベースフラグ
           10  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  受渡未払未収増幅フラグ
           10  WK-UKE-MBMS-ZF-FLG  PIC  X(01).
      *----------  更新日時
           10  FILLER              PIC  X(11)  VALUE
               "',SYSDATE,'".
      *----------  更新ログインユーザ会社コード
           10  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(04)  VALUE
               "' ',".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE
               "'SMZJ1820')".
      *---------- SELECT SQL文(別紙1-3)
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW05         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(22)  VALUE
               "SYORI_YMD= ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE
               "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE
               "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE
               "PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  基準日
           10  FILLER              PIC  X(08)  VALUE
               "KJN_YMD=".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE
               " AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE
               "MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE
               "SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE
               "TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  玉ID
           10  FILLER              PIC  X(10)  VALUE
               "GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE
               " ORDER BY ".
      *----------  異動日
           10  FILLER              PIC  X(09)  VALUE
               " IDO_YMD,".
      *----------  処理順決定評価
           10  FILLER              PIC  X(16)  VALUE
               " SRJUN_KT_HYOKA,".
      *----------  処理順決定摘要
           10  FILLER              PIC  X(17)  VALUE
               " SRJUN_KT_TEKIYO,".
      *----------  原取引ID
           10  FILLER              PIC  X(13)  VALUE
               " TORI_ID ASC,".
      *----------  資金種別
           10  FILLER              PIC  X(15)  VALUE
               " SIKIN_SBT DESC".
      *----------  UPDATE SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW05         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(12)  VALUE
               " UPDATE SET ".
      *----------  処理順
           10  FILLER              PIC  X(06)  VALUE
               "SRJUN=".
           10  WK-SRJUN            PIC  S9(08).
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(11)  VALUE
               "SYORI_YMD= ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE
               "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE
               "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE
               "PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  基準日
           10  FILLER              PIC  X(08)  VALUE
               "KJN_YMD=".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE
               " AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE
               "MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE
               "SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE
               "TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  玉ID
           10  FILLER              PIC  X(10)  VALUE
               "GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  原取引ID
           10  FILLER              PIC  X(08)  VALUE
               "TORI_ID=".
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(06)  VALUE
               " AND ".
      *----------  資金種別
           10  FILLER              PIC  X(11)  VALUE
               "SIKIN_SBT='".
           10  WK-SIKIN-SBT        PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  異動日
           10  FILLER              PIC  X(08)  VALUE
               "IDO_YMD=".
           10  WK-IDO-YMD          PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE
               " AND ".
      *----------  増減区分
           10  FILLER              PIC  X(08)  VALUE
               "ZG_KBN='".
           10  WK-ZG-KBN           PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SELECT SQL文(別紙1-5)
         05  WK-MSG-1-5.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW05         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(11)  VALUE
               "SYORI_YMD= ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE
               " AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE
               "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE
               "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE
               "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)  VALUE
               "PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  基準日
           10  FILLER              PIC  X(08)  VALUE
               "KJN_YMD=".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE
               " AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)  VALUE
               "MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)  VALUE
               "SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)  VALUE
               "TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  玉ID
           10  FILLER              PIC  X(10)  VALUE
               "GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *----------  ORDER BY
           10  FILLER              PIC  X(10)  VALUE
               " ORDER BY ".
      *----------  異動日
           10  FILLER              PIC  X(09)  VALUE
               " IDO_YMD,".
      *----------  処理順決定評価
           10  FILLER              PIC  X(16)  VALUE
               " SRJUN_KT_HYOKA,".
      *----------  処理順決定増減
           10  FILLER              PIC  X(17)  VALUE
               " SRJUN_KT_ZOUGEN,".
      *----------  原取引ID
           10  FILLER              PIC  X(13)  VALUE
               " TORI_ID ASC,".
      *----------  資金種別
           10  FILLER              PIC  X(15)  VALUE
               " SIKIN_SBT DESC".
      *---------- INSERT SQL文(別紙1-6)
         05  WK-MSG-1-6.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW18         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               "TBL-ID(".
           10  WK-TKMXST00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE
               "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE
               "' AND (".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE
               "( FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE
               " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE
               "' ) OR ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE
               "( FUND_CD='".
           10  WK-FUND-CD-1        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(16)  VALUE
               " PTF_CD='    ' )".
           10  FILLER              PIC  X(06)  VALUE
               ") AND ".
      *----------  決済口座番号
           10  FILLER              PIC  X(13)  VALUE
               " KS_KOZA_NO='".
           10  WK-KS-KOZA-NO       PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE
               "' AND ".
      *----------  異動日
           10  FILLER              PIC  X(17)  VALUE
               " IDO_YMD BETWEEN ".
           10  WK-H-KJN-YMD-H      PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- INSERT SQL文(別紙1-7)
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW05         PIC  X(13).
           10  FILLER              PIC  X(17)  VALUE
               "), INSERT DATA ( ".
      *----------  処理実行日
           10  FILLER              PIC  X(10)  VALUE
               "SYORI_YMD,".
      *----------  起動ID
           10  FILLER              PIC  X(09)  VALUE
               "KIDOU_ID,".
      *----------  利用会社コード
           10  FILLER              PIC  X(12)  VALUE
               "RIYO_CMP_CD,".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)  VALUE
               "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE
               "PTF_CD,".
      *----------  開始基準日
           10  FILLER              PIC  X(14)  VALUE
               "KAISI_KJN_YMD,".
      *----------  基準日
           10  FILLER              PIC  X(08)  VALUE
               "KJN_YMD,".
      *----------  銘柄コード
           10  FILLER              PIC  X(07)  VALUE
               "MEG_CD,".
      *----------  証券種別コード
           10  FILLER              PIC  X(11)  VALUE
               "SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(09)  VALUE
               "TATE_FLG,".
      *----------  玉ID
           10  FILLER              PIC  X(09)  VALUE
               "GYOKU_ID,".
      *----------  原取引ID
           10  FILLER              PIC  X(08)  VALUE
               "TORI_ID,".
      *----------  資金種別
           10  FILLER              PIC  X(10)  VALUE
               "SIKIN_SBT,".
      *----------  異動日
           10  FILLER              PIC  X(08)  VALUE
               "IDO_YMD,".
      *----------  増減区分
           10  FILLER              PIC  X(07)  VALUE
               "ZG_KBN,".
      *----------  処理順
           10  FILLER              PIC  X(06)  VALUE
               "SRJUN,".
      *----------  処理順決定摘要
           10  FILLER              PIC  X(16)  VALUE
               "SRJUN_KT_TEKIYO,".
      *----------  処理順決定増減
           10  FILLER              PIC  X(16)  VALUE
               "SRJUN_KT_ZOUGEN,".
      *----------  処理順決定評価
           10  FILLER              PIC  X(15)  VALUE
               "SRJUN_KT_HYOKA,".
      *----------  受渡計上切替対象フラグ
           10  FILLER              PIC  X(17)  VALUE
               "UKE_KJ_KK_TS_FLG,".
      *----------  切替仕訳基準パターンコード
           10  FILLER              PIC  X(18)  VALUE
               "KK_SWK_KJN_PTN_CD,".
      *----------  切替キャッシュフロー２回有効フラグ
           10  FILLER              PIC  X(16)  VALUE
               "KK_CF_NK_YK_FLG,".
      *----------  切替基本会計ベースフラグ
           10  FILLER              PIC  X(18)  VALUE
               "KK_KH_KK_BASE_FLG,".
      *----------  受渡未払未収増幅フラグ
           10  FILLER              PIC  X(16)  VALUE
               "UKE_MBMS_ZF_FLG,".
      *----------  更新日時
           10  FILLER              PIC  X(09)  VALUE
               "UPD_DATE,".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(17)  VALUE
               "UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(08)  VALUE
               "UPD_SID,".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE
               "UPD_PGMID) ".
           10  FILLER              PIC  X(08)  VALUE
               " VALUES(".
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  開始基準日
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  基準日
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  銘柄コード
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  資産負債・買建売建フラグ
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  玉ID
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  原取引ID
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  資金種別
           10  WK-SIKIN-SBT        PIC  X(01).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  異動日
           10  WK-IDO-YMD          PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  増減区分
           10  WK-ZG-KBN           PIC  X(01).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  処理順
           10  FILLER              PIC  X(02)  VALUE
               "0,".
      *----------  処理順決定摘要
           10  WK-SRJUN-KT-TEKIYO
                                   PIC  S9(02).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  処理順決定増減
           10  WK-SRJUN-KT-ZOUGEN
                                   PIC  S9(02).
           10  FILLER              PIC  X(01)  VALUE
               ",".
      *----------  処理順決定評価
           10  WK-SRJUN-KT-HYOKA
                                   PIC  S9(02).
           10  FILLER              PIC  X(02)  VALUE
               ",'".
      *----------  受渡計上切替対象フラグ
           10  WK-UKE-KIRIKAE-FLG  PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  仕訳基準パターンコード
           10  WK-SWK-KJN-PTN-CD   PIC  X(08).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  キャッシュフロー2回有効フラグ
           10  WK-CASH-FLOW-2-FLG  PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  基本会計ベースフラグ
           10  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
           10  FILLER              PIC  X(03)  VALUE
               "','".
      *----------  受渡未払未収増幅フラグ
           10  WK-UKE-MBMS-ZF-FLG  PIC  X(01).
      *----------  更新日時
           10  FILLER              PIC  X(11)  VALUE
               "',SYSDATE,'".
      *----------  更新ログインユーザ会社コード
           10  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "',".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(04)  VALUE
               "' ',".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(11)  VALUE
               "'SMZJ1820')".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *---------- 【SMZJ1922】資金切替判定
       01  PARM-SMZJ1922-INOUT.
           COPY  "SMZJ1922.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *---------- テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *---------- 取引事由判定ルーチン
       01  PARM-SMZJ4012-INOUT.
           COPY  "SMZJ4012.cpy".
      *---------- 証券種別判定ルーチン
       01  PARM-SMZJ4014-INOUT.
           COPY  "SMZJ4014.cpy".
      *----------  ARG2リターンパッケージセットルーチン
       01  PARM-RTNPKG.
         05 PARM-RTNPKG-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ1820-INOUT.
           COPY  "SMZJ1820.cpy".
       01  PARM-SMZJ1820-RTNPKG.
         05  PARM-SMZJ1820-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ1820-INOUT
                  PARM-SMZJ1820-RTNPKG.
      ******************************************************************
      *             対象取引決定と処理順決定（資金）
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SMZJ1820処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SMZJ1820処理  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           EXIT.
      ******************************************************************
      *        3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 初期値処理
           PERFORM  INITIALIZE-VALUE-RTN
      *----------  3.1.3 テーブルID取得処理
           PERFORM  TBL-ID-INIT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     WORK-AREA
                          HST-AREA
                          SQL-AREA
                          FLG-AREA
                          E-MSG-TBL
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-SCZY1160-INOUT
                          PARM-RTNPKG
                          PARM-SMZJ1922-INOUT
                          PARM-SMZJ4012-INOUT
                          PARM-SMZJ4014-INOUT
                          PARM-SMZJ1820-ARG2
                          PARM-SMZJ1820-ARG3
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-----  初回ＣＡＬＬ時のみフラグエリア２の初期化を行う            @3212SEINO@@
           IF     FIRST-SW = 'YES'                                      @3212SEINO@@
           THEN                                                         @3212SEINO@@
                  INITIALIZE                FLG-AREA2                   @3212SEINO@@
                  MOVE  'NO '           TO  FIRST-SW                    @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WORK-AREA        = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HST-AREA         = ["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA         = ["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLG-AREA         = ["FLG-AREA"]"
      D    DISPLAY  CNS-PGM-ID ":FLG-AREA2 =["FLG-AREA2 "]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL        = ["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN = ["PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG   = ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT   = ["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG           = ["
      D             PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1820-INOUT   = ["
      D             PARM-SMZJ1820-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1820-ARG2    = ["
      D             PARM-SMZJ1820-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1820-ARG3    = ["
      D             PARM-SMZJ1820-ARG3"]"
      *-----------------------------------------------------------------
           MOVE  PARM-SMZJ1820-ARG1          OF  PARM-SMZJ1820-INOUT
             TO  WK-PARM-SMZJ1820-ARG1       OF  WK-SMZJ1820
      *----------  SCZY1170 RTN-CD 初期化
           MOVE  CNS-RTN-000
             TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報"
      D    DISPLAY  CNS-PGM-ID":  処理実行日              "
      D       "=["  WK-SYORI-YMD             OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  起動ID                  "
      D       "=["  WK-KIDOU-ID              OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  利用会社コード          "
      D       "=["  WK-RIYO-CMP-CD           OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  ファンドコード          "
      D       "=["  WK-FUND-CD               OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  ポートフォリオコード    "
      D       "=["  WK-PTF-CD                OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  開始基準日              "
      D       "=["  WK-KAISI-KJN-YMD         OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  基準日                  "
      D       "=["  WK-KJN-YMD               OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  銘柄コード              "
      D       "=["  WK-MEG-CD                OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  証券種別コード          "
      D       "=["  WK-SEC-SBT-CD            OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  資産負債・買建売建フラグ"
      D       "=["  WK-TATE-FLG              OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  玉ID                    "
      D       "=["  WK-GYOKU-ID              OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  差分更新From日          "
      D       "=["  WK-SABON-UPDATE-FROM     OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":基準日断面情報            "
      D    DISPLAY  CNS-PGM-ID":利用会社コード  = ["
      D             WK-RIYO-CMP-CD           OF   WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード  = ["
      D             WK-FUND-CD               OF   WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  = ["
      D             WK-PTF-CD                OF   WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":基準日  = ["
      D             WK-KJN-YMD               OF   WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ  = ["
      D             WK-KH-KAIKEI-BASE-FLG    OF  WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日  = ["
      D             WK-KAISI-KJN-YMD-NEXT    OF  WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":仕訳基準パターンコード  = ["
      D             WK-SWK-KJN-PTN-CD        OF  WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":異動計算パターン          "
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）１        "
      D       "=["  WK-TEKIYO-SAKI-SYRI1     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）２        "
      D       "=["  WK-TEKIYO-SAKI-SYRI2     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）３        "
      D       "=["  WK-TEKIYO-SAKI-SYRI3     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）４        "
      D       "=["  WK-TEKIYO-SAKI-SYRI4     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）５        "
      D       "=["  WK-TEKIYO-SAKI-SYRI5     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）６        "
      D       "=["  WK-TEKIYO-SAKI-SYRI6     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）７        "
      D       "=["  WK-TEKIYO-SAKI-SYRI7     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）８        "
      D       "=["  WK-TEKIYO-SAKI-SYRI8     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）９        "
      D       "=["  WK-TEKIYO-SAKI-SYRI9     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）１        "
      D       "=["  WK-TEKIYO-ATO-SYRI1      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）２        "
      D       "=["  WK-TEKIYO-ATO-SYRI2      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）３        "
      D       "=["  WK-TEKIYO-ATO-SYRI3      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）４        "
      D       "=["  WK-TEKIYO-ATO-SYRI4      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）５        "
      D       "=["  WK-TEKIYO-ATO-SYRI5      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）６        "
      D       "=["  WK-TEKIYO-ATO-SYRI6      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）７        "
      D       "=["  WK-TEKIYO-ATO-SYRI7      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）８        "
      D       "=["  WK-TEKIYO-ATO-SYRI8      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）９        "
      D       "=["  WK-TEKIYO-ATO-SYRI9      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  増減取引順              "
      D       "=["  WK-ZOUGEN-TORI-JUN       OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  増加取引処理順序        "
      D       "=["  WK-GKYK-PLUS-SYRI-JUN    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  減少取引処理順序        "
      D       "=["  WK-GKYK-MINUS-SYRI-JUN   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  処理順序                "
      D       "=["  WK-SYRI-JUN              OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1170 RTN-CD           =["
      D             RTN-CD                   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *        3.1.2 初期値処理
      ******************************************************************
       INITIALIZE-VALUE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  初期値処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期値設定
           MOVE  WK-TEKIYO-SAKI-SYRI1        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(1)
           MOVE  WK-TEKIYO-SAKI-SYRI2        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(2)
           MOVE  WK-TEKIYO-SAKI-SYRI3        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(3)
           MOVE  WK-TEKIYO-SAKI-SYRI4        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(4)
           MOVE  WK-TEKIYO-SAKI-SYRI5        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(5)
           MOVE  WK-TEKIYO-SAKI-SYRI6        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(6)
           MOVE  WK-TEKIYO-SAKI-SYRI7        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(7)
           MOVE  WK-TEKIYO-SAKI-SYRI8        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(8)
           MOVE  WK-TEKIYO-SAKI-SYRI9        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(9)
           MOVE  WK-TEKIYO-ATO-SYRI9         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(11)
           MOVE  WK-TEKIYO-ATO-SYRI8         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(12)
           MOVE  WK-TEKIYO-ATO-SYRI7         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(13)
           MOVE  WK-TEKIYO-ATO-SYRI6         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(14)
           MOVE  WK-TEKIYO-ATO-SYRI5         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(15)
           MOVE  WK-TEKIYO-ATO-SYRI4         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(16)
           MOVE  WK-TEKIYO-ATO-SYRI3         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(17)
           MOVE  WK-TEKIYO-ATO-SYRI2         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(18)
           MOVE  WK-TEKIYO-ATO-SYRI1         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(19)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(1).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(1)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(2).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(2)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(3).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(3)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(4).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(4)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(5).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(5)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(6).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(6)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(7).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(7)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(8).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(8)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(9).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(9)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(11).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(11)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(12).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(12)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(13).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(13)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(14).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(14)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(15).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(15)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(16).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(16)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(17).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(17)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(18).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(18)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(19).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(19)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(10).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(10)"]"
      D    DISPLAY  CNS-PGM-ID":***  初期値処理   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-VALUE-EXT.
           EXIT.
      ******************************************************************
      *        テーブルID取得処理
      ******************************************************************
       TBL-ID-INIT-RTN        SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  START  ****"
      *-----------------------------------------------------------------
      *---------- テーブルID取得処理
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
           MOVE  CNS-TBL-TKMXST00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
           MOVE  CNS-TBL-TKMZBW05
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
           MOVE  CNS-TBL-TKMZBW18
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID1=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID2=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID3=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(3)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SCZY1160)=["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TABLE-TKMXST00
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TABLE-TKMZBW05
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TABLE-TKMZBW18
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID1  TKMXST00=["
      D             WK-TABLE-TKMXST00"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID2  TKMZBW05=["
      D             WK-TABLE-TKMZBW05"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID2  TKMZBW18=["
      D             WK-TABLE-TKMZBW18"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブルID取得エラー"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG( COUNTER OF PARM-RTNPKG )
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  主処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.2.1 対象資金取引取得
           PERFORM  TSSK-THST-RTN
      *----------  3.2.2 対象取引処理順序決定処理
           PERFORM  TSST-SRZZKZ-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1 対象資金取引取得
      ******************************************************************
       TSSK-THST-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  対象資金取引取得  START  *****"
      *-----------------------------------------------------------------
      *----------  2)銘柄別断面情報．差分更新From日判断
           IF  WK-SABON-UPDATE-FROM  OF  WK-TKMZBW03  =  ZERO
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 銘柄別断面情報．差分更新From日=0 "
      D    DISPLAY  CNS-PGM-ID":HST-基準日←開始基準日翌日"
      *-----------------------------------------------------------------
      *----------  HST-基準日←ARG1.基準日断面情報.開始基準日の翌日
             MOVE  KAISI-KJN-YMD-NEXT        OF  TKMZBW02
                                             OF  PARM-SMZJ1820-ARG1
               TO  H-KJN-YMD-H
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 銘柄別断面情報．差分更新From日≠0 "
      D    DISPLAY  CNS-PGM-ID": 銘柄別断面情報．差分更新From日=["
      D             WK-SABON-UPDATE-FROM     OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":HST-基準日←銘柄別断面情報．"
      D             "差分更新From日"
      *-----------------------------------------------------------------
      *----------  HST-基準日←銘柄別断面情報．差分更新From日
             MOVE  WK-SABON-UPDATE-FROM      OF  WK-TKMZBW03
               TO  H-KJN-YMD-H
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":HST-基準日=["H-KJN-YMD-H"]"
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ  = ["              @3212SEINO@@
      D             WK-KH-KAIKEI-BASE-FLG    OF  WK-TKMZBW02 "]"        @3212SEINO@@
      *-----------------------------------------------------------------
           IF  WK-KH-KAIKEI-BASE-FLG         OF  WK-TKMZBW02            @3212SEINO@@
            =  CNS-X-2                                                  @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *----------  3)資金取引テーブルから処理資金取引テーブルにデータをコピーする
             PERFORM  TKMXST00-INSERT-A-RTN                             @3212SEINO@@
           ELSE                                                         @3212SEINO@@
      *----------  3)資金取引テーブルから処理資金取引テーブルにデータをコピーする
             PERFORM  TKMXST00-INSERT-B-RTN                             @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  3)処理資金取引テーブルから対象データを抽出する
           PERFORM  TKMZBW18-SECINS-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  対象資金取引取得  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       TSSK-THST-EXT.
           EXIT.
      ******************************************************************
      *        3)資金取引テーブルから処理資金取引テーブルにデータをコピーする
      ******************************************************************
       TKMXST00-INSERT-A-RTN  SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3)資金取引テーブルから処理"
      D             "資金取引テーブルにデータをコピーする START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT6A                                        @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW18
             TO  SQL-TBL-ID6                 OF  SQL-INSERT-1-6,
                 WK-TKMZBW18                 OF  WK-MSG-1-6
           MOVE  WK-TABLE-TKMXST00
             TO  SQL-TBL-ID6-1               OF  SQL-INSERT-1-6,
                 WK-TKMXST00                 OF  WK-MSG-1-6
      *----------  処理実行日
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03
             TO  H-SYORI-YMD                 OF  H-TKMZBW18-TKMXST00
      *----------  起動ID
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03
             TO  H-KIDOU-ID                  OF  H-TKMZBW18-TKMXST00
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW18-TKMXST00-S,
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-6
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZBW18-TKMXST00-S,
                 WK-FUND-CD                  OF  WK-MSG-1-6,
                 WK-FUND-CD-1                OF  WK-MSG-1-6
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZBW18-TKMXST00-S,
                 WK-PTF-CD                   OF  WK-MSG-1-6
      *----------  決済口座番号
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-KS-KOZA-NO                OF  H-TKMZBW18-TKMXST00-S,
                 WK-KS-KOZA-NO               OF  WK-MSG-1-6
      *----------  異動日
           MOVE  H-KJN-YMD-H
             TO  WK-H-KJN-YMD-H              OF  WK-MSG-1-6
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMZBW18-TKMXST00-S,
                 WK-KJN-YMD                  OF  WK-MSG-1-6
           STRING  SQL-INSERT-1-6,
                   SQL-WHERE-1-6-2  DELIMITED BY SIZE
             INTO  SQLSTMT6A
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日            =["
      D             H-SYORI-YMD              OF  H-TKMZBW18-TKMXST00"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                =["
      D             H-KIDOU-ID               OF  H-TKMZBW18-TKMXST00"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード           =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW18-TKMXST00-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード           =["
      D             H-FUND-CD           OF  H-TKMZBW18-TKMXST00-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード     =["
      D             H-PTF-CD            OF  H-TKMZBW18-TKMXST00-S"]"
      D    DISPLAY  CNS-PGM-ID":決済口座番号             =["
      D             H-KS-KOZA-NO        OF  H-TKMZBW18-TKMXST00-S"]"
      D    DISPLAY  CNS-PGM-ID":異動日 HST-基準日        =["
      D             H-KJN-YMD-H"]"
      D    DISPLAY  CNS-PGM-ID":異動日 基準日            =["
      D             H-KJN-YMD           OF  H-TKMZBW18-TKMXST00-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT6A=["SQLSTMT6A"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-6=["WK-MSG-1-6
      D    DISPLAY  SQL-WHERE-1-6-2")"
      D    DISPLAY"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグA=["  @3212SEINO@@
      D             FLG-TKMZBW18-TKMXST00-A"]"                          @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW18-TKMXST00-A = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S6  FROM :SQLSTMT6A  END-EXEC            @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-6,
                     SQL-WHERE-1-6-2  DELIMITED  BY  SIZE
               INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S6
                 USING  :H-TKMZBW18-TKMXST00.H-SYORI-YMD,
                        :H-TKMZBW18-TKMXST00.H-KIDOU-ID,
                        :H-TKMZBW18-TKMXST00-S.H-RIYO-CMP-CD,
                        :H-TKMZBW18-TKMXST00-S.H-FUND-CD,
                        :H-TKMZBW18-TKMXST00-S.H-PTF-CD,
                        :H-TKMZBW18-TKMXST00-S.H-FUND-CD,
                        :H-TKMZBW18-TKMXST00-S.H-KS-KOZA-NO,
                        :H-KJN-YMD-H,
                        :H-TKMZBW18-TKMXST00-S.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-TKMZBW18-TKMXST00-A     @3212SEINO@@
      *----------  ARG2.資金取引SELECT件数←SQLCA.SQLERRD(3)
               MOVE  SQLERRD            OF  SQLCA(CNS-3)
                 TO  SIKIN-TORI-SELECT-KENSU
                                        OF  PARM-SMZJ1820-ARG2
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグA=["  @3212SEINO@@
      D             FLG-TKMZBW18-TKMXST00-A "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ARG2.資金取引SELECT件数=["
      D             SIKIN-TORI-SELECT-KENSU
      D                                 OF  PARM-SMZJ1820-ARG2"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（一意制約違反)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-003
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-6,
                       SQL-WHERE-1-6-2 DELIMITED  BY  SIZE
                 INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー(INSERT)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-004
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-6,
                       SQL-WHERE-1-6-2 DELIMITED  BY  SIZE
                 INTO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3)資金取引テーブルから処理"
      D             "資金取引テーブルにデータをコピーする  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXST00-INSERT-A-EXT.                                           @3212SEINO@@
           EXIT.
      ******************************************************************@3212SEINO@@
      *        3)資金取引テーブルから処理資金取引テーブルにデータをコピーする
      ******************************************************************@3212SEINO@@
       TKMXST00-INSERT-B-RTN  SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID  ":***  3)資金取引テーブルから処理"      @3212SEINO@@
      D             "資金取引テーブルにデータをコピーする START ***"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           INITIALIZE  SQLSTMT6B                                        @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW18                                      @3212SEINO@@
             TO  SQL-TBL-ID6                 OF  SQL-INSERT-1-6,        @3212SEINO@@
                 WK-TKMZBW18                 OF  WK-MSG-1-6             @3212SEINO@@
           MOVE  WK-TABLE-TKMXST00                                      @3212SEINO@@
             TO  SQL-TBL-ID6-1               OF  SQL-INSERT-1-6,        @3212SEINO@@
                 WK-TKMXST00                 OF  WK-MSG-1-6             @3212SEINO@@
      *----------  処理実行日                                           @3212SEINO@@
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03            @3212SEINO@@
             TO  H-SYORI-YMD                 OF  H-TKMZBW18-TKMXST00    @3212SEINO@@
      *----------  起動ID                                               @3212SEINO@@
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03            @3212SEINO@@
             TO  H-KIDOU-ID                  OF  H-TKMZBW18-TKMXST00    @3212SEINO@@
      *----------  利用会社コード                                       @3212SEINO@@
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03            @3212SEINO@@
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW18-TKMXST00-S, @3212SEINO@@
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-6             @3212SEINO@@
      *----------  ファンドコード                                       @3212SEINO@@
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03            @3212SEINO@@
             TO  H-FUND-CD                   OF  H-TKMZBW18-TKMXST00-S, @3212SEINO@@
                 WK-FUND-CD                  OF  WK-MSG-1-6,            @3212SEINO@@
                 WK-FUND-CD-1                OF  WK-MSG-1-6             @3212SEINO@@
      *----------  ポートフォリオコード                                 @3212SEINO@@
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03            @3212SEINO@@
             TO  H-PTF-CD                    OF  H-TKMZBW18-TKMXST00-S, @3212SEINO@@
                 WK-PTF-CD                   OF  WK-MSG-1-6             @3212SEINO@@
      *----------  決済口座番号                                         @3212SEINO@@
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03            @3212SEINO@@
             TO  H-KS-KOZA-NO                OF  H-TKMZBW18-TKMXST00-S, @3212SEINO@@
                 WK-KS-KOZA-NO               OF  WK-MSG-1-6             @3212SEINO@@
      *----------  異動日                                               @3212SEINO@@
           MOVE  H-KJN-YMD-H                                            @3212SEINO@@
             TO  WK-H-KJN-YMD-H              OF  WK-MSG-1-6             @3212SEINO@@
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03            @3212SEINO@@
             TO  H-KJN-YMD                   OF  H-TKMZBW18-TKMXST00-S, @3212SEINO@@
                 WK-KJN-YMD                  OF  WK-MSG-1-6             @3212SEINO@@
           STRING  SQL-INSERT-1-6,                                      @3212SEINO@@
                   SQL-WHERE-1-6-3  DELIMITED BY SIZE                   @3212SEINO@@
             INTO  SQLSTMT6B                                            @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":処理実行日            =["               @3212SEINO@@
      D             H-SYORI-YMD              OF  H-TKMZBW18-TKMXST00"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":起動ID                =["               @3212SEINO@@
      D             H-KIDOU-ID               OF  H-TKMZBW18-TKMXST00"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":利用会社コード           =["            @3212SEINO@@
      D             H-RIYO-CMP-CD       OF  H-TKMZBW18-TKMXST00-S"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ファンドコード           =["            @3212SEINO@@
      D             H-FUND-CD           OF  H-TKMZBW18-TKMXST00-S"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード     =["            @3212SEINO@@
      D             H-PTF-CD            OF  H-TKMZBW18-TKMXST00-S"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":決済口座番号             =["            @3212SEINO@@
      D             H-KS-KOZA-NO        OF  H-TKMZBW18-TKMXST00-S"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":異動日 HST-基準日        =["            @3212SEINO@@
      D             H-KJN-YMD-H"]"                                      @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":異動日 基準日            =["            @3212SEINO@@
      D             H-KJN-YMD           OF  H-TKMZBW18-TKMXST00-S"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT6B=["SQLSTMT6B"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-6=["WK-MSG-1-6"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグB=["  @3212SEINO@@
      D             FLG-TKMZBW18-TKMXST00-B "]"                         @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW18-TKMXST00-B = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S8  FROM :SQLSTMT6B  END-EXEC            @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"            @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           IF  SQLCODE                  =  CNS-SQL-NORMAL               @3212SEINO@@
           THEN                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           ELSE                                                         @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             MOVE  CNS-PGM-ID                                           @3212SEINO@@
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
             MOVE  CNS-POS-005                                          @3212SEINO@@
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
             MOVE  CNS-RTN-900                                          @3212SEINO@@
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
             MOVE  SQLCODE                                              @3212SEINO@@
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
             MOVE  CNS-DETAIL-1                                         @3212SEINO@@
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
             STRING  CNS-SQL-MSG-INSERT,                                @3212SEINO@@
                     WK-MSG-1-6,                                        @3212SEINO@@
                     SQL-WHERE-1-6-3  DELIMITED  BY  SIZE               @3212SEINO@@
               INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1            @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             PERFORM  ERR-RTN                                           @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL                                                     @3212SEINO@@
               EXECUTE S8                                               @3212SEINO@@
                 USING  :H-TKMZBW18-TKMXST00.H-SYORI-YMD,               @3212SEINO@@
                        :H-TKMZBW18-TKMXST00.H-KIDOU-ID,                @3212SEINO@@
                        :H-TKMZBW18-TKMXST00-S.H-RIYO-CMP-CD,           @3212SEINO@@
                        :H-TKMZBW18-TKMXST00-S.H-FUND-CD,               @3212SEINO@@
                        :H-TKMZBW18-TKMXST00-S.H-PTF-CD,                @3212SEINO@@
                        :H-TKMZBW18-TKMXST00-S.H-FUND-CD,               @3212SEINO@@
                        :H-TKMZBW18-TKMXST00-S.H-KS-KOZA-NO,            @3212SEINO@@
                        :H-KJN-YMD-H,                                   @3212SEINO@@
                        :H-TKMZBW18-TKMXST00-S.H-KJN-YMD                @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           EVALUATE  SQLCODE                                            @3212SEINO@@
             WHEN  CNS-SQL-NORMAL                                       @3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND                                     @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-TKMZBW18-TKMXST00-B     @3212SEINO@@
      *----------  ARG2.資金取引SELECT件数←SQLCA.SQLERRD(3)            @3212SEINO@@
               MOVE  SQLERRD            OF  SQLCA(CNS-3)                @3212SEINO@@
                 TO  SIKIN-TORI-SELECT-KENSU                            @3212SEINO@@
                                        OF  PARM-SMZJ1820-ARG2          @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグB=["  @3212SEINO@@
      D             FLG-TKMZBW18-TKMXST00-B "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ARG2.資金取引SELECT件数=["              @3212SEINO@@
      D             SIKIN-TORI-SELECT-KENSU                             @3212SEINO@@
      D                                 OF  PARM-SMZJ1820-ARG2"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-UNIQUE                                       @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（一意制約違反)"           @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               MOVE  CNS-PGM-ID                                         @3212SEINO@@
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               MOVE  CNS-POS-006                                        @3212SEINO@@
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               MOVE  CNS-RTN-300                                        @3212SEINO@@
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               MOVE  SQLCODE                                            @3212SEINO@@
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               MOVE  CNS-DETAIL-1                                       @3212SEINO@@
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               STRING  CNS-SQL-MSG-INSERT,                              @3212SEINO@@
                       WK-MSG-1-6,                                      @3212SEINO@@
                       SQL-WHERE-1-6-3  DELIMITED  BY  SIZE             @3212SEINO@@
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               PERFORM  ERR-RTN                                         @3212SEINO@@
             WHEN  OTHER                                                @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー(INSERT)"                  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               MOVE  CNS-PGM-ID                                         @3212SEINO@@
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               MOVE  CNS-POS-007                                        @3212SEINO@@
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               MOVE  CNS-RTN-900                                        @3212SEINO@@
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               MOVE  SQLCODE                                            @3212SEINO@@
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               MOVE  CNS-DETAIL-1                                       @3212SEINO@@
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1          @3212SEINO@@
               STRING  CNS-SQL-MSG-INSERT,                              @3212SEINO@@
                       WK-MSG-1-6,                                      @3212SEINO@@
                       SQL-WHERE-1-6-3  DELIMITED  BY  SIZE             @3212SEINO@@
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               PERFORM  ERR-RTN                                         @3212SEINO@@
           END-EVALUATE                                                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID  ":***  3)資金取引テーブルから処理"      @3212SEINO@@
      D             "資金取引テーブルにデータをコピーする  END  ***"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           CONTINUE.                                                    @3212SEINO@@
       TKMXST00-INSERT-B-EXT.                                           @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *        3)処理資金取引テーブルから対象データを抽出する
      ******************************************************************
       TKMZBW18-SECINS-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3)処理資金取引テーブルから"
      D             "対象データを抽出する START ***"
      *-----------------------------------------------------------------
      *----------  3).1)処理資金取引TBLから処理対象のレコードを取得する
           PERFORM  TKMZBW18-GET-RTN
      *----------  3).2)『処理資金取引』カーソルフェッチする
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW18-SECINS-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW18-FET-RTN
             UNTIL  FLG-TKMZBW18-CR-FETCH  =  CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW18-SECINS-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  3).3)『処理資金取引』カーソルクローズ処理
      *    PERFORM  TKMZBW18-CLS-RTN                                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3)処理資金取引テーブルから"
      D             "対象データを抽出する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW18-SECINS-EXT.
           EXIT.
      ******************************************************************
      *      3).1)処理資金取引TBLから処理対象のレコードを取得する
      ******************************************************************
       TKMZBW18-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3).1)処理資金取引TBLから処理"
      D             "対象のレコードを取得する START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT1                                         @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW18
             TO  SQL-TBL-ID1,
                 WK-TKMZBW18            OF  WK-MSG-1-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW18-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMZBW18-S,
                 WK-FUND-CD             OF  WK-MSG-1-1,
                 WK-FUND-CD-1           OF  WK-MSG-1-1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMZBW18-S,
                 WK-PTF-CD              OF  WK-MSG-1-1
      *----------  決済口座番号
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-KS-KOZA-NO           OF  H-TKMZBW18-S,
                 WK-KS-KOZA-NO          OF  WK-MSG-1-1
      *----------  異動日
           MOVE  H-KJN-YMD-H
             TO  WK-H-KJN-YMD-H         OF  WK-MSG-1-1
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03
             TO  H-KJN-YMD              OF  H-TKMZBW18-S,
                 WK-KJN-YMD             OF  WK-MSG-1-1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-TKMZBW03
             TO  H-SYORI-YMD            OF  H-TKMZBW18-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-1
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-TKMZBW03
             TO  H-KIDOU-ID             OF  H-TKMZBW18-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-1
           MOVE  SQL-SELECT-1-1         TO  SQLSTMT1                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード           =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW18-S"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード           =["
      D             H-FUND-CD           OF  H-TKMZBW18-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード     =["
      D             H-PTF-CD            OF  H-TKMZBW18-S"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード               =["
      D             H-KS-KOZA-NO        OF  H-TKMZBW18-S"]"
      D    DISPLAY  CNS-PGM-ID":異動日 HST-基準日        =["
      D             H-KJN-YMD-H"]"
      D    DISPLAY  CNS-PGM-ID":異動日 基準日            =["
      D             H-KJN-YMD           OF  H-TKMZBW18-S"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日               =["
      D             H-SYORI-YMD         OF  H-TKMZBW18-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                   =["
      D             H-KIDOU-ID          OF  H-TKMZBW18-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-1=["WK-MSG-1-1"]"
      D    DISPLAY  CNS-PGM-ID":処理資金取引カーソルオープンフラグ"     @3212SEINO@@
      D             "=["FLG-TKMZBW18-CR-OPEN"]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW18-CR-OPEN = CNS-OFF                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S1  FROM :SQLSTMT1  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-008
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZBW18_CUR  CURSOR  FOR S1 END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZBW18_CUR
                 USING  :H-TKMZBW18-S.H-RIYO-CMP-CD,
                        :H-TKMZBW18-S.H-FUND-CD,
                        :H-TKMZBW18-S.H-PTF-CD,
                        :H-TKMZBW18-S.H-FUND-CD,
                        :H-TKMZBW18-S.H-KS-KOZA-NO,
                        :H-KJN-YMD-H,
                        :H-TKMZBW18-S.H-KJN-YMD,
                        :H-TKMZBW18-S.H-SYORI-YMD,
                        :H-TKMZBW18-S.H-KIDOU-ID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":処理資金取引カーソルオープンフラグ"
      D             "=["FLG-TKMZBW18-CR-OPEN"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW18-CR-OPEN
             MOVE  CNS-ON               TO  FLG-TKMZBW18-CR-FETCH
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理資金取引カーソルオープンフラグ"
      D             "=["FLG-TKMZBW18-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-009
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3).1)処理資金取引TBLから処理"
      D             "対象のレコードを取得する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW18-GET-EXT.
           EXIT.
      ******************************************************************
      *     3).2)『処理資金取引』カーソルフェッチする
      ******************************************************************
       TKMZBW18-FET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3).2)『処理資金取引』カーソル"
      D             "フェッチする START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW18
           EXEC  SQL
             FETCH  TKMZBW18_CUR
             INTO   :H-TKMZBW18-O
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH:NORMAL"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH:NOTFOUND"
      *-----------------------------------------------------------------
               MOVE  CNS-OFF            TO  FLG-TKMZBW18-CR-FETCH
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理資金取引循環フラグ"
      D             "=["FLG-TKMZBW18-CR-FETCH"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-010
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1         DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":FETCH个数=["  SQLERRD(3)"]"
      *-----------------------------------------------------------------
           IF  SQLERRD(3) = CNS-0
           THEN
      *----------  3).3)『処理資金取引』カーソルクローズ処理
      *      PERFORM  TKMZBW18-CLS-RTN                                  @3212SEINO@@
      *----------  後処理
             PERFORM  END-RTN
           ELSE
             COMPUTE  WK-KUKAN-KENSUU = SQLERRD(3) - WK-GOUKEI-KENSUU
             MOVE  SQLERRD(3)           TO  WK-GOUKEI-KENSUU
             MOVE  ZERO                 TO  WK-IDX2
             INITIALIZE  H-TKMZBW05-I
                         H-TKMZBW05-II
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク区間件数=["  WK-KUKAN-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":ワーク合計件数=["  WK-GOUKEI-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":ワークIDX2    =["  WK-IDX2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク対象資金取引情報=["H-TKMZBW05-I"]"
      D    DISPLAY  CNS-PGM-ID":ワーク対象資金取引情報増幅データ=["
      D                                                 H-TKMZBW05-II"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW18-FET-RTN]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             PERFORM  VARYING  WK-IDX1  FROM CNS-1 BY CNS-1
               UNTIL  WK-IDX1  > WK-KUKAN-KENSUU
      *----------  原取引ＩＤ
               MOVE  H-TORI-ID          OF  H-TKMZBW18(WK-IDX1)
                 TO  WK-TORI-ID         OF  WK-TKMZBW18-1-1
      *----------  資金種別
               MOVE  H-SIKIN-SBT        OF  H-TKMZBW18(WK-IDX1)
                 TO  WK-SIKIN-SBT       OF  WK-TKMZBW18-1-1
      *----------  異動日
               MOVE  H-IDO-YMD          OF  H-TKMZBW18(WK-IDX1)
                 TO  WK-IDO-YMD         OF  WK-TKMZBW18-1-1
      *----------  増減区分
               MOVE  H-ZG-KBN           OF  H-TKMZBW18(WK-IDX1)
                 TO  WK-ZG-KBN          OF  WK-TKMZBW18-1-1
      *----------  取引事由
               MOVE  H-TORI-JIYU        OF  H-TKMZBW18(WK-IDX1)
                 TO  WK-TORI-JIYU       OF  WK-TKMZBW18-1-1
      *----------  証券種別コード
               MOVE  H-SEC-SBT-CD       OF  H-TKMZBW18(WK-IDX1)
                 TO  WK-SEC-SBT-CD      OF  WK-TKMZBW18-1-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":原取引ＩＤ              "
      D       "=["  WK-TORI-ID          OF  WK-TKMZBW18-1-1"]"
      D    DISPLAY  CNS-PGM-ID":資金種別                "
      D       "=["  WK-SIKIN-SBT        OF  WK-TKMZBW18-1-1"]"
      D    DISPLAY  CNS-PGM-ID":異動日                  "
      D       "=["  WK-IDO-YMD          OF  WK-TKMZBW18-1-1"]"
      D    DISPLAY  CNS-PGM-ID":増減区分                "
      D       "=["  WK-ZG-KBN           OF  WK-TKMZBW18-1-1"]"
      D    DISPLAY  CNS-PGM-ID":取引事由                "
      D       "=["  WK-TORI-JIYU        OF  WK-TKMZBW18-1-1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード          "
      D       "=["  WK-SEC-SBT-CD       OF  WK-TKMZBW18-1-1"]"
      *-----------------------------------------------------------------
      *----------  対象資金取引処理
               PERFORM  TKMZBW05-RTN
             END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW18-FET-RTN]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  2）対象資金取引情報にデータinsert処理
             IF  WK-KUKAN-KENSUU = ZERO
             THEN
               CONTINUE
             ELSE
               PERFORM  TKMZBW05-INSERT-RTN
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  3).2)『処理資金取引』カーソル"
      D             "フェッチする  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW18-FET-EXT.
           EXIT.
      ******************************************************************
      *        3).3)『処理資金取引』カーソルクローズ処理
      ******************************************************************
      *TKMZBW18-CLS-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":*** 3).3)『処理資金取引』カーソル"
      *D             "クローズ処理 START ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZBW18_CUR
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZBW18-CR-OPEN
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-POS-011
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-1         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":***  3).3)『処理資金取引』カーソル"
      *D             "クローズ処理  END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZBW18-CLS-EXT.
      *    EXIT.
      ******************************************************************
      *        対象資金取引処理
      ******************************************************************
       TKMZBW05-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 対象資金取引処理 START ***"
      *-----------------------------------------------------------------
      *----------  (一)対象資金取引項目編集処理
           PERFORM  TKMZBW05-EDIT-RTN
      *----------  (二)資金切替処理
           PERFORM  SMZJ1922-RTN
      *----------  (三)対象資金取引にデータ編集処理
           PERFORM  TKMZBW05-DATA-E-RTN
      *----------  (四)未収未払増加データを増幅
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ      "
      D       "=["  WK-KH-KAIKEI-BASE-FLG    OF  WK-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":処理資金取引.資金種別     "
      D       "=["  WK-SIKIN-SBT             OF  WK-TKMZBW18-1-1"]"
      D    DISPLAY  CNS-PGM-ID":処理資金取引.増減区分     "
      D       "=["  WK-ZG-KBN                OF  WK-TKMZBW18-1-1"]"
      D    DISPLAY  CNS-PGM-ID":SMZJ1922のリターンパッケージ."
      D                       "受渡増幅未払未収処理フラグ     "
      D       "=["  WK-UKE-MIMI-FLG              OF  WK-SMZJ1922"]"
      *-----------------------------------------------------------------
           IF  (WK-KH-KAIKEI-BASE-FLG         OF  WK-TKMZBW02
            =  CNS-X-2  AND
              (WK-SIKIN-SBT                  OF  WK-TKMZBW18-1-1
            =  CNS-X-8  OR
               WK-SIKIN-SBT                  OF  WK-TKMZBW18-1-1
            =  CNS-X-9) AND
               WK-ZG-KBN                     OF  WK-TKMZBW18-1-1
            =  CNS-X-2  AND
               WK-UKE-MIMI-FLG               OF  WK-SMZJ1922  NOT
            =  CNS-X-1) OR
               (WK-UKE-MIMI-FLG              OF  WK-SMZJ1922
            =  CNS-X-2  AND
                WK-ZG-KBN                    OF  WK-TKMZBW18-1-1
            =  CNS-X-2)
           THEN
             COMPUTE  WK-IDX2 = WK-IDX2 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** (四)未収未払増加データを増幅"
      D             "処理 START ***"
      D    DISPLAY  CNS-PGM-ID  ":IDX2  =["WK-IDX2"]"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.処理順序  =["
      D             WK-SYRI-JUN         OF  WK-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
             EVALUATE  WK-SYRI-JUN      OF  WK-IDO-CALC-PATTERN
               WHEN  CNS-SYRI-JUN-3
               WHEN  CNS-SYRI-JUN-4
               WHEN  CNS-SYRI-JUN-7
               WHEN  CNS-SYRI-JUN-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":1)異動計算パターン.処理順序＝"
      D             "('3'  or  '4'  or  '7'  or  '8')の場合"
      *-----------------------------------------------------------------
      *----------  1)ワーク増幅用処理順決定増減を編集
                 PERFORM  WK-SOUBA-SYORI-RTN
               WHEN  OTHER
                 CONTINUE
             END-EVALUATE
      *----------  2)対象資金取引情報に増幅データ編集処理
             PERFORM  TAISYO-SK-EDT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** (三)未収未払増加データを増幅"
      D             "処理 END ***"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 対象資金取引処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-EXT.
           EXIT.
      ******************************************************************
      *        (一)対象資金取引項目編集処理
      ******************************************************************
       TKMZBW05-EDIT-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** (一)対象資金取引項目編集"
      D             "処理 START ***"
      D    DISPLAY  CNS-PGM-ID ":【SMZJ4012】取引事由判定ルーチンを"
      D             "CALLして、ワーク取引属性エリアを取得する。"
      *-----------------------------------------------------------------
      *---------- 【SMZJ4012】取引事由判定ルーチンをCALLして、ワーク取引属性エリアを取得する。
           INITIALIZE  PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TKMZBW18-1-1
             TO  TORI-JIYU                   OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-1
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4012-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引事由 =["
      D             TORI-JIYU                OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4012"               USING  PARM-SMZJ4012-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4012)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  正常 "
      *-----------------------------------------------------------------
      *----------  期間内取引.処理順決定評価←評価損益データフラグ
             MOVE  HYK-SNEKI-DATA-FLG        OF  PARM-SMZJ4012-ARG2
               TO  WK-SRJUN-KT-HYOKA-1
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 評価損益データフラグ     =["
      D             HYK-SNEKI-DATA-FLG       OF  PARM-SMZJ4012-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ": 処理順決定評価=["
      D             WK-SRJUN-KT-HYOKA-1"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  異常"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-012
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           PERFORM  SMZJ4014-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.処理順序 =["
      D             WK-SYRI-JUN         OF  WK-IDO-CALC-PATTERN "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-SYRI-JUN        OF  WK-IDO-CALC-PATTERN
             WHEN  CNS-SYRI-JUN-1
             WHEN  CNS-SYRI-JUN-2
             WHEN  CNS-SYRI-JUN-5
             WHEN  CNS-SYRI-JUN-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":◆異動計算パターン.処理順序＝('1'"
      D             "or'2'or'5'or'6')の場合"
      D    DISPLAY  CNS-PGM-ID  ":処理資金取引.取引事由 =["
      D             WK-TORI-JIYU        OF  WK-TKMZBW18-1-1 "]"
      *-----------------------------------------------------------------
      *----------  ◆異動計算パターン.処理順序＝('1'or'2'or'5'or'6')の場合
               EVALUATE  WK-TORI-JIYU   OF  WK-TKMZBW18-1-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(1)
                   MOVE  CNS-SRJUN-KT-TEKIYO-01
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(2)
                   MOVE  CNS-SRJUN-KT-TEKIYO-02
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(3)
                   MOVE  CNS-SRJUN-KT-TEKIYO-03
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(4)
                   MOVE  CNS-SRJUN-KT-TEKIYO-04
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(5)
                   MOVE  CNS-SRJUN-KT-TEKIYO-05
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(6)
                   MOVE  CNS-SRJUN-KT-TEKIYO-06
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(7)
                   MOVE  CNS-SRJUN-KT-TEKIYO-07
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(8)
                   MOVE  CNS-SRJUN-KT-TEKIYO-08
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(9)
                   MOVE  CNS-SRJUN-KT-TEKIYO-09
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(11)
                   MOVE  CNS-SRJUN-KT-TEKIYO-11
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(12)
                   MOVE  CNS-SRJUN-KT-TEKIYO-12
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(13)
                   MOVE  CNS-SRJUN-KT-TEKIYO-13
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(14)
                   MOVE  CNS-SRJUN-KT-TEKIYO-14
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(15)
                   MOVE  CNS-SRJUN-KT-TEKIYO-15
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(16)
                   MOVE  CNS-SRJUN-KT-TEKIYO-16
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(17)
                   MOVE  CNS-SRJUN-KT-TEKIYO-17
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(18)
                   MOVE  CNS-SRJUN-KT-TEKIYO-18
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  WK-TKYU-SYORI    OF  WK-TKYU-GROUP(19)
                   MOVE  CNS-SRJUN-KT-TEKIYO-19
                     TO  WK-SRJUN-KT-TEKIYO-1
                 WHEN  OTHER
                   MOVE  CNS-SRJUN-KT-TEKIYO-10
                     TO  WK-SRJUN-KT-TEKIYO-1
               END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":処理順決定摘要         =["
      D             WK-SRJUN-KT-TEKIYO-1 "]"
      *-----------------------------------------------------------------
             WHEN  CNS-SYRI-JUN-3
             WHEN  CNS-SYRI-JUN-4
             WHEN  CNS-SYRI-JUN-7
             WHEN  CNS-SYRI-JUN-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":◆異動計算パターン.処理順序＝('3'"
      D             "or'4'or'7'or'8')の場合"
      *-----------------------------------------------------------------
      *----------  ◆異動計算パターン.処理順序＝('3'or'4'or'7'or'8')の場合
               PERFORM  TKMZBW05-3478-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":パラメータエラー"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-013
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** (一)対象資金取引項目編集"
      D             "処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-EDIT-EXT.
           EXIT.
      ******************************************************************
      *        【SMZJ4014】証券種別判定
      ******************************************************************
       SMZJ4014-RTN           SECTION.                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":【SMZJ4014】証券種別判定 START"
      *-----------------------------------------------------------------
      *----------【SMZJ4014】証券種別判定ルーチンをCALLして、処理対象証券種別を決める
           INITIALIZE  PARM-SMZJ4014-INOUT
                       PARM-RTNPKG
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW18-1-1
             TO  SEC-SBT-CD                  OF  PARM-SMZJ4014-ARG1
      *----------  判定対象区分
           MOVE  CNS-SIKIN-JUN-KBN-B
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4014-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":証券種別コード =["
      D             SEC-SBT-CD               OF  PARM-SMZJ4014-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4014-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4014"               USING  PARM-SMZJ4014-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4014)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
      *----------  ワーク資金取引処理順区分
             MOVE  SIKIN-JUN-KBN        OF  PARM-SMZJ4014-ARG2
               TO  WK-SIKIN-JUN-KBN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク資金取引処理順区分 =["
      D             WK-SIKIN-JUN-KBN"]"
      *-----------------------------------------------------------------
           ELSE
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-038
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":【SMZJ4014】証券種別判定 END"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ4014-EXT.
           EXIT.
      ******************************************************************
      *    (二)資金切替処理
      ******************************************************************
       SMZJ1922-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  (二)資金切替処理  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ1922-INOUT
                       PARM-RTNPKG
      *---------- 基準日断面情報
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW02
             TO  RIYO-CMP-CD            OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ1922-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW02
             TO  FUND-CD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ1922-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW02
             TO  PTF-CD                 OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ1922-ARG1
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW02
             TO  KJN-YMD                OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ1922-ARG1
      *----------  基本会計ベースフラグ
           MOVE  WK-KH-KAIKEI-BASE-FLG  OF  WK-TKMZBW02
             TO  KH-KAIKEI-BASE-FLG     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ1922-ARG1
      *----------  開始基準日の翌日
           MOVE  WK-KAISI-KJN-YMD-NEXT  OF  WK-TKMZBW02
             TO  KAISI-KJN-YMD-NEXT     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ1922-ARG1
      *----------  仕訳基準パターンコード
           MOVE  WK-SWK-KJN-PTN-CD      OF  WK-TKMZBW02
             TO  SWK-KJN-PTN-CD         OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ1922-ARG1
      *---------- 資金種別
           MOVE  WK-SIKIN-SBT           OF  WK-TKMZBW18-1-1
             TO  SIKIN-SBT              OF  PARM-SMZJ1922-ARG1
      *---------- 増減区分
           MOVE  WK-ZG-KBN              OF  WK-TKMZBW18-1-1
             TO  ZG-KBN                 OF  PARM-SMZJ1922-ARG1
      *---------- 原取引ID
           MOVE  WK-TORI-ID             OF  WK-TKMZBW18-1-1
             TO  TORI-ID                OF  PARM-SMZJ1922-ARG1
      *---------- 決済口座番号
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  KS-KOZA-NO             OF  PARM-SMZJ1922-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日断面情報:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ=["
      D             KH-KAIKEI-BASE-FLG  OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日の翌日=["
      D             KAISI-KJN-YMD-NEXT  OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":仕訳基準パターンコード=["
      D             SWK-KJN-PTN-CD      OF  TKMZBW02-PARM
      D                                 OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":資金種別=["
      D             SIKIN-SBT           OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":増減区分=["
      D             ZG-KBN              OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":原取引ID=["
      D             TORI-ID             OF  PARM-SMZJ1922-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決済口座番号=["
      D             KS-KOZA-NO          OF  PARM-SMZJ1922-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ1922"             USING  PARM-SMZJ1922-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ1922)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *---------- 受渡計上切替対象フラグ
             MOVE  UKE-KIRIKAE-FLG     OF  PARM-SMZJ1922-ARG2
               TO  WK-UKE-KIRIKAE-FLG  OF  WK-SMZJ1922
      *---------- 仕訳基準パターンコード
             MOVE  SWK-KJN-PTN-CD      OF  PARM-SMZJ1922-ARG2
               TO  WK-SWK-KJN-PTN-CD   OF  WK-SMZJ1922
      *---------- キャッシュフロー2回有効フラグ
             MOVE  CASH-FLOW-2-FLG     OF  PARM-SMZJ1922-ARG2
               TO  WK-CASH-FLOW-2-FLG  OF  WK-SMZJ1922
      *----------  基本会計ベースフラグ
             MOVE  KH-KAIKEI-BASE-FLG  OF  PARM-SMZJ1922-ARG2
               TO  WK-KH-KAIKEI-BASE-FLG  OF  WK-SMZJ1922
      *---------- 受渡増幅未払未収処理フラグ
             MOVE  UKE-MIMI-FLG        OF  PARM-SMZJ1922-ARG2
               TO  WK-UKE-MIMI-FLG       OF  WK-SMZJ1922
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡計上切替対象フラグ =["
      D             WK-UKE-KIRIKAE-FLG  OF  WK-SMZJ1922"]"
      D    DISPLAY  CNS-PGM-ID":仕訳基準パターンコード =["
      D             WK-SWK-KJN-PTN-CD   OF  WK-SMZJ1922"]"
      D    DISPLAY  CNS-PGM-ID":キャッシュフロー2回有効フラグ =["
      D             WK-CASH-FLOW-2-FLG  OF  WK-SMZJ1922"]"
      D    DISPLAY  CNS-PGM-ID":基本会計ベースフラグ =["
      D             WK-KH-KAIKEI-BASE-FLG  OF  WK-SMZJ1922"]"
      D    DISPLAY  CNS-PGM-ID":受渡増幅未払未収処理フラグ =["
      D             WK-UKE-MIMI-FLG       OF  WK-SMZJ1922"]"
      *-----------------------------------------------------------------
           ELSE
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-037
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  (二)資金切替処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ1922-EXT.
           EXIT.
      ******************************************************************
      *        ◆異動計算パターン.処理順序＝('3'or'4'or'7'or'8')の場合処理
      ******************************************************************
       TKMZBW05-3478-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  ◆異動計算パターン.処理順序＝"
      D             "('3'or'4'or'7'or'8')の場合処理 START ***"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.増減取引順=["
      D             WK-ZOUGEN-TORI-JUN       OF  WK-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-ZOUGEN-TORI-JUN      OF  WK-IDO-CALC-PATTERN
             WHEN  CNS-ZOUGEN-TORI-JUN-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":①異動計算パターン.増減取引順＝"
      D             "'1':増加を先の場合"
      D    DISPLAY  CNS-PGM-ID  ":処理資金取引.増減区分            =["
      D             WK-ZG-KBN                OF  WK-TKMZBW18-1-1"]"
      *-----------------------------------------------------------------
               EVALUATE  WK-ZG-KBN           OF  WK-TKMZBW18-1-1
                 WHEN  CNS-ZG-KBN-1
      *----------  a)処理資金取引.増減区分＝'1':増加の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)処理資金取引.増減区分＝'1':増加の場合"
      *-----------------------------------------------------------------
                   PERFORM  TKMZBW05-1-UP-RTN
                 WHEN  CNS-ZG-KBN-2
      *----------  b)処理資金取引.増減区分＝'2':減少の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":b)処理資金取引.増減区分＝'2':減少の場合"
      *-----------------------------------------------------------------
                   PERFORM  TKMZBW05-2-UP-RTN
                 WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ不整合"
      *-----------------------------------------------------------------
      *----------  c)処理資金取引.増減区分は上記以外の場合
                   MOVE  CNS-PGM-ID
                     TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-POS-014
                     TO  ERR-POS             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-140
                     TO  RTN-CD              OF  PARM-SCZY1170-ARG1
                   MOVE  ZERO
                     TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-DETAIL-0
                     TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                   PERFORM  ERR-RTN
               END-EVALUATE
             WHEN  CNS-ZOUGEN-TORI-JUN-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":②異動計算パターン.増減取引順＝"
      D             "'2':減少を先の場合"
      D    DISPLAY  CNS-PGM-ID  ":処理資金取引.増減区分            =["
      D             WK-ZG-KBN                OF  WK-TKMZBW18-1-1"]"
      *-----------------------------------------------------------------
               EVALUATE  WK-ZG-KBN           OF  WK-TKMZBW18-1-1
                 WHEN  CNS-ZG-KBN-2
      *----------  a)処理資金取引.増減区分＝'2':減少の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)処理資金取引.増減区分＝'2':減少の場合"
      *-----------------------------------------------------------------
                   PERFORM  TKMZBW05-1-DO-RTN
                 WHEN  CNS-ZG-KBN-1
      *----------  b)処理資金取引.増減区分＝'1':増加の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":b)処理資金取引.増減区分＝'1':増加の場合"
      *-----------------------------------------------------------------
                   PERFORM  TKMZBW05-2-DO-RTN
                 WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ不整合"
      *-----------------------------------------------------------------
      *----------  c)処理資金取引.増減区分は上記以外の場合
                   MOVE  CNS-PGM-ID
                     TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-POS-015
                     TO  ERR-POS             OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-RTN-140
                     TO  RTN-CD              OF  PARM-SCZY1170-ARG1
                   MOVE  ZERO
                     TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
                   MOVE  CNS-DETAIL-0
                     TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                   PERFORM  ERR-RTN
               END-EVALUATE
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":③異動計算パターン.増減取引順は上記以外の場合"
      *-----------------------------------------------------------------
      *----------  処理順決定増減
               MOVE  ZERO
                 TO  H-SRJUN-KT-ZOUGEN  OF  H-TKMZBW05-I(WK-IDX1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":処理順決定増減=["
      D             H-SRJUN-KT-ZOUGEN   OF  H-TKMZBW05-I(WK-IDX1)"]"
      *-----------------------------------------------------------------
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  ◆異動計算パターン.処理順序＝"
      D             "('3'or'4'or'7'or'8')の場合処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-3478-EXT.
           EXIT.
      ******************************************************************
      *                 a)処理資金取引.増減区分＝'1':増加の場合
      ******************************************************************
       TKMZBW05-1-UP-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** a)処理資金取引.増減区分＝'1':増加"
      D             "の場合 START ***"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.増加取引処理順序=["
      D             WK-GKYK-PLUS-SYRI-JUN    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金取引処理順区分 =["
      D             WK-SIKIN-JUN-KBN"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-GKYK-PLUS-SYRI-JUN   OF  WK-IDO-CALC-PATTERN
             WHEN  CNS-GKYK-SYRI-JUN-1
               IF  WK-SIKIN-JUN-KBN = CNS-X-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-SRJUN-KT-ZOUGEN-01
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               ELSE
                 MOVE  CNS-SRJUN-KT-ZOUGEN-02
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               END-IF
             WHEN  CNS-GKYK-SYRI-JUN-2
             WHEN  CNS-GKYK-SYRI-JUN-3
               IF  WK-SIKIN-JUN-KBN = CNS-X-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-SRJUN-KT-ZOUGEN-02
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               ELSE
                 MOVE  CNS-SRJUN-KT-ZOUGEN-01
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               END-IF
             WHEN  SPACE
               MOVE  CNS-SRJUN-KT-ZOUGEN-01
                 TO  H-SRJUN-KT-ZOUGEN       OF  H-TKMZBW05-I(WK-IDX1)
             WHEN OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":パラメータエラー"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-016
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":処理順決定増減                   =["
      D             H-SRJUN-KT-ZOUGEN   OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID  ":*** a)処理資金取引.増減区分＝'1':増加"
      D             "の場合  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-1-UP-EXT.
           EXIT.
      ******************************************************************
      *                 b)処理資金取引.増減区分＝'2':減少の場合
      ******************************************************************
       TKMZBW05-2-UP-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** b)処理資金取引.増減区分＝'2':減少"
      D             "の場合 START ***"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.減少取引処理順序=["
      D             WK-GKYK-MINUS-SYRI-JUN   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金取引処理順区分 =["
      D             WK-SIKIN-JUN-KBN"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-GKYK-MINUS-SYRI-JUN  OF  WK-IDO-CALC-PATTERN
             WHEN  CNS-GKYK-SYRI-JUN-1
               IF  WK-SIKIN-JUN-KBN = CNS-X-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-SRJUN-KT-ZOUGEN-03
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               ELSE
                 MOVE  CNS-SRJUN-KT-ZOUGEN-04
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               END-IF
             WHEN  CNS-GKYK-SYRI-JUN-2
             WHEN  CNS-GKYK-SYRI-JUN-3
               IF  WK-SIKIN-JUN-KBN = CNS-X-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-SRJUN-KT-ZOUGEN-04
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               ELSE
                 MOVE  CNS-SRJUN-KT-ZOUGEN-03
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               END-IF
             WHEN  SPACE
               MOVE  CNS-SRJUN-KT-ZOUGEN-03
                 TO  H-SRJUN-KT-ZOUGEN       OF  H-TKMZBW05-I(WK-IDX1)
             WHEN OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":パラメータエラー"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-017
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":処理順決定増減                   =["
      D             H-SRJUN-KT-ZOUGEN   OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":*** b)処理資金取引.増減区分＝'2':減少"
      D             "の場合  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-2-UP-EXT.
           EXIT.
      ******************************************************************
      *                 a)処理資金取引.増減区分＝'2':減少の場合
      ******************************************************************
       TKMZBW05-1-DO-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** a)処理資金取引.増減区分＝'2':減少"
      D             "の場合 START ***"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.減少取引処理順序=["
      D             WK-GKYK-MINUS-SYRI-JUN   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金取引処理順区分 =["
      D             WK-SIKIN-JUN-KBN"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-GKYK-MINUS-SYRI-JUN  OF  WK-IDO-CALC-PATTERN
             WHEN  CNS-GKYK-SYRI-JUN-1
               IF  WK-SIKIN-JUN-KBN = CNS-X-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-SRJUN-KT-ZOUGEN-01
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               ELSE
                 MOVE  CNS-SRJUN-KT-ZOUGEN-02
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               END-IF
             WHEN  CNS-GKYK-SYRI-JUN-2
             WHEN  CNS-GKYK-SYRI-JUN-3
               IF  WK-SIKIN-JUN-KBN = CNS-X-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-SRJUN-KT-ZOUGEN-02
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               ELSE
                 MOVE  CNS-SRJUN-KT-ZOUGEN-01
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               END-IF
             WHEN  SPACE
               MOVE  CNS-SRJUN-KT-ZOUGEN-01
                 TO  H-SRJUN-KT-ZOUGEN       OF  H-TKMZBW05-I(WK-IDX1)
             WHEN OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":パラメータエラー"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-018
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":処理順決定増減                   =["
      D             H-SRJUN-KT-ZOUGEN   OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID  ":*** a)処理資金取引.増減区分＝'2':減少"
      D             "の場合  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-1-DO-EXT.
           EXIT.
      ******************************************************************
      *                 b)処理資金取引.増減区分＝'1':増加の場合
      ******************************************************************
       TKMZBW05-2-DO-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** b)処理資金取引.増減区分＝'1':増加"
      D             "の場合 START ***"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.増加取引処理順序=["
      D             WK-GKYK-PLUS-SYRI-JUN    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金取引処理順区分 =["
      D             WK-SIKIN-JUN-KBN"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-GKYK-PLUS-SYRI-JUN   OF  WK-IDO-CALC-PATTERN
             WHEN  CNS-GKYK-SYRI-JUN-1
               IF  WK-SIKIN-JUN-KBN = CNS-X-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-SRJUN-KT-ZOUGEN-03
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               ELSE
                 MOVE  CNS-SRJUN-KT-ZOUGEN-04
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               END-IF
             WHEN  CNS-GKYK-SYRI-JUN-2
             WHEN  CNS-GKYK-SYRI-JUN-3
               IF  WK-SIKIN-JUN-KBN = CNS-X-1
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-SRJUN-KT-ZOUGEN-04
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               ELSE
                 MOVE  CNS-SRJUN-KT-ZOUGEN-03
                   TO  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-I(WK-IDX1)
               END-IF
             WHEN  SPACE
               MOVE  CNS-SRJUN-KT-ZOUGEN-03
                 TO  H-SRJUN-KT-ZOUGEN       OF  H-TKMZBW05-I(WK-IDX1)
             WHEN OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":パラメータエラー"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-019
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":処理順決定増減                   =["
      D             H-SRJUN-KT-ZOUGEN   OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID  ":*** b)処理資金取引.増減区分＝'1':増加"
      D             "の場合  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-2-DO-EXT.
           EXIT.
      ******************************************************************
      *        (三)対象資金取引にデータ編集処理
      ******************************************************************
       TKMZBW05-DATA-E-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** (三)対象資金取引にデータ"
      D             "編集処理START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW05
             TO  SQL-TBL-ID2                 OF  SQL-INSERT-1-2,
                 WK-TKMZBW05                 OF  WK-MSG-1-2
      *----------  処理実行日
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03
             TO  H-SYORI-YMD                 OF  H-TKMZBW05-I(WK-IDX1)
      *----------  起動ID
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03
             TO  H-KIDOU-ID                  OF  H-TKMZBW05-I(WK-IDX1)
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW05-I(WK-IDX1)
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZBW05-I(WK-IDX1)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZBW05-I(WK-IDX1)
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD            OF  WK-TKMZBW03
             TO  H-KAISI-KJN-YMD             OF  H-TKMZBW05-I(WK-IDX1)
      *----------  基準日
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMZBW05-I(WK-IDX1)
      *----------  銘柄コード
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-MEG-CD                    OF  H-TKMZBW05-I(WK-IDX1)
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD                OF  H-TKMZBW05-I(WK-IDX1)
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG                 OF  WK-TKMZBW03
             TO  H-TATE-FLG                  OF  H-TKMZBW05-I(WK-IDX1)
      *----------  玉ID
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03
             TO  H-GYOKU-ID                  OF  H-TKMZBW05-I(WK-IDX1)
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-TKMZBW18-1-1
             TO  H-TORI-ID                   OF  H-TKMZBW05-I(WK-IDX1)
      *----------  資金種別
           MOVE  WK-SIKIN-SBT                OF  WK-TKMZBW18-1-1
             TO  H-SIKIN-SBT                 OF  H-TKMZBW05-I(WK-IDX1)
      *----------  異動日
           MOVE  WK-IDO-YMD                  OF  WK-TKMZBW18-1-1
             TO  H-IDO-YMD                   OF  H-TKMZBW05-I(WK-IDX1)
      *----------  増減区分
           MOVE  WK-ZG-KBN                   OF  WK-TKMZBW18-1-1
             TO  H-ZG-KBN                    OF  H-TKMZBW05-I(WK-IDX1)
      *----------  処理順決定摘要
           MOVE  WK-SRJUN-KT-TEKIYO-1
             TO  H-SRJUN-KT-TEKIYO           OF  H-TKMZBW05-I(WK-IDX1)
      *----------  処理順決定増減
      *----------  処理順決定評価
           MOVE  WK-SRJUN-KT-HYOKA-1
             TO  H-SRJUN-KT-HYOKA            OF  H-TKMZBW05-I(WK-IDX1)
      *----------  受渡計上切替対象フラグ
           MOVE  WK-UKE-KIRIKAE-FLG          OF  WK-SMZJ1922
             TO  H-UKE-KIRIKAE-FLG           OF  H-TKMZBW05-I(WK-IDX1)
      *----------  切替仕訳基準パターンコード
           MOVE  WK-SWK-KJN-PTN-CD           OF  WK-SMZJ1922
             TO  H-SWK-KJN-PTN-CD            OF  H-TKMZBW05-I(WK-IDX1)
      *----------  切替キャッシュフロー2回有効フラグ
           MOVE  WK-CASH-FLOW-2-FLG          OF  WK-SMZJ1922
             TO  H-CASH-FLOW-2-FLG           OF  H-TKMZBW05-I(WK-IDX1)
      *----------  切替基本会計ベースフラグ
           MOVE  WK-KH-KAIKEI-BASE-FLG       OF  WK-SMZJ1922
             TO  H-KH-KAIKEI-BASE-FLG        OF  H-TKMZBW05-I(WK-IDX1)
      *----------  受渡未払未収増幅フラグ
           MOVE  SPACE
             TO  H-UKE-MBMS-ZF-FLG           OF  H-TKMZBW05-I(WK-IDX1)
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-UPD-LOGIN-CMP-CD          OF  H-TKMZBW05-I(WK-IDX1)
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日            =["
      D             H-SYORI-YMD            OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                =["
      D             H-KIDOU-ID             OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード        =["
      D             H-RIYO-CMP-CD          OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード        =["
      D             H-FUND-CD              OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D             H-PTF-CD               OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日            =["
      D             H-KAISI-KJN-YMD        OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日                =["
      D             H-KJN-YMD              OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード            =["
      D             H-MEG-CD               OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード        =["
      D             H-SEC-SBT-CD           OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG             OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                  =["
      D             H-GYOKU-ID             OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":原取引ID              =["
      D             H-TORI-ID              OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":資金種別              =["
      D             H-SIKIN-SBT            OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":異動日                =["
      D             H-IDO-YMD              OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":増減区分              =["
      D             H-ZG-KBN               OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":処理順                =[0]"
      D    DISPLAY  CNS-PGM-ID":処理順決定摘要        =["
      D             H-SRJUN-KT-TEKIYO      OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":処理順決定増減        =["
      D             H-SRJUN-KT-ZOUGEN      OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":処理順決定評価        =["
      D             H-SRJUN-KT-HYOKA       OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":受渡計上切替対象フラグ  =["
      D             H-UKE-KIRIKAE-FLG      OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":切替仕訳基準パターンコード =["
      D             H-SWK-KJN-PTN-CD       OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":切替キャッシュフロー2回有効フラグ =["
      D             H-CASH-FLOW-2-FLG      OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":切替基本会計ベースフラグ   =["
      D             H-KH-KAIKEI-BASE-FLG   OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":受渡未払未収増幅フラグ   =["
      D             H-UKE-MBMS-ZF-FLG      OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":更新日時              =["
      D             "Oracle関数「SYSDATE」]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             H-RIYO-CMP-CD          OF  H-TKMZBW05-I(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ        =["
      D             " ]"
      D    DISPLAY  CNS-PGM-ID":更新プログラムＩＤ    =["
      D             "SMZJ1820]"
      D    DISPLAY  CNS-PGM-ID  ":*** (三)対象資金取引にデータ"
      D             "編集処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-DATA-E-EXT.
           EXIT.
      ******************************************************************
      *    1)ワーク増幅用処理順決定増減を編集
      ******************************************************************
       WK-SOUBA-SYORI-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 1)ワーク増幅用処理順決定増減"
      D             "を編集 START ***"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.増減取引順=["
      D             WK-ZOUGEN-TORI-JUN       OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.増加取引処理順序=["
      D             WK-GKYK-PLUS-SYRI-JUN    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID  ":処理資金取引.証券種別コード      =["
      D             WK-SEC-SBT-CD            OF  WK-TKMZBW18-1-1"]"
      D    DISPLAY  CNS-PGM-ID  ":銘柄別断面情報.証券種別コード    =["
      D             WK-SEC-SBT-CD            OF  WK-TKMZBW03"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク資金取引処理順区分 =["
      D             WK-SIKIN-JUN-KBN"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-ZOUGEN-TORI-JUN      OF  WK-IDO-CALC-PATTERN
             WHEN  CNS-ZOUGEN-TORI-JUN-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":①異動計算パターン.増減取引順＝'2':減少を先  の場合"
      *-----------------------------------------------------------------
               EVALUATE  WK-GKYK-PLUS-SYRI-JUN  OF  WK-IDO-CALC-PATTERN
                 WHEN  CNS-GKYK-SYRI-JUN-1
                   IF  WK-SIKIN-JUN-KBN = CNS-X-1
                   THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                     MOVE  CNS-SRJUN-KT-ZOUGEN-03
                       TO  WK-SB-SRJ-KT-ZOUGEN
                   ELSE
                     MOVE  CNS-SRJUN-KT-ZOUGEN-04
                       TO  WK-SB-SRJ-KT-ZOUGEN
                   END-IF
                 WHEN  CNS-GKYK-SYRI-JUN-2
                 WHEN  CNS-GKYK-SYRI-JUN-3
                   IF  WK-SIKIN-JUN-KBN = CNS-X-1
                   THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                     MOVE  CNS-SRJUN-KT-ZOUGEN-04
                       TO  WK-SB-SRJ-KT-ZOUGEN
                   ELSE
                     MOVE  CNS-SRJUN-KT-ZOUGEN-03
                       TO  WK-SB-SRJ-KT-ZOUGEN
                   END-IF
                 WHEN  SPACE
                   MOVE  CNS-SRJUN-KT-ZOUGEN-03
                     TO  WK-SB-SRJ-KT-ZOUGEN
                 WHEN  OTHER
                   MOVE  ZERO
                     TO  WK-SB-SRJ-KT-ZOUGEN
               END-EVALUATE
             WHEN  CNS-ZOUGEN-TORI-JUN-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":②異動計算パターン.増減取引順＝'1':増加を先  の場合"
      *-----------------------------------------------------------------
               EVALUATE  WK-GKYK-PLUS-SYRI-JUN  OF  WK-IDO-CALC-PATTERN
                 WHEN  CNS-GKYK-SYRI-JUN-1
                   IF  WK-SIKIN-JUN-KBN = CNS-X-1
                   THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                     MOVE  CNS-SRJUN-KT-ZOUGEN-01
                       TO  WK-SB-SRJ-KT-ZOUGEN
                   ELSE
                     MOVE  CNS-SRJUN-KT-ZOUGEN-02
                       TO  WK-SB-SRJ-KT-ZOUGEN
                   END-IF
                 WHEN  CNS-GKYK-SYRI-JUN-2
                 WHEN  CNS-GKYK-SYRI-JUN-3
                   IF  WK-SIKIN-JUN-KBN = CNS-X-1
                   THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":壱)ワーク資金取引処理順区分＝'1'（対象）の場合"
      *-----------------------------------------------------------------
                     MOVE  CNS-SRJUN-KT-ZOUGEN-02
                       TO  WK-SB-SRJ-KT-ZOUGEN
                   ELSE
                     MOVE  CNS-SRJUN-KT-ZOUGEN-01
                       TO  WK-SB-SRJ-KT-ZOUGEN
                   END-IF
                 WHEN  SPACE
                   MOVE  CNS-SRJUN-KT-ZOUGEN-01
                     TO  WK-SB-SRJ-KT-ZOUGEN
                 WHEN  OTHER
                   MOVE  ZERO
                     TO  WK-SB-SRJ-KT-ZOUGEN
               END-EVALUATE
             WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":③異動計算パターン.増減取引順は上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  ZERO                    TO  WK-SB-SRJ-KT-ZOUGEN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク増幅用処理順決定増減=["
      D             WK-SB-SRJ-KT-ZOUGEN"]"
      D    DISPLAY  CNS-PGM-ID  ":*** 1)ワーク増幅用処理順決定増減"
      D             "を編集  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-SOUBA-SYORI-EXT.
           EXIT.
      ******************************************************************
      *        2)対象資金取引情報に増幅データ編集処理
      ******************************************************************
       TAISYO-SK-EDT-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 2)対象資金取引情報に増幅データ"
      D             "編集処理START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT7                                         @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW05
             TO  SQL-TBL-ID7                 OF  SQL-INSERT-1-7,
                 WK-TKMZBW05                 OF  WK-MSG-1-7
      *----------  処理実行日
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03
             TO  H-SYORI-YMD                 OF  H-TKMZBW05-II(WK-IDX2)
      *----------  起動ID
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03
             TO  H-KIDOU-ID                  OF  H-TKMZBW05-II(WK-IDX2)
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW05-II(WK-IDX2)
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZBW05-II(WK-IDX2)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZBW05-II(WK-IDX2)
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD            OF  WK-TKMZBW03
             TO  H-KAISI-KJN-YMD             OF  H-TKMZBW05-II(WK-IDX2)
      *----------  基準日
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMZBW05-II(WK-IDX2)
      *----------  銘柄コード
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-MEG-CD                    OF  H-TKMZBW05-II(WK-IDX2)
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD                OF  H-TKMZBW05-II(WK-IDX2)
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG                 OF  WK-TKMZBW03
             TO  H-TATE-FLG                  OF  H-TKMZBW05-II(WK-IDX2)
      *----------  玉ID
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03
             TO  H-GYOKU-ID                  OF  H-TKMZBW05-II(WK-IDX2)
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-TKMZBW18-1-1
             TO  H-TORI-ID                   OF  H-TKMZBW05-II(WK-IDX2)
      *----------  資金種別
           MOVE  WK-SIKIN-SBT                OF  WK-TKMZBW18-1-1
             TO  H-SIKIN-SBT                 OF  H-TKMZBW05-II(WK-IDX2)
      *----------  異動日
           MOVE  WK-IDO-YMD                  OF  WK-TKMZBW18-1-1
             TO  H-IDO-YMD                   OF  H-TKMZBW05-II(WK-IDX2)
      *----------  増減区分
           MOVE  CNS-X-1
             TO  H-ZG-KBN                    OF  H-TKMZBW05-II(WK-IDX2)
      *----------  処理順決定摘要
           MOVE  WK-SRJUN-KT-TEKIYO-1
             TO  H-SRJUN-KT-TEKIYO           OF  H-TKMZBW05-II(WK-IDX2)
      *----------  処理順決定増減
           MOVE  WK-SB-SRJ-KT-ZOUGEN
             TO  H-SRJUN-KT-ZOUGEN           OF  H-TKMZBW05-II(WK-IDX2)
      *----------  処理順決定評価
           MOVE  WK-SRJUN-KT-HYOKA-1
             TO  H-SRJUN-KT-HYOKA            OF  H-TKMZBW05-II(WK-IDX2)
      *----------  受渡計上切替対象フラグ
           MOVE  SPACE
             TO  H-UKE-KIRIKAE-FLG           OF  H-TKMZBW05-II(WK-IDX2)
      *----------  切替仕訳基準パターンコード
           MOVE  SPACE
             TO  H-SWK-KJN-PTN-CD            OF  H-TKMZBW05-II(WK-IDX2)
      *----------  切替キャッシュフロー2回有効フラグ
           MOVE  SPACE
             TO  H-CASH-FLOW-2-FLG           OF  H-TKMZBW05-II(WK-IDX2)
      *----------  切替基本会計ベースフラグ
           MOVE  SPACE
             TO  H-KH-KAIKEI-BASE-FLG        OF  H-TKMZBW05-II(WK-IDX2)
      *----------  受渡未払未収増幅フラグ
           MOVE  CNS-X-1
             TO  H-UKE-MBMS-ZF-FLG           OF  H-TKMZBW05-II(WK-IDX2)
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-UPD-LOGIN-CMP-CD          OF  H-TKMZBW05-II(WK-IDX2)
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日            =["
      D             H-SYORI-YMD            OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                =["
      D             H-KIDOU-ID             OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード        =["
      D             H-RIYO-CMP-CD          OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード        =["
      D             H-FUND-CD              OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D             H-PTF-CD               OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日            =["
      D             H-KAISI-KJN-YMD        OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":基準日                =["
      D             H-KJN-YMD              OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード            =["
      D             H-MEG-CD               OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード        =["
      D             H-SEC-SBT-CD           OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG             OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                  =["
      D             H-GYOKU-ID             OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":原取引ID              =["
      D             H-TORI-ID              OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":資金種別              =["
      D             H-SIKIN-SBT            OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":異動日                =["
      D             H-IDO-YMD              OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":増減区分              =["
      D             H-ZG-KBN               OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":処理順                =[0]"
      D    DISPLAY  CNS-PGM-ID":処理順決定摘要        =["
      D             H-SRJUN-KT-TEKIYO      OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":処理順決定増減        =["
      D             H-SRJUN-KT-ZOUGEN      OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":処理順決定評価        =["
      D             H-SRJUN-KT-HYOKA       OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":受渡計上切替対象フラグ  =["
      D             H-UKE-KIRIKAE-FLG      OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":切替仕訳基準パターンコード =["
      D             H-SWK-KJN-PTN-CD       OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":切替キャッシュフロー2回有効フラグ =["
      D             H-CASH-FLOW-2-FLG      OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":切替基本会計ベースフラグ   =["
      D             H-KH-KAIKEI-BASE-FLG   OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":受渡未払未収増幅フラグ   =["
      D             H-UKE-MBMS-ZF-FLG      OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":更新日時              =["
      D             "Oracle関数「SYSDATE」]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             H-RIYO-CMP-CD          OF  H-TKMZBW05-II(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ        =["
      D             " ]"
      D    DISPLAY  CNS-PGM-ID":更新プログラムＩＤ    =["
      D             "SMZJ1820]"
      D    DISPLAY  CNS-PGM-ID  ":*** 2)対象資金取引情報に増幅データ"
      D             "編集処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TAISYO-SK-EDT-EXT.
           EXIT.
      ******************************************************************
      *       2）対象資金取引情報にデータinsert処理
      ******************************************************************
       TKMZBW05-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":*** 2）対象資金取引情報にデータinsert処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
           MOVE  SQL-INSERT-1-2              TO  SQLSTMT2               @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT2=["SQLSTMT2"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報INSカーソルオープンフ"  @3212SEINO@@
      D             "ラグ１=["FLG-INSERT-TKMZBW05-CR1 "]"               @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-INSERT-TKMZBW05-CR1 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S2  FROM :SQLSTMT2  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             PERFORM  WK-MSG-1-2-EDIT-RTN
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-020
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           MOVE  WK-KUKAN-KENSUU        TO  HST-CNT
           EXEC SQL  FOR :HST-CNT
               EXECUTE S2
                 USING  :H-TKMZBW05-I-O
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-INSERT-TKMZBW05-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報INSカーソルオープンフ"  @3212SEINO@@
      D             "ラグ１=["FLG-INSERT-TKMZBW05-CR1 "]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":INSERT件数=["SQLERRD(3)"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（一意制約違反)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-2-EDIT-RTN
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-021
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-300
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-2       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー(INSERT)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-2-EDIT-RTN
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-022
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-2       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":IDX2=["WK-IDX2"]"
      *-----------------------------------------------------------------
           IF  WK-IDX2 = ZERO
           THEN
             CONTINUE
           ELSE
             INITIALIZE  SQLSTMT7                                       @3212SEINO@@
             MOVE  SQL-INSERT-1-7              TO  SQLSTMT7             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT7=["SQLSTMT7"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報INSカーソルオープンフ"  @3212SEINO@@
      D             "ラグ２=["FLG-INSERT-TKMZBW05-CR2 "]"               @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-INSERT-TKMZBW05-CR2 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
             EXEC  SQL  PREPARE  S7  FROM :SQLSTMT7  END-EXEC           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  =  CNS-SQL-NORMAL
             THEN
               CONTINUE
             ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-7-EDIT-RTN
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-034
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-7         DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
             MOVE  WK-IDX2              TO  HST-CNT
             EXEC SQL  FOR :HST-CNT
                 EXECUTE S7
                   USING  :H-TKMZBW05-II-O
             END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-INSERT-TKMZBW05-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報INSカーソルオープンフ"  @3212SEINO@@
      D             "ラグ２=["FLG-INSERT-TKMZBW05-CR2 "]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":INSERT件数=["SQLERRD(3)"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（一意制約違反)"
      *-----------------------------------------------------------------
                 PERFORM  WK-MSG-1-7-EDIT-RTN
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-035
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-300
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
                 STRING  CNS-SQL-MSG-INSERT,
                         WK-MSG-1-7       DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー(INSERT)"
      *-----------------------------------------------------------------
                 PERFORM  WK-MSG-1-2-EDIT-RTN
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-036
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                  TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
                 STRING  CNS-SQL-MSG-INSERT,
                         WK-MSG-1-7       DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 2）対象資金取引情報にデータinsert処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-INSERT-EXT.
           EXIT.
      ******************************************************************
      *       WK-MSG-1-2編集処理
      ******************************************************************
       WK-MSG-1-2-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** WK-MSG-1-2編集処理 START ***"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  H-SYORI-YMD            OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-SYORI-YMD           OF  WK-MSG-1-2
      *----------  起動ID
           MOVE  H-KIDOU-ID             OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-KIDOU-ID            OF  WK-MSG-1-2
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD          OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-2
      *----------  ファンドコード
           MOVE  H-FUND-CD              OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-2
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD               OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-2
      *----------  開始基準日
           MOVE  H-KAISI-KJN-YMD        OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-2
      *----------  基準日
           MOVE  H-KJN-YMD              OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-2
      *----------  銘柄コード
           MOVE  H-MEG-CD               OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-2
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD           OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-2
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG             OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-2
      *----------  玉ID
           MOVE  H-GYOKU-ID             OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-2
      *----------  原取引ID
           MOVE  H-TORI-ID              OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-TORI-ID             OF  WK-MSG-1-2
      *----------  資金種別
           MOVE  H-SIKIN-SBT            OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-SIKIN-SBT           OF  WK-MSG-1-2
      *----------  異動日
           MOVE  H-IDO-YMD              OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-IDO-YMD             OF  WK-MSG-1-2
      *----------  増減区分
           MOVE  H-ZG-KBN               OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-ZG-KBN              OF  WK-MSG-1-2
      *----------  処理順決定摘要
           MOVE  H-SRJUN-KT-TEKIYO      OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-SRJUN-KT-TEKIYO     OF  WK-MSG-1-2
      *----------  処理順決定増減
           MOVE  H-SRJUN-KT-ZOUGEN      OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-SRJUN-KT-ZOUGEN     OF  WK-MSG-1-2
      *----------  処理順決定評価
           MOVE  H-SRJUN-KT-HYOKA       OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-SRJUN-KT-HYOKA      OF  WK-MSG-1-2
      *----------  受渡計上切替対象フラグ
           MOVE  H-UKE-KIRIKAE-FLG      OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-UKE-KIRIKAE-FLG     OF  WK-MSG-1-2
      *----------  切替仕訳基準パターンコード
           MOVE  H-SWK-KJN-PTN-CD       OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-SWK-KJN-PTN-CD      OF  WK-MSG-1-2
      *----------  切替キャッシュフロー2回有効フラグ
           MOVE  H-CASH-FLOW-2-FLG      OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-CASH-FLOW-2-FLG     OF  WK-MSG-1-2
      *----------  切替基本会計ベースフラグ
           MOVE  H-KH-KAIKEI-BASE-FLG   OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-KH-KAIKEI-BASE-FLG  OF  WK-MSG-1-2
      *----------  受渡未払未収増幅フラグ
           MOVE  H-UKE-MBMS-ZF-FLG      OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-UKE-MBMS-ZF-FLG     OF  WK-MSG-1-2
      *----------  更新ログインユーザ会社コード
           MOVE  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW05-I(SQLERRD(3) + 1)
             TO  WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** WK-MSG-1-2編集処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-2-EDIT-EXT.                                             @3212SEINO@@
           EXIT.
      ******************************************************************
      *       WK-MSG-1-7編集処理
      ******************************************************************
       WK-MSG-1-7-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** WK-MSG-1-7編集処理 START ***"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  H-SYORI-YMD           OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-SYORI-YMD          OF  WK-MSG-1-7
      *----------  起動ID
           MOVE  H-KIDOU-ID            OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-KIDOU-ID           OF  WK-MSG-1-7
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD         OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD        OF  WK-MSG-1-7
      *----------  ファンドコード
           MOVE  H-FUND-CD             OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-FUND-CD            OF  WK-MSG-1-7
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD              OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-PTF-CD             OF  WK-MSG-1-7
      *----------  開始基準日
           MOVE  H-KAISI-KJN-YMD       OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD      OF  WK-MSG-1-7
      *----------  基準日
           MOVE  H-KJN-YMD             OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-KJN-YMD            OF  WK-MSG-1-7
      *----------  銘柄コード
           MOVE  H-MEG-CD              OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-MEG-CD             OF  WK-MSG-1-7
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD          OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD         OF  WK-MSG-1-7
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG            OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-TATE-FLG           OF  WK-MSG-1-7
      *----------  玉ID
           MOVE  H-GYOKU-ID            OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID           OF  WK-MSG-1-7
      *----------  原取引ID
           MOVE  H-TORI-ID             OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-TORI-ID            OF  WK-MSG-1-7
      *----------  資金種別
           MOVE  H-SIKIN-SBT           OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-SIKIN-SBT          OF  WK-MSG-1-7
      *----------  異動日
           MOVE  H-IDO-YMD             OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-IDO-YMD            OF  WK-MSG-1-7
      *----------  増減区分
           MOVE  H-ZG-KBN              OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-ZG-KBN             OF  WK-MSG-1-7
      *----------  処理順決定摘要
           MOVE  H-SRJUN-KT-TEKIYO     OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-SRJUN-KT-TEKIYO    OF  WK-MSG-1-7
      *----------  処理順決定増減
           MOVE  H-SRJUN-KT-ZOUGEN     OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-SRJUN-KT-ZOUGEN    OF  WK-MSG-1-7
      *----------  処理順決定評価
           MOVE  H-SRJUN-KT-HYOKA      OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-SRJUN-KT-HYOKA     OF  WK-MSG-1-7
      *----------  受渡計上切替対象フラグ
           MOVE  H-UKE-KIRIKAE-FLG     OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-UKE-KIRIKAE-FLG    OF  WK-MSG-1-7
      *----------  切替仕訳基準パターンコード
           MOVE  H-SWK-KJN-PTN-CD      OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-SWK-KJN-PTN-CD     OF  WK-MSG-1-7
      *----------  切替キャッシュフロー2回有効フラグ
           MOVE  H-CASH-FLOW-2-FLG     OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-CASH-FLOW-2-FLG    OF  WK-MSG-1-7
      *----------  切替基本会計ベースフラグ
           MOVE  H-KH-KAIKEI-BASE-FLG  OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-KH-KAIKEI-BASE-FLG OF  WK-MSG-1-7
      *----------  受渡未払未収増幅フラグ
           MOVE  H-UKE-MBMS-ZF-FLG     OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-UKE-MBMS-ZF-FLG    OF  WK-MSG-1-7
      *----------  更新ログインユーザ会社コード
           MOVE  H-UPD-LOGIN-CMP-CD    OF  H-TKMZBW05-II(SQLERRD(3) + 1)
             TO  WK-UPD-LOGIN-CMP-CD   OF  WK-MSG-1-7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** WK-MSG-1-7編集処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-7-EDIT-EXT.                                             @3212SEINO@@
           EXIT.
      ******************************************************************
      *       3.2.2 対象取引処理順序決定処理
      ******************************************************************
       TSST-SRZZKZ-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2 対象取引処理順序決定処理"
      D             " START ***"
      D    DISPLAY  CNS-PGM-ID  ":異動計算パターン.処理順序 =["
      D             WK-SYRI-JUN         OF  WK-IDO-CALC-PATTERN "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-SYRI-JUN        OF  WK-IDO-CALC-PATTERN
             WHEN  CNS-SYRI-JUN-1
             WHEN  CNS-SYRI-JUN-2
             WHEN  CNS-SYRI-JUN-5
             WHEN  CNS-SYRI-JUN-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":◆異動計算パターン.処理順序＝('1'"
      D             "or'2'or'5'or'6')の場合"
      *-----------------------------------------------------------------
      *----------  3.2.2.1) 対象資金取引情報テーブルから処理対象のレコードを取得する
               PERFORM  TKMZBW05-GET-1256-RTN
      *----------  3.2.2.2)『対象資金取引情報』カーソルフェッチする
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSST-SRZZKZ-RTN-1]"           GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  TKMZBW05-FET-1256-RTN
                 UNTIL  FLG-TKMZBW05-CR-FETCH-1  =  CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSST-SRZZKZ-RTN-1]"           GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  3.2.2.3)『対象資金取引情報』カーソルクローズ処理
      *        PERFORM  TKMZBW05-CLS-1256-RTN                           @3212SEINO@@
             WHEN  CNS-SYRI-JUN-3
             WHEN  CNS-SYRI-JUN-4
             WHEN  CNS-SYRI-JUN-7
             WHEN  CNS-SYRI-JUN-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":◆異動計算パターン.処理順序＝('3'"
      D             "or'4'or'7'or'8')の場合"
      *-----------------------------------------------------------------
      *----------  3.2.2.1)3478の場合対象資金取引情報テーブルから処理対象のレコードを取得する
               PERFORM  TKMZBW05-GET-3478-RTN
      *----------  3.2.2.2)3478の場合『対象資金取引情報』カーソルフェッチする
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSST-SRZZKZ-RTN-2]"           GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
               PERFORM  TKMZBW05-FET-3478-RTN
                 UNTIL  FLG-TKMZBW05-CR-FETCH-2  =  CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSST-SRZZKZ-RTN-2]"           GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *----------  3.2.2.3)3478の場合『対象資金取引情報』カーソルクローズ処理
      *        PERFORM  TKMZBW05-CLS-3478-RTN                           @3212SEINO@@
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":パラメータエラー"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-023
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2 対象取引処理順序決定処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TSST-SRZZKZ-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2.1)1256の場合対象資金取引情報テーブルから処理対象のレコードを取得する
      ******************************************************************
       TKMZBW05-GET-1256-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.1)1256の場合対象資金取引情"
      D    "報テーブルから処理対象のレコードを取得する START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT3                                         @3212SEINO@@
      *----------  対象資金取引情報テーブルから処理対象のSQL文設定（「別紙1-3 SQL説明」を参照）
           MOVE  WK-TABLE-TKMZBW05
             TO  SQL-TBL-ID3            OF  SQL-SELECT-1-3,
                 WK-TKMZBW05            OF  WK-MSG-1-3
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-TKMZBW03
             TO  H-SYORI-YMD            OF  H-TKMZBW05-S-1,
                 WK-SYORI-YMD           OF  WK-MSG-1-3
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-TKMZBW03
             TO  H-KIDOU-ID             OF  H-TKMZBW05-S-1,
                 WK-KIDOU-ID            OF  WK-MSG-1-3
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW05-S-1,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMZBW05-S-1,
                 WK-FUND-CD             OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMZBW05-S-1,
                 WK-PTF-CD              OF  WK-MSG-1-3
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03
             TO  H-KJN-YMD              OF  H-TKMZBW05-S-1,
                 WK-KJN-YMD             OF  WK-MSG-1-3
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-MEG-CD               OF  H-TKMZBW05-S-1,
                 WK-MEG-CD              OF  WK-MSG-1-3
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD           OF  H-TKMZBW05-S-1,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG            OF  WK-TKMZBW03
             TO  H-TATE-FLG             OF  H-TKMZBW05-S-1,
                 WK-TATE-FLG            OF  WK-MSG-1-3
      *----------  玉ID
           MOVE  WK-GYOKU-ID            OF  WK-TKMZBW03
             TO  H-GYOKU-ID             OF  H-TKMZBW05-S-1,
                 WK-GYOKU-ID            OF  WK-MSG-1-3
           MOVE  SQL-SELECT-1-3         TO  SQLSTMT3                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日            =["
      D             H-SYORI-YMD              OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                =["
      D             H-KIDOU-ID               OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード        =["
      D             H-RIYO-CMP-CD            OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード        =["
      D             H-FUND-CD                OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D             H-PTF-CD                 OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":基準日                =["
      D             H-KJN-YMD                OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード            =["
      D             H-MEG-CD                 OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード        =["
      D             H-SEC-SBT-CD             OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG               OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                  =["
      D             H-GYOKU-ID               OF  H-TKMZBW05-S-1"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT3=["SQLSTMT3"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-3=["WK-MSG-1-3"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報カーソルオープンフラ"   @3212SEINO@@
      D             "グ_1=["FLG-TKMZBW05-CR-OPEN-1"]"                   @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW05-CR-OPEN-1 = CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S3  FROM :SQLSTMT3 END-EXEC              @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-024
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZBW05_CUR  CURSOR  FOR S3 END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZBW05_CUR
                 USING  :H-TKMZBW05-S-1.H-SYORI-YMD,
                        :H-TKMZBW05-S-1.H-KIDOU-ID,
                        :H-TKMZBW05-S-1.H-RIYO-CMP-CD,
                        :H-TKMZBW05-S-1.H-FUND-CD,
                        :H-TKMZBW05-S-1.H-PTF-CD,
                        :H-TKMZBW05-S-1.H-KJN-YMD,
                        :H-TKMZBW05-S-1.H-MEG-CD,
                        :H-TKMZBW05-S-1.H-SEC-SBT-CD,
                        :H-TKMZBW05-S-1.H-TATE-FLG,
                        :H-TKMZBW05-S-1.H-GYOKU-ID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報カーソルオープン"
      D             "フラグ=["FLG-TKMZBW05-CR-OPEN-1"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW05-CR-OPEN-1
             MOVE  CNS-ON               TO  FLG-TKMZBW05-CR-FETCH-1
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報カーソルオープンフラ"
      D             "グ_1=["FLG-TKMZBW05-CR-OPEN-1"]"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.1)1256の場合対象資金取引情"
      D    "報テーブルから処理対象のレコードを取得する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-GET-1256-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2.2)1256の場合『対象資金取引情報』カーソルフェッチする
      ******************************************************************
       TKMZBW05-FET-1256-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.2)1256の場合『対象資金取引"
      D             "情報』カーソルフェッチする START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW05-1
           EXEC  SQL
             FETCH  TKMZBW05_CUR
             INTO   :H-TKMZBW05-1-O
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH:NORMAL"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH:NOTFOUND"
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグ"
      D             "=["FLG-TKMZBW05-CR-FETCH-1"]"
      *-----------------------------------------------------------------
               MOVE  CNS-OFF              TO  FLG-TKMZBW05-CR-FETCH-1
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグ"
      D             "=["FLG-TKMZBW05-CR-FETCH-1"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-026
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3         DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":FETCH个数=["  SQLERRD(3)"]"
      *-----------------------------------------------------------------
           IF  SQLERRD(3) = CNS-0
           THEN
             CONTINUE
           ELSE
             COMPUTE  WK-KUKAN-KENSUU-2
                       = SQLERRD(3) - WK-GOUKEI-KENSUU-2
             MOVE  SQLERRD(3)           TO  WK-GOUKEI-KENSUU-2
             INITIALIZE  H-TKMZBW05-2
                         H-TKMZBW05-U-2
                         WK-MSG-1-4
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク区間件数順序決定用=["
      D                         WK-KUKAN-KENSUU-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク合計件数順序決定用=["
      D                         WK-GOUKEI-KENSUU-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理順決定=["H-TKMZBW05-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理順決定キー=["H-TKMZBW05-U-2"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW05-FET-1256-RTN]"       GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             PERFORM  VARYING  WK-IDX3  FROM CNS-1 BY CNS-1
               UNTIL  WK-IDX3  > WK-KUKAN-KENSUU-2
      *----------  別紙1-4項目設定
      *----------  処理実行日
               MOVE  WK-SYORI-YMD       OF  WK-TKMZBW03
                 TO  H-SYORI-YMD        OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  起動ID
               MOVE  WK-KIDOU-ID        OF  WK-TKMZBW03
                 TO  H-KIDOU-ID         OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  利用会社コード
               MOVE  WK-RIYO-CMP-CD     OF  WK-TKMZBW03
                 TO  H-RIYO-CMP-CD      OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  ファンドコード
               MOVE  WK-FUND-CD         OF  WK-TKMZBW03
                 TO  H-FUND-CD          OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  ポートフォリオコード
               MOVE  WK-PTF-CD          OF  WK-TKMZBW03
                 TO  H-PTF-CD           OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  基準日
               MOVE  WK-KJN-YMD         OF  WK-TKMZBW03
                 TO  H-KJN-YMD          OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  銘柄コード
               MOVE  WK-MEG-CD          OF  WK-TKMZBW03
                 TO  H-MEG-CD           OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  証券種別コード
               MOVE  WK-SEC-SBT-CD      OF  WK-TKMZBW03
                 TO  H-SEC-SBT-CD       OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  資産負債・買建売建フラグ
               MOVE  WK-TATE-FLG        OF  WK-TKMZBW03
                 TO  H-TATE-FLG         OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  玉ID
               MOVE  WK-GYOKU-ID        OF  WK-TKMZBW03
                 TO  H-GYOKU-ID         OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  原取引ID
               MOVE  H-TORI-ID          OF  H-TKMZBW05-1(WK-IDX3)
                 TO  H-TORI-ID          OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  資金種別
               MOVE  H-SIKIN-SBT        OF  H-TKMZBW05-1(WK-IDX3)
                 TO  H-SIKIN-SBT        OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  異動日
               MOVE  H-IDO-YMD          OF  H-TKMZBW05-1(WK-IDX3)
                 TO  H-IDO-YMD          OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  増減区分
               MOVE  H-ZG-KBN           OF  H-TKMZBW05-1(WK-IDX3)
                 TO  H-ZG-KBN           OF  H-TKMZBW05-U-2(WK-IDX3)
               MOVE  WK-TABLE-TKMZBW05
                 TO  WK-TKMZBW05        OF  WK-MSG-1-4
      *----------  ①処理順決定処理
               COMPUTE  WK-SRZ = WK-SRZ + CNS-1
               MOVE  WK-SRZ
                 TO  H-SRJUN            OF  H-TKMZBW05-2(WK-IDX3)
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理順                =["
      D             H-SRJUN             OF  H-TKMZBW05-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日            =["
      D             H-SYORI-YMD         OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                =["
      D             H-KIDOU-ID          OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード        =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード        =["
      D             H-FUND-CD           OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D             H-PTF-CD            OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":基準日                =["
      D             H-KJN-YMD           OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード            =["
      D             H-MEG-CD            OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード        =["
      D             H-SEC-SBT-CD        OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                  =["
      D             H-GYOKU-ID          OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":原取引ID              =["
      D             H-TORI-ID           OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":資金種別              =["
      D             H-SIKIN-SBT         OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":異動日                =["
      D             H-IDO-YMD           OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":増減区分              =["
      D             H-ZG-KBN            OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      *-----------------------------------------------------------------
             END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW05-FET-1256-RTN]"       GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             IF  WK-KUKAN-KENSUU-2 = ZERO
             THEN
               CONTINUE
             ELSE
      *----------  ②対象資金取引テーブルにupdate処理（「別紙1-4 SQL説明」を参照）
               PERFORM  TKMZBW05-UPDATE-RTN
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.2)1256の場合『対象資金取引"
      D             "情報』カーソルフェッチする  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-FET-1256-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2.3)1256の場合『対象資金取引情報』カーソルクローズ処理
      ******************************************************************
      *TKMZBW05-CLS-1256-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.3)1256の場合『対象資金取引"
      *D             "情報』カーソルクローズ処理 START ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZBW05_CUR
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZBW05-CR-OPEN-1
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-POS-027
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-3         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.3)1256の場合『対象資金取引"
      *D             "情報』カーソルクローズ処理  END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZBW05-CLS-1256-EXT.
      *    EXIT.
      ******************************************************************
      *        3.2.2.1)3478の場合対象資金取引情報テーブルから処理対象のレコードを取得する
      ******************************************************************
       TKMZBW05-GET-3478-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.1)3478の場合対象資金取引情"
      D    "報テーブルから処理対象のレコードを取得する START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT5                                         @3212SEINO@@
      *----------  対象資金取引情報テーブルから処理対象のSQL文設定（「別紙1-5 SQL説明」を参照）
           MOVE  WK-TABLE-TKMZBW05
             TO  SQL-TBL-ID5            OF  SQL-SELECT-1-5,
                 WK-TKMZBW05            OF  WK-MSG-1-5
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-TKMZBW03
             TO  H-SYORI-YMD            OF  H-TKMZBW05-S-3,
                 WK-SYORI-YMD           OF  WK-MSG-1-5
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-TKMZBW03
             TO  H-KIDOU-ID             OF  H-TKMZBW05-S-3,
                 WK-KIDOU-ID            OF  WK-MSG-1-5
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW05-S-3,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-5
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMZBW05-S-3,
                 WK-FUND-CD             OF  WK-MSG-1-5
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMZBW05-S-3,
                 WK-PTF-CD              OF  WK-MSG-1-5
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03
             TO  H-KJN-YMD              OF  H-TKMZBW05-S-3,
                 WK-KJN-YMD             OF  WK-MSG-1-5
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-MEG-CD               OF  H-TKMZBW05-S-3,
                 WK-MEG-CD              OF  WK-MSG-1-5
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD           OF  H-TKMZBW05-S-3,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-5
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG            OF  WK-TKMZBW03
             TO  H-TATE-FLG             OF  H-TKMZBW05-S-3,
                 WK-TATE-FLG            OF  WK-MSG-1-5
      *----------  玉ID
           MOVE  WK-GYOKU-ID            OF  WK-TKMZBW03
             TO  H-GYOKU-ID             OF  H-TKMZBW05-S-3,
                 WK-GYOKU-ID            OF  WK-MSG-1-5
           MOVE  SQL-SELECT-1-5         TO  SQLSTMT5                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日            =["
      D             H-SYORI-YMD         OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                =["
      D             H-KIDOU-ID          OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード        =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード        =["
      D             H-FUND-CD           OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D             H-PTF-CD            OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":基準日                =["
      D             H-KJN-YMD           OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード            =["
      D             H-MEG-CD            OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード        =["
      D             H-SEC-SBT-CD        OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                  =["
      D             H-GYOKU-ID          OF  H-TKMZBW05-S-3"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT5=["SQLSTMT5"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-5=["WK-MSG-1-5"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報カーソルオープンフラ"   @3212SEINO@@
      D             "グ_2=["FLG-TKMZBW05-CR-OPEN-2"]"                   @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW05-CR-OPEN-2 = CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S5  FROM :SQLSTMT5  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-028
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZBW05_CUR_1  CURSOR  FOR S5 END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZBW05_CUR_1
                 USING  :H-TKMZBW05-S-3.H-SYORI-YMD,
                        :H-TKMZBW05-S-3.H-KIDOU-ID,
                        :H-TKMZBW05-S-3.H-RIYO-CMP-CD,
                        :H-TKMZBW05-S-3.H-FUND-CD,
                        :H-TKMZBW05-S-3.H-PTF-CD,
                        :H-TKMZBW05-S-3.H-KJN-YMD,
                        :H-TKMZBW05-S-3.H-MEG-CD,
                        :H-TKMZBW05-S-3.H-SEC-SBT-CD,
                        :H-TKMZBW05-S-3.H-TATE-FLG,
                        :H-TKMZBW05-S-3.H-GYOKU-ID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報カーソルオープン"
      D             "フラグ=["FLG-TKMZBW05-CR-FETCH-2"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW05-CR-OPEN-2
             MOVE  CNS-ON               TO  FLG-TKMZBW05-CR-FETCH-2
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報カーソルオープンフラ"   @3212SEINO@@
      D             "グ_2=["FLG-TKMZBW05-CR-OPEN-2"]"                   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報カーソルオープン"
      D             "フラグ=["FLG-TKMZBW05-CR-FETCH-2"]"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-029
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.1)3478の場合対象資金取引情"
      D    "報テーブルから処理対象のレコードを取得する  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-GET-3478-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2.2)3478の場合『対象資金取引情報』カーソルフェッチする
      ******************************************************************
       TKMZBW05-FET-3478-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.2)3478の場合『対象資金取引"
      D             "情報』カーソルフェッチする START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW05-3
           EXEC  SQL
             FETCH  TKMZBW05_CUR_1
             INTO   :H-TKMZBW05-3-O
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH:NORMAL"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH:NOTFOUND"
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグ"
      D             "=["FLG-TKMZBW05-CR-FETCH-2"]"
      *-----------------------------------------------------------------
               MOVE  CNS-OFF              TO  FLG-TKMZBW05-CR-FETCH-2
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグ"
      D             "=["FLG-TKMZBW05-CR-FETCH-2"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-030
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-5         DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":FETCH个数=["  SQLERRD(3)"]"
      *-----------------------------------------------------------------
           IF  SQLERRD(3) = CNS-0
           THEN
             CONTINUE
           ELSE
             COMPUTE  WK-KUKAN-KENSUU-2
                       = SQLERRD(3) - WK-GOUKEI-KENSUU-2
             MOVE  SQLERRD(3)           TO  WK-GOUKEI-KENSUU-2
             INITIALIZE  H-TKMZBW05-2
                         H-TKMZBW05-U-2
                         WK-MSG-1-4
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク区間件数順序決定用=["
      D                         WK-KUKAN-KENSUU-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク合計件数順序決定用=["
      D                         WK-GOUKEI-KENSUU-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理順決定=["H-TKMZBW05-2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理順決定キー=["H-TKMZBW05-U-2"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW05-FET-3478-RTN]"       GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             PERFORM  VARYING  WK-IDX3  FROM CNS-1 BY CNS-1
               UNTIL  WK-IDX3  > WK-KUKAN-KENSUU-2
      *----------  別紙1-4項目設定
      *----------  処理実行日
               MOVE  WK-SYORI-YMD       OF  WK-TKMZBW03
                 TO  H-SYORI-YMD        OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  起動ID
               MOVE  WK-KIDOU-ID        OF  WK-TKMZBW03
                 TO  H-KIDOU-ID         OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  利用会社コード
               MOVE  WK-RIYO-CMP-CD     OF  WK-TKMZBW03
                 TO  H-RIYO-CMP-CD      OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  ファンドコード
               MOVE  WK-FUND-CD         OF  WK-TKMZBW03
                 TO  H-FUND-CD          OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  ポートフォリオコード
               MOVE  WK-PTF-CD          OF  WK-TKMZBW03
                 TO  H-PTF-CD           OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  基準日
               MOVE  WK-KJN-YMD         OF  WK-TKMZBW03
                 TO  H-KJN-YMD          OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  銘柄コード
               MOVE  WK-MEG-CD          OF  WK-TKMZBW03
                 TO  H-MEG-CD           OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  証券種別コード
               MOVE  WK-SEC-SBT-CD      OF  WK-TKMZBW03
                 TO  H-SEC-SBT-CD       OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  資産負債・買建売建フラグ
               MOVE  WK-TATE-FLG        OF  WK-TKMZBW03
                 TO  H-TATE-FLG         OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  玉ID
               MOVE  WK-GYOKU-ID        OF  WK-TKMZBW03
                 TO  H-GYOKU-ID         OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  原取引ID
               MOVE  H-TORI-ID          OF  H-TKMZBW05-3(WK-IDX3)
                 TO  H-TORI-ID          OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  資金種別
               MOVE  H-SIKIN-SBT        OF  H-TKMZBW05-3(WK-IDX3)
                 TO  H-SIKIN-SBT        OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  異動日
               MOVE  H-IDO-YMD          OF  H-TKMZBW05-3(WK-IDX3)
                 TO  H-IDO-YMD          OF  H-TKMZBW05-U-2(WK-IDX3)
      *----------  増減区分
               MOVE  H-ZG-KBN           OF  H-TKMZBW05-3(WK-IDX3)
                 TO  H-ZG-KBN           OF  H-TKMZBW05-U-2(WK-IDX3)
               MOVE  WK-TABLE-TKMZBW05
                 TO  WK-TKMZBW05        OF  WK-MSG-1-4
      *----------  ①処理順決定処理
               COMPUTE  WK-SRZ = WK-SRZ + CNS-1
               MOVE  WK-SRZ
                 TO  H-SRJUN            OF  H-TKMZBW05-2(WK-IDX3)
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理順                =["
      D             H-SRJUN             OF  H-TKMZBW05-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日            =["
      D             H-SYORI-YMD         OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                =["
      D             H-KIDOU-ID          OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード        =["
      D             H-RIYO-CMP-CD       OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード        =["
      D             H-FUND-CD           OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D             H-PTF-CD            OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":基準日                =["
      D             H-KJN-YMD           OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード            =["
      D             H-MEG-CD            OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード        =["
      D             H-SEC-SBT-CD        OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG          OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                  =["
      D             H-GYOKU-ID          OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":原取引ID              =["
      D             H-TORI-ID           OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":資金種別              =["
      D             H-SIKIN-SBT         OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":異動日                =["
      D             H-IDO-YMD           OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":増減区分              =["
      D             H-ZG-KBN            OF  H-TKMZBW05-U-2(WK-IDX3)"]"
      *-----------------------------------------------------------------
             END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW05-FET-3478-RTN]"       GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             IF  WK-KUKAN-KENSUU-2 = ZERO
             THEN
               CONTINUE
             ELSE
      *----------  ②対象資金取引テーブルにupdate処理（「別紙1-4 SQL説明」を参照）
               PERFORM  TKMZBW05-UPDATE-RTN
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.2)3478の場合『対象資金取引"
      D             "情報』カーソルフェッチする  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-FET-3478-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2.3)3478の場合『対象資金取引情報』カーソルクローズ処理
      ******************************************************************
      *TKMZBW05-CLS-3478-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.3)3478の場合『対象資金取引"
      *D             "情報』カーソルクローズ処理 START ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZBW05_CUR_1
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZBW05-CR-OPEN-2
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-POS-031
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-5         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID  ":*** 3.2.2.3)3478の場合『対象資金取引"
      *D             "情報』カーソルクローズ処理  END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZBW05-CLS-3478-EXT.
      *    EXIT.
      ******************************************************************
      *        ②対象資金取引テーブルにupdate処理（「別紙1-4 SQL説明」を参照）
      ******************************************************************
       TKMZBW05-UPDATE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** ②対象資金取引テーブルにupdate"
      D             "処理（「別紙1-4 SQL説明」を参照） START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW05
             TO  SQL-TBL-ID4            OF  SQL-UPDATE-1-4
           MOVE  SQL-UPDATE-1-4         TO  SQLSTMT4                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT4=["SQLSTMT4"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報UPDカーソルオープンフ"  @3212SEINO@@
      D             "ラグ=["FLG-UPDATE-TKMZBW05 "]"                     @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-UPDATE-TKMZBW05 = CNS-OFF                            @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S4  FROM :SQLSTMT4  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             PERFORM  WK-MSG-1-4-EDIT-RTN
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-032
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           MOVE  WK-KUKAN-KENSUU-2      TO  HST-CNT
           EXEC SQL  FOR :HST-CNT
               EXECUTE S4
                 USING  :H-TKMZBW05-2-O,
                        :H-TKMZBW05-U-2-O
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":UPDATE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-UPDATE-TKMZBW05         @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報UPDカーソルオープンフ"  @3212SEINO@@
      D             "ラグ=["FLG-UPDATE-TKMZBW05 "]"                     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":UPDATE件数=["SQLERRD(3)"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（UPDATE)"
      *-----------------------------------------------------------------
               PERFORM  WK-MSG-1-4-EDIT-RTN
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-033
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-4         DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** ②対象資金取引テーブルにupdate"
      D             "処理（「別紙1-4 SQL説明」を参照）  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW05-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *       WK-MSG-1-4編集処理
      ******************************************************************
       WK-MSG-1-4-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** WK-MSG-1-4編集処理 START ***"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  H-SYORI-YMD        OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-SYORI-YMD       OF  WK-MSG-1-4
      *----------  起動ID
           MOVE  H-KIDOU-ID         OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-KIDOU-ID        OF  WK-MSG-1-4
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD      OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD     OF  WK-MSG-1-4
      *----------  ファンドコード
           MOVE  H-FUND-CD          OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-FUND-CD         OF  WK-MSG-1-4
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD           OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-PTF-CD          OF  WK-MSG-1-4
      *----------  基準日
           MOVE  H-KJN-YMD          OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-KJN-YMD         OF  WK-MSG-1-4
      *----------  銘柄コード
           MOVE  H-MEG-CD           OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-MEG-CD          OF  WK-MSG-1-4
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD       OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD      OF  WK-MSG-1-4
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG         OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-TATE-FLG        OF  WK-MSG-1-4
      *----------  玉ID
           MOVE  H-GYOKU-ID         OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID        OF  WK-MSG-1-4
      *----------  原取引ID
           MOVE  H-TORI-ID          OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-TORI-ID         OF  WK-MSG-1-4
      *----------  資金種別
           MOVE  H-SIKIN-SBT        OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-SIKIN-SBT       OF  WK-MSG-1-4
      *----------  異動日
           MOVE  H-IDO-YMD          OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-IDO-YMD         OF  WK-MSG-1-4
      *----------  増減区分
           MOVE  H-ZG-KBN           OF  H-TKMZBW05-U-2(SQLERRD(3) + 1)
             TO  WK-ZG-KBN          OF  WK-MSG-1-4
           MOVE  WK-TABLE-TKMZBW05
             TO  WK-TKMZBW05        OF  WK-MSG-1-4
      *----------  処理順決定処理
           MOVE  H-SRJUN            OF  H-TKMZBW05-2(SQLERRD(3) + 1)
             TO  WK-SRJUN           OF  WK-MSG-1-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** WK-MSG-1-4編集処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-1-4-EDIT-EXT.                                             @3212SEINO@@
           EXIT.
      ******************************************************************
      *     3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージの設定
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理1 START ***"
      D    DISPLAY CNS-PGM-ID":RTN-CD    OF  PARM-SCZY1170-ARG1=["
      D                        RTN-CD    OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"             USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO     PARM-SMZJ1820-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":PARM-SCZY1170-RTNPKG=["
      D            PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":  COUNTER = ["
      D            COUNTER               OF PARM-SMZJ1820-ARG3"]"
      D    DISPLAY CNS-PGM-ID":  エラー検知プログラム名 = ["
      D            ERR-PGM-ID            OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  ポジション = ["
      D            ERR-POS               OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  リターンコード = ["
      D            RTN-CD                OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコード = ["
      D            DETAIL-RTN-CD         OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D            DETAIL-RTN-CD-FLG     OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  フリーメッセージ = ["
      D            FREE-MSG              OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":***リターンパッケージの処理1  END  ***"
      D    DISPLAY  CNS-PGM-ID":***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           GOBACK.
      ******************************************************************
      *     3.4.1 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID ":TKMZBW18_CUR OPEN FLAG   =["
      D             FLG-TKMZBW18-CR-OPEN "]"
      D    DISPLAY  CNS-PGM-ID ":TKMZBW05_CUR OPEN FLAG   =["
      D             FLG-TKMZBW05-CR-OPEN-1 "]"
      D    DISPLAY  CNS-PGM-ID ":TKMZBW05_CUR_1 OPEN FLAG =["
      D             FLG-TKMZBW05-CR-OPEN-2 "]"
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報INSカーソルオープンフ"  @3212SEINO@@
      D             "ラグ１=["FLG-INSERT-TKMZBW05-CR1 "]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報INSカーソルオープンフ"  @3212SEINO@@
      D             "ラグ２=["FLG-INSERT-TKMZBW05-CR2 "]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報UPDカーソルオープンフ"  @3212SEINO@@
      D             "ラグ=["FLG-UPDATE-TKMZBW05 "]"                     @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグA=["  @3212SEINO@@
      D             FLG-TKMZBW18-TKMXST00-A "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグB=["  @3212SEINO@@
      D             FLG-TKMZBW18-TKMXST00-B "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  対象資金取引情報INSカーソルオープンフラグ１          @3212SEINO@@
           IF  FLG-INSERT-TKMZBW05-CR1  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-INSERT-TKMZBW05-CR1     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  対象資金取引情報INSカーソルオープンフラグ２          @3212SEINO@@
           IF  FLG-INSERT-TKMZBW05-CR2  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-INSERT-TKMZBW05-CR2     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  対象資金取引情報UPDカーソルオープンフラグ            @3212SEINO@@
           IF  FLG-UPDATE-TKMZBW05  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-UPDATE-TKMZBW05         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  対象資金取引カーソルオープンフラグA                  @3212SEINO@@
           IF  FLG-TKMZBW18-TKMXST00-A  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-TKMZBW18-TKMXST00-A     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  対象資金取引カーソルオープンフラグB                  @3212SEINO@@
           IF  FLG-TKMZBW18-TKMXST00-B  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-TKMZBW18-TKMXST00-B     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           IF  FLG-TKMZBW18-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
               CLOSE TKMZBW18_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(CLOSE) =[" SQLCODE "]"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF               TO  FLG-TKMZBW18-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":TKMZBW18_CUR OPEN FLAG =["
      D             FLG-TKMZBW18-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW05-CR-OPEN-1 = CNS-ON
           THEN
             EXEC  SQL
               CLOSE TKMZBW05_CUR
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(CLOSE) =[" SQLCODE "]"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF               TO  FLG-TKMZBW05-CR-OPEN-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":TKMZBW05_CUR OPEN FLAG =["
      D             FLG-TKMZBW05-CR-OPEN-1 "]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW05-CR-OPEN-2 = CNS-ON
           THEN
             EXEC  SQL
               CLOSE TKMZBW05_CUR_1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SQLCODE(CLOSE) =[" SQLCODE "]"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF               TO  FLG-TKMZBW05-CR-OPEN-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":TKMZBW05_CUR_1 OPEN FLAG =["
      D             FLG-TKMZBW05-CR-OPEN-2 "]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報INSカーソルオープンフ"  @3212SEINO@@
      D             "ラグ１=["FLG-INSERT-TKMZBW05-CR1 "]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報INSカーソルオープンフ"  @3212SEINO@@
      D             "ラグ２=["FLG-INSERT-TKMZBW05-CR2 "]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引情報UPDカーソルオープンフ"  @3212SEINO@@
      D             "ラグ=["FLG-UPDATE-TKMZBW05 "]"                     @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグA=["  @3212SEINO@@
      D             FLG-TKMZBW18-TKMXST00-A "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":対象資金取引カーソルオープンフラグB=["  @3212SEINO@@
      D             FLG-TKMZBW18-TKMXST00-B "]"                         @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":PARM-SMZJ1820-INOUT=["
      D            PARM-SMZJ1820-INOUT"]"
      *-----------------------------------------------------------------
      *----------  リターンパッケージの設定
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理2 START ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"             USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO     PARM-SMZJ1820-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":PARM-SCZY1170-RTNPKG=["
      D            PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":  COUNTER  = ["
      D            COUNTER               OF PARM-SMZJ1820-ARG3"]"
      D    DISPLAY CNS-PGM-ID":  エラー検知プログラム名= ["
      D            ERR-PGM-ID            OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  ポジション = ["
      D            ERR-POS               OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  リターンコード = ["
      D            RTN-CD                OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコード = ["
      D            DETAIL-RTN-CD         OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D            DETAIL-RTN-CD-FLG     OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  フリーメッセージ = ["
      D            FREE-MSG              OF PARM-SMZJ1820-ARG3(COUNTER
      D                                  OF PARM-SMZJ1820-ARG3)"]"
      D    DISPLAY CNS-PGM-ID
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理2  END  ***"
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
