      ******************************************************************
      *$Header: $
      ******************************************************************
      *
      *     システムＩＤ   : T-STAR
      *     システム名称   : 次期TSTARシステム
      *     プログラムＩＤ : SCZY4023
      *     プログラム名称 : ポートフォリオと有効期間取得-IIIルーチン
      *     処理概要       : ポートフォリオを範囲またはＡＬＬ指定して、
      *                      条件に合致した複数のポートフォリオの
      *                      配列をすべて返却する。
      *                      ポートフォリオが存在しても、
      *                      権限チェックで通らない場合は０件で返す。
      *     更新ＤＢ       : なし
      *     参照ＤＢ       : (TKPFZK01)ポートフォリオ属性
      *                     （TKPFZK02)ポートフォリオ所属処理グループ
      *     引数           : IN  利用会社コード
      *                      IN  業務グループコード
      *                      IN  ログインユーザ会社コード
      *                      IN  オール指定
      *                      IN  グループ
      *                      IN  ファンド&ポートフォリオ
      *                      IN  権限チェック有無
      *                      IN  日中夜間区分
      *                      IN  APL指定出力件数
      *                      OUT ヒット件数
      *                      OUT 返却データ
      *                      RTNパッケージ
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20080410   新規  SCS          周兵  新規作成
      *     20081020   修正  SCS          陳新梅 テーマ④
      *     20081023   修正  SCS        李海中  連結障害対応No.0000119
      *     20081121   修正  SCS        王永建  連結障害対応No.0000356
      *     20081209   修正   SCS       王斌    連結障害対応No.0000211
      *     20081209   修正   SCS       王斌    残タスク    No.0000153
      *     20081209   修正   SCS       王斌    連結障害対応No.0000589
      *     20090107   修正   SCS       韓均    残タスク    No.0000169
      *     20090218   修正  SCS        李峰    残テーマNo.196
      *     20090219   修正  SCS        王永建  総合障害対応No.0000014
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SCZY4023.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-04-10.
       DATE-COMPILED.
      ******************************************************************
      *
      *    環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *    デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *    作  業  場  所  節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id: $".
      ******************************************************************
      *    コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
      *----------  共通コンスタント定義の宣言
         05  CNS-SCZYCNS.
           COPY  "KOMONCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SCZY4023".
      *----------  ポートフォリオ属性
         05  CNS-TBL-TKPFZK01      PIC  X(08)  VALUE  "TKPFZK01".
      *----------  ポートフォリオ所属処理グループ
         05  CNS-TBL-TKPFZK02      PIC  X(08)  VALUE  "TKPFZK02".
      *----------  パラメータエラーメッセージ
         05  CNS-ERRID-E03         PIC  X(16)
             VALUE  "パラメータエラー".
         05  CNS-ERRID-E05         PIC  X(26)
             VALUE  "パラメータメニューIDエラー".
         05  CNS-ERRID-E06         PIC  X(34)
             VALUE  "パラメータ画面アクション区分エラー".
      *----------  抽出件数超過したメッセージ
         05  CNS-ERRID-E04         PIC  X(16)
             VALUE  "抽出件数超過警告".
      *----------  エラー区分
         05  CNS-07                PIC  X(02)  VALUE  "07".
      *----------  TXRX利用区分ポジション
         05  CNS-TXRX-POS          PIC  9(03)  VALUE  267.
         05  CNS-1                 PIC  9(01)  VALUE  1.
      *******    連結障害対応No.0000211  20081209 修正  開始    ********
         05  CNS-2                 PIC  9(01)  VALUE  2.
         05  CNS-3                 PIC  9(01)  VALUE  3.
         05  CNS-4                 PIC  9(01)  VALUE  4.
         05  CNS-5                 PIC  9(01)  VALUE  5.
         05  CNS-6                 PIC  9(01)  VALUE  6.
         05  CNS-7                 PIC  9(01)  VALUE  7.
         05  CNS-8                 PIC  9(01)  VALUE  8.
         05  CNS-9                 PIC  9(01)  VALUE  9.
         05  CNS-10                PIC  9(02)  VALUE  10.
      *******    連結障害対応No.0000211  20081209 修正  終了    ********
      *----------  カウント用
         05  CNS-X-0               PIC  X(01)  VALUE  "0".
         05  CNS-X-1               PIC  X(01)  VALUE  "1".
         05  CNS-X-2               PIC  X(01)  VALUE  "2".
         05  CNS-MAX               PIC  9(05)  VALUE  50000.
      ******************************************************************
      *    オラクルホスト  変数
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  ポートフォリオ属性エリア（セレクト）
         05  H-TKPFZK01-S-CR1.
      *----------  ファンドコード
           10  H-O-FUND-CD         PIC  X(12).
      *----------  ファンド名（日）
           10  H-O-FND-MEI-JPN     PIC  X(60).
      *----------  ポートフォリオコード
           10  H-O-PTF-CD          PIC  X(04).
      *----------  ポートフォリオ名（日）
           10  H-O-PTF-MEI-JPN     PIC  X(60).
      *----------  ポートフォリオ属性エリア（セレクト）
         05  H-KEY-TKPFZK01-CR1.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
         05  H-TKPFZK-S-CR2.
      *----------  ファンドコード
           10  H-O-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-O-PTF-CD          PIC  X(04).
         05  H-KEY-TKPFZK01-CR2.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコードポートフォリオコード
           10  H-I-FUND-CD1        PIC  X(12).
           10  H-I-PTF-CD1         PIC  X(04).
           10  H-I-FUND-CD2        PIC  X(12).
           10  H-I-PTF-CD2         PIC  X(04).
           10  H-I-FUND-CD3        PIC  X(12).
           10  H-I-PTF-CD3         PIC  X(04).
           10  H-I-FUND-CD4        PIC  X(12).
           10  H-I-PTF-CD4         PIC  X(04).
           10  H-I-FUND-CD5        PIC  X(12).
           10  H-I-PTF-CD5         PIC  X(04).
           10  H-I-FUND-CD6        PIC  X(12).
           10  H-I-PTF-CD6         PIC  X(04).
           10  H-I-FUND-CD7        PIC  X(12).
           10  H-I-PTF-CD7         PIC  X(04).
           10  H-I-FUND-CD8        PIC  X(12).
           10  H-I-PTF-CD8         PIC  X(04).
           10  H-I-FUND-CD9        PIC  X(12).
           10  H-I-PTF-CD9         PIC  X(04).
           10  H-I-FUND-CD10       PIC  X(12).
           10  H-I-PTF-CD10        PIC  X(04).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
         05  H-TKPFZK01-S-CR3.
      *----------  ファンド名（日）
           10  H-O-FND-MEI-JPN     PIC  X(60).
      *----------  ポートフォリオ名（日）
           10  H-O-PTF-MEI-JPN     PIC  X(60).
         05  H-KEY-TKPFZK01-CR3.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-I-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-I-PTF-CD          PIC  X(04).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *----------  ポートフォリオ属性エリア（セレクト）
         05  H-KEY-TKPFZK02-CR2.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ポートフォリオグループコード
           10  H-PTF-GRP-CD1       PIC  X(08).
           10  H-PTF-GRP-CD2       PIC  X(08).
           10  H-PTF-GRP-CD3       PIC  X(08).
           10  H-PTF-GRP-CD4       PIC  X(08).
           10  H-PTF-GRP-CD5       PIC  X(08).
           10  H-PTF-GRP-CD6       PIC  X(08).
           10  H-PTF-GRP-CD7       PIC  X(08).
           10  H-PTF-GRP-CD8       PIC  X(08).
           10  H-PTF-GRP-CD9       PIC  X(08).
           10  H-PTF-GRP-CD10      PIC  X(08).
      *----------  動的SQL文をいれるバッファ
         05  SQLSTMT.
      *----------  CR1用
           10  SQLSTMT-CR1         PIC  X(2500).
      *----------  CR2用
           10  SQLSTMT-CR2         PIC  X(2500).
      *----------  CR3用
           10  SQLSTMT-CR3         PIC  X(2500).
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *    フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  カーソルオープンフラグ
         05  FLG-CR1-OPEN          PIC  9(01).
         05  FLG-CR2-OPEN          PIC  9(01).
         05  FLG-CR3-OPEN          PIC  9(01).
      *----------  フェッチ処理フラグ
         05  FLG-CR1-FETCH         PIC  9(01).
         05  FLG-CR2-FETCH         PIC  9(01).
         05  FLG-CR3-FETCH         PIC  9(01).
      *----------  利用権限チェックフラグ
         05  FLG-CHECK             PIC  9(01).
      ******************************************************************
      *    サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  テーブルID取得ルーチンパラメータ
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  利用権限チェックルーチンパラメータ
       01  PARM-SCZY1130-IN.
           COPY  "SCZY1130.cpy".
      *----------  監査ログＩＮＳルーチンパラメータ
       01  PARM-SCZY1100-AIFA-HEADER.
         05  PARM-SCZY1100-CZAIFA.
           COPY "WOMCMAIFA.CPY".
         05  PARM-SCZY1100-CZCOMMONHEADER.
           COPY "CZCOMMONHEADER.cpy".
       01  PARM-SCZY1100-INOUT.
           COPY "SCZY1100.cpy".
       01  PARM-SCZY1100-RTNPKG.
         05  PARM-SCZY1100-ARG4.
           COPY  "CZRTNPACKAGE.cpy".
      *----------  リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
      *----------  ソートルーチン
       01  PARM-SCZY4030-INOUT.
           COPY  "SCZY4030.cpy".
      *******    連結障害対応No.0000119  20081023 修正  開始    ********
      *----------  バッチ用監査ログＩＮＳルーチン
       01  PARM-SCZY7110-AIFA-HEADER.
         05  PARM-SCZY7110-CZAIFA.
           COPY "WOMCMAIFA.CPY".
         05  PARM-SCZY7110-CZCOMMONHEADER.
           COPY "CZCOMMONHEADER.cpy".
       01  PARM-SCZY7110-IN.
           COPY  "SCZY7110.cpy".
       01  PARM-SCZY7110-RTNPKG.
         05  PARM-SCZY7110-ARG4.
           COPY  "CZRTNPACKAGE.cpy".
      *******    連結障害対応No.0000119  20081023 修正  終了    ********
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *    SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  WK-オール指定 = 1(ALL)の場合(CR1)
         05  SQL-SELECT-DATA-CR1.
      *----------  SELECT
           10  FILLER              PIC  X(07)
               VALUE  "SELECT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)
               VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)
               VALUE  "PTF_CD,".
      *----------  ファンド名（日）
           10  FILLER              PIC  X(12)
               VALUE  "FND_MEI_JPN,".
      *----------  ポートフォリオ名（日）
           10  FILLER              PIC  X(11)
               VALUE  "PTF_MEI_JPN".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
      *----------  テーブルＩＤ
           10  SQL-TBL-ID-CR1      PIC  X(13).
      *----------  ＳＱＬ文編集用
         05  SQL-SELECT-WHERE-CR1.
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(28)
               VALUE  "RIYO_CMP_CD = :V_RIYO_CMP_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  削除区分
           10  FILLER              PIC  X(26)
               VALUE  "SAKUJO_KBN = :V_SAKUJO_KBN".
      *----------  ORDER BYファンドコード
           10  FILLER              PIC  X(18)
               VALUE  " ORDER BY FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)
               VALUE  "PTF_CD,".
      *----------  適用開始日
           10  FILLER              PIC  X(11)
               VALUE  "TEKIYO_FROM".
      *----------  オーダー順
           10  FILLER              PIC  X(05)
               VALUE  " DESC".
      *----------  フリーメッセージ編集用
         05  SQL-SELECT-WHERE-E-CR1.
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  SQL-CR1-RIYO-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(01)
               VALUE  "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  削除区分
           10  FILLER              PIC  X(16)
               VALUE  "SAKUJO_KBN = ' '".
      *----------  ORDER BYファンドコード
           10  FILLER              PIC  X(18)
               VALUE  " ORDER BY FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)
               VALUE  "PTF_CD,".
      *----------  適用開始日
           10  FILLER              PIC  X(11)
               VALUE  "TEKIYO_FROM".
      *----------  オーダー順
           10  FILLER              PIC  X(05)
               VALUE  " DESC".
      *----------  WK-オール指定 <> 1の場合(CR2 TKPFZK01)
         05  SQL-SELECT-DATA-CR2-1.
      *----------  SELECT
           10  FILLER              PIC  X(07)
               VALUE  "SELECT ".
      *----------  DISTINCT
           10  FILLER              PIC  X(09)
               VALUE  "DISTINCT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)
               VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(06)
               VALUE  "PTF_CD".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
      *----------  テーブルＩＤ
           10  SQL-TBL-ID-CR2-1    PIC  X(13).
      *----------  ＳＱＬ文編集用
         05  SQL-SELECT-WHERE-CR2-1.
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(28)
               VALUE  "RIYO_CMP_CD = :V_RIYO_CMP_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ファンドコードポートフォリオグコード
           10  FILLER              PIC  X(21)
               VALUE  "(FUND_CD,PTF_CD) IN (".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD1,:V_PTF_CD1),".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD2,:V_PTF_CD2),".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD3,:V_PTF_CD3),".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD4,:V_PTF_CD4),".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD5,:V_PTF_CD5),".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD6,:V_PTF_CD6),".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD7,:V_PTF_CD7),".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD8,:V_PTF_CD8),".
           10  FILLER              PIC  X(26)
               VALUE  " (:V_FUND_CD9,:V_PTF_CD9),".
           10  FILLER              PIC  X(28)
               VALUE  " (:V_FUND_CD10,:V_PTF_CD10))".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  削除区分
           10  FILLER              PIC  X(26)
               VALUE  "SAKUJO_KBN = :V_SAKUJO_KBN".
         05  SQL-UNION-CR2.
      *----------  UNION
           10  FILLER              PIC  X(07)
               VALUE  " UNION ".
      *----------  フリーメッセージ編集用
         05  SQL-SELECT-WHERE-E-CR2-1.
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  SQL-RIYO-CMP-CD-CR2-1
                                   PIC  X(04).
           10  FILLER              PIC  X(01)
               VALUE  "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ファンドコードポートフォリオグコード
           10  FILLER              PIC  X(21)
               VALUE  "(FUND_CD,PTF_CD) IN (".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD1        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD1         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'),".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD2        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD2         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE "'),".
           10  FILLER              PIC  X(02)
               VALUE "('".
           10  SQL-FUND-CD3        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD3         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'),".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD4        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD4         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'),".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD5        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD5         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'),".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD6        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD6         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'),".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD7        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD7         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'),".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD8        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD8         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'),".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD9        PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD9         PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'),".
           10  FILLER              PIC  X(02)
               VALUE  "('".
           10  SQL-FUND-CD10       PIC  X(12).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-CD10        PIC  X(04).
           10  FILLER              PIC  X(03)
               VALUE  "'))".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  削除区分
           10  FILLER              PIC  X(16)
               VALUE  "SAKUJO_KBN = ' '".
         05  SQL-UNION-E-CR2.
      *----------  UNION
           10  FILLER              PIC  X(07)
               VALUE  " UNION ".
      *----------  WK-オール指定 <> 1の場合(CR2 TKPFZK02)
         05  SQL-SELECT-DATA-CR2-2.
      *----------  SELECT
           10  FILLER              PIC  X(07)
               VALUE  "SELECT ".
      *----------  DISTINCT
           10  FILLER              PIC  X(09)
               VALUE  "DISTINCT ".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)
               VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(06)
               VALUE  "PTF_CD".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
      *----------  テーブルＩＤ
           10  SQL-TBL-ID-CR2-2    PIC  X(13).
      *----------  ＳＱＬ文編集用
         05  SQL-SELECT-WHERE-CR2-2.
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(28)
               VALUE  "RIYO_CMP_CD = :V_RIYO_CMP_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ポートフォリオグループコード
           10  FILLER              PIC  X(15)
               VALUE  "PTF_GRP_CD IN (".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD1,".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD2,".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD3,".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD4,".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD5,".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD6,".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD7,".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD8,".
           10  FILLER              PIC  X(15)
               VALUE  ":P_PTF_GRP_CD9,".
           10  FILLER              PIC  X(17)
               VALUE  ":P_PTF_GRP_CD10 )".
      *----------   ORDER BY
           10  FILLER              PIC  X(18)
               VALUE  " ORDER BY FUND_CD,".
           10  FILLER              PIC  X(06)
               VALUE  "PTF_CD".
      *----------  フリーメッセージ編集用
         05  SQL-SELECT-WHERE-E-CR2-2.
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  SQL-RIYO-CMP-CD-CR2-2
                                   PIC  X(04).
           10  FILLER              PIC  X(01)
               VALUE  "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ポートフォリオグループコード
           10  FILLER              PIC  X(16)
               VALUE  "PTF_GRP_CD IN ('".
           10  SQL-PTF-GRP-CD1     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD2     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD3     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD4     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD5     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD6     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD7     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD8     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD9     PIC  X(08).
           10  FILLER              PIC  X(03)
               VALUE  "','".
           10  SQL-PTF-GRP-CD10    PIC  X(08).
           10  FILLER              PIC  X(02)
               VALUE  "')".
      *----------   ORDER BY
           10  FILLER              PIC  X(18)
               VALUE  " ORDER BY FUND_CD,".
           10  FILLER              PIC  X(06)
               VALUE  "PTF_CD".
      *----------  直近データの名称取得(CR3)
         05  SQL-SELECT-DATA-CR3.
      *----------  SELECT
           10  FILLER              PIC  X(07)
               VALUE  "SELECT ".
      *----------  ファンド名（日）
           10  FILLER              PIC  X(12)
               VALUE  "FND_MEI_JPN,".
      *----------  ポートフォリオ名（日）
           10  FILLER              PIC  X(11)
               VALUE  "PTF_MEI_JPN".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
      *----------  テーブルＩＤ
           10  SQL-TBL-ID-CR3-1    PIC  X(13).
      *----------  ＳＱＬ文編集用
         05  SQL-SELECT-WHERE-CR3.
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(28)
               VALUE  "RIYO_CMP_CD = :V_RIYO_CMP_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(20)
               VALUE  "FUND_CD = :V_FUND_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(18)
               VALUE  "PTF_CD = :V_PTF_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  適用開始日
           10  FILLER              PIC  X(16)
               VALUE  "TEKIYO_FROM IN (".
           10  FILLER              PIC  X(08)
               VALUE  " SELECT ".
      *----------  MAX(適用開始日)
           10  FILLER              PIC  X(16)
               VALUE  "MAX(TEKIYO_FROM)".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
      *----------  ワークテーブルID
           10  SQL-TBL-ID-CR3-2    PIC  X(13).
      *----------  FROM
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(28)
               VALUE  "RIYO_CMP_CD = :V_RIYO_CMP_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(20)
               VALUE  "FUND_CD = :V_FUND_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(18)
               VALUE  "PTF_CD = :V_PTF_CD".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  削除区分
           10  FILLER              PIC  X(27)
               VALUE  "SAKUJO_KBN = :V_SAKUJO_KBN)".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  削除区分
           10  FILLER              PIC  X(26)
               VALUE  "SAKUJO_KBN = :V_SAKUJO_KBN".
      *----------  フリーメッセージ編集用
         05  SQL-SELECT-WHERE-E-CR3.
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  SQL-RIYO-CMP-CD-CR3-1
                                   PIC  X(04).
           10  FILLER              PIC  X(01)
               VALUE  "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)
               VALUE  "FUND_CD = '".
           10  SQL-FUND-CD-CR3-1   PIC  X(12).
           10  FILLER              PIC  X(01)
               VALUE "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(10)
               VALUE  "PTF_CD = '".
           10  SQL-PTF-CD-CR3-1    PIC  X(04).
           10  FILLER              PIC  X(01)
               VALUE "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  適用開始日
           10  FILLER              PIC  X(16)
               VALUE  "TEKIYO_FROM IN (".
           10  FILLER              PIC  X(08)
               VALUE  " SELECT ".
      *----------  MAX(適用開始日)
           10  FILLER              PIC  X(16)
               VALUE  "MAX(TEKIYO_FROM)".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
      *----------  ワークテーブルID
           10  SQL-TBL-ID-CR3-3    PIC  X(13).
      *----------  FROM
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)
               VALUE  "RIYO_CMP_CD = '".
           10  SQL-RIYO-CMP-CD-CR3-2
                                   PIC  X(04).
           10  FILLER              PIC  X(01)
               VALUE  "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)
               VALUE  "FUND_CD = '".
           10  SQL-FUND-CD-CR3-2   PIC  X(12).
           10  FILLER              PIC  X(01)
               VALUE "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(10)
               VALUE  "PTF_CD = '".
           10  SQL-PTF-CD-CR3-2    PIC  X(04).
           10  FILLER              PIC  X(01)
               VALUE "'".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  削除区分
           10  FILLER              PIC  X(17)
               VALUE  "SAKUJO_KBN = ' ')".
      *----------  AND
           10  FILLER              PIC  X(05)
               VALUE  " AND ".
      *----------  削除区分
           10  FILLER              PIC  X(16)
               VALUE  "SAKUJO_KBN = ' '".
      ******************************************************************
      *    ワーク  エリア
      ******************************************************************
       01  WORK-AREA.
      *----------  WK-ＡＩＦＡ共通ヘッダ
         05  WK-AIFA-HEADER        PIC  X(700).
      *----------  利用会社コード
         05  WK-RIYO-CMP-CD        PIC  X(04).
      *----------  オール指定
         05  WK-ALL-SITEI          PIC  X(01).
         05  WK-OUT.
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
      *----------  ファンド名（日）
         05  WK-FND-MEI-JPN        PIC  X(60).
      *----------  ポートフォリオ名（日）
         05  WK-PTF-MEI-JPN        PIC  X(60).
      *----------  権限チェック有無
         05  WK-KGN-CHK-UMU        PIC  X(01).
      *----------  メニューID
         05  WK-MENU-ID            PIC  X(08).
      *----------  画面アクション区分
         05  WK-GAMEN-ACT-KBN      PIC  X(01).
      *----------  業務タスクID
         05  WK-GYOMU-TASK-ID      PIC  X(07).
      *----------  日中夜間区分
         05  WK-NCHU-YAKN-KBN      PIC  X(01).
      *----------  APL指定出力件数
         05  WK-APL-OUT-CNT        PIC  9(08).
      *----------  ヒット件数カウンター
         05  WK-HIT-COUNT          PIC  9(05).
      *----------  WK-前回ファンドコード
         05  WK-FUND-CD-TMP        PIC  X(12).
      *----------  WK-前回ポートフォリオコード
         05  WK-PTF-CD-TMP         PIC  X(04).
      *----------  WK-OUT-データ
         05  WK-OUT-DATA  OCCURS  50000.
      *----------  ファンドコード
           10  WK-O-FUND-CD        PIC  X(12).
      *----------  ファンド名（日）
           10  WK-O-FND-MEI-JPN    PIC  X(60).
      *----------  ポートフォリオコード
           10  WK-O-PTF-CD         PIC  X(04).
      *----------  ポートフォリオ名（日）
           10  WK-O-PTF-MEI-JPN    PIC  X(60).
      *----------  件数取得限定COUNT
         05  WK-COUNT              PIC  9(05).
         05  WK-IDX1               PIC  9(05).
         05  WK-IDX2               PIC  9(05).
         05  WK-IDX3               PIC  9(05).
         05  WK-IDX4               PIC  9(05).
         05  WK-IDX5               PIC  9(05).
      *----------  ワークのフリーメッセージ
         05  WK-SQLSTMT.
      *----------  CR1用
           10  WK-SQLSTMT-CR1      PIC  X(2500).
      *----------  CR2用
           10  WK-SQLSTMT-CR2      PIC  X(2500).
      *----------  CR3用
           10  WK-SQLSTMT-CR3      PIC  X(2500).
      *******    連結障害対応No.0000211  20081209 修正  開始    ********
      *----------  ワークカウント
         05  WK-CNT                PIC  9(06).
      *----------  WK-IN-ファンドコード
         05  WK-IN-FUND-ALL.
           10  WK-IN-FUND-CD       PIC  X(12)
                                   OCCURS  10.
      *----------  WK-IN-ポートフォリオコード
         05  WK-IN-PTF-ALL.
           10  WK-IN-PTF-CD        PIC  X(04)
                                   OCCURS  10.
      *----------  WK-IN-ポートフォリオグループコード
         05  WK-IN-GRP-ALL.
           10  WK-IN-GRP-CD        PIC  X(08)
                                   OCCURS  10.
      *******    連結障害対応No.0000211  20081209 修正  終了    ********
      *******    残タスク   No.0000153  20081209 修正  開始    *********
      *----------  ワークリターンコード
         05  WK-RETURN-CODE        PIC  X(03).
      *******    残タスク   No.0000153  20081209 修正  終了    *********
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  LINK-IN.
         05  IN-AIFA.
           COPY  "WOMCMAIFA.CPY".
         05  IN-HEAD.
           COPY  "CZCOMMONHEADER.cpy".
       01  LINK-INOUT.
           COPY "SCZY4023.cpy".
       01  PARM-SCZY4023-RTNPKG.
         05  PARM-SCZY4023-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *        PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  LINK-IN
                  LINK-INOUT
                  PARM-SCZY4023-RTNPKG.
      ******************************************************************
      *    メイン処理
      ******************************************************************
       BASE-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** SCZY4023 START ***"
      *-----------------------------------------------------------------
      *----------  3.1. 前処理
           PERFORM  START-RTN
      *----------  3.2. 主処理
           PERFORM  MAIN-RTN
      *----------  3.3. 後処理
           PERFORM  END-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** SCZY4023 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *    3.1 前処理
      ******************************************************************
       START-RTN              SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化処理
           PERFORM  INIT-RTN
      *----------  件数取得処理
           PERFORM  CNT-GET-RTN
      *----------  テーブルID取得処理
           PERFORM  TBL-ID-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       START-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1 初期化処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:初期化処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  HST-AREA
                       WORK-AREA
                       FLG-AREA
      *******    総合障害対応No.0000014  20090219 修正  開始    ********
                       SQL-AREA
                       PARM-SCZY1100-RTNPKG
      *******    総合障害対応No.0000014  20090219 修正  終了    ********
                       PARM-SCZY1160-INOUT
                       PARM-SCZY1130-IN
                       PARM-SCZY1100-INOUT
                       PARM-SCZY1170-IN
                       PARM-SCZY4030-INOUT
                       PARM-RTNPKG
                       PARM-SCZY4023-ARG2
                       PARM-SCZY4023-ARG3
      *******    連結障害対応No.0000119  20081023 修正  開始    ********
                       PARM-SCZY7110-IN
      *******    連結障害対応No.0000119  20081023 修正  終了    ********
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":HST-AREA =["
      D                         HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID ":WORK-AREA =["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID ":FLG-AREA =["FLG-AREA"]"
      *******    総合障害対応No.0000014  20090219 修正  開始    ********
      D    DISPLAY  CNS-PGM-ID ":SQL-AREA =["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1100-RTNPKG =["
      D                         PARM-SCZY1100-RTNPKG"]"
      *******    総合障害対応No.0000014  20090219 修正  終了    ********
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1160-INOUT =["
      D                         PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1130-IN =["
      D                         PARM-SCZY1130-IN"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1100-INOUT =["
      D                         PARM-SCZY1100-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1170-IN =["
      D                         PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY4030-INOUT =["
      D                         PARM-SCZY4030-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY4023-ARG2 =["
      D                          PARM-SCZY4023-ARG2 "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY4023-ARG3 =["
      D                          PARM-SCZY4023-ARG3"]"
      *******    連結障害対応No.0000119  20081023 修正  開始    ********
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7110-IN   =["
      D                         PARM-SCZY7110-IN"]"
      *******    連結障害対応No.0000119  20081023 修正  終了    ********
      *-----------------------------------------------------------------
      *******    残タスク   No.0000153  20081209 修正  開始    *********
      *----------  WK-RETURN-CODE  ←  '000'
           MOVE  CNS-RTN-000           TO  WK-RETURN-CODE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RETURN-CODE =["WK-RETURN-CODE"]"
      *-----------------------------------------------------------------
      *******    残タスク   No.0000153  20081209 修正  終了    *********
      *----------  ＡＩＦＡ共通ヘッダ
           MOVE  LINK-IN               TO  WK-AIFA-HEADER
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  WK-RIYO-CMP-CD
      *----------  オール指定
           MOVE  ALL-SITEI             OF  PARM-SCZY4023-ARG1
             TO  WK-ALL-SITEI
      *----------  権限チェック有無
           MOVE  KGN-CHK-UMU           OF  PARM-SCZY4023-ARG1
             TO  WK-KGN-CHK-UMU
      *----------  メニューID
           MOVE  MENU-ID               OF  PARM-SCZY4023-ARG1
             TO  WK-MENU-ID
      *----------  画面アクション区分
           MOVE  GAMEN-ACT-KBN         OF  PARM-SCZY4023-ARG1
             TO  WK-GAMEN-ACT-KBN
      *----------  業務タスクID
           MOVE  GYOMU-TASK-ID         OF  PARM-SCZY4023-ARG1
             TO  WK-GYOMU-TASK-ID
      *----------  日中夜間区分
           MOVE  NCHU-YAKN-KBN         OF  PARM-SCZY4023-ARG1
             TO  WK-NCHU-YAKN-KBN
      *----------  APL指定出力件数
           MOVE  APL-OUT-CNT           OF  PARM-SCZY4023-ARG1
             TO  WK-APL-OUT-CNT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ＡＩＦＡ共通ヘッダ=[" WK-AIFA-HEADER"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=[" WK-RIYO-CMP-CD "]"
      D    DISPLAY  CNS-PGM-ID ":オール指定=[" WK-ALL-SITEI "]"
      D    DISPLAY  CNS-PGM-ID ":権限チェック有無=[" WK-KGN-CHK-UMU "]"
      D    DISPLAY  CNS-PGM-ID ":メニューID=[" WK-MENU-ID "]"
      D    DISPLAY  CNS-PGM-ID ":画面アクション区分=["
      D              WK-GAMEN-ACT-KBN "]"
      D    DISPLAY  CNS-PGM-ID ":業務タスクID=[" WK-GYOMU-TASK-ID "]"
      D    DISPLAY  CNS-PGM-ID ":日中夜間区分=[" WK-NCHU-YAKN-KBN "]"
      D    DISPLAY  CNS-PGM-ID ":APL指定出力件数=[" WK-APL-OUT-CNT "]"
      *-----------------------------------------------------------------
      *******    連結障害対応No.0000211  20081209 修正  開始    ********
           PERFORM  VARYING  WK-CNT  FROM  CNS-1  BY  CNS-1
             UNTIL  WK-CNT  >  CNS-10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CNT = ["WK-CNT"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.ポートフォリオ区分("WK-CNT") = ["
      D             PTF-KBN            OF  PARM-SCZY4023-ARG1(WK-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.グループ又はファンドコード("WK-CNT
      D             ") = ["GRP-FUND-CD OF  PARM-SCZY4023-ARG1(WK-CNT)"]"
      *-----------------------------------------------------------------
             EVALUATE  PTF-KBN         OF  PARM-SCZY4023-ARG1(WK-CNT)
               WHEN  CNS-X-1
                 MOVE  GRP-FUND-CD     OF  PARM-SCZY4023-ARG1(WK-CNT)
                   TO  WK-IN-GRP-CD(WK-CNT)
               WHEN  CNS-X-2
                 MOVE  GRP-FUND-CD     OF  PARM-SCZY4023-ARG1(WK-CNT)
                   TO  WK-IN-FUND-CD(WK-CNT)
               WHEN  OTHER
                 CONTINUE
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード("WK-CNT") = ["
      D             WK-IN-GRP-CD(WK-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード("WK-CNT") = ["
      D             WK-IN-FUND-CD(WK-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.ポートフォリオコード("WK-CNT") = ["
      D             PTF-CD             OF  PARM-SCZY4023-ARG1(WK-CNT)"]"
      *-----------------------------------------------------------------
             MOVE  PTF-CD              OF  PARM-SCZY4023-ARG1(WK-CNT)
               TO  WK-IN-PTF-CD(WK-CNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード("WK-CNT
      D             ") = ["WK-IN-PTF-CD(WK-CNT)"]"
      *-----------------------------------------------------------------
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CNT = ["WK-CNT"]"
      *-----------------------------------------------------------------
      *******    連結障害対応No.0000211  20081209 修正  終了    ********
      *----------  利用会社コードログインユーザー会社コード
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****利用会社コードチェック処理*****"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D              WK-RIYO-CMP-CD    OF  WORK-AREA "]"
      D    DISPLAY  CNS-PGM-ID ":ログインユーザー会社コード=["
      D              COMPANY-CODE      OF  IN-AIFA "]"
      *-----------------------------------------------------------------
           IF  WK-RIYO-CMP-CD          OF  WORK-AREA          NOT= SPACE
            AND  COMPANY-CODE          OF  IN-AIFA            NOT= SPACE
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  利用会社コードログイン"
      D                        "ユーザー会社コード正常  *****"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  利用会社コードログイン"
      D                            "ユーザー会社コードエラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E03
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  オール指定
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****オール指定チェック処理*****"
      D    DISPLAY  CNS-PGM-ID ":オール指定=[" WK-ALL-SITEI "]"
      *-----------------------------------------------------------------
           IF  WK-ALL-SITEI = CNS-X-0
            OR WK-ALL-SITEI = CNS-X-1
            OR WK-ALL-SITEI = CNS-X-2
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  オール指定正常  *****"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  オール指定エラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-002
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E03
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-----------------------------------------------------------------
      *----------  WK-権限チェック有無 = "0" また
      *----------  WK-権限チェック有無 = "1" また
      *----------  WK-権限チェック有無 = "2"の場合
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****権限チェック有無チェック処理*****"
      D    DISPLAY  CNS-PGM-ID ":権限チェック有無=[" WK-KGN-CHK-UMU "]"
      *-----------------------------------------------------------------
           IF  WK-KGN-CHK-UMU          OF  WORK-AREA= CNS-X-0
           OR  WK-KGN-CHK-UMU          OF  WORK-AREA= CNS-X-1
           OR  WK-KGN-CHK-UMU          OF  WORK-AREA= CNS-X-2
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  権限チェック有無正常  *****"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  権限チェック有無エラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-003
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E03
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  権限チェック有無 = "1"(権限チェックする)
      *----------  メニューID = SPACE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****権限チェック有無ANDメニューID"
      D                        "チェック処理*****"
      *-----------------------------------------------------------------
           IF  KGN-CHK-UMU             OF  PARM-SCZY4023-ARG1 = CNS-X-1
            AND  MENU-ID               OF  PARM-SCZY4023-ARG1 = SPACE
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  権限チェック有無ANDメニューID"
      D                        "チェックエラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-004
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E05
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  権限チェック有無ANDメニューID"
      D                        "チェック正常  *****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  権限チェック有無 = "1"(権限チェックする)
      *----------  画面アクション区分 = SPACE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****権限チェック有無AND画面アクション"
      D                        "区分チェック処理*****"
      *-----------------------------------------------------------------
           IF  KGN-CHK-UMU             OF  PARM-SCZY4023-ARG1 = CNS-X-1
            AND  GAMEN-ACT-KBN         OF  PARM-SCZY4023-ARG1 = SPACE
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  権限チェック有無AND画面"
      D                        "アクション区分チェックエラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-005
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E06
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  権限チェック有無AND画面"
      D                        "アクション区分チェック正常  *****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  WK-日中夜間区分 = "0" また
      *----------  WK-日中夜間区分 = "1"の場合
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  日中夜間区分チェック処理  *****"
      D    DISPLAY  CNS-PGM-ID ":日中夜間区分=[" WK-NCHU-YAKN-KBN "]"
      *-----------------------------------------------------------------
           IF  WK-NCHU-YAKN-KBN         OF  WORK-AREA = CNS-X-0
           OR  WK-NCHU-YAKN-KBN         OF  WORK-AREA = CNS-X-1
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  日中夜間区分正常  *****"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  日中夜間区分エラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-006
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E03
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *******    連結障害対応No.0000211  20081209 修正  開始    ********
      *----------  WK-ポートフォリオ グループコード = スペース
      *----------  WK-ファンドコード = スペース
      *----------  WK-ポートフォリオコード＝スペースの場合
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  ファンド&ポートフォリオ"
      D             "とグループチェック処理  *****"
      D    DISPLAY  CNS-PGM-ID ":オール指定=[" WK-ALL-SITEI "]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオグループコード   =["
      D              WK-IN-GRP-ALL"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード                 =["
      D              WK-IN-FUND-ALL"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード           =["
      D              WK-IN-PTF-ALL"]"
      *-----------------------------------------------------------------
           IF  WK-ALL-SITEI = CNS-X-0
           AND WK-IN-GRP-ALL  =  SPACE
           AND WK-IN-FUND-ALL =  SPACE
           AND WK-IN-PTF-ALL  =  SPACE
           THEN
      *******    連結障害対応No.0000211  20081209 修正  終了    ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  ファンド&ポートフォリオ"
      D             "とグループエラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-007
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E03
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  ファンド&ポートフォリオ"
      D             "とグループチェック処理正常  *****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *******    連結障害対応No.0000211  20081209 修正  開始    ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":オール指定=[" WK-ALL-SITEI "]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオグループコード   =["
      D              WK-IN-GRP-ALL"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード                 =["
      D              WK-IN-FUND-ALL"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード           =["
      D              WK-IN-PTF-ALL"]"
      *-----------------------------------------------------------------
           IF  WK-ALL-SITEI = CNS-X-2
           AND WK-IN-GRP-ALL  =  SPACE
           AND WK-IN-FUND-ALL =  SPACE
           AND WK-IN-PTF-ALL  =  SPACE
           THEN
      *******    連結障害対応No.0000211  20081209 修正  終了    ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  ファンド&ポートフォリオ"
      D             "とグループエラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-008
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E03
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  ファンド&ポートフォリオ"
      D             "とグループチェック処理正常  *****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *******    残タスクNo.196 20090218 修正  開始    *****************
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":オール指定=[" WK-ALL-SITEI "]"
      *-----------------------------------------------------------------
           IF  WK-ALL-SITEI = CNS-X-1
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオグループコード   =["
      D              WK-IN-GRP-ALL"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード                 =["
      D              WK-IN-FUND-ALL"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード           =["
      D              WK-IN-PTF-ALL"]"
      *-----------------------------------------------------------------
             IF  WK-IN-GRP-ALL = SPACE
              AND WK-IN-FUND-ALL = SPACE
              AND WK-IN-PTF-ALL = SPACE
             THEN
               CONTINUE
             ELSE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-032
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  CNS-ERRID-E03
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
           ELSE
             CONTINUE
           END-IF
      *******    残タスクNo.196 20090218 修正  終了    *****************
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:初期化処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 件数取得処理
      ******************************************************************
       CNT-GET-RTN            SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 件数取得処理 START *** "
      D    DISPLAY  CNS-PGM-ID ":APL指定出力件数=["WK-APL-OUT-CNT"]"
      *-----------------------------------------------------------------
      *----------  WK-APL指定出力件数 <> 0 かつ
      *----------  WK-APL指定出力件数 < 50000 の場合
           IF  WK-APL-OUT-CNT     OF  WORK-AREA <> ZERO
           AND WK-APL-OUT-CNT     OF  WORK-AREA < CNS-MAX
           THEN
             MOVE  WK-APL-OUT-CNT OF  WORK-AREA     TO  WK-COUNT
           ELSE
             MOVE  CNS-MAX                          TO  WK-COUNT
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-件数=["WK-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":*** 件数取得処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CNT-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.1.3 テーブルID取得処理
      ******************************************************************
       TBL-ID-GET-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** SCZY1160:"
      D                       "テーブルID取得処理 START *** "
      *-----------------------------------------------------------------
           INITIALIZE  PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG=["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
      *----------  接続用パラメータ設定
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  RIYO-CMP-CD           OF  PARM-SCZY1160-ARG1
      *----------  テーブルID
           MOVE  CNS-TBL-TKPFZK01      TO  TBL-ID
                                       OF  PARM-SCZY1160-ARG1(1)
           MOVE  CNS-TBL-TKPFZK02      TO  TBL-ID
                                       OF  PARM-SCZY1160-ARG1(2)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1160-ARG1:"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード =["
      D              RIYO-CMP-CD       OF PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID(1)  =["
      D              TBL-ID            OF PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID(2)  =["
      D              TBL-ID            OF PARM-SCZY1160-ARG1(2)"]"
      *-----------------------------------------------------------------
           CALL   "SCZY1160"           USING  PARM-SCZY1160-INOUT
                                              PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブルID取得ルーチンSCZY1160"
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY1160=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID ":COUNTER  OF  PARM-RTNPKG=["
      D                          COUNTER  OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG) =
               CNS-RTN-000
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  テーブルID正常取得  *****"
      D    DISPLAY  CNS-PGM-ID ":TKPFZK01 ID =["
      D             HENSYUGO-TBL-ID    OF  PARM-SCZY1160-ARG2(1)"]"
      D    DISPLAY  CNS-PGM-ID ":TKPFZK02 ID =["
      D             HENSYUGO-TBL-ID    OF  PARM-SCZY1160-ARG2(2)"]"
      *-----------------------------------------------------------------
             INITIALIZE  PARM-RTNPKG
             MOVE  HENSYUGO-TBL-ID     OF  PARM-SCZY1160-ARG2(1)
               TO  SQL-TBL-ID-CR1,
                   SQL-TBL-ID-CR2-1,
                   SQL-TBL-ID-CR3-1,
                   SQL-TBL-ID-CR3-2,
                   SQL-TBL-ID-CR3-3
             MOVE  HENSYUGO-TBL-ID     OF  PARM-SCZY1160-ARG2(2)
               TO  SQL-TBL-ID-CR2-2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":取得テーブルID(CR1)    =["
      D             SQL-TBL-ID-CR1"]"
      D    DISPLAY  CNS-PGM-ID ":取得テーブルID(CR2-1) =["
      D             SQL-TBL-ID-CR2-1"]"
      D    DISPLAY  CNS-PGM-ID ":取得テーブルID(CR2-2) =["
      D             SQL-TBL-ID-CR2-2"]"
      D    DISPLAY  CNS-PGM-ID ":取得テーブルID(CR3-1)    =["
      D             SQL-TBL-ID-CR3-1"]"
      D    DISPLAY  CNS-PGM-ID ":取得テーブルID(CR3-2)    =["
      D             SQL-TBL-ID-CR3-2"]"
      D    DISPLAY  CNS-PGM-ID ":取得テーブルID(CR3-3)    =["
      D             SQL-TBL-ID-CR3-3"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****  テーブルID取得エラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-009
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID ":*** SCZY1160:テーブルID取得処理  END"
      D                       " ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:主処理  START  ***"
      D    DISPLAY  CNS-PGM-ID ":オール指定=[" WK-ALL-SITEI "]"
      *-----------------------------------------------------------------
           IF  WK-ALL-SITEI = CNS-X-1
           THEN
      *----------  3.2.1．ポートフォリオ属性抽出
             PERFORM  CR1-MAIN-RTN
           ELSE
      *----------  3.2.2. ポートフォリオ所属処理グループ抽出
             PERFORM  CR2-MAIN-RTN
           END-IF
      *----------  3.2.3. オール指定によりソート順の変更
           PERFORM  JUN-HENKOU-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:主処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1．ポートフォリオ属性抽出
      ******************************************************************
       CR1-MAIN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:ポートフォリオ属性抽出"
      D             "START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.1 ポートフォリオ属性CURSOR PREPARE
             PERFORM  CR1-PREPARE-RTN
      *----------  3.2.1.2 ポートフォリオ属性CURSOR OPEN
             PERFORM  CR1-OPEN-RTN
      *----------  3.2.1.3 ポートフォリオ属性CURSOR FETCH
             PERFORM   UNTIL  FLG-CR1-FETCH = CNS-ON
                 PERFORM  CR1-FETCH-RTN
             END-PERFORM
      *----------  3.2.1.4 ポートフォリオ属性CURSOR CLOSE
             PERFORM  CR1-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:ポートフォリオ属性抽出"
      D             "END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR1-MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.1ポートフォリオ属性CURSOR PREPARE
      ******************************************************************
       CR1-PREPARE-RTN        SECTION.
      *-----------------------------------------------------------------
           INITIALIZE  WK-SQLSTMT
                       SQLSTMT
      *----------  フリーメッセージ用動的SQL文作成
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  SQL-CR1-RIYO-CMP-CD
           STRING  SQL-SELECT-DATA-CR1,
                   SQL-SELECT-WHERE-E-CR1
           DELIMITED BY SIZE
           INTO  WK-SQLSTMT-CR1
      *----------  ポートフォリオ属性動的SQL文作成
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  H-RIYO-CMP-CD         OF  H-KEY-TKPFZK01-CR1
      *----------  削除区分
           MOVE  SPACE
             TO  H-SAKUJO-KBN          OF  H-KEY-TKPFZK01-CR1
           STRING  SQL-SELECT-DATA-CR1,
                   SQL-SELECT-WHERE-CR1
           DELIMITED BY SIZE
           INTO  SQLSTMT-CR1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=[" H-RIYO-CMP-CD
      D                                OF  H-KEY-TKPFZK01-CR1 "]"
      D    DISPLAY  CNS-PGM-ID ":削除区分=["H-SAKUJO-KBN
      D                                OF  H-KEY-TKPFZK01-CR1"]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT-CR1=["SQLSTMT-CR1"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D              SQL-CR1-RIYO-CMP-CD "]"
      D    DISPLAY  CNS-PGM-ID ":WK-SQLSTMT-CR1=[" WK-SQLSTMT-CR1 "]"
      D    DISPLAY  CNS-PGM-ID ":*** PREPARE CURSOR START***"
      *-----------------------------------------------------------------
      *----------  PREPARE CURSOR
           EXEC SQL
             PREPARE  S1 FROM  :SQLSTMT-CR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ属性CR1 "
      D             "CURSOR PREPARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** PREPARE CR1 CURSOR 正常 ***"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** PREPARE CR1 CURSOR エラー ***"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-010
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR1
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** PREPARE CR1 CURSOR END ***"
      D    DISPLAY  CNS-PGM-ID ":*** DECLARE CR1 CURSOR START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR1  CURSOR  FOR  S1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ属性CR1"
      D             "CURSOR DECLARE SQLCODE=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID ":*** DECLARE CR1 CURSOR END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR1-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.2 ポートフォリオ属性CURSOR OPEN
      ******************************************************************
       CR1-OPEN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ属性CR1 "
      D                       "CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  OPEN  CURSOR
           EXEC SQL
               OPEN CR1
                 USING  :H-KEY-TKPFZK01-CR1.H-RIYO-CMP-CD,
                        :H-KEY-TKPFZK01-CR1.H-SAKUJO-KBN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ属性CR1"
      D                        "CURSOR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON              TO  FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR1 CURSOR OPEN 正常"
      D    DISPLAY  CNS-PGM-ID ":CR1 OPEN FLAG =["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CURSOR OPEN エラー"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-011
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR1
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ属性CR1 "
      D                       "CURSOR OPEN END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR1-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.3 ポートフォリオ属性CURSOR FETCH
      ******************************************************************
       CR1-FETCH-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ属性CR1 "
      D             "CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------CR1 FETCH
           EXEC SQL
             FETCH CR1
             INTO  :H-TKPFZK01-S-CR1.H-O-FUND-CD,
                   :H-TKPFZK01-S-CR1.H-O-PTF-CD,
                   :H-TKPFZK01-S-CR1.H-O-FND-MEI-JPN,
                   :H-TKPFZK01-S-CR1.H-O-PTF-MEI-JPN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ属性CR1 "
      D             "CURSOR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ属性CR1 FETCH取得データ:"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード=[" H-O-FUND-CD
      D                                OF  H-TKPFZK01-S-CR1 "]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード=[" H-O-PTF-CD
      D                                OF  H-TKPFZK01-S-CR1 "]"
      D    DISPLAY  CNS-PGM-ID ":ファンド名（日）=[" H-O-FND-MEI-JPN
      D                                OF  H-TKPFZK01-S-CR1 "]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ名（日）=[ "
      D             H-O-PTF-MEI-JPN    OF  H-TKPFZK01-S-CR1"]"
      *-----------------------------------------------------------------
               MOVE  H-O-FUND-CD       OF  H-TKPFZK01-S-CR1
                 TO  WK-FUND-CD        OF  WK-OUT
               MOVE  H-O-PTF-CD        OF  H-TKPFZK01-S-CR1
                 TO  WK-PTF-CD         OF  WK-OUT
               MOVE  H-O-FND-MEI-JPN   OF  H-TKPFZK01-S-CR1
                 TO  WK-FND-MEI-JPN
               MOVE  H-O-PTF-MEI-JPN   OF  H-TKPFZK01-S-CR1
                 TO  WK-PTF-MEI-JPN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ファンドコード=["
      D              WK-FUND-CD        OF  WK-OUT "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ポートフォリオコード=["
      D              WK-PTF-CD         OF  WK-OUT "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ファンド名（日）=["
      D              WK-FND-MEI-JPN "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ポートフォリオ名（日）=["
      D              WK-PTF-MEI-JPN "]"
      *-----------------------------------------------------------------
      *----------  抽出データをチェックする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-前回ファンドコード=["
      D              WK-FUND-CD-TMP "]"
      D    DISPLAY  CNS-PGM-ID ":WK-前回ポートフォリオコード=["
      D              WK-PTF-CD-TMP "]"
      *-----------------------------------------------------------------
      *----------  WK-前回ファンドコード <> WK-ファンドコード ORつ
      *----------  WK-前回ポートフォリオコード <>WK-ポートフォリオコード
               IF  WK-FUND-CD     OF  WK-OUT  NOT = WK-FUND-CD-TMP
                 OR  WK-PTF-CD    OF  WK-OUT  NOT = WK-PTF-CD-TMP
               THEN
                 MOVE  WK-FUND-CD OF  WK-OUT   TO  WK-FUND-CD-TMP
                 MOVE  WK-PTF-CD  OF  WK-OUT   TO  WK-PTF-CD-TMP
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-前回ファンドコード=["
      D             WK-FUND-CD-TMP "]"
      D    DISPLAY  CNS-PGM-ID ":WK-前回ポートフォリオコード=["
      D             WK-PTF-CD-TMP "]"
      *-----------------------------------------------------------------
      *----------  A) 抽出レコードチェック処理
                  PERFORM  TYSYT-CD-CHK1-RTN
      *----------  B) オール指定の場合出力データ編集処理
                  PERFORM  DATA-HENSYU-CR1-RTN
               ELSE
                  CONTINUE
               END-IF
      *----------  データなし
           WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON            TO  FLG-CR1-FETCH
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-CR1-FETCH:["FLG-CR1-FETCH"]"
      *-----------------------------------------------------------------
      *----------  SQLCODE ≠ 0 AND SQLCODE ≠ 1403
           WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-012
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-SQLSTMT-CR1
                 TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ属性CR1"
      D             "CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR1-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    A) 抽出レコードチェック処理
      ******************************************************************
       TYSYT-CD-CHK1-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 抽出レコードチェック処理 START ***"
      *-----------------------------------------------------------------
      *----------  利用権限チェック処理
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":権限チェック有無 =["
      D              WK-KGN-CHK-UMU "]"
      *-----------------------------------------------------------------
      *----------  権限チェック有無 ＝ '1'また"2"の場合
           IF  WK-KGN-CHK-UMU          OF  WORK-AREA = CNS-X-1
           OR  WK-KGN-CHK-UMU          OF  WORK-AREA = CNS-X-2
           THEN
      *----------  利用権限チェック処理
             PERFORM  RYO-KGN-CHK1-RTN
           ELSE
             MOVE  CNS-ON              TO  FLG-CHECK
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-CHECK        =[" FLG-CHECK "]"
      D    DISPLAY  CNS-PGM-ID ":*** 抽出レコードチェック処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TYSYT-CD-CHK1-EXT.
           EXIT.
      ******************************************************************
      *    利用権限チェック1処理
      ******************************************************************
       RYO-KGN-CHK1-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 利用権限チェック1処理 START ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG=[" PARM-RTNPKG "]"
      *--------------------<DEBUG>--------------------------------------
      *----------  接続用パラメータ設定
      *----------  業務グループコード
           MOVE  GYOUMU-GROUP-CODE     OF  IN-HEAD
             TO  GYOMU-GRP-CD          OF  PARM-SCZY1130-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD        OF  WORK-AREA
             TO  RIYO-CMP-CD           OF  PARM-SCZY1130-ARG1
      *----------  ログインユーザ会社コード
           MOVE  COMPANY-CODE          OF  IN-AIFA
             TO  LOGIN-CMP-CD          OF  PARM-SCZY1130-ARG1
      *----------  メニューID
           MOVE  SPACE
             TO  MENU-ID               OF  PARM-SCZY1130-ARG1
      *----------  実行処理ID
           MOVE  SPACE
             TO  JIKOU-SYORI-ID        OF  PARM-SCZY1130-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD            OF  WK-OUT
             TO  FUND-CD               OF  PARM-SCZY1130-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD             OF  WK-OUT
             TO  PTF-CD                OF  PARM-SCZY1130-ARG1
      *----------  予備
           MOVE  SPACE
             TO  YOBI                  OF  PARM-SCZY1130-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1130-ARG1:"
      D    DISPLAY  CNS-PGM-ID ":業務グループコード =["
      D              GYOMU-GRP-CD      OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード =["
      D              RIYO-CMP-CD       OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ログインユーザ会社コード =["
      D              LOGIN-CMP-CD      OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":メニューID =["
      D              MENU-ID           OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":実行処理ID =["
      D              JIKOU-SYORI-ID    OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード =["
      D              FUND-CD           OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード =["
      D              PTF-CD            OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":予備 =["
      D              YOBI              OF  PARM-SCZY1130-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY1130"           USING  PARM-SCZY1130-IN
                                       PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用権限チェックルーチン1SCZY1130:"
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY1130=["
      D              RTN-CD OF PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID ":COUNTER  OF  PARM-RTNPKG=["
      D                          COUNTER  OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             WHEN  CNS-RTN-000
               MOVE  CNS-ON            TO  FLG-CHECK
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-CHECK=["FLG-CHECK"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-130
               MOVE  CNS-OFF           TO  FLG-CHECK
               INITIALIZE  PARM-RTNPKG
      *******    テーマ④ 20081020 修正  開始    ***********************
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-CHECK=["FLG-CHECK"]"
      D    DISPLAY  CNS-PGM-ID ":権限チェック有無=[" WK-KGN-CHK-UMU "]"
      D    DISPLAY  CNS-PGM-ID ":オール指定      =[" WK-ALL-SITEI "]"
      *-----------------------------------------------------------------
               IF  WK-KGN-CHK-UMU      OF  WORK-AREA = CNS-X-1
                 AND  WK-ALL-SITEI     OF  WORK-AREA <> CNS-X-1
               THEN
      *******    残タスク   No.0000153  20081209 修正  開始    *********
      *----------  WK-RETURN-CODE  ←  '130'
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RETURN-CODE =["WK-RETURN-CODE"]"
      *-----------------------------------------------------------------
               MOVE  CNS-RTN-130         TO  WK-RETURN-CODE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RETURN-CODE =["WK-RETURN-CODE"]"
      *-----------------------------------------------------------------
      *******    残タスク   No.0000153  20081209 修正  終了    *********
      *******    連結障害対応No.0000119  20081023 修正  開始    ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.業務タスクID =["
      D             GYOMU-TASK-ID      OF  PARM-SCZY4023-ARG1"]"
      *-----------------------------------------------------------------
                 IF  GYOMU-TASK-ID  OF  PARM-SCZY4023-ARG1 = SPACE
                 THEN
      *----------  監査ログ1ＩＮＳルーチン
                   PERFORM  KANSA-LOG1-INS-RTN
                 ELSE
      *----------  バッチ用監査ログＩＮＳルーチン
                   PERFORM  SCZY7110-1-RTN
                 END-IF
      *******    連結障害対応No.0000119  20081023 修正  終了    ********
               ELSE
                 CONTINUE
               END-IF
      *******    テーマ④ 20081020 修正  終了    ***********************
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-013
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":*** 利用権限チェック1処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       RYO-KGN-CHK1-EXT.
           EXIT.
      ******************************************************************
      *    監査ログ1ＩＮＳルーチン
      ******************************************************************
       KANSA-LOG1-INS-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":監査ログ1ＩＮＳルーチン START"
      *-----------------------------------------------------------------
      *----------  AIFA・共通ヘッダ項目
           MOVE  WK-AIFA-HEADER        TO  PARM-SCZY1100-AIFA-HEADER
      *----------  システム処理ID
           MOVE  WK-MENU-ID
             TO  SYS-SYORI-ID          OF  PARM-SCZY1100-INOUT
      *----------  起動ID
           MOVE  SPACE
             TO  KIDOU-ID              OF  PARM-SCZY1100-INOUT
      *----------  画面アクション区分
           MOVE  WK-GAMEN-ACT-KBN
             TO  GAMEN-ACT-KBN         OF  PARM-SCZY1100-INOUT
      *----------  正常エラー区分
           MOVE  CNS-07
             TO  NML-ERR-KBN           OF  PARM-SCZY1100-INOUT
      *----------  課金用検索区分
           MOVE  ZERO
             TO  EE-SEARCH-KBN         OF  PARM-SCZY1100-INOUT
      *----------  基準年月日1
           MOVE  SPACE
             TO  KIJUN-YMD1            OF  PARM-SCZY1100-INOUT
      *----------  基準年月日2
           MOVE  SPACE
             TO  KIJUN-YMD2            OF  PARM-SCZY1100-INOUT
      *----------  委託会社コード
           MOVE  SPACE
             TO  ITK-CMP-CD            OF  PARM-SCZY1100-INOUT
      *----------  ファンドコード
           MOVE  SPACE
             TO  FND-CD                OF  PARM-SCZY1100-INOUT
      *******    連結障害対応No.0000356 20081121 修正  開始    *********
      *----------  銘柄コード
           MOVE  SPACE
             TO  MEG-CD                OF  PARM-SCZY1100-INOUT
      *******    連結障害対応No.0000356 20081121 修正  終了    *********
      *----------  データ特定用ID
           MOVE  WK-GYOMU-TASK-ID
             TO  DATA-ID               OF  PARM-SCZY1100-INOUT
      *----------  TXRX利用区分
           MOVE  IN-HEAD(CNS-TXRX-POS:CNS-1)
             TO  TXRX-KBN              OF  PARM-SCZY1100-INOUT
      *----------  RXファンドコード
           MOVE  WK-FUND-CD            OF  WK-OUT
             TO  FUND-CD               OF  PARM-SCZY1100-INOUT
      *----------  RXポートフォリオコード
           MOVE  WK-PTF-CD             OF  WK-OUT
             TO  PTF-CD                OF  PARM-SCZY1100-INOUT
      *----------  電文ID
           MOVE  SPACE
             TO  DENBUN-ID             OF  PARM-SCZY1100-INOUT
      *----------  入力電文
           MOVE  SPACE
             TO  IN-DENBUN             OF  PARM-SCZY1100-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":AIFA・共通ヘッダ項目              =["
      D             PARM-SCZY1100-AIFA-HEADER                  "]"
      D    DISPLAY  CNS-PGM-ID ":システム処理ID                    =["
      D             SYS-SYORI-ID       OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                            =["
      D             KIDOU-ID           OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":画面アクション区分                =["
      D             GAMEN-ACT-KBN      OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":正常エラー区分                    =["
      D             NML-ERR-KBN        OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":課金用検索区分                    =["
      D             EE-SEARCH-KBN      OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":基準年月日1                       =["
      D             KIJUN-YMD1         OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":基準年月日2                       =["
      D             KIJUN-YMD2         OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":委託会社コード                    =["
      D             ITK-CMP-CD         OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード                    =["
      D             FND-CD             OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                        =["
      D             MEG-CD             OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":データ特定用ID                    =["
      D             DATA-ID            OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":TXRX利用区分                      =["
      D             TXRX-KBN           OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":RXファンドコード                  =["
      D             FUND-CD            OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":RXポートフォリオコード            =["
      D             PTF-CD             OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":電文ID                            =["
      D             DENBUN-ID          OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":入力電文                          =["
      D             IN-DENBUN          OF PARM-SCZY1100-INOUT  "]"
      *-----------------------------------------------------------------
           CALL  "SCZY1100"             USING  PARM-SCZY1100-AIFA-HEADER
                                               PARM-SCZY1100-INOUT
                                               PARM-SCZY1100-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY1100                  =["
      D    RTN-CD
      D    OF PARM-SCZY1100-RTNPKG(COUNTER   OF PARM-SCZY1100-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID ":COUNTER OF PARM-SCZY1100-RTNPKG=["
      D             COUNTER                  OF PARM-SCZY1100-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD
                OF PARM-SCZY1100-RTNPKG(COUNTER OF PARM-SCZY1100-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-014
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 監査ログ1ＩＮＳルーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KANSA-LOG1-INS-EXT.
           EXIT.
      ******************************************************************
      *    B) オール指定の場合出力データ編集処理
      ******************************************************************
       DATA-HENSYU-CR1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** オール指定の場合出力データ編集処理"
      D             " START ***"
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":WK-件数       =["WK-COUNT"]"
      *-----------------------------------------------------------------
      *----------  CHECK-FLG ＝ 1の場合
           IF  FLG-CHECK = CNS-ON
           THEN
      *----------  WK-ヒット件数 ＜ WK-件数の場合
             COMPUTE  WK-HIT-COUNT = 1 + WK-HIT-COUNT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":WK-件数       =["WK-COUNT"]"
      *-----------------------------------------------------------------
             IF  WK-HIT-COUNT <= WK-COUNT
             THEN
      *---------- ファンドコード
               MOVE  WK-FUND-CD        OF  WK-OUT
                 TO  WK-O-FUND-CD(WK-HIT-COUNT)
      *----------  ポートフォリオコード
               MOVE  WK-PTF-CD         OF  WK-OUT
                 TO  WK-O-PTF-CD(WK-HIT-COUNT)
      *----------  ファンド名（日）
               MOVE  WK-FND-MEI-JPN
                 TO  WK-O-FND-MEI-JPN(WK-HIT-COUNT)
      *----------  ポートフォリオ名（日）
               MOVE  WK-PTF-MEI-JPN
                 TO  WK-O-PTF-MEI-JPN(WK-HIT-COUNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数=["WK-HIT-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":WK-ファンドコード("WK-HIT-COUNT")=["
      D              WK-O-FUND-CD(WK-HIT-COUNT) "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ポートフォリオコード("
      D              WK-HIT-COUNT")=["
      D              WK-O-PTF-CD(WK-HIT-COUNT) "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ファンド名（日）("WK-HIT-COUNT")=["
      D              WK-O-FND-MEI-JPN(WK-HIT-COUNT) "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ポートフォリオ名(日)("
      D              WK-HIT-COUNT")=["
      D              WK-O-PTF-MEI-JPN(WK-HIT-COUNT) "]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-件数=["WK-COUNT"]"
      *-----------------------------------------------------------------
               MOVE  WK-COUNT
                 TO  HIT-KENSU         OF  PARM-SCZY4023-ARG2
               MOVE  CNS-RTN-002
                 TO  RTN-CD            OF  PARM-SCZY4023-RTNPKG(1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":件数 =["
      D                          HIT-KENSU   OF  PARM-SCZY4023-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ":リターンコード=["
      D                          RTN-CD   OF  PARM-SCZY4023-RTNPKG(1)"]"
      *-----------------------------------------------------------------
      *----------  ソート用データ
               PERFORM  VARYING WK-IDX5  FROM  1  BY  1
                 UNTIL  WK-IDX5 > WK-COUNT
      *----------  ファンドコード
                 MOVE  WK-O-FUND-CD(WK-IDX5)
                   TO  O-FUND-CD       OF  PARM-SCZY4023-ARG2(WK-IDX5)
      *----------  ファンド名（日）
                 MOVE  WK-O-FND-MEI-JPN(WK-IDX5)
                   TO  O-FND-MEI-JPN   OF  PARM-SCZY4023-ARG2(WK-IDX5)
      *----------  ポートフォリオコード
                 MOVE  WK-O-PTF-CD(WK-IDX5)
                   TO  O-PTF-CD        OF  PARM-SCZY4023-ARG2(WK-IDX5)
      *----------  ポートフォリオ名（日）
                 MOVE  WK-O-PTF-MEI-JPN(WK-IDX5)
                   TO  O-PTF-MEI-JPN   OF  PARM-SCZY4023-ARG2(WK-IDX5)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.ファンドコード("WK-IDX5")=["
      D             O-FUND-CD         OF  PARM-SCZY4023-ARG2(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ファンド名（日）("WK-IDX5")=["
      D             O-FND-MEI-JPN     OF  PARM-SCZY4023-ARG2(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ポートフォリオコード("WK-IDX5")=["
      D             O-PTF-CD          OF  PARM-SCZY4023-ARG2(WK-IDX5)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ポートフォリオ名（日）("WK-IDX5")"
      D        "=[" O-PTF-MEI-JPN     OF  PARM-SCZY4023-ARG2(WK-IDX5)"]"
      *-----------------------------------------------------------------
               END-PERFORM
      *******    残タスク   No.0000169  20090107 修正  開始    *********
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":WK-件数       =["WK-COUNT"]"
      *-----------------------------------------------------------------
               MOVE  WK-COUNT          TO  WK-HIT-COUNT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT"]"
      *-----------------------------------------------------------------
               PERFORM  JUN-HENKOU-RTN
      *******    残タスク   No.0000169  20090107 修正  終了    *********
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-015
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-002
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  CNS-ERRID-E04
                 TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** オール指定の場合出力データ編集処理"
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-HENSYU-CR1-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.4 ポートフォリオ属性CURSOR CLOSE
      ******************************************************************
       CR1-CLOSE-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ属性CR1"
      D              "CURSOR CLOSE START ***"
      D    DISPLAY  CNS-PGM-ID ":CR1 OPEN FLAG =[" FLG-CR1-OPEN "]"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ属性"
      D             "CURSOR CLOSE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF             TO  FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR1 OPEN FLAG =[" FLG-CR1-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-016
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR1
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ属性"
      D              "CURSOR CLOSE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR1-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2．ポートフォリオ所属処理グループ抽出
      ******************************************************************
       CR2-MAIN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:ポートフォリオ所属処理"
      D              "グループ抽出START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.2.1 ポートフォリオ所属処理グループCURSOR PREPARE
             PERFORM  CR2-PREPARE-RTN
      *----------  3.2.2.2 ポートフォリオ所属処理グループCURSOR OPEN
             PERFORM  CR2-OPEN-RTN
      *----------  3.2.2.3 ポートフォリオ所属処理グループCURSOR FETCH
             PERFORM   UNTIL  FLG-CR2-FETCH = CNS-ON
                 PERFORM  CR2-FETCH-RTN
             END-PERFORM
      *----------  3.2.2.4 ポートフォリオ所属処理グループCURSOR CLOSE
             PERFORM  CR2-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:ポートフォリオ所属処理"
      D              "グループ抽出END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR2-MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.1 ポートフォリオ所属処理グループCURSOR PREPARE
      ******************************************************************
       CR2-PREPARE-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 適ポートフォリオ所属処理グループ"
      D                       "CR2 CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
      *----------  ポートフォリオ所属処理グループSQL文
           INITIALIZE  WK-SQLSTMT-CR2
                       SQLSTMT-CR2
      *----------  フリーメッセージ用動的SQL文作成
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  SQL-RIYO-CMP-CD-CR2-1,
                 SQL-RIYO-CMP-CD-CR2-2
      *******    連結障害対応No.0000211  20081209 修正  開始    ********
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(1)       = ["
      D             WK-IN-FUND-CD(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(2)       = ["
      D             WK-IN-FUND-CD(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(3)       = ["
      D             WK-IN-FUND-CD(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(4)       = ["
      D             WK-IN-FUND-CD(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(5)       = ["
      D             WK-IN-FUND-CD(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(6)       = ["
      D             WK-IN-FUND-CD(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(7)       = ["
      D             WK-IN-FUND-CD(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(8)       = ["
      D             WK-IN-FUND-CD(CNS-8)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(9)       = ["
      D             WK-IN-FUND-CD(CNS-9)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ファンドコード(10)      = ["
      D             WK-IN-FUND-CD(CNS-10)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(1) = ["
      D             WK-IN-PTF-CD(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(2) = ["
      D             WK-IN-PTF-CD(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(3) = ["
      D             WK-IN-PTF-CD(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(4) = ["
      D             WK-IN-PTF-CD(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(5) = ["
      D             WK-IN-PTF-CD(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(6) = ["
      D             WK-IN-PTF-CD(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(7) = ["
      D             WK-IN-PTF-CD(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(8) = ["
      D             WK-IN-PTF-CD(CNS-8)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(9) = ["
      D             WK-IN-PTF-CD(CNS-9)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-ポートフォリオコード(10)= ["
      D             WK-IN-PTF-CD(CNS-10)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(1)       = ["
      D             WK-IN-GRP-CD(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(2)       = ["
      D             WK-IN-GRP-CD(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(3)       = ["
      D             WK-IN-GRP-CD(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(4)       = ["
      D             WK-IN-GRP-CD(CNS-4)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(5)       = ["
      D             WK-IN-GRP-CD(CNS-5)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(6)       = ["
      D             WK-IN-GRP-CD(CNS-6)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(7)       = ["
      D             WK-IN-GRP-CD(CNS-7)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(8)       = ["
      D             WK-IN-GRP-CD(CNS-8)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(9)       = ["
      D             WK-IN-GRP-CD(CNS-9)"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-グループコード(10)      = ["
      D             WK-IN-GRP-CD(CNS-10)"]"
      *-----------------------------------------------------------------
      *----------  ファンドコードポートフォリオコード
           MOVE  WK-IN-FUND-CD(CNS-1)  TO  SQL-FUND-CD1
           MOVE  WK-IN-FUND-CD(CNS-2)  TO  SQL-FUND-CD2
           MOVE  WK-IN-FUND-CD(CNS-3)  TO  SQL-FUND-CD3
           MOVE  WK-IN-FUND-CD(CNS-4)  TO  SQL-FUND-CD4
           MOVE  WK-IN-FUND-CD(CNS-5)  TO  SQL-FUND-CD5
           MOVE  WK-IN-FUND-CD(CNS-6)  TO  SQL-FUND-CD6
           MOVE  WK-IN-FUND-CD(CNS-7)  TO  SQL-FUND-CD7
           MOVE  WK-IN-FUND-CD(CNS-8)  TO  SQL-FUND-CD8
           MOVE  WK-IN-FUND-CD(CNS-9)  TO  SQL-FUND-CD9
           MOVE  WK-IN-FUND-CD(CNS-10) TO  SQL-FUND-CD10
      *----------  ポートフォリオコード
           MOVE  WK-IN-PTF-CD(CNS-1)   TO  SQL-PTF-CD1
           MOVE  WK-IN-PTF-CD(CNS-2)   TO  SQL-PTF-CD2
           MOVE  WK-IN-PTF-CD(CNS-3)   TO  SQL-PTF-CD3
           MOVE  WK-IN-PTF-CD(CNS-4)   TO  SQL-PTF-CD4
           MOVE  WK-IN-PTF-CD(CNS-5)   TO  SQL-PTF-CD5
           MOVE  WK-IN-PTF-CD(CNS-6)   TO  SQL-PTF-CD6
           MOVE  WK-IN-PTF-CD(CNS-7)   TO  SQL-PTF-CD7
           MOVE  WK-IN-PTF-CD(CNS-8)   TO  SQL-PTF-CD8
           MOVE  WK-IN-PTF-CD(CNS-9)   TO  SQL-PTF-CD9
           MOVE  WK-IN-PTF-CD(CNS-10)  TO  SQL-PTF-CD10
      *----------  ポートフォリオグループコード
           MOVE  WK-IN-GRP-CD(CNS-1)   TO  SQL-PTF-GRP-CD1
           MOVE  WK-IN-GRP-CD(CNS-2)   TO  SQL-PTF-GRP-CD2
           MOVE  WK-IN-GRP-CD(CNS-3)   TO  SQL-PTF-GRP-CD3
           MOVE  WK-IN-GRP-CD(CNS-4)   TO  SQL-PTF-GRP-CD4
           MOVE  WK-IN-GRP-CD(CNS-5)   TO  SQL-PTF-GRP-CD5
           MOVE  WK-IN-GRP-CD(CNS-6)   TO  SQL-PTF-GRP-CD6
           MOVE  WK-IN-GRP-CD(CNS-7)   TO  SQL-PTF-GRP-CD7
           MOVE  WK-IN-GRP-CD(CNS-8)   TO  SQL-PTF-GRP-CD8
           MOVE  WK-IN-GRP-CD(CNS-9)   TO  SQL-PTF-GRP-CD9
           MOVE  WK-IN-GRP-CD(CNS-10)  TO  SQL-PTF-GRP-CD10
      *******    連結障害対応No.0000211  20081209 修正  終了    ********
           STRING  SQL-SELECT-DATA-CR2-1,
                   SQL-SELECT-WHERE-E-CR2-1,
                   SQL-UNION-E-CR2,
                   SQL-SELECT-DATA-CR2-2,
                   SQL-SELECT-WHERE-E-CR2-2,
           DELIMITED BY SIZE
           INTO  WK-SQLSTMT-CR2
      *----------  ポートフォリオ属性動的SQL文作成
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  H-RIYO-CMP-CD         OF  H-KEY-TKPFZK01-CR2
      *******    連結障害対応No.0000211  20081209 修正  開始    ********
      *----------  ファンドコードポートフォリオコード
           MOVE  WK-IN-FUND-CD(CNS-1)
             TO  H-I-FUND-CD1          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-1)
             TO  H-I-PTF-CD1           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-2)
             TO  H-I-FUND-CD2          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-2)
             TO  H-I-PTF-CD2           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-3)
             TO  H-I-FUND-CD3          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-3)
             TO  H-I-PTF-CD3           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-4)
             TO  H-I-FUND-CD4          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-4)
             TO  H-I-PTF-CD4           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-5)
             TO  H-I-FUND-CD5          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-5)
             TO  H-I-PTF-CD5           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-6)
             TO  H-I-FUND-CD6          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-6)
             TO  H-I-PTF-CD6           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-7)
             TO  H-I-FUND-CD7          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-7)
             TO  H-I-PTF-CD7           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-8)
             TO  H-I-FUND-CD8          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-8)
             TO  H-I-PTF-CD8           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-9)
             TO  H-I-FUND-CD9          OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-9)
             TO  H-I-PTF-CD9           OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-FUND-CD(CNS-10)
             TO  H-I-FUND-CD10         OF  H-KEY-TKPFZK01-CR2
           MOVE  WK-IN-PTF-CD(CNS-10)
             TO  H-I-PTF-CD10          OF  H-KEY-TKPFZK01-CR2
      *----------  削除区分
           MOVE  SPACE
             TO  H-SAKUJO-KBN          OF  H-KEY-TKPFZK01-CR2
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  H-RIYO-CMP-CD         OF  H-KEY-TKPFZK02-CR2
      *----------  ポートフォリオグループコード
           MOVE  WK-IN-GRP-CD(CNS-1)
             TO  H-PTF-GRP-CD1         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-2)
             TO  H-PTF-GRP-CD2         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-3)
             TO  H-PTF-GRP-CD3         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-4)
             TO  H-PTF-GRP-CD4         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-5)
             TO  H-PTF-GRP-CD5         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-6)
             TO  H-PTF-GRP-CD6         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-7)
             TO  H-PTF-GRP-CD7         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-8)
             TO  H-PTF-GRP-CD8         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-9)
             TO  H-PTF-GRP-CD9         OF  H-KEY-TKPFZK02-CR2
           MOVE  WK-IN-GRP-CD(CNS-10)
             TO  H-PTF-GRP-CD10        OF  H-KEY-TKPFZK02-CR2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(1)       = ["
      D             H-I-FUND-CD1       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(2)       = ["
      D             H-I-FUND-CD2       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(3)       = ["
      D             H-I-FUND-CD3       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(4)       = ["
      D             H-I-FUND-CD4       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(5)       = ["
      D             H-I-FUND-CD5       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(6)       = ["
      D             H-I-FUND-CD6       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(7)       = ["
      D             H-I-FUND-CD7       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(8)       = ["
      D             H-I-FUND-CD8       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(9)       = ["
      D             H-I-FUND-CD9       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ファンドコード(10)      = ["
      D             H-I-FUND-CD10      OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(1) = ["
      D             H-I-PTF-CD1        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(2) = ["
      D             H-I-PTF-CD2        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(3) = ["
      D             H-I-PTF-CD3        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(4) = ["
      D             H-I-PTF-CD4        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(5) = ["
      D             H-I-PTF-CD5        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(6) = ["
      D             H-I-PTF-CD6        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(7) = ["
      D             H-I-PTF-CD7        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(8) = ["
      D             H-I-PTF-CD8        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(9) = ["
      D             H-I-PTF-CD9        OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-ポートフォリオコード(10)= ["
      D             H-I-PTF-CD10       OF  H-KEY-TKPFZK01-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(1)       = ["
      D             H-PTF-GRP-CD1      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(2)       = ["
      D             H-PTF-GRP-CD2      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(3)       = ["
      D             H-PTF-GRP-CD3      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(4)       = ["
      D             H-PTF-GRP-CD4      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(5)       = ["
      D             H-PTF-GRP-CD5      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(6)       = ["
      D             H-PTF-GRP-CD6      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(7)       = ["
      D             H-PTF-GRP-CD7      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(8)       = ["
      D             H-PTF-GRP-CD8      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(9)       = ["
      D             H-PTF-GRP-CD9      OF  H-KEY-TKPFZK02-CR2"]"
      D    DISPLAY  CNS-PGM-ID":HST-グループコード(10)      = ["
      D             H-PTF-GRP-CD10     OF  H-KEY-TKPFZK02-CR2"]"
      *******    連結障害対応No.0000211  20081209 修正  終了    ********
           STRING  SQL-SELECT-DATA-CR2-1,
                   SQL-SELECT-WHERE-CR2-1,
                   SQL-UNION-CR2,
                   SQL-SELECT-DATA-CR2-2,
                   SQL-SELECT-WHERE-CR2-2,
           DELIMITED BY SIZE
           INTO  SQLSTMT-CR2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-SQLSTMT-CR2=[" WK-SQLSTMT-CR2 "]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT-CR2=[" SQLSTMT-CR2 "]"
      *-----------------------------------------------------------------
      *----------  PREPARE CURSOR
           EXEC SQL
             PREPARE  S2 FROM  :SQLSTMT-CR2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ所属処理グループCR2"
      D             "CURSOR PREPARE SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** PREPARE CR2 CURSOR 正常 ***"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** PREPARE CR2 CURSOR エラー ***"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-017
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR2
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D              "CURSOR PREPARE END ***"
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D              "CURSOR DECLEAR START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR2  CURSOR  FOR  S2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ所属処理グループCR2"
      D             "CURSOR DECLARE SQLCODE=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D              "CURSOR DECLEAR END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR2-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.2 ポートフォリオ所属処理グループCURSOR OPEN
      ******************************************************************
       CR2-OPEN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D             "CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  OPEN  CURSOR
           EXEC  SQL
               OPEN CR2
                 USING  :H-KEY-TKPFZK01-CR2.H-RIYO-CMP-CD,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD1,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD1,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD2,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD2,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD3,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD3,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD4,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD4,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD5,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD5,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD6,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD6,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD7,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD7,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD8,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD8,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD9,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD9,
                        :H-KEY-TKPFZK01-CR2.H-I-FUND-CD10,
                        :H-KEY-TKPFZK01-CR2.H-I-PTF-CD10,
                        :H-KEY-TKPFZK01-CR2.H-SAKUJO-KBN,
                        :H-KEY-TKPFZK02-CR2.H-RIYO-CMP-CD,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD1,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD2,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD3,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD4,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD5,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD6,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD7,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD8,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD9,
                        :H-KEY-TKPFZK02-CR2.H-PTF-GRP-CD10
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ所属処理グループCR2"
      D             "CURSOR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON              TO  FLG-CR2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR2 CURSOR OPEN 正常"
      D    DISPLAY  CNS-PGM-ID ":CR2 OPEN FLAG =["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-018
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR2
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D             "CURSOR OPEN END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR2-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.3 ポートフォリオ所属処理グループCURSOR FETCH
      ******************************************************************
       CR2-FETCH-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D             "CURSOR FETCH START ***"
      D    DISPLAY  CNS-PGM-ID ":FLG-CR2-FETCH=["FLG-CR2-FETCH"]"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  H-O-FUND-CD     OF  H-TKPFZK-S-CR2
                       H-O-PTF-CD      OF  H-TKPFZK-S-CR2
      *----------CR2 FETCH
           EXEC SQL
             FETCH CR2
             INTO  :H-TKPFZK-S-CR2.H-O-FUND-CD,
                   :H-TKPFZK-S-CR2.H-O-PTF-CD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ所属処理グループCR2"
      D             "CURSOR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ファンドコード["
      D              H-O-FUND-CD       OF  H-TKPFZK-S-CR2 "]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード["
      D              H-O-PTF-CD        OF  H-TKPFZK-S-CR2 "]"
      D    DISPLAY  CNS-PGM-ID ":権限チェック有無=["WK-KGN-CHK-UMU"]"
      *-----------------------------------------------------------------
      *----------  a)ファンド&ポートフォリオスペースチェック
               IF  H-O-FUND-CD         OF  H-TKPFZK-S-CR2 = SPACE
               OR  H-O-PTF-CD          OF  H-TKPFZK-S-CR2 = SPACE
               THEN
                 CONTINUE
               ELSE
      *----------  権限チェック有無 ＝ '1'の場合また"2"
                 IF  WK-KGN-CHK-UMU = CNS-X-1
                 OR  WK-KGN-CHK-UMU = CNS-X-2
                 THEN
      *----------  b)利用権限チェック2処理
                   PERFORM  RYO-KGN-CHK2-RTN
                 ELSE
      *----------  c)直近データの名称取得処理
                   PERFORM  CR3-MAIN-RTN
                 END-IF
               END-IF
      *----------  データなし
             WHEN  CNS-SQL-NOTFOUND
                MOVE  CNS-ON           TO FLG-CR2-FETCH
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-CR2-FETCH:["FLG-CR2-FETCH"]"
      *-----------------------------------------------------------------
      *----------  上記以外の場合
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-019
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR2
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D             "CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR2-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.4 ポートフォリオ所属処理グループCURSOR CLOSE
      ******************************************************************
       CR2-CLOSE-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D             "CURSOR CLOSE START ***"
      D    DISPLAY  CNS-PGM-ID ":CR2 OPEN FLAG =["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ所属処理グループCR2"
      D             "CURSOR CLOSE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF             TO  FLG-CR2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR2 OPEN FLAG =["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-020
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR2
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** ポートフォリオ所属処理グループCR2"
      D                       "CURSOR CLOSE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR2-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    b)利用権限チェック2処理
      ******************************************************************
       RYO-KGN-CHK2-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 利用権限チェック2処理 START ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG=["PARM-RTNPKG"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  接続用パラメータ設定
      *----------  業務グループコード
           MOVE  GYOUMU-GROUP-CODE     OF  IN-HEAD
             TO  GYOMU-GRP-CD          OF  PARM-SCZY1130-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD        OF  WORK-AREA
             TO  RIYO-CMP-CD           OF  PARM-SCZY1130-ARG1
      *----------  ログインユーザ会社コード
           MOVE  COMPANY-CODE          OF  IN-AIFA
             TO  LOGIN-CMP-CD          OF  PARM-SCZY1130-ARG1
      *----------  メニューID
           MOVE  SPACE
             TO  MENU-ID               OF  PARM-SCZY1130-ARG1
      *----------  実行処理ID
           MOVE  SPACE
             TO  JIKOU-SYORI-ID        OF  PARM-SCZY1130-ARG1
      *----------  ファンドコード
           MOVE  H-O-FUND-CD           OF  H-TKPFZK-S-CR2
             TO  FUND-CD               OF  PARM-SCZY1130-ARG1
      *----------  ポートフォリオコード
           MOVE  H-O-PTF-CD            OF  H-TKPFZK-S-CR2
             TO  PTF-CD                OF  PARM-SCZY1130-ARG1
      *----------  予備
           MOVE  SPACE
             TO  YOBI                  OF  PARM-SCZY1130-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1130-ARG1:"
      D    DISPLAY  CNS-PGM-ID ":業務グループコード =["
      D              GYOMU-GRP-CD      OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード =["
      D              RIYO-CMP-CD       OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ログインユーザ会社コード =["
      D              LOGIN-CMP-CD      OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":メニューID =["
      D              MENU-ID           OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":実行処理ID =["
      D              JIKOU-SYORI-ID    OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード =["
      D              FUND-CD           OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード =["
      D              PTF-CD            OF  PARM-SCZY1130-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":予備 =["
      D              YOBI              OF  PARM-SCZY1130-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY1130"           USING  PARM-SCZY1130-IN
                                              PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用権限チェックルーチン2SCZY1130"
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG=[" PARM-RTNPKG "]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY1130=["
      D            RTN-CD OF PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID ":COUNTER  OF  PARM-RTNPKG=["
      D                          COUNTER  OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *----------  c)直近データの名称取得処理
               PERFORM  CR3-MAIN-RTN
             WHEN  CNS-RTN-130
               MOVE  CNS-OFF           TO  FLG-CHECK
      *******    残タスク   No.0000169  20090107 修正  開始    *********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CHECK=["FLG-CHECK"]"
      D    DISPLAY  CNS-PGM-ID":WK-RETURN-CODE =["WK-RETURN-CODE"]"
      *-----------------------------------------------------------------
               MOVE  CNS-RTN-130       TO  WK-RETURN-CODE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RETURN-CODE =["WK-RETURN-CODE"]"
      *-----------------------------------------------------------------
      *******    残タスク   No.0000169  20090107 修正  終了    *********
      *******    残タスク   No.0000153  20081209 修正  開始    *********
               INITIALIZE  PARM-RTNPKG
      *******    残タスク   No.0000153  20081209 修正  終了    *********
      *******    テーマ④ 20081020 修正  開始    ***********************
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-CHECK=["FLG-CHECK"]"
      D    DISPLAY  CNS-PGM-ID ":権限チェック有無=[" WK-KGN-CHK-UMU "]"
      D    DISPLAY  CNS-PGM-ID ":オール指定      =[" WK-ALL-SITEI "]"
      *--------------------<DEBUG>--------------------------------------
               IF  WK-KGN-CHK-UMU  = CNS-X-1
                 AND  WK-ALL-SITEI <> CNS-X-1
               THEN
      D    DISPLAY  CNS-PGM-ID":WK-RETURN-CODE =["WK-RETURN-CODE"]"
      *-----------------------------------------------------------------
      *******    連結障害対応No.0000119  20081023 修正  開始    ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.業務タスクID =["
      D             GYOMU-TASK-ID      OF  PARM-SCZY4023-ARG1"]"
      *-----------------------------------------------------------------
                 IF  GYOMU-TASK-ID  OF  PARM-SCZY4023-ARG1 = SPACE
                 THEN
      *----------  監査ログ1ＩＮＳルーチン
                   PERFORM  KANSA-LOG2-INS-RTN
                 ELSE
      *----------  バッチ用監査ログＩＮＳルーチン
                   PERFORM  SCZY7110-2-RTN
                 END-IF
      *******    連結障害対応No.0000119  20081023 修正  終了    ********
               ELSE
                 CONTINUE
               END-IF
      *******    テーマ④ 20081020 修正  終了    ***********************
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-021
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG=[" PARM-RTNPKG "]"
      D    DISPLAY  CNS-PGM-ID ":*** 利用権限チェック処理2 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       RYO-KGN-CHK2-EXT.
           EXIT.
      ******************************************************************
      *    監査ログ2ＩＮＳルーチン
      ******************************************************************
       KANSA-LOG2-INS-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":監査ログ2ＩＮＳルーチン START"
      *-----------------------------------------------------------------
      *----------  AIFA・共通ヘッダ項目
           MOVE  WK-AIFA-HEADER        TO  PARM-SCZY1100-AIFA-HEADER
      *----------  システム処理ID
           MOVE  WK-MENU-ID
             TO  SYS-SYORI-ID          OF  PARM-SCZY1100-INOUT
      *----------  起動ID
           MOVE  SPACE
             TO  KIDOU-ID              OF  PARM-SCZY1100-INOUT
      *----------  画面アクション区分
           MOVE  WK-GAMEN-ACT-KBN
             TO  GAMEN-ACT-KBN         OF  PARM-SCZY1100-INOUT
      *----------  正常エラー区分
           MOVE  CNS-07
             TO  NML-ERR-KBN           OF  PARM-SCZY1100-INOUT
      *----------  課金用検索区分
           MOVE  ZERO
             TO  EE-SEARCH-KBN         OF  PARM-SCZY1100-INOUT
      *----------  基準年月日1
           MOVE  SPACE
             TO  KIJUN-YMD1            OF  PARM-SCZY1100-INOUT
      *----------  基準年月日2
           MOVE  SPACE
             TO  KIJUN-YMD2            OF  PARM-SCZY1100-INOUT
      *----------  委託会社コード
           MOVE  SPACE
             TO  ITK-CMP-CD            OF  PARM-SCZY1100-INOUT
      *----------  ファンドコード
           MOVE  SPACE
             TO  FND-CD                OF  PARM-SCZY1100-INOUT
      *******    連結障害対応No.0000356 20081121 修正  開始    *********
      *----------  銘柄コード
           MOVE  SPACE
             TO  MEG-CD                OF  PARM-SCZY1100-INOUT
      *******    連結障害対応No.0000356 20081121 修正  終了    *********
      *----------  データ特定用ID
           MOVE  WK-GYOMU-TASK-ID
             TO  DATA-ID               OF  PARM-SCZY1100-INOUT
      *----------  TXRX利用区分
           MOVE  IN-HEAD(CNS-TXRX-POS:CNS-1)
             TO  TXRX-KBN              OF  PARM-SCZY1100-INOUT
      *----------  RXファンドコード
           MOVE  H-O-FUND-CD           OF  H-TKPFZK-S-CR2
             TO  FUND-CD               OF  PARM-SCZY1100-INOUT
      *----------  RXポートフォリオコード
           MOVE  H-O-PTF-CD            OF  H-TKPFZK-S-CR2
             TO  PTF-CD                OF  PARM-SCZY1100-INOUT
      *----------  電文ID
           MOVE  SPACE
             TO  DENBUN-ID             OF  PARM-SCZY1100-INOUT
      *----------  入力電文
           MOVE  SPACE
             TO  IN-DENBUN             OF  PARM-SCZY1100-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":AIFA・共通ヘッダ項目              =["
      D             PARM-SCZY1100-AIFA-HEADER                  "]"
      D    DISPLAY  CNS-PGM-ID ":システム処理ID                    =["
      D             SYS-SYORI-ID       OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                            =["
      D             KIDOU-ID           OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":画面アクション区分                =["
      D             GAMEN-ACT-KBN      OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":正常エラー区分                    =["
      D             NML-ERR-KBN        OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":課金用検索区分                    =["
      D             EE-SEARCH-KBN      OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":基準年月日1                       =["
      D             KIJUN-YMD1         OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":基準年月日2                       =["
      D             KIJUN-YMD2         OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":委託会社コード                    =["
      D             ITK-CMP-CD         OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード                    =["
      D             FND-CD             OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                        =["
      D             MEG-CD             OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":データ特定用ID                    =["
      D             DATA-ID            OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":TXRX利用区分                      =["
      D             TXRX-KBN           OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":RXファンドコード                  =["
      D             FUND-CD            OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":RXポートフォリオコード            =["
      D             PTF-CD             OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":電文ID                            =["
      D             DENBUN-ID          OF PARM-SCZY1100-INOUT  "]"
      D    DISPLAY  CNS-PGM-ID ":入力電文                          =["
      D             IN-DENBUN          OF PARM-SCZY1100-INOUT  "]"
      *-----------------------------------------------------------------
           CALL  "SCZY1100"             USING  PARM-SCZY1100-AIFA-HEADER
                                               PARM-SCZY1100-INOUT
                                               PARM-SCZY1100-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY1100                  =["
      D    RTN-CD
      D    OF PARM-SCZY1100-RTNPKG(COUNTER   OF PARM-SCZY1100-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID ":COUNTER OF PARM-SCZY1100-RTNPKG=["
      D             COUNTER                  OF PARM-SCZY1100-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD
                OF PARM-SCZY1100-RTNPKG(COUNTER OF PARM-SCZY1100-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-022
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 監査ログ2ＩＮＳルーチン END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KANSA-LOG2-INS-EXT.
           EXIT.
      ******************************************************************
      *    c)直近データの名称取得処理
      ******************************************************************
       CR3-MAIN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  直近データの名称取得START  ***"
      *-----------------------------------------------------------------
      *----------  あ)直近データの名称取得CURSOR PREPARE
             PERFORM  CR3-PREPARE-RTN
      *----------  い)直近データの名称取得CURSOR OPEN
             PERFORM  CR3-OPEN-RTN
      *----------  う)直近データの名称取得CURSOR FETCH
             PERFORM  CR3-FETCH-RTN
      *----------  え)直近データの名称取得CURSOR CLOSE
             PERFORM  CR3-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  直近データの名称END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR3-MAIN-EXT.
           EXIT.
      ******************************************************************
      *    あ)直近データの名称取得CURSOR PREPARE
      ******************************************************************
       CR3-PREPARE-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得"
      D                       "CR3 CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
      *----------  直近データの名称取得SQL文
           INITIALIZE  WK-SQLSTMT-CR3
                       SQLSTMT-CR3
      *----------  フリーメッセージ用動的SQL文作成
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  SQL-RIYO-CMP-CD-CR3-1,
                 SQL-RIYO-CMP-CD-CR3-2
      *----------  ファンドコード
           MOVE  H-O-FUND-CD           OF  H-TKPFZK-S-CR2
             TO  SQL-FUND-CD-CR3-1,
                 SQL-FUND-CD-CR3-2
      *----------  ポートフォリオコード
           MOVE  H-O-PTF-CD            OF  H-TKPFZK-S-CR2
             TO  SQL-PTF-CD-CR3-1,
                 SQL-PTF-CD-CR3-2
           STRING  SQL-SELECT-DATA-CR3,
                   SQL-SELECT-WHERE-E-CR3
           DELIMITED BY SIZE
           INTO  WK-SQLSTMT-CR3
      *----------  直近データの名称取得SQL文作成
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  H-RIYO-CMP-CD         OF  H-KEY-TKPFZK01-CR3
      *----------  ファンドコード
           MOVE  H-O-FUND-CD           OF  H-TKPFZK-S-CR2
             TO  H-I-FUND-CD           OF  H-KEY-TKPFZK01-CR3
      *----------  ポートフォリオコード
           MOVE  H-O-PTF-CD            OF  H-TKPFZK-S-CR2
             TO  H-I-PTF-CD            OF  H-KEY-TKPFZK01-CR3
      *----------  削除区分
           MOVE  SPACE
             TO  H-SAKUJO-KBN          OF  H-KEY-TKPFZK01-CR3
           STRING  SQL-SELECT-DATA-CR3,
                   SQL-SELECT-WHERE-CR3
           DELIMITED BY SIZE
           INTO  SQLSTMT-CR3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-SQLSTMT-CR3=[" WK-SQLSTMT-CR3 "]"
      D    DISPLAY  CNS-PGM-ID ":SQLSTMT-CR3=[" SQLSTMT-CR3 "]"
      *-----------------------------------------------------------------
      *----------  PREPARE CURSOR
           EXEC SQL
             PREPARE  S3 FROM  :SQLSTMT-CR3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直近データの名称取得CR3"
      D                        "CURSOR PREPARE SQLCODE=[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** PREPARE CR3 CURSOR 正常 ***"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** PREPARE CR3 CURSOR エラー ***"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-023
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR3
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得CR3"
      D              "CURSOR PREPARE END ***"
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得CR3"
      D              "CURSOR DECLEAR START ***"
      *-----------------------------------------------------------------
      *----------  DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR3  CURSOR  FOR  S3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直近データの名称取得CR3"
      D                        "CURSOR DECLARE SQLCODE=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得CR3"
      D                       "CURSOR DECLEAR END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR3-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    い)直近データの名称取得CURSOR OPEN
      ******************************************************************
       CR3-OPEN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得CR3"
      D                       "CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  OPEN  CURSOR
           EXEC  SQL
               OPEN CR3
                 USING  :H-KEY-TKPFZK01-CR3.H-RIYO-CMP-CD,
                        :H-KEY-TKPFZK01-CR3.H-I-FUND-CD,
                        :H-KEY-TKPFZK01-CR3.H-I-PTF-CD,
                        :H-KEY-TKPFZK01-CR3.H-RIYO-CMP-CD,
                        :H-KEY-TKPFZK01-CR3.H-I-FUND-CD,
                        :H-KEY-TKPFZK01-CR3.H-I-PTF-CD,
                        :H-KEY-TKPFZK01-CR3.H-SAKUJO-KBN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直近データの名称取得CR3"
      D                        "CURSOR OPEN SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON              TO  FLG-CR3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":OPEN CR3"
      D    DISPLAY  CNS-PGM-ID ":CR3 OPEN FLAG =["FLG-CR3-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-024
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR3
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得"
      D                       "CURSOR OPEN END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR3-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    う)直近データの名称取得CURSOR FETCH
      ******************************************************************
       CR3-FETCH-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得CR3"
      D             "CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE  H-O-FND-MEI-JPN OF   H-TKPFZK01-S-CR3
                       H-O-PTF-MEI-JPN OF   H-TKPFZK01-S-CR3
      *----------CR3 FETCH
           EXEC SQL
             FETCH CR3
             INTO  :H-TKPFZK01-S-CR3.H-O-FND-MEI-JPN,
                   :H-TKPFZK01-S-CR3.H-O-PTF-MEI-JPN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直近データの名称取得CR3"
      D             "CURSOR FETCH SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
      *----------  正常
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直近データの名称取得CURSOR FETCH 結果:"
      D    DISPLAY  CNS-PGM-ID ":ファンド名（日）=["
      D                        H-O-FND-MEI-JPN OF   H-TKPFZK01-S-CR3 "]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオ名（日）=["
      D                        H-O-PTF-MEI-JPN OF   H-TKPFZK01-S-CR3 "]"
      *-----------------------------------------------------------------
      *----------  非オール指定の場合出力データ編集処理
               PERFORM  DATA-HENSYU-CR3-RTN
      *----------  データなしの場合
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
      *----------  上記以外の場合
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-025
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR3
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得CR3"
      D                       "CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR3-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    え)直近データの名称取得CURSOR CLOSE
      ******************************************************************
       CR3-CLOSE-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 直近データの名称取得CR3"
      D             "CURSOR CLOSE START ***"
      D    DISPLAY  CNS-PGM-ID ":CR3 OPEN FLAG =["FLG-CR3-OPEN"]"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直近データの名称取得CR3"
      D             "CURSOR CLOSE SQLCODE =[" SQLCODE "]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF           TO  FLG-CR3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR3 OPEN FLAG =[" FLG-CR3-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-026
               TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  WK-SQLSTMT-CR3
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":直近データの名称取得CR3"
      D             "CURSOR CLOSE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR3-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    非オール指定の場合出力データ編集処理
      ******************************************************************
       DATA-HENSYU-CR3-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 非オール指定の場合出力データ編集"
      D             "処理 START ***"
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":WK-件数       =["WK-COUNT"]"
      *-----------------------------------------------------------------
      *----------  WK-ヒット件数 ＜ WK-件数の場合
           COMPUTE  WK-HIT-COUNT = 1 + WK-HIT-COUNT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":WK-件数       =["WK-COUNT"]"
      *-----------------------------------------------------------------
             IF  WK-HIT-COUNT <= WK-COUNT
             THEN
      *----------  ファンドコード
               MOVE  H-O-FUND-CD       OF  H-TKPFZK-S-CR2
                 TO  WK-O-FUND-CD(WK-HIT-COUNT)
      *----------  ポートフォリオコード
               MOVE  H-O-PTF-CD        OF  H-TKPFZK-S-CR2
                 TO  WK-O-PTF-CD(WK-HIT-COUNT)
      *----------  ファンド名（日）
               MOVE  H-O-FND-MEI-JPN   OF  H-TKPFZK01-S-CR3
                 TO  WK-O-FND-MEI-JPN(WK-HIT-COUNT)
      *----------  ポートフォリオ名（日）
               MOVE  H-O-PTF-MEI-JPN   OF  H-TKPFZK01-S-CR3
                 TO  WK-O-PTF-MEI-JPN(WK-HIT-COUNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数 =["WK-HIT-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":WK-ファンドコード("WK-HIT-COUNT")=["
      D              WK-O-FUND-CD(WK-HIT-COUNT) "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ポートフォリオコード("
      D              WK-HIT-COUNT")=["
      D              WK-O-PTF-CD(WK-HIT-COUNT) "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ファンド名（日）("WK-HIT-COUNT")=["
      D              WK-O-FND-MEI-JPN(WK-HIT-COUNT) "]"
      D    DISPLAY  CNS-PGM-ID ":WK-ポートフォリオ名(日)("
      D              WK-HIT-COUNT")=["
      D              WK-O-PTF-MEI-JPN(WK-HIT-COUNT) "]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-件数       =["WK-COUNT"]"
      *-----------------------------------------------------------------
               MOVE  WK-COUNT          TO  WK-HIT-COUNT
               MOVE  CNS-RTN-002
                 TO  RTN-CD            OF  PARM-SCZY4023-RTNPKG(1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数=["WK-HIT-COUNT"]"
      D    DISPLAY  CNS-PGM-ID ":リターンコード=["
      D                          RTN-CD   OF  PARM-SCZY4023-RTNPKG(1)"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":オール指定 =["
      D                          ALL-SITEI   OF  PARM-SCZY4023-ARG1"]"
      *-----------------------------------------------------------------
               IF  ALL-SITEI           OF  PARM-SCZY4023-ARG1
                 = CNS-X-2
               THEN
                 PERFORM  JUN-HENKOU-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数=["WK-HIT-COUNT"]"
      *-----------------------------------------------------------------
                 MOVE  WK-HIT-COUNT
                   TO  HIT-KENSU       OF  PARM-SCZY4023-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":件数 =["
      D                          HIT-KENSU   OF  PARM-SCZY4023-ARG2"]"
      *-----------------------------------------------------------------
      *----------  ソート用データ
                 PERFORM  VARYING WK-IDX4  FROM  1  BY  1
                   UNTIL  WK-IDX4 > WK-HIT-COUNT
      *----------  ファンドコード
                   MOVE  WK-O-FUND-CD(WK-IDX4)
                     TO  O-FUND-CD     OF  PARM-SCZY4023-ARG2(WK-IDX4)
      *----------  ファンド名（日）
                   MOVE  WK-O-FND-MEI-JPN(WK-IDX4)
                     TO  O-FND-MEI-JPN OF  PARM-SCZY4023-ARG2(WK-IDX4)
      *----------  ポートフォリオコード
                   MOVE  WK-O-PTF-CD(WK-IDX4)
                     TO  O-PTF-CD      OF  PARM-SCZY4023-ARG2(WK-IDX4)
      *----------  ポートフォリオ名（日）
                   MOVE  WK-O-PTF-MEI-JPN(WK-IDX4)
                     TO  O-PTF-MEI-JPN OF  PARM-SCZY4023-ARG2(WK-IDX4)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.ファンドコード("WK-IDX4")=["
      D             O-FUND-CD         OF  PARM-SCZY4023-ARG2(WK-IDX4)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ファンド名（日）("WK-IDX4")=["
      D             O-FND-MEI-JPN     OF  PARM-SCZY4023-ARG2(WK-IDX4)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ポートフォリオコード("WK-IDX4")=["
      D             O-PTF-CD          OF  PARM-SCZY4023-ARG2(WK-IDX4)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ポートフォリオ名（日）("WK-IDX4")"
      D        "=[" O-PTF-MEI-JPN     OF  PARM-SCZY4023-ARG2(WK-IDX4)"]"
      *-----------------------------------------------------------------
                 END-PERFORM
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-027
                   TO  ERR-POS         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-002
                   TO  RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  ZERO
                   TO  DETAIL-RTN-CD   OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-0
                   TO  DETAIL-RTN-CD-FLG
                                       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                 MOVE  CNS-ERRID-E04
                   TO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
                 PERFORM  ERR-RTN
               END-IF
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 非オール指定の場合出力データ編集"
      D             "処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-HENSYU-CR3-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3. オール指定によりソート順の変更
      ******************************************************************
       JUN-HENKOU-RTN         SECTION.
      *******    連結障害対応No.0000589  20081209 修正  開始    ********
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  オール指定によりソート順の変更"
      D                         "  START  ***"
      D    DISPLAY  CNS-PGM-ID ":オール指定 =["
      D                          ALL-SITEI   OF  PARM-SCZY4023-ARG1"]"
      *-----------------------------------------------------------------
           IF  ALL-SITEI               OF  PARM-SCZY4023-ARG1
            =  CNS-X-2
           AND WK-HIT-COUNT > CNS-1
           THEN
      *******    連結障害対応No.0000589  20081209 修正  終了    ********
             PERFORM  SORT-ROUTINE-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数=["WK-HIT-COUNT"]"
      *-----------------------------------------------------------------
           MOVE  WK-HIT-COUNT
             TO  HIT-KENSU              OF  PARM-SCZY4023-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":件数 =["
      D                          HIT-KENSU   OF  PARM-SCZY4023-ARG2"]"
      *-----------------------------------------------------------------
      *----------  ソート用データ
             PERFORM  VARYING WK-IDX3  FROM  1  BY  1
               UNTIL  WK-IDX3 > WK-HIT-COUNT
      *----------  ファンドコード
               MOVE  WK-O-FUND-CD(WK-IDX3)
                 TO  O-FUND-CD          OF  PARM-SCZY4023-ARG2(WK-IDX3)
      *----------  ファンド名（日）
               MOVE  WK-O-FND-MEI-JPN(WK-IDX3)
                 TO  O-FND-MEI-JPN      OF  PARM-SCZY4023-ARG2(WK-IDX3)
      *----------  ポートフォリオコード
               MOVE  WK-O-PTF-CD(WK-IDX3)
                 TO  O-PTF-CD           OF  PARM-SCZY4023-ARG2(WK-IDX3)
      *----------  ポートフォリオ名（日）
               MOVE  WK-O-PTF-MEI-JPN(WK-IDX3)
                 TO  O-PTF-MEI-JPN      OF  PARM-SCZY4023-ARG2(WK-IDX3)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.ファンドコード("WK-IDX3")=["
      D             O-FUND-CD         OF  PARM-SCZY4023-ARG2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ファンド名（日）("WK-IDX3")=["
      D             O-FND-MEI-JPN     OF  PARM-SCZY4023-ARG2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ポートフォリオコード("WK-IDX3")=["
      D             O-PTF-CD          OF  PARM-SCZY4023-ARG2(WK-IDX3)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ポートフォリオ名（日）("WK-IDX3")"
      D        "=[" O-PTF-MEI-JPN     OF  PARM-SCZY4023-ARG2(WK-IDX3)"]"
      *-----------------------------------------------------------------
             END-PERFORM
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":リターンコード=["
      D                          RTN-CD OF  PARM-SCZY4023-RTNPKG(1)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                   OF  PARM-SCZY4023-RTNPKG(1)
            =  CNS-RTN-002
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  抽出超過処理  ***"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-028
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-002
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG
                                        OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERRID-E04
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** オール指定によりソート順の変更"
      D                         "  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       JUN-HENKOU-EXT.
           EXIT.
      ******************************************************************
      *    ソートルーチン
      ******************************************************************
       SORT-ROUTINE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  ソートルーチン  START  ***"
      *-----------------------------------------------------------------
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD           OF  PARM-SCZY4023-ARG1
             TO  RIYO-CMP-CD           OF  PARM-SCZY4030-ARG1
      *----------  ヒット件数
           MOVE  WK-HIT-COUNT
             TO  HIT-KENSU             OF  PARM-SCZY4030-ARG1
      *----------  利用サブＩＤ
           MOVE  CNS-PGM-ID
             TO  RIYO-SUB-ID           OF  PARM-SCZY4030-ARG1
      *----------  ソート用オール指定1
           EVALUATE  ALL-SITEI         OF  PARM-SCZY4023-ARG1
             WHEN  CNS-X-0
             WHEN  CNS-X-1
               MOVE  CNS-X-0
                 TO  ALL-SITEI-1       OF  PARM-SCZY4030-ARG1
             WHEN  CNS-X-2
               MOVE  CNS-X-1
                 TO  ALL-SITEI-1       OF  PARM-SCZY4030-ARG1
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *******    連結障害対応No.0000211  20081209 修正  開始    ********
           PERFORM  VARYING  WK-CNT  FROM  CNS-1  BY  CNS-1
             UNTIL  WK-CNT  >  CNS-10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CNT = ["WK-CNT"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.ポートフォリオ区分("WK-CNT") = ["
      D             PTF-KBN            OF  PARM-SCZY4023-ARG1(WK-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.グループ又はファンドコード("WK-CNT
      D             ") = ["GRP-FUND-CD OF  PARM-SCZY4023-ARG1(WK-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.ポートフォリオコード("WK-CNT") = ["
      D             PTF-CD             OF  PARM-SCZY4023-ARG1(WK-CNT)"]"
      *-----------------------------------------------------------------
      *----------  ソート用ポートフォリオ区分
             MOVE  PTF-KBN              OF  PARM-SCZY4023-ARG1(WK-CNT)
               TO  PTF-KBN              OF  PARM-SCZY4030-ARG1(WK-CNT)
      *----------  ソート用グループ又はファンドコード
             MOVE  GRP-FUND-CD          OF  PARM-SCZY4023-ARG1(WK-CNT)
               TO  GRP-FUND-CD          OF  PARM-SCZY4030-ARG1(WK-CNT)
      *----------  ソート用ポートフォリオコード
             MOVE  PTF-CD               OF  PARM-SCZY4023-ARG1(WK-CNT)
               TO  PTF-CD               OF  PARM-SCZY4030-ARG1(WK-CNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4030.ポートフォリオ区分("WK-CNT
      D      ") = ["PTF-KBN            OF  PARM-SCZY4030-ARG1(WK-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY4030.グループ又はファンドコード("
      D      WK-CNT") = ["GRP-FUND-CD  OF  PARM-SCZY4030-ARG1(WK-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY4030.ポートフォリオコード("WK-CNT
      D      ") = ["PTF-CD             OF  PARM-SCZY4030-ARG1(WK-CNT)"]"
      *-----------------------------------------------------------------
           END-PERFORM
      *******    連結障害対応No.0000211  20081209 修正  終了    ********
      *----------  ソート用オール指定2
           MOVE  CNS-X-0
             TO  ALL-SITEI-2           OF  PARM-SCZY4030-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード     =["RIYO-CMP-CD
      D                                        OF  PARM-SCZY4030-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ヒット件数         =["HIT-KENSU
      D                                        OF  PARM-SCZY4030-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用サブＩＤ       =["RIYO-SUB-ID
      D                                        OF  PARM-SCZY4030-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ソート用オール指定1=["ALL-SITEI-1
      D                                        OF  PARM-SCZY4030-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ソート用オール指定2=["ALL-SITEI-2
      D                                        OF  PARM-SCZY4030-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ソート用評価系列   =["HYK
      D                                        OF  PARM-SCZY4030-ARG1"]"
      *-----------------------------------------------------------------
      *----------  ソート用データ
           PERFORM  VARYING WK-IDX1  FROM  1  BY  1
             UNTIL  WK-IDX1 > WK-HIT-COUNT
      *----------  ファンドコード
             MOVE  WK-O-FUND-CD(WK-IDX1)
               TO  I-FUND-CD            OF  PARM-SCZY4030-ARG1(WK-IDX1)
      *----------  ファンド名（日）
             MOVE  WK-O-FND-MEI-JPN(WK-IDX1)
               TO  I-FND-MEI-JPN        OF  PARM-SCZY4030-ARG1(WK-IDX1)
      *----------  ポートフォリオコード
             MOVE  WK-O-PTF-CD(WK-IDX1)
               TO  I-PTF-CD             OF  PARM-SCZY4030-ARG1(WK-IDX1)
      *----------  ポートフォリオ名（日）
             MOVE  WK-O-PTF-MEI-JPN(WK-IDX1)
               TO  I-PTF-MEI-JPN        OF  PARM-SCZY4030-ARG1(WK-IDX1)
      *----------  評価系列コード
             MOVE  SPACE
               TO  I-HYK-KRTU-CD        OF  PARM-SCZY4030-ARG1(WK-IDX1)
      *----------  開始日
             MOVE  ZERO
               TO  I-YMD-FROM           OF  PARM-SCZY4030-ARG1(WK-IDX1)
      *----------  終了日
             MOVE  ZERO
               TO  I-YMD-TO             OF  PARM-SCZY4030-ARG1(WK-IDX1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード("WK-IDX1")=["I-FUND-CD
      D                               OF  PARM-SCZY4030-ARG1(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":ファンド名（日）("WK-IDX1")=["
      D             I-FND-MEI-JPN     OF  PARM-SCZY4030-ARG1(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード("WK-IDX1")=["
      D             I-PTF-CD          OF  PARM-SCZY4030-ARG1(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ名（日）("WK-IDX1")=["
      D             I-PTF-MEI-JPN     OF  PARM-SCZY4030-ARG1(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード("WK-IDX1")=["
      D             I-HYK-KRTU-CD     OF  PARM-SCZY4030-ARG1(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":開始日("WK-IDX1")=["I-YMD-FROM
      D                               OF  PARM-SCZY4030-ARG1(WK-IDX1)"]"
      D    DISPLAY  CNS-PGM-ID":終了日("WK-IDX1")=["I-YMD-TO
      D                               OF  PARM-SCZY4030-ARG1(WK-IDX1)"]"
      *-----------------------------------------------------------------
           END-PERFORM
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4030 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4030"             USING  PARM-SCZY4030-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4030 END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4030)                     =["
      D             RTN-CD  OF  PARM-RTNPKG  (COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG               =["
      D             COUNTER             OF  PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":WK-ヒット件数=["WK-HIT-COUNT"]"
      *-----------------------------------------------------------------
           IF  RTN-CD       OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             INITIALIZE  PARM-RTNPKG
             MOVE  WK-HIT-COUNT
               TO  HIT-KENSU            OF  PARM-SCZY4023-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":件数 =["
      D                          HIT-KENSU   OF  PARM-SCZY4023-ARG2"]"
      *-----------------------------------------------------------------
             PERFORM  VARYING WK-IDX2  FROM  1  BY  1
               UNTIL  WK-IDX2 > WK-HIT-COUNT
      *----------  ファンドコード
               MOVE  O-FUND-CD          OF  PARM-SCZY4030-ARG2(WK-IDX2)
                 TO  O-FUND-CD          OF  PARM-SCZY4023-ARG2(WK-IDX2)
      *----------  ファンド名（日）
               MOVE  O-FND-MEI-JPN      OF  PARM-SCZY4030-ARG2(WK-IDX2)
                 TO  O-FND-MEI-JPN      OF  PARM-SCZY4023-ARG2(WK-IDX2)
      *----------  ポートフォリオコード
               MOVE  O-PTF-CD           OF  PARM-SCZY4030-ARG2(WK-IDX2)
                 TO  O-PTF-CD           OF  PARM-SCZY4023-ARG2(WK-IDX2)
      *----------  ポートフォリオ名（日）
               MOVE  O-PTF-MEI-JPN      OF  PARM-SCZY4030-ARG2(WK-IDX2)
                 TO  O-PTF-MEI-JPN      OF  PARM-SCZY4023-ARG2(WK-IDX2)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.ファンドコード("WK-IDX2")=["
      D             O-FUND-CD         OF  PARM-SCZY4023-ARG2(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ファンド名（日）("WK-IDX2")=["
      D             O-FND-MEI-JPN     OF  PARM-SCZY4023-ARG2(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ポートフォリオコード("WK-IDX2")=["
      D             O-PTF-CD          OF  PARM-SCZY4023-ARG2(WK-IDX2)"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.ポートフォリオ名（日）("WK-IDX2")"
      D        "=[" O-PTF-MEI-JPN     OF  PARM-SCZY4023-ARG2(WK-IDX2)"]"
      *-----------------------------------------------------------------
             END-PERFORM
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  ソートルーチエラー  *****"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-029
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ソートルーチ END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SORT-ROUTINE-EXT.
           EXIT.
      ******************************************************************
      *    3.3 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:後処理  START  ***"
      *-----------------------------------------------------------------
      *******    残タスク   No.0000153  20081209 修正  開始    *********
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RETURN-CODE =["WK-RETURN-CODE"]"
      *-----------------------------------------------------------------
           MOVE  WK-RETURN-CODE
             TO  RTN-CD                OF  PARM-SCZY1170-IN
      *******    残タスク   No.0000153  20081209 修正  終了    *********
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ERR-PGM-ID  OF  PARM-SCZY1170-IN=["
      D              ERR-PGM-ID        OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":ERR-POS  OF  PARM-SCZY1170-IN=["
      D              ERR-POS           OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD  OF  PARM-SCZY1170-IN=["
      D              RTN-CD            OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":DETAIL-RTN-CD  OF  PARM-SCZY1170-IN"
      D             "=[" DETAIL-RTN-CD OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":DETAIL-RTN-CD-FLG  OF"
      D             "PARM-SCZY1170-IN=["
      D              DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":FREE-MSG  OF  PARM-SCZY1170-IN=["
      D              FREE-MSG          OF  PARM-SCZY1170-IN "]"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"           USING  PARM-SCZY1170-IN
                                       PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG =[" PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           MOVE  PARM-RTNPKG           TO  PARM-SCZY4023-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY4023-ARG2=["
      D              PARM-SCZY4023-ARG2 "]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY4023-ARG3=["
      D              PARM-SCZY4023-ARG3 "]"
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *    3.4 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  SCZY4023:エラー処理  START  ***"
      *-----------------------------------------------------------------
      *----------  CURSOR3 CLOSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR3 OPEN FLAG =["FLG-CR3-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-CR3-OPEN = CNS-ON
           THEN
                EXEC  SQL
                 CLOSE CR3
                END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CLOSE CR3"
      D    DISPLAY  CNS-PGM-ID ":CR3 CLOSE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-OFF           TO  FLG-CR3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR3 OPEN FLAG =["FLG-CR3-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *----------  CURSOR2 CLOSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR2 OPEN FLAG =["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-CR2-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CR2
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CLOSE CR2"
      D    DISPLAY  CNS-PGM-ID ":CR2 CLOSE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-OFF           TO  FLG-CR2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR2 OPEN FLAG =["FLG-CR2-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *----------  CURSOR1 CLOSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR1 OPEN FLAG =["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-CR1-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CR1
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CLOSE CR1"
      D    DISPLAY  CNS-PGM-ID ":CR1 CLOSE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-OFF           TO  FLG-CR1-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CR1 OPEN FLAG =["FLG-CR1-OPEN"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *----------  ARG2．ヒット件数処理
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":リターンコード =["
      D                         RTN-CD  OF  PARM-SCZY4023-RTNPKG(1)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                   OF  PARM-SCZY4023-RTNPKG(1)
            =  CNS-RTN-002
           THEN
             CONTINUE
           ELSE
      *----------  ヒット件数<-ZERO、返却データ初期化
             INITIALIZE  PARM-SCZY4023-ARG2
             MOVE  ZERO      TO  HIT-KENSU
                                       OF  PARM-SCZY4023-ARG2
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":HIT-KENSU =["
      D              HIT-KENSU          OF  PARM-SCZY4023-ARG2 "]"
      D    DISPLAY  CNS-PGM-ID ":OUT-DATA =[" PARM-SCZY4023-ARG2 "]"
      D    DISPLAY  CNS-PGM-ID ":ERR-PGM-ID  OF  PARM-SCZY1170-IN=["
      D              ERR-PGM-ID         OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":ERR-POS  OF  PARM-SCZY1170-IN=["
      D              ERR-POS            OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD  OF  PARM-SCZY1170-IN=["
      D              RTN-CD             OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":DETAIL-RTN-CD  OF  PARM-SCZY1170-IN"
      D             "=[" DETAIL-RTN-CD  OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":DETAIL-RTN-CD-FLG  OF"
      D             "PARM-SCZY1170-IN=["
      D              DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-IN "]"
      D    DISPLAY  CNS-PGM-ID ":FREE-MSG  OF  PARM-SCZY1170-IN=["
      D              FREE-MSG           OF  PARM-SCZY1170-IN "]"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"           USING  PARM-SCZY1170-IN
                                              PARM-RTNPKG
           MOVE  PARM-RTNPKG           TO  PARM-SCZY4023-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY4023-ARG3=["
      D              PARM-SCZY4023-ARG3 "]"
      D    DISPLAY  CNS-PGM-ID ":***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID ":*** SCZY4023 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
      *******    連結障害対応No.0000119  20081023 修正  開始    ********
      ******************************************************************
      *    バッチ用監査ログＩＮＳルーチン１
      ******************************************************************
       SCZY7110-1-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** バッチ用監査ログＩＮＳルーチン１ START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7110-AIFA-HEADER
                       PARM-SCZY7110-IN
                       PARM-SCZY7110-RTNPKG
      *----------  AIFA・共通ヘッダ項目
           MOVE  WK-AIFA-HEADER        TO  PARM-SCZY7110-AIFA-HEADER
      *----------  システム処理ID
           MOVE  WK-MENU-ID
             TO  SYS-SYORI-ID          OF  PARM-SCZY7110-IN
      *----------  起動ID
           MOVE  SPACE
             TO  KIDOU-ID              OF  PARM-SCZY7110-IN
      *----------  画面アクション区分
           MOVE  WK-GAMEN-ACT-KBN
             TO  GAMEN-ACT-KBN         OF  PARM-SCZY7110-IN
      *----------  正常エラー区分
           MOVE  CNS-07
             TO  NML-ERR-KBN           OF  PARM-SCZY7110-IN
      *----------  課金用検索区分
           MOVE  ZERO
             TO  EE-SEARCH-KBN         OF  PARM-SCZY7110-IN
      *----------  基準年月日1
           MOVE  SPACE
             TO  KIJUN-YMD1            OF  PARM-SCZY7110-IN
      *----------  基準年月日2
           MOVE  SPACE
             TO  KIJUN-YMD2            OF  PARM-SCZY7110-IN
      *----------  委託会社コード
           MOVE  SPACE
             TO  ITK-CMP-CD            OF  PARM-SCZY7110-IN
      *----------  ファンドコード
           MOVE  SPACE
             TO  FND-CD                OF  PARM-SCZY7110-IN
      *******    連結障害対応No.0000356 20081121 修正  開始    *********
      *----------  銘柄コード
           MOVE  SPACE
             TO  MEG-CD                OF  PARM-SCZY7110-IN
      *******    連結障害対応No.0000356 20081121 修正  終了    *********
      *----------  データ特定用ID
           MOVE  WK-GYOMU-TASK-ID
             TO  DATA-ID               OF  PARM-SCZY7110-IN
      *----------  TXRX利用区分
           MOVE  IN-HEAD(CNS-TXRX-POS:CNS-1)
             TO  TXRX-KBN              OF  PARM-SCZY7110-IN
      *----------  RXファンドコード
           MOVE  WK-FUND-CD            OF  WK-OUT
             TO  FUND-CD               OF  PARM-SCZY7110-IN
      *----------  RXポートフォリオコード
           MOVE  WK-PTF-CD             OF  WK-OUT
             TO  PTF-CD                OF  PARM-SCZY7110-IN
      *----------  電文ID
           MOVE  SPACE
             TO  DENBUN-ID             OF  PARM-SCZY7110-IN
      *----------  入力電文
           MOVE  SPACE
             TO  IN-DENBUN             OF  PARM-SCZY7110-IN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":AIFA・共通ヘッダ項目              =["
      D             PARM-SCZY7110-AIFA-HEADER                  "]"
      D    DISPLAY  CNS-PGM-ID ":システム処理ID                    =["
      D             SYS-SYORI-ID       OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                            =["
      D             KIDOU-ID           OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":画面アクション区分                =["
      D             GAMEN-ACT-KBN      OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":正常エラー区分                    =["
      D             NML-ERR-KBN        OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":課金用検索区分                    =["
      D             EE-SEARCH-KBN      OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":基準年月日1                       =["
      D             KIJUN-YMD1         OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":基準年月日2                       =["
      D             KIJUN-YMD2         OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":委託会社コード                    =["
      D             ITK-CMP-CD         OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード                    =["
      D             FND-CD             OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                        =["
      D             MEG-CD             OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":データ特定用ID                    =["
      D             DATA-ID            OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":TXRX利用区分                      =["
      D             TXRX-KBN           OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":RXファンドコード                  =["
      D             FUND-CD            OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":RXポートフォリオコード            =["
      D             PTF-CD             OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":電文ID                            =["
      D             DENBUN-ID          OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":入力電文                          =["
      D             IN-DENBUN          OF PARM-SCZY7110-IN  "]"
      *-----------------------------------------------------------------
           CALL  "SCZY7110"             USING  PARM-SCZY7110-AIFA-HEADER
                                               PARM-SCZY7110-IN
                                               PARM-SCZY7110-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY7110                  =["
      D    RTN-CD
      D    OF PARM-SCZY7110-RTNPKG(COUNTER   OF PARM-SCZY7110-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID ":COUNTER OF PARM-SCZY7110-RTNPKG=["
      D             COUNTER                  OF PARM-SCZY7110-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD
                OF PARM-SCZY7110-RTNPKG(COUNTER OF PARM-SCZY7110-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  監査ログＩＮＳエラー  *****"
      *--------------------<DEBUG>--------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-030
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** バッチ用監査ログＩＮＳルーチン１ END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7110-1-EXT.
           EXIT.
      ******************************************************************
      *    バッチ用監査ログＩＮＳルーチン２
      ******************************************************************
       SCZY7110-2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** バッチ用監査ログＩＮＳルーチン２ START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7110-AIFA-HEADER
                       PARM-SCZY7110-IN
                       PARM-SCZY7110-RTNPKG
      *----------  AIFA・共通ヘッダ項目
           MOVE  WK-AIFA-HEADER        TO  PARM-SCZY7110-AIFA-HEADER
      *----------  システム処理ID
           MOVE  WK-MENU-ID
             TO  SYS-SYORI-ID          OF  PARM-SCZY7110-IN
      *----------  起動ID
           MOVE  SPACE
             TO  KIDOU-ID              OF  PARM-SCZY7110-IN
      *----------  画面アクション区分
           MOVE  WK-GAMEN-ACT-KBN
             TO  GAMEN-ACT-KBN         OF  PARM-SCZY7110-IN
      *----------  正常エラー区分
           MOVE  CNS-07
             TO  NML-ERR-KBN           OF  PARM-SCZY7110-IN
      *----------  課金用検索区分
           MOVE  ZERO
             TO  EE-SEARCH-KBN         OF  PARM-SCZY7110-IN
      *----------  基準年月日1
           MOVE  SPACE
             TO  KIJUN-YMD1            OF  PARM-SCZY7110-IN
      *----------  基準年月日2
           MOVE  SPACE
             TO  KIJUN-YMD2            OF  PARM-SCZY7110-IN
      *----------  委託会社コード
           MOVE  SPACE
             TO  ITK-CMP-CD            OF  PARM-SCZY7110-IN
      *----------  ファンドコード
           MOVE  SPACE
             TO  FND-CD                OF  PARM-SCZY7110-IN
      *******    連結障害対応No.0000356 20081121 修正  開始    *********
      *----------  銘柄コード
           MOVE  SPACE
             TO  MEG-CD                OF  PARM-SCZY1100-INOUT
      *******    連結障害対応No.0000356 20081121 修正  終了    *********
      *----------  データ特定用ID
           MOVE  WK-GYOMU-TASK-ID
             TO  DATA-ID               OF  PARM-SCZY7110-IN
      *----------  TXRX利用区分
           MOVE  IN-HEAD(CNS-TXRX-POS:CNS-1)
             TO  TXRX-KBN              OF  PARM-SCZY7110-IN
      *----------  RXファンドコード
           MOVE  H-O-FUND-CD           OF  H-TKPFZK-S-CR2
             TO  FUND-CD               OF  PARM-SCZY7110-IN
      *----------  RXポートフォリオコード
           MOVE  H-O-PTF-CD            OF  H-TKPFZK-S-CR2
             TO  PTF-CD                OF  PARM-SCZY7110-IN
      *----------  電文ID
           MOVE  SPACE
             TO  DENBUN-ID             OF  PARM-SCZY7110-IN
      *----------  入力電文
           MOVE  SPACE
             TO  IN-DENBUN             OF  PARM-SCZY7110-IN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":AIFA・共通ヘッダ項目              =["
      D             PARM-SCZY7110-AIFA-HEADER                  "]"
      D    DISPLAY  CNS-PGM-ID ":システム処理ID                    =["
      D             SYS-SYORI-ID       OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":起動ID                            =["
      D             KIDOU-ID           OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":画面アクション区分                =["
      D             GAMEN-ACT-KBN      OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":正常エラー区分                    =["
      D             NML-ERR-KBN        OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":課金用検索区分                    =["
      D             EE-SEARCH-KBN      OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":基準年月日1                       =["
      D             KIJUN-YMD1         OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":基準年月日2                       =["
      D             KIJUN-YMD2         OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":委託会社コード                    =["
      D             ITK-CMP-CD         OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード                    =["
      D             FND-CD             OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":銘柄コード                        =["
      D             MEG-CD             OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":データ特定用ID                    =["
      D             DATA-ID            OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":TXRX利用区分                      =["
      D             TXRX-KBN           OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":RXファンドコード                  =["
      D             FUND-CD            OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":RXポートフォリオコード            =["
      D             PTF-CD             OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":電文ID                            =["
      D             DENBUN-ID          OF PARM-SCZY7110-IN  "]"
      D    DISPLAY  CNS-PGM-ID ":入力電文                          =["
      D             IN-DENBUN          OF PARM-SCZY7110-IN  "]"
      *-----------------------------------------------------------------
           CALL  "SCZY7110"             USING  PARM-SCZY7110-AIFA-HEADER
                                               PARM-SCZY7110-IN
                                               PARM-SCZY7110-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY7110                  =["
      D    RTN-CD
      D    OF PARM-SCZY7110-RTNPKG(COUNTER   OF PARM-SCZY7110-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID ":COUNTER OF PARM-SCZY7110-RTNPKG=["
      D             COUNTER                  OF PARM-SCZY7110-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD
                OF PARM-SCZY7110-RTNPKG(COUNTER OF PARM-SCZY7110-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  監査ログＩＮＳエラー  *****"
      *--------------------<DEBUG>--------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-031
                 TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** バッチ用監査ログＩＮＳルーチン２ END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7110-2-EXT.
           EXIT.
      *******    連結障害対応No.0000119  20081023 修正  終了    ********
