      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * ＩＤ           : MUSJ0251
      * 名称           : 運用成果残高データ保存
      * 処理概要       : 残高履歴、資金残履歴、元本残高より、
      *                  基準日＝処理対象日のデータを抽出し、
      *                  これを元に運用成果残高のデータを生成・保存する
      * 参照ＤＢ       : 実行状況明細管理(TKDYAA35)
      *                  電文保持（TKDYAA32）
      *                  進捗管理(TKDYAA40)
      *                  残高履歴（TKMZZR00）
      *                  資金残履歴（TKMZSR00）
      *                  元本残高（TKMZGZ00）
      *                  評価履歴（TKMHHR00）
      * 更新ＤＢ       : 実行状況明細管理(TKDYAA35)
      *                  運用成果残高（TKUSZT01）
      *                  進捗管理(TKDYAA40)
      * 引数           : 利用会社コード
      *                  処理実行日
      *                  業務タスクID
      *                  起動ＩＤ
      *
      * 改訂履歴
      * 年月日   区分 所属     担当    内容
      * -------- ---- -------- ------- ---------------------------------
      * 20080526 新規 SCS      陳暁斌  新規作成
      * 20081101 修正 SCS      陳暁斌  仕様変更
      * 20081212 修正 SCS      陳暁斌  連結障害776の対応
      * 20081229 修正 SCS      陳暁斌  SCZY4002の接続説明を変更
      * 20090108 修正 SCS      陳暁斌  仕様変更
      * 20090226 修正 SCS      陳暁斌  残タスク165、172、187の対応
      * 20090407 修正 SCS      陳暁斌  残タスク185、187、194の対応
      * 20090610 修正 SCS      馬  輝  残タスク242の対応
      * 20090727 修正 SCS      陳暁斌  テーマ1029対応
      * 20090807 修正 SCS      陳暁斌  テーマ1207、1213対応
      * 20090817 修正 SCS      黄剣鵬  テーマ1008、1213対応
      * 20090901 修正 SCS      陳暁斌  テーマ1015対応
      * 20100223 修正 SCS      兪ル    性能改善、PH2対応（ＧＩＰＳモード起動処理追加）
      * 20100323 修正 SCS      兪ル    連結障害(0002214)対応
      * 20100326 修正 SCS      兪ル    連結障害(0002224)対応
      * 20100420 修正 SCS      HECHENG 「処理内容」にワーク期間(TO)を
      *                                 設定の変更 (テーマ2547対応)
      * 20100604 修正 SCS      査毅峰  (テーマ2834-1の対応)
      * 20100704 修正 SCS      兪巧芳  テーマ2818対応
      * 20110311 修正 SCS      徐志成  テーマ2693対応
      * 20110914 修正 SCS      陳新梅  テーマ3281対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    MUSJ0251.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-05-26.
       DATE-COMPILED.
      ******************************************************************
      *
      *        環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V  WITH  DEBUGGING  MODE.
       OBJECT-COMPUTER.       RP5470.
      ******************************************************************
      *
      *        デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
      *----------  共通用コンスタント
         05  CNS-USCNS.
           COPY "USCNS.cpy".
      *----------  プログラムID
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "MUSJ0251".
      *----------  運用成果残高
         05  CNS-TBL-TKUSZT01      PIC  X(08)  VALUE  "TKUSZT01".
      *----------  残高履歴
         05  CNS-TBL-TKMZZR00      PIC  X(08)  VALUE  "TKMZZR00".
      *----------  資金残履歴
         05  CNS-TBL-TKMZSR00      PIC  X(08)  VALUE  "TKMZSR00".
      *----------  元本残高
         05  CNS-TBL-TKMZGZ00      PIC  X(08)  VALUE  "TKMZGZ00".
      *----------  評価履歴
         05  CNS-TBL-TKMHHR00      PIC  X(08)  VALUE  "TKMHHR00".
      *----------  進捗管理
         05  CNS-TBL-TKDYAA40      PIC  X(08)  VALUE  "TKDYAA40".
      *----------  期間FROM
         05  CNS-KJN-FROM          PIC  X(08)  VALUE  "期間FROM".
      *----------  期間TO
         05  CNS-KJN-TO            PIC  X(06)  VALUE  "期間TO".
      *----------  期間TO
         05  CNS-SYOHIN-ZOK        PIC  X(08)  VALUE  "商品属性".
      *----------  決算扱い方法
         05  CNS-KSN-HH            PIC  X(12)  VALUE  "決算扱い方法".
      *---------- 画面ID
         05  CNS-GAMEN-ID          PIC  X(08)  VALUE  "MUSJ02  ".
      *----------  指定した期間
         05  CNS-SITEYI-KIKAN      PIC  X(12)  VALUE  "指定した期間".
      *----------  13ヶ月
         05  CNS-TUKI              PIC  X(06)  VALUE  "13ヶ月".
      *----------  期間TO未指定の場合、期間FROM
         05  CNS-SYS-DATE          PIC  X(12)  VALUE  "システム日付".
      *----------  フリーメッセージ ← "基準日："
         05  CNS-YKJ-YMD           PIC  X(08)  VALUE  "基準日：".
      *----------
         05  CNS-MAX-TKPFZK01      PIC  9(03)  VALUE  100.
         05  CNS-MAX-TKCMSZ00      PIC  9(03)  VALUE  300.
      *----------  メッセージID
         05  CNS-MSG-E000430       PIC  X(07)  VALUE  "E000430".
         05  CNS-MSG-E000259       PIC  X(07)  VALUE  "E000259".
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  オラクル接続フラグ
         05  FLG-ORA-CONNECT       PIC  9(01).
      *----------  カーソルオープンフラグ
         05  FLG-CR-OPEN           PIC  9(01).
      *----------  FETCH-END
         05  FLG-FETCH-END         PIC  9(01).
      *----------  STOP
         05  FLG-STOP              PIC  9(01).
      *----------  システムエラーフラグ
         05  FLG-SYSTEM-ERR        PIC  9(01).
      *----------  後処理業務エラーフラグ
         05  FLG-GYOMU-ERR         PIC  9(01).
      *----------  明細業務エラーフラグ
         05  FLG-MEISAI-GYOMU-ERR  PIC  9(01).
      *----------  次のフェッチレコードフラグ
         05  FLG-NEXT-FETCH-REC    PIC  9(01).
      *----------  次の基準日レコードフラグ
         05  FLG-NEXT-KJN-REC      PIC  9(01).
      *----------  次のポートフォリオ明細フラグ
         05  FLG-NEXT-PTF-MEISAI   PIC  9(01).
      *----------  実行可能区分フラグ
         05  FLG-PTF-JIKOU-KBN     PIC  9(01).
      *----------  サブ業務エラーフラグ
         05  FLG-SABU-GYOMU-ERR    PIC  9(01).
      *----------  次のワークポートフォリオ明細フラグ
         05  FLG-NEXT-MEISAI-PTF   PIC  9(01).
      ******************************************************************
      *                SQL  エリア
      ******************************************************************
       01  SQL-AREA.
         05  SQL-SELECT.
      *----------  基準日
           10  FILLER              PIC  X(35)
               VALUE  "SELECT DISTINCT(KJN_YMD) AS KJN_YMD".
      *----------  FROM テーブルTKMZZR00
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKMZZR00    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(17)
               VALUE  "RIYO_CMP_CD = :V1".
      *----------  ファンドコード
           10  FILLER              PIC  X(18)
               VALUE  " AND FUND_CD = :V2".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(17)
               VALUE  " AND PTF_CD = :V3".
      *----------  決算日断面区分
           10  FILLER              PIC  X(06)
               VALUE  " AND (".
      *----------  決算日断面区分（1）
           10  FILLER              PIC  X(38)
               VALUE  "(KSN_YMD_DMN_KBN = :V4 AND :V5 <> ' ')".
      *----------  決算日断面区分（2）
           10  FILLER              PIC  X(42)
               VALUE  " OR (KSN_YMD_DMN_KBN = :V6 AND :V7 <> ' ')".
      *----------  決算日断面区分（3）
           10  FILLER              PIC  X(43)
               VALUE  " OR (KSN_YMD_DMN_KBN = :V8 AND :V9 <> ' '))".
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  FILLER              PIC  X(20)
               VALUE  " AND KJN_YMD >= :V10".
      *---------- 基準日  ≦ ワーク期間(TO)
           10  FILLER              PIC  X(20)
               VALUE  " AND KJN_YMD <= :V11".
      *----------  UNION
           10  FILLER              PIC  X(07)
               VALUE  " UNION ".
      *----------  基準日
           10  FILLER              PIC  X(24)
               VALUE  "SELECT DISTINCT(KJN_YMD)".
      *----------  FROM テーブルTKMZSR00
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKMZSR00    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(18)
               VALUE  "RIYO_CMP_CD = :V12".
      *----------  ファンドコード
           10  FILLER              PIC  X(19)
               VALUE  " AND FUND_CD = :V13".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(18)
               VALUE  " AND PTF_CD = :V14".
      *----------  決算日断面区分
           10  FILLER              PIC  X(06)
               VALUE  " AND (".
      *----------  決算日断面区分（1）
           10  FILLER              PIC  X(40)
               VALUE  "(KSN_YMD_DMN_KBN = :V15 AND :V16 <> ' ')".
      *----------  決算日断面区分（2）
           10  FILLER              PIC  X(44)
               VALUE  " OR (KSN_YMD_DMN_KBN = :V17 AND :V18 <> ' ')".
      *----------  決算日断面区分（3）
           10  FILLER              PIC  X(45)
               VALUE  " OR (KSN_YMD_DMN_KBN = :V19 AND :V20 <> ' '))".
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  FILLER              PIC  X(20)
               VALUE  " AND KJN_YMD >= :V21".
      *---------- 基準日  ≦ ワーク期間(TO)
           10  FILLER              PIC  X(20)
               VALUE  " AND KJN_YMD <= :V22".
      *----------  UNION
           10  FILLER              PIC  X(07)
               VALUE  " UNION ".
      *----------  基準日
           10  FILLER              PIC  X(24)
               VALUE  "SELECT DISTINCT(KJN_YMD)".
      *----------  FROM テーブルTKMZGZ00
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKMZGZ00    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(18)
               VALUE  "RIYO_CMP_CD = :V23".
      *----------  ファンドコード
           10  FILLER              PIC  X(19)
               VALUE  " AND FUND_CD = :V24".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(18)
               VALUE  " AND PTF_CD = :V25".
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  FILLER              PIC  X(20)
               VALUE  " AND KJN_YMD >= :V26".
      *---------- 基準日  ≦ ワーク期間(TO)
           10  FILLER              PIC  X(20)
               VALUE  " AND KJN_YMD <= :V27".
      *----------  UNION
           10  FILLER              PIC  X(07)
               VALUE  " UNION ".
      *----------  基準日
           10  FILLER              PIC  X(24)
               VALUE  "SELECT DISTINCT(KJN_YMD)".
      *----------  FROM テーブルTKMZGZ00
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKMHHR00    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(18)
               VALUE  "RIYO_CMP_CD = :V28".
      *----------  ファンドコード
           10  FILLER              PIC  X(19)
               VALUE  " AND FUND_CD = :V29".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(18)
               VALUE  " AND PTF_CD = :V30".
      *----------  評価系列コード
           10  FILLER              PIC  X(23)
               VALUE  " AND HYK_KRTU_CD = :V31".
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  FILLER              PIC  X(20)
               VALUE  " AND KJN_YMD >= :V32".
      *---------- 基準日  ≦ ワーク期間(TO)
           10  FILLER              PIC  X(20)
               VALUE  " AND KJN_YMD <= :V33".
      *----------  UNION
           10  FILLER              PIC  X(07)
               VALUE  " UNION ".
      *----------  基準日
           10  FILLER              PIC  X(29)
               VALUE  "SELECT DISTINCT(SS_SYORI_YMD)".
      *----------  FROM テーブルTKDYAA40
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKDYAA40    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(18)
               VALUE  "RIYO_CMP_CD = :V34".
      *----------  ファンドコード
           10  FILLER              PIC  X(19)
               VALUE  " AND FUND_CD = :V35".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(18)
               VALUE  " AND PTF_CD = :V36".
      *----------  進捗タスクID
           10  FILLER              PIC  X(31)
               VALUE  " AND SHINTK_TASK_ID = 'ST00500'".
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  FILLER              PIC  X(25)
               VALUE  " AND SS_SYORI_YMD >= :V37".
      *---------- 基準日  ≦ ワーク期間(TO)
           10  FILLER              PIC  X(25)
               VALUE  " AND SS_SYORI_YMD <= :V38".
      *---------- 進捗ステータス'100'(正常終了)、または'000'（確定済）
           10  FILLER              PIC  X(47)
               VALUE  " AND (SHINTK_STS = '100' OR SHINTK_STS = '000')".
      *----------  ORDER BY
           10  FILLER              PIC  X(17)
               VALUE  " ORDER BY KJN_YMD".
         05  SQL-SLCT-TKDYAA40-TMP.
      *----------  NVL(MAX(DECODE(SUBSTR(基準日,7,2),99,最終処理基準日,基準日)), 0)
           10  FILLER              PIC  X(34)
               VALUE  "BEGIN SELECT NVL(MAX(DECODE(SUBSTR".
           10  FILLER              PIC  X(43)
               VALUE  "(KJN_YMD,7,2),99,SS_SYORI_YMD,KJN_YMD)), 0)".
           10  FILLER              PIC  X(09)
               VALUE  " INTO :V1".
      *----------  FROM テーブルTKDYAA40
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKDYAA40    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(17)
               VALUE  "RIYO_CMP_CD = :V2".
      *----------  ファンドコード
           10  FILLER              PIC  X(18)
               VALUE  " AND FUND_CD = :V3".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(17)
               VALUE  " AND PTF_CD = :V4".
      *----------  評価系列コード
           10  FILLER              PIC  X(22)
               VALUE " AND HYK_KRTU_CD = :V5".
      *----------  進捗タスクID
           10  FILLER              PIC  X(25)
               VALUE  " AND SHINTK_TASK_ID = :V6".
      *----------  進捗ステータス
           10  FILLER              PIC  X(19)
               VALUE  " AND SHINTK_STS IN ".
           10  FILLER              PIC  X(54)
               VALUE
               "('000','100','200','270','275','277','375','500');END;".
         05  SQL-SLCT-TKDYAA40-1.
      *----------  NVL(MAX(基準日), 0)
           10  FILLER              PIC  X(33)
               VALUE  "BEGIN SELECT NVL(MAX(KJN_YMD), 0)".
           10  FILLER              PIC  X(09)
               VALUE  " INTO :V1".
      *----------  FROM テーブルTKDYAA40
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKDYAA40    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(17)
               VALUE  "RIYO_CMP_CD = :V2".
      *----------  ファンドコード
           10  FILLER              PIC  X(18)
               VALUE  " AND FUND_CD = :V3".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(17)
               VALUE  " AND PTF_CD = :V4".
      *----------  評価系列コード
           10  FILLER              PIC  X(22)
               VALUE " AND HYK_KRTU_CD = :V5".
      *----------  進捗タスクID
           10  FILLER              PIC  X(25)
               VALUE  " AND SHINTK_TASK_ID = :V6".
      *----------  進捗ステータス
           10  FILLER              PIC  X(26)
               VALUE  " AND SHINTK_STS = :V7;END;".
         05  SQL-DELETE.
      *----------  DELETE
           10  FILLER              PIC  X(12)
               VALUE "DELETE FROM ".
      *----------  運用成果残高（TKUSZT01）
           10  SQL-TBL-TKUSZT01    PIC  X(13).
           10  FILLER              PIC  X(07)
               VALUE " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(22)
               VALUE  "RIYO_CMP_CD = :V1 AND ".
      *---------- ファンドコード
           10  FILLER              PIC  X(18)
               VALUE  "FUND_CD = :V2 AND ".
      *---------- ポートフォリオコード
           10  FILLER              PIC  X(17)
               VALUE  "PTF_CD = :V3 AND ".
      *---------- 残高日付  ≧ ワーク期間(FROM)
           10  FILLER              PIC  X(21)
               VALUE  "ZANTK_YMD >= :V4 AND ".
      *---------- 残高日付  ≦ ワーク期間(TO)
           10  FILLER              PIC  X(21)
               VALUE  "ZANTK_YMD <= :V5 AND ".
      *---------- 評価系列コード
           10  FILLER              PIC  X(22)
               VALUE  "HYK_KRTU_CD = :V6 AND ".
      *----------  決算日断面区分
           10  FILLER              PIC  X(02)  VALUE  " (".
      *----------  決算日断面区分（1）
           10  FILLER              PIC  X(38)
               VALUE  "(KSN_YMD_DMN_KBN = :V7 AND :V8 <> ' ')".
      *----------  決算日断面区分（2）
           10  FILLER              PIC  X(43)
               VALUE  " OR (KSN_YMD_DMN_KBN = :V9 AND :V10 <> ' ')".
      *----------  決算日断面区分（3）
           10  FILLER              PIC  X(45)
               VALUE  " OR (KSN_YMD_DMN_KBN = :V11 AND :V12 <> ' '))".
         05  SQL-DELETE-WHERE.
      *----------  証券種別コード,銘柄コード
           10  FILLER              PIC  X(33)
               VALUE  " AND (((SEC_SBT_CD , MEG_CD) IN (".
      *----------  SELECT
           10  FILLER              PIC  X(06)
               VALUE  "SELECT".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)
               VALUE  " SEC_SBT_CD,".
      *----------  銘柄コード
           10  FILLER              PIC  X(07)
               VALUE  " MEG_CD".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
      *----------  ワーク再処理要銘柄一覧テーブル（TKUSGP01）
           10  SQL-TBL-TKUSGP01    PIC  X(13).
      *----------  )
           10  FILLER              PIC  X(02)
               VALUE  "))".
      *---------- OR
           10  FILLER              PIC  X(06)
               VALUE  " OR ( ".
      *---------- SEC_SBT_CD
           10  FILLER              PIC  X(16)
               VALUE  " SEC_SBT_CD IN (".
      *----------  SELECT
           10  FILLER              PIC  X(06)
               VALUE  "SELECT".
      *---------- DISTINCT
           10  FILLER              PIC  X(10)
               VALUE  " DISTINCT ".
      *----------  証券種別コード
           10  FILLER              PIC  X(12)
               VALUE  " SEC_SBT_CD ".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
      *----------  ワーク再処理要銘柄一覧テーブル（TKUSGP01）
           10  SQL-TBL-TKUSGP01-1  PIC  X(13).
      *----------  AND
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  証券種別コード
           10  FILLER              PIC  X(15)
               VALUE  " SEC_SBT_CD IN ".
      *----------  PRI,EX
           10  FILLER              PIC  X(15)
               VALUE  " ('PRI','EX')))".
      *--------------------連結障害(0002214)対応 START------------------
      *---------- OR
           10  FILLER              PIC  X(06)
               VALUE  " OR ( ".
      *---------- 証券種別コード
           10  FILLER              PIC  X(14)
               VALUE  "SEC_SBT_CD IN ".
      *----------  SELECT
           10  FILLER              PIC  X(30)
               VALUE  "('FSMS','FBMS','CBMS','OOET') ".
      *---------- AND
           10  FILLER              PIC  X(04)
               VALUE  "AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(11)
               VALUE  "MEG_CD IN (".
      *----------  SELECT
           10  FILLER              PIC  X(07)
               VALUE  " SELECT".
      *---------- DISTINCT
           10  FILLER              PIC  X(10)
               VALUE  " DISTINCT ".
      *----------  銘柄コード
           10  FILLER              PIC  X(07)
               VALUE  "MEG_CD ".
      *----------  FROM
           10  FILLER              PIC  X(05)
               VALUE  "FROM ".
      *----------  ワーク再処理要銘柄一覧テーブル（TKUSGP01）
           10  SQL-TBL-TKUSGP01-2  PIC  X(13).
      *----------  FROM
           10  FILLER              PIC  X(04)
               VALUE  " )))".
      *--------------------連結障害(0002214)対応 END--------------------
      ******************************************************************
      *                SQL通信領域
      ******************************************************************
      *----------  SQLコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  ORACLE接続ユーザ領域
         05  H-ORA-USER            PIC  X(80).
         05  HST-TBL-SELECT.
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
         05  HST-TKDYAA40-SELECT-TMP.
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
         05  HST-TKDYAA40-WHERE-TMP.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *----------  進捗タスクID
           10  H-SHINTK-TASK-ID    PIC  X(07).
         05  HST-TKDYAA40-SELECT.
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
         05  HST-TKDYAA40-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *----------  進捗タスクID
           10  H-SHINTK-TASK-ID    PIC  X(07).
      *----------  進捗ステータス
           10  H-SHINTK-STS        PIC  X(03).
         05  HST-TKMZZR00-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  決算日断面区分1-1
           10  H-KSN-YMD-DMN-KBN   PIC  X(01).
      *----------  決算日断面区分1-2
           10  H-KSN-YMD-DMN-KBN2  PIC  X(01).
      *----------  決算日断面区分2-1
           10  H-KSN-YMD-DMN-KBN3  PIC  X(01).
      *----------  決算日断面区分2-2
           10  H-KSN-YMD-DMN-KBN4  PIC  X(01).
      *----------  決算日断面区分3-1
           10  H-KSN-YMD-DMN-KBN5  PIC  X(01).
      *----------  決算日断面区分3-2
           10  H-KSN-YMD-DMN-KBN6  PIC  X(01).
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  H-TKMZZR00-KJN1     PIC  S9(08).
      *---------- 基準日  ≦ ワーク期間(TO)
           10  H-TKMZZR00-KJN2     PIC  S9(08).
         05  HST-TKMZSR00-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  決算日断面区分1-1
           10  H-KSN-YMD-DMN-KBN   PIC  X(01).
      *----------  決算日断面区分1-2
           10  H-KSN-YMD-DMN-KBN2  PIC  X(01).
      *----------  決算日断面区分2-1
           10  H-KSN-YMD-DMN-KBN3  PIC  X(01).
      *----------  決算日断面区分2-2
           10  H-KSN-YMD-DMN-KBN4  PIC  X(01).
      *----------  決算日断面区分3-1
           10  H-KSN-YMD-DMN-KBN5  PIC  X(01).
      *----------  決算日断面区分3-2
           10  H-KSN-YMD-DMN-KBN6  PIC  X(01).
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  H-TKMZSR00-KJN1     PIC  S9(08).
      *---------- 基準日  ≦ ワーク期間(TO)
           10  H-TKMZSR00-KJN2     PIC  S9(08).
         05  HST-TKMZGZ00-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  H-TKMZGZ00-KJN1     PIC  S9(08).
      *---------- 基準日  ≦ ワーク期間(TO)
           10  H-TKMZGZ00-KJN2     PIC  S9(08).
         05  HST-TKMHHR00-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  H-TKMHHR00-KJN1     PIC  S9(08).
      *---------- 基準日  ≦ ワーク期間(TO)
           10  H-TKMHHR00-KJN2     PIC  S9(08).
         05  HST-TKDYAA402-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *---------- 基準日  ≧ ワーク期間(FROM)
           10  H-TKDYAA402-KJN1    PIC  S9(08).
      *---------- 基準日  ≦ ワーク期間(TO)
           10  H-TKDYAA402-KJN2    PIC  S9(08).
         05  HST-DELETE-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  残高日付
           10  H-ZANTK-YMD         PIC  S9(08).
      *----------  残高日付
           10  H-ZANTK-YMD1        PIC  S9(08).
      *---------- 評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *----------  決算日断面区分1-1
           10  H-KSN-YMD-DMN-KBN   PIC  X(01).
      *----------  決算日断面区分1-2
           10  H-KSN-YMD-DMN-KBN2  PIC  X(01).
      *----------  決算日断面区分2-1
           10  H-KSN-YMD-DMN-KBN3  PIC  X(01).
      *----------  決算日断面区分2-2
           10  H-KSN-YMD-DMN-KBN4  PIC  X(01).
      *----------  決算日断面区分3-1
           10  H-KSN-YMD-DMN-KBN5  PIC  X(01).
      *----------  決算日断面区分3-2
           10  H-KSN-YMD-DMN-KBN6  PIC  X(01).
      *----------  SQLSTMT-S
         05  SQLSTMT-S             PIC  X(2500).
      *----------  SQLSTMT-D
         05  SQLSTMT-D             PIC  X(2500).
           EXEC  SQL  END     DECLARE   SECTION  END-EXEC.
      ******************************************************************
      *                ワーク  エリア
      ******************************************************************
       01  WORK-AREA.
      *----------  接続引数
         05  WK-ARGUMENT.
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  処理実行日
           10  WK-SHORI-YMD        PIC  X(08).
           10  WK-SHORI-YMD-9
                                   REDEFINES  WK-SHORI-YMD
                                   PIC  9(08).
      *----------  業務タスクID
           10  WK-GYOMU-TASK-ID    PIC  X(07).
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  LOOP
         05  WK-LOOP.
           10  WK-IDX-J            PIC  9(05).
           10  WK-IDX-K            PIC  9(02).
           10  WK-IDX-L            PIC  9(05).
      *----------  SQL
         05  WK-DELETE-LENGH       PIC  9(03).
      *----------  COUNT
         05  WK-COUNT.
           10  WK-COUNT-1          PIC  9(02).
           10  WK-COUNT-3          PIC  9(04).
      *----------<残タスク117（決算扱い方法の追加）  START>-------------
           10  WK-COUNT-4          PIC  9(04).
           10  WK-COUNT-5          PIC  9(04).
      *----------<残タスク117（決算扱い方法の追加）  END>---------------
      *----------  件数
         05  WK-KENSUU.
      *----------  フェッチ件数
           10  WK-FETCH-KENSUU     PIC  9(09).
      *----------  エラーフリーメッセージ
         05  WK-SQL-ERR-MSG.
      *----------  SELECTリーメッセージ
           10  WK-SELECT-FREE-MSG  PIC  X(3000).
      *----------  DELETETリーメッセージ
           10  WK-DELETE-FREE-MSG  PIC  X(3000).
      *----------  日付
         05  WK-DATE.
      *----------  マシン日付時刻
           10  WK-MAC-DATE-TIME    PIC  X(14).
      *----------  ヒット件数-7050
         05  WK-HIT-KENSU-LAST     PIC  9(05).
      *----------  ファンド&ポートフォリオオ明細-GIPS
         05  WK-FUND-PTF-DETAIL-GP.
      *----------  ヒット件数
           10  WK-HIT-KENSU-GP     PIC  9(05).
      *----------  返却データ
           10  WK-OUTPUT-DATA-GP   OCCURS  50000.
      *----------  ファンドコード
             15  WK-FUND-CD-DETAIL-GP
                                   PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD-DETAIL-GP
                                   PIC  X(04).
      *----------  デフォルト評価系列コード
             15  WK-DEFAUL-THYK-CD-DETAIL-GP
                                   PIC  X(04).
      *----------基準日From
             15  WK-KZYN-YMD-FROM-DETAIL-GP
                                   PIC  9(08).
      *----------基準日To
             15  WK-KZYN-YMD-TO-DETAIL-GP
                                   PIC  9(08).
      *----------  ファンド&ポートフォリオオ明細
         05  WK-FUND-PTF-DETAIL.
      *----------  ヒット件数
           10  WK-HIT-KENSU        PIC  9(05).
      *----------  返却データ
           10  WK-OUTPUT-DATA      OCCURS  50000.
      *----------  ファンドコード
             15  WK-FUND-CD-DETAIL PIC  X(12).
      *----------  ファンド名（日）
             15  WK-FND-MEI-JPN-DETAIL
                                   PIC  X(60).
      *----------  ポートフォリオコード
             15  WK-PTF-CD-DETAIL  PIC  X(04).
      *----------  ポートフォリオ名（日）
             15  WK-PTF-MEI-JPN-DETAIL
                                   PIC  X(60).
      *----------  デフォルト評価系列コード
             15  WK-DEFAUL-THYK-CD-DETAIL
                                   PIC  X(04).
      *----------基準日From
             15  WK-KZYN-YMD-FROM-DETAIL
                                   PIC  9(08).
      *----------基準日To
             15  WK-KZYN-YMD-TO-DETAIL
                                   PIC  9(08).
      *----------  ワークポートフォリオ明細
         05  WK-PTF-DETAIL.
      *----------  取得件数
           10  WK-GET-KENSU        PIC  9(05).
      *----------  実行状況管理明細データ
           10  WK-PTF-GRP          OCCURS  50000.
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  評価系列コード
             15  WK-HYK-KRTU-CD    PIC  X(04).
      *----------  帳票ID
             15  WK-REP-ID         PIC  X(08).
      *----------  帳票任意コード
             15  WK-REP-ANY-CD     PIC  X(50).
      *----------  基準日From
             15  WK-KJN-YMD-FR     PIC  9(08).
      *----------  基準日To
             15  WK-KJN-YMD-TO     PIC  9(08).
      *----------  業務タスクID
             15  WK-GYOMU-TASK-ID  PIC  X(07).
      *----------  明細単位実行ステータス
             15  WK-JIKOU-STS      PIC  X(03).
      *----------  datファイル名
             15  WK-DAT-FILE-NAME  PIC  X(100).
      *----------  ワークシステムエラー情報
         05  WK-SYS-ERR-INFO.
      *---------- エラー検知プログラム名
           10  WK-ERR-PGM-ID       PIC  X(16).
      *---------- ポジション
           10  WK-ERR-POS          PIC  X(04).
      *---------- リターンコード
           10  WK-RTN-CD           PIC  X(03).
      *---------- 詳細リターンコード
           10  WK-DETAIL-RTN-CD    PIC  S9(09).
      *----------  詳細リターンコードデコードフラグ
           10  WK-DETAIL-RTN-CD-FLG
                                   PIC  X(01).
      *---------- フリーメッセージ
           10  WK-FREE-MSG         PIC  X(2000).
      *---------- ワーク業務エラー情報
         05  WK-GYOMU-ERR-INFO.
           10  WK-MESSAGE-AREA     OCCURS  999.
      *---------- ファンドコード
             15  WK-GYOMU-FUND-CD  PIC  X(12).
      *---------- ポートフォリオコード
             15  WK-GYOMU-PTF-CD   PIC  X(04).
      *---------- 評価系列コード
             15  WK-GYOMU-HYK-KRTU-CD
                                   PIC  X(04).
      *---------- 帳票ID
             15  WK-GYOMU-REP-ID   PIC  X(08).
      *---------- 帳票任意コード
             15  WK-GYOMU-REP-ANY-CD
                                   PIC  X(50).
      *---------- 基準日From
             15  WK-GYOMU-KJN-YMD-FROM
                                   PIC  X(08).
      *---------- 基準日To
             15  WK-GYOMU-KJN-YMD-TO
                                   PIC  X(08).
      *---------- メッセージID
             15  WK-GYOMU-MSG-ID   PIC  X(07).
      *---------- 置換文字
             15  WK-GYOMU-TIKAN-MOJI.
               20  WK-GYOMU-TK-MOJI
                                   OCCURS  5
                                   PIC  X(30).
      *---------- フリーメッセージ
             15  WK-GYOMU-FREE-MSG PIC  X(200).
      *----------<残タスク117（決算扱い方法の追加）  START>-------------
         05  WK-SCZY7080-INFO.
           10  WK-SCZY7080-AREA    OCCURS  999.
      *---------- ファンドコード
             15  WK-SABU-FUND-CD   PIC  X(12).
      *---------- ポートフォリオコード
             15  WK-SABU-PTF-CD    PIC  X(04).
      *---------- 評価系列コード
             15  WK-SABU-HYK-KRTU-CD
                                   PIC  X(04).
      *---------- 帳票ID
             15  WK-SABU-REP-ID    PIC  X(08).
      *---------- 帳票任意コード
             15  WK-SABU-REP-ANY-CD
                                   PIC  X(50).
      *---------- 基準日From
             15  WK-SABU-KJN-YMD-FROM
                                   PIC  X(08).
      *---------- 基準日To
             15  WK-SABU-KJN-YMD-TO
                                   PIC  X(08).
      *---------- メッセージID
             15  WK-SABU-MSG-ID    PIC  X(07).
      *---------- 置換文字
             15  WK-SABU-TIKAN-MOJI.
               20  WK-SABU-TK-MOJI
                                   OCCURS  5
                                   PIC  X(30).
      *---------- フリーメッセージ
             15  WK-SABU-FREE-MSG  PIC  X(200).
      *----------<残タスク117（決算扱い方法の追加）  END>---------------
      *----------  ワーク期間
         05  WK-KIKAN.
      *----------  期間FROM
           10  WK-KIKAN-FR         PIC  X(08).
           10  WK-KIKAN-FR-9
                                   REDEFINES  WK-KIKAN-FR
                                   PIC  9(08).
      *----------  期間TO
           10  WK-KIKAN-TO         PIC  X(08).
           10  WK-KIKAN-TO-9
                                   REDEFINES  WK-KIKAN-TO
                                   PIC  9(08).
      *----------  決算日断面区分
         05  WK-KSN-DMN.
      *----------  決算日断面区分(1)
           10  WK-KSN-YMD-DMN-KBN-1
                                   PIC  X(01).
      *----------  決算日断面区分(2)
           10  WK-KSN-YMD-DMN-KBN-2
                                   PIC  X(01).
      *----------  決算日断面区分(3)
           10  WK-KSN-YMD-DMN-KBN-3
                                   PIC  X(01).
         05  WK-TBL-NAME.
      *----------  運用成果残高
           10  WK-TBL-TKUSZT01     PIC  X(13).
      *----------  残高履歴
           10  WK-TBL-TKMZZR00     PIC  X(13).
      *----------  資金残履歴
           10  WK-TBL-TKMZSR00     PIC  X(13).
      *----------  元本残高
           10  WK-TBL-TKMZGZ00     PIC  X(13).
      *----------  進捗管理
           10  WK-TBL-TKDYAA40     PIC  X(13).
      *----------  評価履歴
           10  WK-TBL-TKMHHR00     PIC  X(13).
      *----------  リターンコード
         05  WK-RTN-CODE           PIC  9(02).
      *----------  実行ステータス
         05  WK-STATUS             PIC  9(02).
      *----------  基準日実行ステータス
         05  WK-KJN-STATUS         PIC  9(02).
      *----------  エラー種別
         05  WK-ERR-SYUBETU        PIC  X(01).
      *----------  エラーカウンター数
         05  WK-ERR-CNT            PIC  9(02).
      *---------- 基準日
         05  WK-KJN-YMD            PIC  9(08).
      *---------- 基準日
         05  WK-KJN-YMD-1          PIC  9(08).
      *----------  基準日
         05  WK-END-YMD-KJN.
           10  WK-END-YY-KJN       PIC  9(04).
           10  WK-END-MM-KJN       PIC  9(02).
           10  WK-END-DD-KJN       PIC  9(02).
         05  WK-END-YMD-KJN-9
                                   REDEFINES  WK-END-YMD-KJN
                                   PIC  9(08).
      *----------  フリーメッセージ.約定日
         05  WK-YKJ-YMD            PIC  X(08).
      *----------  ワークサブ期間
         05  WK-SUB-KIKAN.
      *----------  サブ期間FROM
           10  WK-SUB-KIKAN-FR     PIC  X(08).
           10  WK-SUB-KIKAN-FR-9
                                   REDEFINES  WK-SUB-KIKAN-FR
                                   PIC  9(08).
      *----------  サブ期間TO
           10  WK-SUB-KIKAN-TO     PIC  X(08).
           10  WK-SUB-KIKAN-TO-9
                                   REDEFINES  WK-SUB-KIKAN-TO
                                   PIC  9(08).
      *----------  ワークＧＩＰＳモード
         05  WK-GIPS-MODE          PIC  X(01).
      *----------  ワーク再処理要銘柄一覧テーブルID
         05  WK-MG-TBL-ID          PIC  X(13).
      *----------  ワーク月数
         05  WK-KJN-FR-MONTH       PIC  S9(05)V9(06).
      ******************************************************************
      *        電文情報 エリア
      ******************************************************************
       01  WK-DENBUN-AREA.
      *----------  AIFA情報
         05  WK-AIFA.
           COPY  "WOMCMAIFA.CPY".
      *----------  共通ヘッダ
         05  WK-HEADER.
           COPY  "CZCOMMONHEADER.cpy".
      *----------  上り電文情報
         05  WK-DENBUN-INFO.
           COPY  "INMUSJ0210_COBOL.cpy".
      ******************************************************************
      *        共通関数引数用パラメータ エリア
      ******************************************************************
      *----------  システム日付・マシン日付時刻ＧＥＴルーチン
       01  PARM-SCZY1010-INOUT.
           COPY  "SCZY1010.cpy".
      *----------  カレンダールーチン
       01  PARM-SCZY1020-INOUT.
           COPY  "SCZY1020.cpy".
      *----------  テーブルID取得
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  リターンパッケージセット
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
           COPY "CZRTNPACKAGE.cpy".
      *----------  進捗管理データ削除ルーチン
       01  PARM-SCZY1180-INOUT.
           COPY  "SCZY1180.cpy".
      *----------  残高進捗チェックルーチン
       01  PARM-SUSC0402-INOUT.
           COPY  "SUSC0402.cpy".
      *----------  評価進捗チェックルーチン
       01  PARM-SUSC0403-INOUT.
           COPY  "SUSC0403.cpy".
      *----------  運用成果進捗更新処理ルーチン
       01  PARM-SUSC0406-INOUT.
           COPY  "SUSC0406.cpy".
       01  PARM-SCZY4002-AIFA-HEADER.
         05  PARM-IN-AIFA.
      *----------  AIFA情報
           COPY  "WOMCMAIFA.CPY".
         05  PARM-IN-HEADER.
      *----------  共通ヘッダ
           COPY  "CZCOMMONHEADER.cpy".
      *----------  ポートフォリオと有効期間取得ルーチン
       01  PARM-SCZY4002-INOUT.
           COPY  "SCZY4002.cpy".
      *----------  バッチ開始メッセージ出力ルーチン
       01  PARM-SCZY7010-IN.
           COPY  "SCZY7010.cpy".
      *----------  バッチ終了メッセージ出力ルーチン
       01  PARM-SCZY7020-INOUT.
           COPY  "SCZY7020.cpy".
      *----------  バッチ処理件数出力ルーチン
       01  PARM-SCZY7040-IN.
           COPY  "SCZY7040.cpy".
      *----------  実行状況管理明細ＩＮＳルーチン
       01  PARM-SCZY7050-IN.
           COPY  "SCZY7050.cpy".
      *----------  実行状況管理SELルーチン
       01  PARM-SCZY7060-INOUT.
           COPY  "SCZY7060.cpy".
      *----------  ポートフォリオ別メッセージＩＮＳルーチン
       01  PARM-SCZY7080-INOUT.
           COPY  "SCZY7080.cpy".
      *----------  バッチ引数一括ＧＥＴルーチン
       01  PARM-SCZY7090-INOUT.
           COPY  "SCZY7090.cpy".
      *----------  バッチＤＢ接続情報取得
       01  PARM-SCZY7100-INOUT.
           COPY  "SCZY7100.cpy".
      *----------  処理対象ポートフォリオＧＥＴルーチン
       01  PARM-SCZY7200-INOUT.
           COPY  "SCZY7200.cpy".
      *----------  実行状況管理明細ＵＰＤルーチン
       01  PARM-SCZY7210-INOUT.
           COPY  "SCZY7210.cpy".
      *----------  残高履歴から運用成果残高データ保存ルーチン
       01  PARM-SUSC0001-INOUT.
           COPY  "SUSC0001.cpy".
      *----------  資金残履歴から運用成果残高データ保存ルーチン
       01  PARM-SUSC0002-INOUT.
           COPY  "SUSC0002.cpy".
      *----------  元本残高から運用成果残高データ保存ルーチン
       01  PARM-SUSC0003-INOUT.
           COPY  "SUSC0003.cpy".
      *----------  評価履歴から運用成果残高データ保存ルーチン
       01  PARM-SUSC0004-INOUT.
           COPY  "SUSC0004.cpy".
      *----------  運用成果残高データ保存起動単体チェックルーチン
       01  PARM-SUSJ0201-INOUT.
           COPY  "SUSJ0201.cpy".
      *----------  ポートフォリオ属性情報メモリ格納処理
       01  PARM-SCZY4313-INOUT.
           COPY  "SCZY4313.cpy".
      *----------  商品属性情報メモリ格納処理
       01  PARM-SCZY4403-INOUT.
           COPY  "SCZY4403.cpy".
       01  PARM-SUSCGP01-AIFA-HEADER.
         05  PARM-IN-AIFA-SUSCGP01.
      *----------  AIFA情報
           COPY  "WOMCMAIFA.CPY".
         05  PARM-IN-HEADER-SUSCGP01.
      *----------  共通ヘッダ
           COPY  "CZCOMMONHEADER.cpy".
      *----------  GIPSモード用ポートフォリオ・計算期間取得ルーチン
       01  PARM-SUSCGP01-INOUT.
           COPY  "SUSCGP01.cpy".
      *----------  GIPSモード用銘柄取得ルーチン
       01  PARM-SUSCGP02-INOUT.
           COPY  "SUSCGP02.cpy".
      *----------  運用成果残高データ保存O3Wチェックルーチン
      *----------  AIFA情報
       01  PARM-AIFA.
           COPY  "WOMCMAIFA.CPY".
      *----------  共通ヘッダ
       01  PARM-HEADER.
           COPY  "CZCOMMONHEADER.cpy".
      *----------  上り電文情報
       01  PARM-DENBUN-INFO.
           COPY  "INMUSJ0210_COBOL.cpy".
      *----------  O3Wチェックルーチン
       01  PARM-SUSJ0202-INOUT.
           COPY  "SUSJ0202.cpy".
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *        手 続 き 部
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
      *    処理全体
      ******************************************************************
       BASE-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  MUSJ0251  START  ***"
      *-----------------------------------------------------------------
      *----------  前処理
           PERFORM  INIT-RTN
      *----------  主処理
           PERFORM  MAIN-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE          =["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
           IF  WK-RTN-CODE NOT = CNS-RTN-BT16
           THEN
      *----------  後処理
             PERFORM  END-RTN
           ELSE
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  MUSJ0251  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1.ワークエリアの初期化
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2.開始メッセージ出力
           PERFORM  PUT-BIGN-MSG-RTN
      *----------  3.1.3.引数取得
           PERFORM  EXEC-ARG-GET-RTN
      *----------  3.1.4.ＤＢ接続情報取得
           PERFORM  GET-DB-VAR-RTN
      *---------   3.1.5.オラクル接続
           PERFORM  CONNECT-ORA-RTN
      *----------  3.1.6.システム日付取得
           PERFORM  SYS-DATE-RTN
      *----------  3.1.7.テーブルID取得
           PERFORM  TBLID-GET-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1.ワークエリアの初期化
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワークエリアの初期化  START  ***"
      *-----------------------------------------------------------------
      *----------  ワークエリアの初期化
           INITIALIZE     FLG-AREA
                          SQL-AREA
                          HST-AREA
                          WORK-AREA
                          WK-DENBUN-AREA
                          PARM-SCZY1010-INOUT
                          PARM-SCZY1020-INOUT
                          PARM-SCZY1160-INOUT
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-SCZY1180-INOUT
                          PARM-SUSC0402-INOUT
                          PARM-SUSC0403-INOUT
                          PARM-SUSC0406-INOUT
                          PARM-SCZY4002-AIFA-HEADER
                          PARM-SCZY4002-INOUT
                          PARM-SCZY7010-IN
                          PARM-SCZY7020-INOUT
                          PARM-SCZY7040-IN
                          PARM-SCZY7050-IN
                          PARM-SCZY7060-INOUT
                          PARM-SCZY7080-INOUT
                          PARM-SCZY7090-INOUT
                          PARM-SCZY7100-INOUT
                          PARM-SCZY7200-INOUT
                          PARM-SCZY7210-INOUT
                          PARM-SUSC0001-INOUT
                          PARM-SUSC0002-INOUT
                          PARM-SUSC0003-INOUT
                          PARM-SUSC0004-INOUT
                          PARM-SUSJ0201-INOUT
                          PARM-SCZY4313-INOUT
                          PARM-SCZY4403-INOUT
                          PARM-SUSCGP01-INOUT
                          PARM-SUSCGP02-INOUT
                          PARM-AIFA
                          PARM-HEADER
                          PARM-DENBUN-INFO
                          PARM-SUSJ0202-INOUT
                          PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワークエリアの初期化  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2.開始メッセージ出力処理
      ******************************************************************
       PUT-BIGN-MSG-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  開始メッセージ出力処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7010-IN
      *----------  プログラムID
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7010-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7010-ARG:"
      D    DISPLAY  CNS-PGM-ID":プログラムID           =["
      D             PGM-ID              OF  PARM-SCZY7010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7010 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7010"             USING  PARM-SCZY7010-IN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7010 END  ***"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  開始メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PUT-BIGN-MSG-EXT.
           EXIT.
      ******************************************************************
      *    3.1.3.引数取得
      ******************************************************************
       EXEC-ARG-GET-RTN       SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"*****   引数取得処理  START   *****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7090-INOUT
                       PARM-RTNPKG
      *----------  引数NO（引数の何番目）
           MOVE  CNS-5
             TO  ARG-NUM                OF  PARM-SCZY7090-ARG1
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7090-ARG:"
      D    DISPLAY  CNS-PGM-ID":引数NO=["
      D             ARG-NUM             OF  PARM-SCZY7090-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7090 START ***"
      *-----------------------------------------------------------------
           CALL   "SCZY7090"            USING  PARM-SCZY7090-INOUT
                                               PARM-RTNPKG
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7090 END ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7090)=["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
      *----------  リターンコード＝「000：正常」の場合
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ワーク利用会社コード
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-1)
               TO  WK-RIYO-CMP-CD
      *----------  ワーク処理実行日
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-2)
               TO  WK-SHORI-YMD
      *----------  ワーク業務タスクID
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-3)
               TO  WK-GYOMU-TASK-ID     OF  WK-ARGUMENT
      *----------  ワーク起動ＩＤ
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-4)
               TO  WK-KIDOU-ID
      *----------  ワークＧＩＰＳモード
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-5)
               TO  WK-GIPS-MODE
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*****   バッチ引数の取得正常   *****"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク処理実行日=["WK-SHORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク業務タスクID=["
      D             WK-GYOMU-TASK-ID    OF  WK-ARGUMENT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク起動ＩＤ=["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワークＧＩＰＳモード=["WK-GIPS-MODE"]"
      *-----------------------------------------------------------------
             IF  WK-GIPS-MODE           NOT = CNS-X-1
             THEN
      *----------  ワークＧＩＰＳモード←0：ＧＩＰＳモード以外
               MOVE  CNS-X-0            TO  WK-GIPS-MODE
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワークＧＩＰＳモード=["WK-GIPS-MODE"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":バッチ引数取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-001          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  引数取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       EXEC-ARG-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.1.4.バッチＤＢ接続情報取得
      ******************************************************************
       GET-DB-VAR-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢ接続情報取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7100-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7100-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7100-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード         =["
      D             RIYO-CMP-CD         OF  PARM-SCZY7100-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7100 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7100"             USING  PARM-SCZY7100-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7100 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7100)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  DB接続情報
             MOVE  DB-SETUZOKU-JYOUHOU  OF PARM-SCZY7100-ARG2
               TO  H-ORA-USER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢ接続情報取得 正常"
      D    DISPLAY  CNS-PGM-ID":H-ORA-USER         =["H-ORA-USER"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢ接続情報取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-002          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   ＤＢ接続情報取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-DB-VAR-EXT.
           EXIT.
      ******************************************************************
      *    3.1.5.ORACLE接続
      ******************************************************************
       CONNECT-ORA-RTN        SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   ORACLE接続  START   *****"
      *-----------------------------------------------------------------
      *----------  ORACLE接続
           EXEC SQL
             CONNECT :H-ORA-USER
           END-EXEC
           EVALUATE  SQLCODE
      *----------  SQLCODE=「0：正常終了」 の場合
             WHEN  CNS-SQL-NORMAL
      *----------  ORACLE接続フラグON(接続成功)
               MOVE  CNS-ON             TO  FLG-ORA-CONNECT
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ORACLE接続成功 :SQLCODE=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  SQLCODE≠「0：正常終了」 の場合
             WHEN  OTHER
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ORACLE接続エラー:SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16      TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID        TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-003       TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900       TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE           TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1      TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  CNS-CONNECT-ERR   TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   ORACLE接続  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CONNECT-ORA-EXT.
           EXIT.
      ******************************************************************
      *    3.1.6.システム日付取得
      ******************************************************************
       SYS-DATE-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  システム日付取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1010-INOUT
                       PARM-RTNPKG
                       WK-MAC-DATE-TIME
      *----------  OL/BT区分
           MOVE  CNS-BT
             TO  DATE-KBN               OF  PARM-SCZY1010-ARG1
      *----------  時刻形式区分
           MOVE  CNS-TIME-FORM-KBN-1
             TO  TIME-FORM-KBN          OF  PARM-SCZY1010-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1010-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1010-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード         =["
      D             RIYO-CMP-CD         OF  PARM-SCZY1010-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":OL/BT区分              =["
      D             DATE-KBN            OF  PARM-SCZY1010-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":時刻形式区分           =["
      D             TIME-FORM-KBN       OF  PARM-SCZY1010-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1010 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1010"             USING  PARM-SCZY1010-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1010 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1010)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  MAC-DATE-TIME        OF PARM-SCZY1010-ARG2
               TO  WK-MAC-DATE-TIME
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":システム日付取得 正常"
      D    DISPLAY  CNS-PGM-ID":マシン日付時刻=["WK-MAC-DATE-TIME"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":システム日付取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-004          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  システム日付取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SYS-DATE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.7.テーブルID取得
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  テーブルID(1)
           MOVE  CNS-TBL-TKUSZT01
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  テーブルID(2)
           MOVE  CNS-TBL-TKMZZR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *----------  テーブルID(3)
           MOVE  CNS-TBL-TKMZSR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *----------  テーブルID(4)
           MOVE  CNS-TBL-TKMZGZ00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *----------  テーブルID(5)
           MOVE  CNS-TBL-TKDYAA40
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
      *----------  テーブルID(6)
           MOVE  CNS-TBL-TKMHHR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(6)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1160-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード  =["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1   "]"
      D    DISPLAY  CNS-PGM-ID":テーブルID(1)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID(2)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID(3)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID(4)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID(5)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID(6)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1160 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1160 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得 正常"
      *-----------------------------------------------------------------
      *----------  ワークテーブルID1
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKUSZT01
      *----------  ワークテーブルID2
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TBL-TKMZZR00
      *----------  ワークテーブルID3
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TBL-TKMZSR00
      *----------  ワークテーブルID4
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TBL-TKMZGZ00
      *----------  ワークテーブルID5
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TBL-TKDYAA40
      *----------  ワークテーブルID6
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(6)
               TO  WK-TBL-TKMHHR00
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-005          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1160取得テーブルID:"
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKUSZT01=["WK-TBL-TKUSZT01"]"
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKMZZR00=["WK-TBL-TKMZZR00"]"
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKMZSR00=["WK-TBL-TKMZSR00"]"
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKMZGZ00=["WK-TBL-TKMZGZ00"]"
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKDYAA40=["WK-TBL-TKDYAA40"]"
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKMHHR00=["WK-TBL-TKMHHR00"]"
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2.主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.処理対象取得処理
           PERFORM  SHORI-KENRI-GET-RTN
      *----------  3.2.2.運用残高データ保存する処理
           PERFORM  DATA-SAVE-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.処理対象取得処理
      ******************************************************************
       SHORI-KENRI-GET-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  処理対象取得処理  START  ***"
      *-----------------------------------------------------------------
      *----------  1) 電文情報取得とチェック処理
           PERFORM  DENBUN-GET-CHECK-RTN
      *----------  2) ポートフォリオ明細取得処理
           PERFORM  PTF-DETAIL-GET-RTN
      *----------  3) 決算日断面区分取得処理
           PERFORM  KSN-DMN-KBN-RTN
      *----------  4）商品属性情報メモリ格納処理
           PERFORM  SCZY4403-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  処理対象取得処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SHORI-KENRI-GET-EXT.
           EXIT.
      ******************************************************************
      *    1) 電文情報取得とチェック処理
      ******************************************************************
       DENBUN-GET-CHECK-RTN   SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 電文情報取得とチェック処理START ***"
      *-----------------------------------------------------------------
      *----------  電文情報取得処理
           PERFORM  DENBUN-INFO-GET-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークＧＩＰＳモード=["WK-GIPS-MODE"]"
      *-----------------------------------------------------------------
           IF  WK-GIPS-MODE = CNS-X-1
           THEN
      *----------  ②チェック処理
             PERFORM  GPS-CHECK-RTN
           ELSE
      *----------  O3Wチェックル処理
             PERFORM  O3W-CHECK-RTN
      *----------  起動単体チェック処理
             PERFORM  DENBUN-CHECK-RTN
      *---------- ワーク期間(FROM)_補充、ワーク期間(TO)_補充を設定する
             PERFORM  SUB-KIKAN-TO-FR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 電文情報取得とチェック処理END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DENBUN-GET-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    電文情報取得処理
      ******************************************************************
       DENBUN-INFO-GET-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報取得処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7060-INOUT
                       PARM-RTNPKG
                       WK-DENBUN-AREA
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF PARM-SCZY7060-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF PARM-SCZY7060-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF PARM-SCZY7060-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7060-ARG:"
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SYORI-YMD=["
      D             SYORI-YMD           OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":KIDOU-ID=["
      D             KIDOU-ID            OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7060 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7060"             USING  PARM-SCZY7060-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7060 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7060)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  DENBUN-INFO          OF  PARM-SCZY7060-ARG3
               TO  WK-DENBUN-AREA
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":電文情報取得処理  正常"
      D    DISPLAY  CNS-PGM-ID":WK-AIFA=["WK-AIFA"]"
      D    DISPLAY  CNS-PGM-ID":WK-HEADER=["WK-HEADER"]"
      D    DISPLAY  CNS-PGM-ID":WK-DENBUN-INFO=["WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":電文情報取得処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-006          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報取得処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DENBUN-INFO-GET-EXT.
           EXIT.
      ******************************************************************
      *    ＧＩＰＳモードチェックル処理
      ******************************************************************
       GPS-CHECK-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ＧＩＰＳチェックル処理 START  ***"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク決算扱い方法=["I-KSN-ATSKI-HH
      D                                            OF  WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
      *----------単体チェックを行う
               EVALUATE  I-KSN-ATSKI-HH  OF  WK-DENBUN-INFO
                 WHEN  CNS-X-1
                 WHEN  CNS-X-2
                 WHEN  CNS-X-3
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":チェック処理 パラメータ正常"
      *-----------------------------------------------------------------
                   CONTINUE
                 WHEN  SPACE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":チェック処理 パラメータエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
                   MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                   INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- メッセージID
                   MOVE  CNS-MSG-E000133
                     TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                   MOVE  CNS-KSN-HH
                     TO  WK-GYOMU-TK-MOJI
                     OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  後処理業務エラーフラグ
                   MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
                   PERFORM  END-RTN
                 WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":チェック処理上記以外の場合エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
                   MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                   INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- メッセージID
                   MOVE  CNS-MSG-E000130
                     TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                   MOVE  CNS-KSN-HH
                     TO  WK-GYOMU-TK-MOJI
                     OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  後処理業務エラーフラグ
                   MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
                   PERFORM  END-RTN
               END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＧＩＰＳチェックル処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GPS-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    O3Wチェックル処理
      ******************************************************************
       O3W-CHECK-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  O3Wチェックル処理 START  ***"
      *-----------------------------------------------------------------
            INITIALIZE  PARM-AIFA
                        PARM-HEADER
                        PARM-DENBUN-INFO
                        PARM-SUSJ0202-INOUT
            MOVE  WK-AIFA               TO  PARM-AIFA
            MOVE  WK-HEADER             TO  PARM-HEADER
            MOVE  WK-DENBUN-INFO        TO  PARM-DENBUN-INFO
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSJ0202-ARG:"
      D    DISPLAY  CNS-PGM-ID":PARM-AIFA=["PARM-AIFA"]"
      D    DISPLAY  CNS-PGM-ID":PARM-HEADER=["PARM-HEADER"]"
      D    DISPLAY  CNS-PGM-ID":PARM-DENBUN-INFO=["PARM-DENBUN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSJ0202 START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSJ0202"             USING  PARM-AIFA
                                               PARM-HEADER
                                               PARM-DENBUN-INFO
                                               PARM-SUSJ0202-INOUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSJ0202 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSJ0202)       =["
      D             RTN-CD OF SUSJ0202-ARG1-OUT"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF SUSJ0202-ARG1-OUT
             WHEN  CNS-RTN-SPP0
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":O3Wチェックル処理  正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":O3Wチェックル処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT10         TO   WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
             INITIALIZE  WK-GYOMU-ERR-INFO
             MOVE  SUSJ0202-BT-OUT      TO  WK-GYOMU-ERR-INFO
      *----------  後処理業務エラーフラグ
             MOVE  CNS-ON               TO  FLG-GYOMU-ERR
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GYOMU-ERR-INFO=["WK-GYOMU-ERR-INFO"]"
      D    DISPLAY  CNS-PGM-ID":FLG-GYOMU-ERR=["FLG-GYOMU-ERR"]"
      *-----------------------------------------------------------------
      *----------  後処理
             PERFORM  END-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  O3Wチェックル処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       O3W-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    起動単体チェック処理
      ******************************************************************
       DENBUN-CHECK-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  起動単体チェック処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSJ0201-INOUT
                        PARM-RTNPKG
      *----------  接続用パラメータ設定
           MOVE  CNS-KIDOU-KBN-B
             TO  KIDOU-KBN              OF  PARM-SUSJ0201-ARG1
           MOVE  WK-DENBUN-INFO         TO  PARM-SUSJ0201-ARG2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSJ0201-ARG:"
      D    DISPLAY  CNS-PGM-ID":PARM-SUSJ0201-ARG1=["
      D             PARM-SUSJ0201-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SUSJ0201-ARG2=["
      D             PARM-SUSJ0201-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSJ0201 START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSJ0201"             USING  PARM-SUSJ0201-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSJ0201 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSJ0201)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":起動単体チェック処理  正常"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":起動単体チェック処理 パラメータエラー"
      *-----------------------------------------------------------------
               INITIALIZE  WK-GYOMU-ERR-INFO
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT10       TO  WK-RTN-CODE
      *----------  ワーク業務エラーを編集
               MOVE  PARM-SUSJ0201-ARG6 TO  WK-GYOMU-ERR-INFO
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-GYOMU-ERR
      *----------  後処理
               PERFORM  END-RTN
             WHEN  OTHER
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16       TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               MOVE  PARM-RTNPKG        TO  PARM-SCZY1170-RTNPKG
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-007        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":起動単体チェック処理  エラー"
      *-----------------------------------------------------------------
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報チェック処理 END  ***"
      *-----------------------------------------------------------------
            CONTINUE.
       DENBUN-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    2) 明細取得処理
      ******************************************************************
       PTF-DETAIL-GET-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 明細取得処理 START ***"
      D    DISPLAY  CNS-PGM-ID":ワークＧＩＰＳモード=["WK-GIPS-MODE"]"
      *-----------------------------------------------------------------
           IF  WK-GIPS-MODE             = CNS-X-1
           THEN
      *----------  SUSCGP01で取得したポートフォリオ明細
             PERFORM  SUSCGP01-RTN
           ELSE
      *----------  SCZY4002ポートフォリオ明細取得処理
             PERFORM  SCZY4002-RTN
           END-IF
      *----------  実行状況管理明細インサート処理
           PERFORM  SCZY7050-RTN
      *----------  ＤＢコミット処理
           PERFORM  DB-COMMIT3-RTN
      *----------  ポートフォリオ明細取得処理
           PERFORM  SCZY7200-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 明細取得処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-DETAIL-GET-EXT.
           EXIT.
      ******************************************************************
      *    SUSCGP01で取得したポートフォリオ明細処理
      ******************************************************************
       SUSCGP01-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SUSCGP01ポートフォリオ明細取得処理"
      D             " START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSCGP01-INOUT
                       PARM-RTNPKG
                       PARM-SUSCGP01-AIFA-HEADER
      *----------  LINK
           MOVE  WK-AIFA
             TO  PARM-IN-AIFA-SUSCGP01  OF  PARM-SUSCGP01-AIFA-HEADER
           MOVE  WK-HEADER
             TO  PARM-IN-HEADER-SUSCGP01 OF  PARM-SUSCGP01-AIFA-HEADER
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSCGP01-ARG1
      *----------  業務タスクＩＤ
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOUMU-TASK-ID         OF  PARM-SUSCGP01-ARG1
      *----------  メニューＩＤ
           MOVE  MENU-ID                OF  WK-DENBUN-INFO
             TO  MENU-ID                OF  PARM-SUSCGP01-ARG1
      *----------  画面アクション区分
           MOVE  CNS-X-9
             TO  GAMEN-ACT-KBN          OF  PARM-SUSCGP01-ARG1
      *----------  評価系列FLG
           MOVE  CNS-X-1
             TO  HYK-KRTU-FLG           OF  PARM-SUSCGP01-ARG1
      *----------  ＧＸ接続対象種別
           MOVE  SPACE
             TO  GX-TAISYO-KBN          OF  PARM-SUSCGP01-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSCGP01-ARG:"
      D    DISPLAY  CNS-PGM-ID":ＡＩＦＡ共通ヘッダ=["
      D             PARM-SUSCGP01-AIFA-HEADER "]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSCGP01-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクＩＤ=["
      D             GYOUMU-TASK-ID      OF  PARM-SUSCGP01-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":メニューＩＤ=["
      D             MENU-ID             OF  PARM-SUSCGP01-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":画面アクション区分=["
      D             GAMEN-ACT-KBN       OF  PARM-SUSCGP01-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列FLG=["
      D             HYK-KRTU-FLG        OF  PARM-SUSCGP01-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ＧＸ接続対象種別=["
      D             GX-TAISYO-KBN       OF  PARM-SUSCGP01-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSCGP01 START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSCGP01"             USING  PARM-SUSCGP01-AIFA-HEADER
                                               PARM-SUSCGP01-INOUT
                                               PARM-RTNPKG
      *    机上デバッグについて、RETURN-CODEの事前設定--START--
      *    MOVE  CNS-RTN-002
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    MOVE  CNS-RTN-800
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    MOVE  CNS-RTN-901
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    机上デバッグについて、RETURN-CODEの事前設定--END--
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSCGP01 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSCGP01)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               MOVE  PARM-SUSCGP01-ARG2 TO  WK-FUND-PTF-DETAIL-GP
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード取得処理  正常"
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSU-GP=["WK-HIT-KENSU-GP"]"
      *-----------------------------------------------------------------
               IF  WK-HIT-KENSU-GP = ZERO
               THEN
      *----------  ワークリターンコード
                 MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 IF  I-KJN-YMD-FR OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- 基準日To
                 IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- メッセージID
                 MOVE  CNS-MSG-E000217
                   TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  CNS-FUND-PTF
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  後処理業務エラーフラグ
                 MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
                 PERFORM  END-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-RTN-002
               MOVE  PARM-SUSCGP01-ARG2 TO  WK-FUND-PTF-DETAIL-GP
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT2        TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               IF  I-KJN-YMD-FR  OF  WK-DENBUN-INFO NOT = SPACE
               THEN
                 MOVE  I-KJN-YMD-FR     OF  WK-DENBUN-INFO
                   TO  WK-GYOMU-KJN-YMD-FROM
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               ELSE
                 MOVE  WK-SHORI-YMD
                   TO  WK-GYOMU-KJN-YMD-FROM
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               END-IF
      *---------- 基準日To
               IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
               THEN
                 MOVE  I-KJN-YMD-TO     OF  WK-DENBUN-INFO
                   TO  WK-GYOMU-KJN-YMD-TO
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               ELSE
                 MOVE  WK-SHORI-YMD
                   TO  WK-GYOMU-KJN-YMD-TO
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               END-IF
      *---------- メッセージID
               MOVE  CNS-MSG-W000309
                 TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  3.3.1.業務エラー2処理
               PERFORM  GYOMU-ERR-2-RTN
      *----------  権限なしの場合
             WHEN  CNS-RTN-130
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード権限なし"
      D    DISPLAY  CNS-PGM-ID":HIT-KENSU  OF  PARM-SUSCGP01-ARG2=["
      D             HIT-COUNT  OF  PARM-SUSCGP01-ARG2"]"
      *-----------------------------------------------------------------
               IF  HIT-COUNT  OF  PARM-SUSCGP01-ARG2 = ZERO
               THEN
      *----------  ワークリターンコード
                 MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 IF  I-KJN-YMD-FR OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- 基準日To
                 IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- メッセージID
                 MOVE  CNS-MSG-E000217
                   TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  CNS-FUND-PTF
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *---------- 基準日From
                 IF  I-KJN-YMD-FR OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
                 END-IF
      *---------- 基準日To
                 IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
                 END-IF
      *---------- メッセージID
                 MOVE  CNS-MSG-E000534
                   TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-2)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-2,CNS-1)
      *----------  後処理業務エラーフラグ
                 MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
                 PERFORM  END-RTN
               ELSE
                 MOVE  PARM-SUSCGP01-ARG2 TO  WK-FUND-PTF-DETAIL-GP
      *----------  ワークリターンコード
                 MOVE  CNS-RTN-BT4        TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 IF  I-KJN-YMD-FR  OF  WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- 基準日To
                 IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- メッセージID
                 MOVE  CNS-MSG-E000534
                   TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  3.3.1.業務エラー2処理
                 PERFORM  GYOMU-ERR-2-RTN
               END-IF
             WHEN  CNS-RTN-800
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               IF  I-KJN-YMD-FR OF WK-DENBUN-INFO NOT = SPACE
               THEN
                 MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                   TO  WK-GYOMU-KJN-YMD-FROM
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               ELSE
                 MOVE  WK-SHORI-YMD
                   TO  WK-GYOMU-KJN-YMD-FROM
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               END-IF
      *---------- 基準日To
               IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
               THEN
                 MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                   TO  WK-GYOMU-KJN-YMD-TO
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               ELSE
                 MOVE  WK-SHORI-YMD
                   TO  WK-GYOMU-KJN-YMD-TO
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               END-IF
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
               PERFORM  END-RTN
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード取得処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16       TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-042        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SUSCGP01ポートフォリオ明細取得処理"
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSCGP01-EXT.
           EXIT.
      ******************************************************************
      *    SCZY4002ポートフォリオ明細取得処理
      ******************************************************************
       SCZY4002-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY4002ポートフォリオ明細取得処理"
      D             " START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4002-INOUT
                       PARM-RTNPKG
                       PARM-SCZY4002-AIFA-HEADER
      *----------  LINK
           MOVE  WK-AIFA
             TO  PARM-IN-AIFA           OF  PARM-SCZY4002-AIFA-HEADER
           MOVE  WK-HEADER
             TO  PARM-IN-HEADER         OF  PARM-SCZY4002-AIFA-HEADER
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-COMPANY-CODE      OF  PARM-SCZY4002-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上り電文.ポートフォリオ区分=["
      D             I-PTF-SYORI-KBN     OF  WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
      *----------  オール指定1
           EVALUATE  I-PTF-SYORI-KBN    OF  WK-DENBUN-INFO
             WHEN  CNS-X-1
               MOVE  CNS-X-2
               TO  ALL-SITEI-1          OF  PARM-SCZY4002-ARG1
             WHEN  CNS-X-2
               MOVE  CNS-X-1
               TO  ALL-SITEI-1          OF  PARM-SCZY4002-ARG1
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
           IF  I-PTF-SYORI-KBN  OF  WK-DENBUN-INFO   =  CNS-X-1
           THEN
             INITIALIZE  WK-COUNT-1
             PERFORM  VARYING  WK-IDX-K  FROM  CNS-1  BY  CNS-1
               UNTIL  WK-IDX-K > 10
               COMPUTE  WK-COUNT-1 = WK-COUNT-1 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-K=["WK-IDX-K"]"
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-1=["WK-COUNT-1"]"
      *-----------------------------------------------------------------
      *----------  ポートフォリオ区分
               MOVE  I-FUND-PTF-KBN OF  WK-DENBUN-INFO(WK-IDX-K)
                 TO  PTF-KBN        OF  PARM-SCZY4002-ARG1(WK-COUNT-1)
      *----------  グループ又はファンドコード
               MOVE  I-FUND-CD      OF  WK-DENBUN-INFO(WK-IDX-K)
                 TO  GRP-FUND-CD    OF  PARM-SCZY4002-ARG1(WK-COUNT-1)
      *----------  ポートフォリオコード
               MOVE  I-PTF-CD       OF  WK-DENBUN-INFO(WK-IDX-K)
                 TO  PTF-CD         OF  PARM-SCZY4002-ARG1(WK-COUNT-1)
             END-PERFORM
           ELSE
      *----------  ポートフォリオ選択リスト
             INITIALIZE  PTF-FUND-LIST  OF  PARM-SCZY4002-ARG1
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上り電文.評価系列区分=["
      D             I-HYK-KRTU-KBN      OF  WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
      *----------  オール指定2
           EVALUATE  I-HYK-KRTU-KBN     OF  WK-DENBUN-INFO
             WHEN  CNS-X-1
               MOVE  CNS-X-3
                 TO  ALL-SITEI-2        OF  PARM-SCZY4002-ARG1
             WHEN  CNS-X-2
               MOVE  CNS-X-2
                 TO  ALL-SITEI-2        OF  PARM-SCZY4002-ARG1
             WHEN  CNS-X-3
               MOVE  CNS-X-1
                 TO  ALL-SITEI-2        OF  PARM-SCZY4002-ARG1
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *----------  評価系列
           IF  I-HYK-KRTU-KBN           OF  WK-DENBUN-INFO = CNS-X-1
           THEN
             PERFORM                  VARYING  WK-IDX-K
               FROM  CNS-1  BY  CNS-1
               UNTIL  WK-IDX-K > 10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-K=["WK-IDX-K"]"
      *-----------------------------------------------------------------
                 MOVE  I-HYK-KRTU-CD    OF  WK-DENBUN-INFO(WK-IDX-K)
                   TO  HYK-KRTU-CD      OF  PARM-SCZY4002-ARG1(WK-IDX-K)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":HYK-KRTU-CD("WK-IDX-K")=["
      D             HYK-KRTU-CD      OF  PARM-SCZY4002-ARG1(WK-IDX-K)"]"
      *-----------------------------------------------------------------
             END-PERFORM
           ELSE
             INITIALIZE  HYK-KRTU       OF  PARM-SCZY4002-ARG1
           END-IF
      *----------  基準日FROM
           MOVE  WK-SUB-KIKAN-FR
             TO  KZYN-YMD-FROM          OF  PARM-SCZY4002-ARG1
      *---------- 基準日TO
           MOVE  WK-SUB-KIKAN-TO
             TO  KZYN-YMD-TO            OF  PARM-SCZY4002-ARG1
      *---------- 権限チェック有無
           MOVE  CNS-X-1
             TO  KGN-CHK-UMU            OF  PARM-SCZY4002-ARG1
      *---------- メニューID
           MOVE  MENU-ID                OF  WK-DENBUN-INFO
             TO  MENU-ID                OF  PARM-SCZY4002-ARG1
      *---------- 画面アクション区分
           MOVE  CNS-X-9
             TO  GAMEN-ACT-KBN          OF  PARM-SCZY4002-ARG1
      *---------- 業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY4002-ARG1
      *---------- 日中夜間区分
           MOVE  CNS-X-0
             TO  NCHU-YAKN-KBN          OF  PARM-SCZY4002-ARG1
      *---------- APL指定出力件数
           MOVE  ZERO
             TO  APL-OUT-CNT            OF  PARM-SCZY4002-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4002-ARG:"
      D    DISPLAY  CNS-PGM-ID":ＡＩＦＡ共通ヘッダ=["
      D             PARM-SCZY4002-AIFA-HEADER "]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-COMPANY-CODE   OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":オール指定1=["
      D             ALL-SITEI-1         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ選択リスト=["
      D             PTF-FUND-LIST       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":オール指定2=["
      D             ALL-SITEI-2         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列=["
      D             HYK-KRTU            OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KZYN-YMD-FROM       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日TO=["
      D             KZYN-YMD-TO         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":権限チェック有無=["
      D             KGN-CHK-UMU         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":メニューID=["
      D             MENU-ID             OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":画面アクション区分=["
      D             GAMEN-ACT-KBN       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":日中夜間区分=["
      D             NCHU-YAKN-KBN       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":APL指定出力件数=["
      D             APL-OUT-CNT         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4002 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4002"             USING  PARM-SCZY4002-AIFA-HEADER
                                               PARM-SCZY4002-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4002 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4002)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               MOVE  PARM-SCZY4002-ARG2 TO  WK-FUND-PTF-DETAIL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード取得処理  正常"
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSU=["WK-HIT-KENSU"]"
      *-----------------------------------------------------------------
               IF  WK-HIT-KENSU = ZERO
               THEN
      *----------  ワークリターンコード
                 MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 IF  I-KJN-YMD-FR OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- 基準日To
                 IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- メッセージID
                 MOVE  CNS-MSG-E000217
                   TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  CNS-FUND-PTF
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  後処理業務エラーフラグ
                 MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
                 PERFORM  END-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-RTN-002
               MOVE  PARM-SCZY4002-ARG2 TO  WK-FUND-PTF-DETAIL
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT2        TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               IF  I-KJN-YMD-FR  OF  WK-DENBUN-INFO NOT = SPACE
               THEN
                 MOVE  I-KJN-YMD-FR     OF  WK-DENBUN-INFO
                   TO  WK-GYOMU-KJN-YMD-FROM
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               ELSE
                 MOVE  WK-SHORI-YMD
                   TO  WK-GYOMU-KJN-YMD-FROM
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               END-IF
      *---------- 基準日To
               IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
               THEN
                 MOVE  I-KJN-YMD-TO     OF  WK-DENBUN-INFO
                   TO  WK-GYOMU-KJN-YMD-TO
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               ELSE
                 MOVE  WK-SHORI-YMD
                   TO  WK-GYOMU-KJN-YMD-TO
                   OF  WK-GYOMU-ERR-INFO(CNS-1)
               END-IF
      *---------- メッセージID
               MOVE  CNS-MSG-W000309
                 TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  3.3.1.業務エラー2処理
               PERFORM  GYOMU-ERR-2-RTN
      *------------------ <20090108          START>---------------------
      *----------  権限なしの場合
             WHEN  CNS-RTN-130
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード権限なし"
      D    DISPLAY  CNS-PGM-ID":HIT-KENSU  OF  PARM-SCZY4002-ARG2=["
      D             HIT-KENSU  OF  PARM-SCZY4002-ARG2"]"
      *-----------------------------------------------------------------
               IF  HIT-KENSU  OF  PARM-SCZY4002-ARG2 = ZERO
               THEN
      *----------  ワークリターンコード
                 MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 IF  I-KJN-YMD-FR OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- 基準日To
                 IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- メッセージID
                 MOVE  CNS-MSG-E000217
                   TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  CNS-FUND-PTF
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *---------- 基準日From
                 IF  I-KJN-YMD-FR OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
                 END-IF
      *---------- 基準日To
                 IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
                 END-IF
      *---------- メッセージID
                 MOVE  CNS-MSG-E000534
                   TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-2)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-2,CNS-1)
      *----------  後処理業務エラーフラグ
                 MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
                 PERFORM  END-RTN
               ELSE
                 MOVE  PARM-SCZY4002-ARG2 TO  WK-FUND-PTF-DETAIL
      *----------  ワークリターンコード
                 MOVE  CNS-RTN-BT4        TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 IF  I-KJN-YMD-FR  OF  WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-FR   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- 基準日To
                 IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
                 THEN
                   MOVE  I-KJN-YMD-TO   OF  WK-DENBUN-INFO
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
                 END-IF
      *---------- メッセージID
                 MOVE  CNS-MSG-E000534
                   TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  3.3.1.業務エラー2処理
                 PERFORM  GYOMU-ERR-2-RTN
               END-IF
      *------------------ <20090108          END>-----------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード取得処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16       TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-008        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY4002ポートフォリオ明細取得処理"
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4002-EXT.
           EXIT.
      ******************************************************************
      *    実行状況管理明細インサート処理
      ******************************************************************
       SCZY7050-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 実行状況管理明細インサート処理"
      D             " START ***"
      D    DISPLAY  CNS-PGM-ID":ワークＧＩＰＳモード=["WK-GIPS-MODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSU-LAST=["WK-HIT-KENSU"]"
      *-----------------------------------------------------------------
      *◇ワークＧＩＰＳモード='1'の場合（ＧＩＰＳモード起動）
           IF  WK-GIPS-MODE  =  CNS-X-1
           THEN
             MOVE  WK-HIT-KENSU-GP      TO  WK-HIT-KENSU-LAST
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSU-GP=["WK-HIT-KENSU-GP"]"
      *-----------------------------------------------------------------
      *◇上記以外の場合（非ＧＩＰＳモード起動）
           ELSE
             MOVE  WK-HIT-KENSU         TO  WK-HIT-KENSU-LAST
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSU=["WK-HIT-KENSU"]"
      *-----------------------------------------------------------------
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSU-LAST=["
      D             WK-HIT-KENSU-LAST"]"
      *-----------------------------------------------------------------
           PERFORM                  VARYING  WK-IDX-L
             FROM  CNS-1 BY CNS-1 UNTIL WK-IDX-L > WK-HIT-KENSU-LAST
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-L=["WK-IDX-L"]"
      *-----------------------------------------------------------------
             INITIALIZE  PARM-SCZY7050-IN
                         PARM-RTNPKG
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD
               TO  RIYO-CMP-CD            OF PARM-SCZY7050-ARG1
      *----------  処理実行日
             MOVE  WK-SHORI-YMD-9
               TO  SYORI-YMD              OF PARM-SCZY7050-ARG1
      *----------  起動ID
             MOVE  WK-KIDOU-ID
               TO  KIDOU-ID               OF PARM-SCZY7050-ARG1
      *----------  業務タスクID
             MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
               TO  GYOMU-TASK-ID          OF  PARM-SCZY7050-ARG1
      *◇ワークＧＩＰＳモード='1'の場合（ＧＩＰＳモード起動）
             IF  WK-GIPS-MODE  =  CNS-X-1
             THEN
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL-GP(WK-IDX-L)
                 TO  FUND-CD                OF  PARM-SCZY7050-ARG1
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL-GP(WK-IDX-L)
                 TO  PTF-CD                 OF  PARM-SCZY7050-ARG1
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD-DETAIL-GP(WK-IDX-L)
                 TO  HYK-KRTU-CD            OF  PARM-SCZY7050-ARG1
      *---------- 基準日From
               MOVE  WK-KZYN-YMD-FROM-DETAIL-GP(WK-IDX-L)
                 TO  KJN-YMD-FROM         OF  PARM-SCZY7050-ARG1
      *---------- 基準日To
               MOVE  WK-KZYN-YMD-TO-DETAIL-GP(WK-IDX-L)
                 TO  KJN-YMD-TO           OF  PARM-SCZY7050-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-OUTPUT-DATA-GP("WK-IDX-L")=["
      D             WK-OUTPUT-DATA-GP(WK-IDX-L)"]"
      *-----------------------------------------------------------------
      *◇上記以外の場合（非ＧＩＰＳモード起動）
             ELSE
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL(WK-IDX-L)
                 TO  FUND-CD                OF  PARM-SCZY7050-ARG1
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL(WK-IDX-L)
                 TO  PTF-CD                 OF  PARM-SCZY7050-ARG1
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD-DETAIL(WK-IDX-L)
                 TO  HYK-KRTU-CD            OF  PARM-SCZY7050-ARG1
      *---------- 基準日From
               MOVE  WK-KZYN-YMD-FROM-DETAIL(WK-IDX-L)
                 TO  KJN-YMD-FROM         OF  PARM-SCZY7050-ARG1
      *---------- 基準日To
               MOVE  WK-KZYN-YMD-TO-DETAIL(WK-IDX-L)
                 TO  KJN-YMD-TO           OF  PARM-SCZY7050-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-OUTPUT-DATA("WK-IDX-L")=["
      D             WK-OUTPUT-DATA(WK-IDX-L)"]"
      *-----------------------------------------------------------------
             END-IF
      *---------- 帳票ID
             MOVE  SPACE
               TO  REP-ID                 OF  PARM-SCZY7050-ARG1
      *---------- 帳票任意コード
             MOVE  SPACE
               TO  REP-ANY-CD             OF  PARM-SCZY7050-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7050-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD           OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD             OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID              OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID         OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD               OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD                OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD           OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID                OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD            OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日From=["
      D             KJN-YMD-FROM          OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日To=["
      D             KJN-YMD-TO            OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7050 START  ***"
      *-----------------------------------------------------------------
             CALL  "SCZY7050"           USING  PARM-SCZY7050-IN
                                               PARM-RTNPKG
      *    机上デバッグについて、RETURN-CODEの事前設定--START--
      *    MOVE  CNS-RTN-901
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    机上デバッグについて、RETURN-CODEの事前設定--END--
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7050 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7050)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER               OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
             IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
              =  CNS-RTN-000
             THEN
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況管理明細インサート処理  正常"
      *-----------------------------------------------------------------
             ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況管理明細インサート処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-009          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                              (COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
             END-IF
           END-PERFORM
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 実行状況管理明細インサート処理"
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7050-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミット処理
      ******************************************************************
       DB-COMMIT3-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミット処理  START  ***"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-010          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-COMMIT-ERR       TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT3-EXT.
           EXIT.
      ******************************************************************
      *    ポートフォリオ明細取得処理
      ******************************************************************
       SCZY7200-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ポートフォリオ明細取得処理START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7200-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7200-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7200-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7200-ARG1
      *----------  帳票ID
           MOVE  SPACE
             TO  REP-ID                 OF  PARM-SCZY7200-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7200  START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY7200"            USING  PARM-SCZY7200-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7200   END   ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7200)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER            OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                    ":***  ポートフォリオ明細取得処理 正常  ***"
      *-----------------------------------------------------------------
             MOVE  PARM-SCZY7200-ARG2   TO  WK-PTF-DETAIL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク取得件数=["WK-GET-KENSU"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                    ":***  ポートフォリオ明細取得処理 異常  ***"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-011          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ポートフォリオ明細取得処理END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7200-EXT.
           EXIT.
      ******************************************************************
      *    3) 決算日断面区分取得処理
      ******************************************************************
       KSN-DMN-KBN-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 決算日断面区分取得処理 START ***"
      D    DISPLAY  CNS-PGM-ID":I-KSN-ATSKI-HH OF WK-DENBUN-INFO=["
      D             I-KSN-ATSKI-HH        OF  WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
           EVALUATE  I-KSN-ATSKI-HH       OF  WK-DENBUN-INFO
             WHEN  CNS-X-1
             WHEN  CNS-X-2
               MOVE  I-KSN-ATSKI-HH       OF  WK-DENBUN-INFO
                 TO  WK-KSN-YMD-DMN-KBN-1
               MOVE  CNS-X-0              TO  WK-KSN-YMD-DMN-KBN-2
             WHEN  CNS-X-3
               MOVE  CNS-X-1              TO  WK-KSN-YMD-DMN-KBN-1
               MOVE  CNS-X-2              TO  WK-KSN-YMD-DMN-KBN-2
               MOVE  CNS-X-0              TO  WK-KSN-YMD-DMN-KBN-3
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-KSN-YMD-DMN-KBN-1=["
      D             WK-KSN-YMD-DMN-KBN-1"]"
      D    DISPLAY  CNS-PGM-ID":WK-KSN-YMD-DMN-KBN-2=["
      D             WK-KSN-YMD-DMN-KBN-2"]"
      D    DISPLAY  CNS-PGM-ID":WK-KSN-YMD-DMN-KBN-3=["
      D             WK-KSN-YMD-DMN-KBN-3"]"
      D    DISPLAY  CNS-PGM-ID":*** 決算日断面区分取得処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KSN-DMN-KBN-EXT.
           EXIT.
      ******************************************************************
      *    4）商品属性情報メモリ格納処理
      ******************************************************************
       SCZY4403-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY4403商品属性情報メモリ格納処理"
      D             " START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4403-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4403-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4403-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4403-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4403 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4403"             USING  PARM-SCZY4403-INOUT
                                               PARM-RTNPKG
      *    机上デバッグについて、RETURN-CODEの事前設定--START--
      *    MOVE  CNS-RTN-002
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    MOVE  CNS-RTN-901
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    机上デバッグについて、RETURN-CODEの事前設定--END--
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4403 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4403)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":商品属性情報メモリ格納処理  正常"
      D    DISPLAY  CNS-PGM-ID":商品属性データエリア=["
      D                         PARM-SCZY4403-ARG2"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT10       TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- メッセージID
               MOVE  CNS-MSG-E000217
                 TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  CNS-SYOHIN-ZOK
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
               PERFORM  END-RTN
      *----------  抽出件数超過警告
             WHEN  CNS-RTN-002
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- メッセージID
               MOVE  CNS-MSG-E000445
                 TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字1
               MOVE  CNS-SYOHIN-ZOK
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *---------- 置換文字2
               MOVE  CNS-MAX-TKCMSZ00
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-2)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
               PERFORM  END-RTN
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード取得処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16       TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-043        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY4403商品属性情報メモリ格納処理"
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4403-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.運用残高データ保存する処理
      ******************************************************************
       DATA-SAVE-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 運用残高データ保存する処理START ***"
      D    DISPLAY  CNS-PGM-ID":WK-GET-KENSU=["WK-GET-KENSU"]"
      *-----------------------------------------------------------------
           PERFORM                  VARYING  WK-IDX-J
             FROM  CNS-1 BY CNS-1 UNTIL WK-IDX-J > WK-GET-KENSU
                                     OR WK-RTN-CODE = CNS-16
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-J=["WK-IDX-J"]"
      D    DISPLAY  CNS-PGM-ID":WK-PTF-GRP("WK-IDX-J")=["
      D             WK-PTF-GRP(WK-IDX-J)"]"
      *-----------------------------------------------------------------
      *----------  1) 実行状況更新処理1
             PERFORM  STATUS-KOUSIN-1-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":次のワークポートフォリオ明細フラグ=["
      D             FLG-NEXT-MEISAI-PTF"]"
      *-----------------------------------------------------------------
             IF  FLG-NEXT-MEISAI-PTF = CNS-OFF
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
               IF  WK-STATUS < CNS-6
               THEN
      *----------  2) ポートフォリオ属性情報メモリ格納処理
                 PERFORM  SCZY4313-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** ポートフォリオ属性情報"
      D                       "メモリ格納処理しない****"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
               IF  WK-STATUS < CNS-6
               THEN
      *----------  2) 期間TOと期間FROM設定処理
                 PERFORM  KIKAN-TO-FR-GET-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 期間TOと期間FROM設定処理しない****"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
               IF  WK-STATUS < CNS-6
               THEN
      *----------  3) 締めﾁｪｯｸ
                 PERFORM  SINU-CHECK-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 締めﾁｪｯｸしない ****"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-PTF-MEISAI  =["
      D                         FLG-NEXT-PTF-MEISAI "]"
      *-----------------------------------------------------------------
               IF (  FLG-NEXT-PTF-MEISAI = CNS-OFF
                 AND WK-STATUS < CNS-6 )
               THEN
      *----------  4) 運用成果残高データ削除処理
                 PERFORM  DATA-DELETE-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 運用成果残高データ削除処理"
      D                       "しない  ****"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-PTF-MEISAI  =["
      D                         FLG-NEXT-PTF-MEISAI "]"
      *-----------------------------------------------------------------
               IF ( FLG-NEXT-PTF-MEISAI = CNS-OFF
                AND WK-STATUS < CNS-6 )
               THEN
      *----------  5) SQL発行処理
                 PERFORM  SQL-HAKKO-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** SQL発行処理しない ****"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-MEISAI-GYOMU-ERR = ["
      D                         FLG-MEISAI-GYOMU-ERR "]"
      *-----------------------------------------------------------------
               IF  FLG-MEISAI-GYOMU-ERR = CNS-ON
               THEN
      *----------  6) 業務エラー1処理
                 PERFORM  GYOMU-ERR-1-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 業務エラー1処理しない ****"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
      *----------  7) 実行状況更新処理2
               PERFORM  STATUS-KOUSIN-2-RTN
      *----------  ＤＢコミット処理
               PERFORM  DB-COMMIT-RTN
             ELSE
               CONTINUE
             END-IF
      *----------  初期化
             INITIALIZE  WK-STATUS
                         WK-COUNT-3
                         WK-KJN-STATUS
                         WK-KIKAN-FR
                         WK-KIKAN-TO
                         WK-GYOMU-ERR-INFO
                         FLG-CR-OPEN
                         FLG-FETCH-END
                         FLG-NEXT-KJN-REC
                         FLG-PTF-JIKOU-KBN
                         FLG-NEXT-FETCH-REC
                         FLG-NEXT-PTF-MEISAI
                         FLG-MEISAI-GYOMU-ERR
                         FLG-NEXT-MEISAI-PTF
           END-PERFORM
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-J=["WK-IDX-J"]"
      D    DISPLAY  CNS-PGM-ID":*** 運用残高データ保存する処理END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-SAVE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.1) 実行状況更新処理1
      ******************************************************************
       STATUS-KOUSIN-1-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況更新処理1 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7210-INOUT
                       PARM-RTNPKG
                       FLG-NEXT-MEISAI-PTF
      *----------  セッション区分
           MOVE  CNS-X-0
             TO  SESSION-KBN            OF  PARM-SCZY7210-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7210-ARG2
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SCZY7210-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7210-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SCZY7210-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SCZY7210-ARG2
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SCZY7210-ARG2
      *----------  帳票ID
           MOVE  WK-REP-ID              OF  WK-PTF-GRP(WK-IDX-J)
             TO  REP-ID                 OF  PARM-SCZY7210-ARG2
      *----------  帳票任意コード
           MOVE  WK-REP-ANY-CD          OF  WK-PTF-GRP(WK-IDX-J)
             TO  REP-ANY-CD             OF  PARM-SCZY7210-ARG2
      *----------  基準日FROM
           MOVE  WK-KJN-YMD-FR          OF  WK-PTF-GRP(WK-IDX-J)
             TO  KJN-YMD-FROM           OF  PARM-SCZY7210-ARG2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得・基準日FROM=["
      D             WK-KJN-YMD-FR       OF  WK-PTF-GRP(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SCZY7210-ARG2"]"
      *-----------------------------------------------------------------
      *----------  実行ステータス
           MOVE  SPACE
             TO  JIKOU-STS              OF  PARM-SCZY7210-ARG2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7210-ARG:"
      D    DISPLAY  CNS-PGM-ID":SESSION-KBN   =["
      D             SESSION-KBN         OF  PARM-SCZY7210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD   =["
      D             RIYO-CMP-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":SYORI-YMD     =["
      D             SYORI-YMD           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":KIDOU-ID      =["
      D             KIDOU-ID            OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":FUND-CD       =["
      D             FUND-CD             OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PTF-CD        =["
      D             PTF-CD              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":HYK-KRTU-CD   =["
      D             HYK-KRTU-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":REP-ID        =["
      D             REP-ID              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":REP-ANY-CD    =["
      D             REP-ANY-CD          OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":KJN-YMD-FROM  =["
      D             KJN-YMD-FROM        OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":JIKOU-STS     =["
      D             JIKOU-STS           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7210 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7210"             USING  PARM-SCZY7210-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7210 END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG)       =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7210)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況更新処理1  正常"
      *-----------------------------------------------------------------
      *----------  ＤＢコミット処理
             PERFORM  DB-COMMIT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行可能区分   =["
      D             CONTINUE-KBN        OF  PARM-SCZY7210-ARG3"]"
      *-----------------------------------------------------------------
             IF  CONTINUE-KBN   OF  PARM-SCZY7210-ARG3 = CNS-X-0
             THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行可能区分=正常の場合"
      *-----------------------------------------------------------------
               CONTINUE
             ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行可能区分=ポートフォリオ処理中の場合"
      *-----------------------------------------------------------------
               IF  CONTINUE-KBN   OF  PARM-SCZY7210-ARG3 = CNS-X-3
               THEN
      *----------  次のワークポートフォリオ明細フラグ
                 MOVE  CNS-ON           TO  FLG-NEXT-MEISAI-PTF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":次のポートフォリオ明細データの処理へ"
      *-----------------------------------------------------------------
               ELSE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
                 IF  CONTINUE-KBN  OF  PARM-SCZY7210-ARG3 = CNS-X-1
                 THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行可能区分=一時停止の場合"
      *-----------------------------------------------------------------
      *---------- メッセージID
                   MOVE  CNS-MSG-E000451
                     TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                   MOVE  SPACE
                     TO  WK-GYOMU-TK-MOJI OF  WK-GYOMU-ERR-INFO(CNS-1,1)
      *----------  ワーク実行ステータス
                   MOVE  CNS-10           TO  WK-STATUS
                 ELSE
                   CONTINUE
                 END-IF
                 IF  CONTINUE-KBN  OF  PARM-SCZY7210-ARG3 = CNS-X-2
                 THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行可能区分=強制停止の場合"
      *-----------------------------------------------------------------
      *---------- メッセージID
                   MOVE  CNS-MSG-E000431
                     TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                   MOVE  SPACE
                     TO  WK-GYOMU-TK-MOJI OF  WK-GYOMU-ERR-INFO(CNS-1,1)
      *----------  ワーク実行ステータス
                   MOVE  CNS-10           TO  WK-STATUS
                 ELSE
                   CONTINUE
                 END-IF
                 IF  WK-RTN-CODE < WK-STATUS
                 THEN
      *----------  ワークリターンコード
                   MOVE  WK-STATUS        TO  WK-RTN-CODE
                 ELSE
                   CONTINUE
                 END-IF
      *---------- ファンドコード
                 MOVE  WK-FUND-CD         OF  WK-PTF-GRP(WK-IDX-J)
                   TO  WK-GYOMU-FUND-CD   OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- ポートフォリオコード
                 MOVE  WK-PTF-CD          OF  WK-PTF-GRP(WK-IDX-J)
                   TO  WK-GYOMU-PTF-CD    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 評価系列コード
                 MOVE  WK-HYK-KRTU-CD     OF  WK-PTF-GRP(WK-IDX-J)
                   TO  WK-GYOMU-HYK-KRTU-CD
                                          OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 帳票ID
                 MOVE  WK-REP-ID          OF  WK-PTF-GRP(WK-IDX-J)
                   TO  WK-GYOMU-REP-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 帳票任意コード
                 MOVE  WK-REP-ANY-CD      OF  WK-PTF-GRP(WK-IDX-J)
                   TO  WK-GYOMU-REP-ANY-CD
                                          OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日From
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得・基準日FROM=["
      D             WK-KJN-YMD-FR  OF  WK-PTF-GRP(WK-IDX-J)"]"
      *-----------------------------------------------------------------
                 IF  WK-KJN-YMD-FR  OF  WK-PTF-GRP(WK-IDX-J) NOT = ZERO
                 THEN
                   MOVE  WK-KJN-YMD-FR    OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-KJN-YMD-FROM
                                          OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                                          OF  WK-GYOMU-ERR-INFO(CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日=["WK-SHORI-YMD"]"
      *-----------------------------------------------------------------
                 END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク業務エラーパッケージ.基準日From=["
      D             WK-GYOMU-KJN-YMD-FROM OF WK-GYOMU-ERR-INFO(CNS-1)"]"
      *-----------------------------------------------------------------
      *---------- 基準日To
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得・基準日TO=["
      D             WK-KJN-YMD-TO       OF  WK-PTF-GRP(WK-IDX-J)"]"
      *-----------------------------------------------------------------
                 IF  WK-KJN-YMD-TO  OF  WK-PTF-GRP(WK-IDX-J) NOT = ZERO
                 THEN
                   MOVE  WK-KJN-YMD-TO    OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-KJN-YMD-TO
                                          OF  WK-GYOMU-ERR-INFO(CNS-1)
                 ELSE
                   MOVE  WK-SHORI-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                                          OF  WK-GYOMU-ERR-INFO(CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日=["WK-SHORI-YMD"]"
      *-----------------------------------------------------------------
                 END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク業務エラーパッケージ.基準日To=["
      D             WK-GYOMU-KJN-YMD-TO  OF  WK-GYOMU-ERR-INFO(CNS-1)"]"
      *-----------------------------------------------------------------
      *---------- フリーメッセージ
                 MOVE  SPACE
                   TO  WK-GYOMU-FREE-MSG  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 業務エラー1処理
                 PERFORM  GYOMU-ERR-1-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE          =["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
                 IF  WK-RTN-CODE NOT = CNS-RTN-BT16
                 THEN
      *----------  後処理
                   PERFORM  END-RTN
                 ELSE
      *----------  エラー処理
                   PERFORM  ERR-RTN
                 END-IF
               END-IF
             END-IF
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況更新処理1 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-012          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況更新処理1 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       STATUS-KOUSIN-1-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミット処理
      ******************************************************************
       DB-COMMIT-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミット処理  START  ***"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-013          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-COMMIT-ERR       TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT-EXT.
           EXIT.
      ******************************************************************
      *    エラー1情報追加処理
      ******************************************************************
       ERR-INFO-ADD-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー1情報追加処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-ON                 TO  FLG-SYSTEM-ERR
      *---------- エラーリターンパッケージ
           INITIALIZE  PARM-SCZY1170-IN
           MOVE  WK-SYS-ERR-INFO        TO  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-ARG1              =["
      D             PARM-SCZY1170-ARG1                        "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"           USING  PARM-SCZY1170-IN
                                             PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  エラー1情報追加処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-INFO-ADD-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.2)ポートフォリオ属性情報メモリ格納処理
      ******************************************************************
       SCZY4313-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY4313ポートフォリオ属性情報"
      D             "メモリ格納処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4313-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4313-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SCZY4313-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SCZY4313-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200取得・ファンドコード= ["
      D             WK-FUND-CD          OF  WK-PTF-GRP(WK-IDX-J) "]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200取得・ポートフォリオコード=["
      D             WK-PTF-CD           OF  WK-PTF-GRP(WK-IDX-J) "]"
      D    DISPLAY  CNS-PGM-ID":SCZY4313-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4313-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY4313-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY4313-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4313 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4313"             USING  PARM-SCZY4313-INOUT
                                               PARM-RTNPKG
      *    机上デバッグについて、RETURN-CODEの事前設定--START--
      *    MOVE  CNS-RTN-002
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    MOVE  CNS-RTN-901
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    机上デバッグについて、RETURN-CODEの事前設定--END--
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4313 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4313)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
             WHEN  CNS-RTN-110
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性情報メモリ格納処理"
      D                       "  正常"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性データエリア=["
      D                         PARM-SCZY4313-ARG2"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-002
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT10     TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- メッセージID
               MOVE  CNS-MSG-E000445
                 TO  WK-GYOMU-MSG-ID  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字1
               MOVE  CNS-PTF-CD
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *---------- 置換文字2
               MOVE  CNS-MAX-TKPFZK01
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-2)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
               PERFORM  END-RTN
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード取得処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16       TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-044        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SCZY4313ポートフォリオ属性情報"
      D             "メモリ格納処理 END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4313-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.3) 期間TOと期間FROM設定処理
      ******************************************************************
       KIKAN-TO-FR-GET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 期間TOと期間FROM設定処理  START ***"
      *-----------------------------------------------------------------
           MOVE  WK-KJN-YMD-FR             OF  WK-PTF-GRP(WK-IDX-J)
             TO  WK-KIKAN-FR               OF  WK-KIKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得・基準日FROM= ["
      D             WK-KJN-YMD-FR          OF  WK-PTF-GRP(WK-IDX-J) "]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間(FROM)= ["
      D             WK-KIKAN-FR            OF  WK-KIKAN "]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得・基準日TO= ["
      D             WK-KJN-YMD-TO          OF  WK-PTF-GRP(WK-IDX-J) "]"
      *-----------------------------------------------------------------
      *----------  電文情報.基準日TO
           IF  WK-KJN-YMD-TO    OF  WK-PTF-GRP(WK-IDX-J) NOT = ZERO
           THEN
             MOVE  WK-KJN-YMD-TO           OF  WK-PTF-GRP(WK-IDX-J)
               TO  WK-KIKAN-TO
           ELSE
             MOVE  WK-SHORI-YMD            TO  WK-KIKAN-TO
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間(TO)   = [" WK-KIKAN-TO "]"
      *-----------------------------------------------------------------
      *----------  期間(FROM) > 期間(TO)の場合
           IF  WK-KIKAN-FR-9 > WK-KIKAN-TO-9
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
             IF  WK-STATUS < CNS-6
             THEN
      *----------  ワーク実行ステータス
               MOVE  CNS-6                 TO  WK-STATUS
             ELSE
               CONTINUE
             END-IF
      *----------  ワークリターンコード
             IF  WK-RTN-CODE < WK-STATUS
             THEN
               MOVE  WK-STATUS             TO  WK-RTN-CODE
             ELSE
               CONTINUE
             END-IF
             COMPUTE  WK-COUNT-3 = WK-COUNT-3 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-3=["WK-COUNT-3"]"
      *-----------------------------------------------------------------
      *----------  明細業務エラーフラグ
             MOVE  CNS-ON                  TO  FLG-MEISAI-GYOMU-ERR
      *----------  ワーク業務エラーパッケージを編集
      *---------- ファンドコード
             MOVE  WK-FUND-CD              OF  WK-PTF-GRP(WK-IDX-J)
               TO  WK-GYOMU-FUND-CD
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- ポートフォリオコード
             MOVE  WK-PTF-CD               OF  WK-PTF-GRP(WK-IDX-J)
               TO  WK-GYOMU-PTF-CD
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 評価系列コード
             MOVE  WK-HYK-KRTU-CD          OF  WK-PTF-GRP(WK-IDX-J)
               TO  WK-GYOMU-HYK-KRTU-CD
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票ID
             MOVE  WK-REP-ID               OF  WK-PTF-GRP(WK-IDX-J)
               TO  WK-GYOMU-REP-ID
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票任意コード
             MOVE  WK-REP-ANY-CD           OF  WK-PTF-GRP(WK-IDX-J)
               TO  WK-GYOMU-REP-ANY-CD
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日From
             MOVE  WK-KIKAN-FR
               TO  WK-GYOMU-KJN-YMD-FROM
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日To
             MOVE  WK-KIKAN-TO
               TO  WK-GYOMU-KJN-YMD-TO
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- メッセージID
             MOVE  CNS-MSG-E000257
               TO  WK-GYOMU-MSG-ID
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 置換文字
             MOVE  CNS-KJN-TO
               TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-1)
             MOVE  CNS-KJN-FROM
               TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-2)
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  WK-GYOMU-FREE-MSG
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークＧＩＰＳモード=["WK-GIPS-MODE"]"
      *-----------------------------------------------------------------
      *-----------  ワーク期間(TO)の再セット
           IF  WK-GIPS-MODE  =  CNS-X-1
           THEN
             PERFORM  KIKAN-TO-RESET-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  期間TOと期間FROM設定処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KIKAN-TO-FR-GET-EXT.
           EXIT.
      ******************************************************************
      *    月末日の日付取得処理
      ******************************************************************
       END-DATE-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 月末日の日付取得処理 START ***"
      *-----------------------------------------------------------------
             INITIALIZE  PARM-SCZY1020-INOUT
                         PARM-RTNPKG
      *----------  機能区分
           MOVE  CNS-X-5
             TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *---------- 基準年月日1
           MOVE  WK-KJN-YMD-1
             TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-ARG1
      *---------- 計算ベース区分
           MOVE  CNS-X-1
             TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *---------- 前後区分1
           MOVE  CNS-X-2
             TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *---------- 単位区分
           MOVE  CNS-X-2
             TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":機能区分      =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日1   =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":計算ベース区分=["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":前後区分1     =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":単位区分      =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1020"             USING  PARM-SCZY1020-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)            =["
      D             RTN-CD   OF PARM-RTNPKG( COUNTER OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  IXCAL-KJN-YMD-2      OF  PARM-SCZY1020-ARG1
               TO  H-KJN-YMD            OF  HST-TKDYAA40-SELECT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"月末日の日付取得処理 正常"
      D    DISPLAY  CNS-PGM-ID":取得した日付の月末日=["
      D             IXCAL-KJN-YMD-2      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":取得した日付=["
      D             H-KJN-YMD            OF  HST-TKDYAA40-SELECT"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"月末日の日付取得処理 異常"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-014          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 月末日の日付取得処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-DATE-EXT.
           EXIT.
      ******************************************************************
      *    翌日.日付取得処理
      ******************************************************************
       DATE-GET-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 翌日.日付取得処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1020-INOUT
                       PARM-RTNPKG
      *---------- 機能区分
           MOVE  CNS-X-3
             TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *---------- 基準年月日1
           MOVE  H-KJN-YMD              OF  HST-TKDYAA40-SELECT
             TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-ARG1
      *---------- 計算ベース区分
           MOVE  CNS-X-1
             TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *---------- 前後区分1
           MOVE  CNS-X-1
             TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *---------- 前後区分2
           MOVE  CNS-X-0
             TO  IXCAL-ZENGO-KBN-2      OF  PARM-SCZY1020-ARG1
      *---------- 単位区分
           MOVE  CNS-X-1
             TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *---------- 日数
           MOVE  CNS-1
             TO  IXCAL-DAYS             OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 日付取得処理 START ***"
      D    DISPLAY  CNS-PGM-ID":機能区分      =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日1   =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":計算ベース区分=["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":前後区分1     =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":前後区分2     =["
      D             IXCAL-ZENGO-KBN-2   OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":単位区分      =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":日数          =["
      D             IXCAL-DAYS          OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1020"             USING  PARM-SCZY1020-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)            =["
      D             RTN-CD   OF PARM-RTNPKG( COUNTER OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  IXCAL-KJN-YMD-2      OF  PARM-SCZY1020-ARG1
               TO  WK-KIKAN-FR-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":翌日.日付取得 正常"
      D    DISPLAY  CNS-PGM-ID":WK-KIKAN-FR-9=["WK-KIKAN-FR-9"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":翌日.日付取得 異常"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-015          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 翌日.日付取得処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATE-GET-EXT.
           EXIT.
      ******************************************************************
      *    ③ワーク期間(TO)の再セット
      ******************************************************************
       KIKAN-TO-RESET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク期間(TO)の再セット  START ***"
      *-----------------------------------------------------------------
      *----------  進捗管理最大正常終了日を取得
           PERFORM  SELECT-END-DATE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワーク期間(TO)の再セット  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KIKAN-TO-RESET-EXT.
           EXIT.
      ******************************************************************
      *    進捗管理最大正常終了日を取得
      ******************************************************************
       SELECT-END-DATE-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理最大正常終了日を取得"
      D             " START  ***"
      *-----------------------------------------------------------------
      *----------  SQL作成(PREPARE-TMP)
           PERFORM  SELECT-PRE-TMP-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-6
           THEN
      *----------  SELECT-SQL作成(EXECUTE-TMP)
             PERFORM  SELECT-EXEC-TMP-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 進捗管理最大正常終了日を取得"
      D             "処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理最大正常終了日を取得"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-END-DATE-EXT.
           EXIT.
      ******************************************************************
      *    SQL作成（PREPARE-TMP）
      ******************************************************************
       SELECT-PRE-TMP-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***SELECT SQL作成(PREPARE-TMP) START***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT-S
                       HST-TKDYAA40-WHERE-TMP
                       HST-TKDYAA40-SELECT-TMP
                       WK-SELECT-FREE-MSG
      *----------  テーブルTKDYAA40
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TBL-TKDYAA40       OF  SQL-SLCT-TKDYAA40-TMP
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-TKDYAA40-WHERE-TMP
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-TKDYAA40-WHERE-TMP
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-TKDYAA40-WHERE-TMP
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-HYK-KRTU-CD          OF  HST-TKDYAA40-WHERE-TMP
      *----------  進捗タスクID:"運用成果残高"
           MOVE  CNS-ST00800
             TO  H-SHINTK-TASK-ID       OF  HST-TKDYAA40-WHERE-TMP
           STRING  SQL-SLCT-TKDYAA40-TMP
                   DELIMITED BY SIZE
                   INTO SQLSTMT-S
           END-STRING
           STRING SQLSTMT-S(1:FUNCTION  LENGTH(SQL-SLCT-TKDYAA40-TMP))
                "[:V1="
                 H-KJN-YMD              OF  HST-TKDYAA40-SELECT-TMP
                "][:V2="
                 H-RIYO-CMP-CD          OF  HST-TKDYAA40-WHERE-TMP
                "][:V3="
                 H-FUND-CD              OF  HST-TKDYAA40-WHERE-TMP
                "][:V4="
                 H-PTF-CD               OF  HST-TKDYAA40-WHERE-TMP
                "][:V5="
                 H-HYK-KRTU-CD          OF  HST-TKDYAA40-WHERE-TMP
                "][:V6="
                 H-SHINTK-TASK-ID       OF  HST-TKDYAA40-WHERE-TMP
                "]"
                DELIMITED BY SIZE
                INTO  WK-SELECT-FREE-MSG
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-S         =["SQLSTMT-S"]"
      D    DISPLAY  CNS-PGM-ID":WK-SELECT-FREE-MSG =["
      D             WK-SELECT-FREE-MSG"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  SETRECORD  FROM  :SQLSTMT-S
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE-TMP)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-047        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SELECT SQL作成(PREPARE-TMP)  END***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-PRE-TMP-EXT.
           EXIT.
      ******************************************************************
      *    SELECT-SQL作成(EXECUTE-TMP)
      ******************************************************************
       SELECT-EXEC-TMP-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***SELECT-SQL作成(EXECUTE-TMP) START***"
      *-----------------------------------------------------------------
           EXEC SQL EXECUTE SETRECORD
           USING  :HST-TKDYAA40-SELECT-TMP.H-KJN-YMD,
                  :HST-TKDYAA40-WHERE-TMP.H-RIYO-CMP-CD,
                  :HST-TKDYAA40-WHERE-TMP.H-FUND-CD,
                  :HST-TKDYAA40-WHERE-TMP.H-PTF-CD,
                  :HST-TKDYAA40-WHERE-TMP.H-HYK-KRTU-CD,
                  :HST-TKDYAA40-WHERE-TMP.H-SHINTK-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(EXECUTE-TMP)= [" SQLCODE "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク期間TO=["WK-KIKAN-TO-9"]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間FROM=["WK-KIKAN-FR-9"]"
      D    DISPLAY  CNS-PGM-ID":取得した日付 =["
      D                         H-KJN-YMD OF HST-TKDYAA40-SELECT-TMP "]"
      *-----------------------------------------------------------------
               IF  H-KJN-YMD OF HST-TKDYAA40-SELECT-TMP NOT = ZERO
               THEN
                 MOVE  H-KJN-YMD OF HST-TKDYAA40-SELECT-TMP
                   TO  WK-END-YMD-KJN-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得した日付の下2桁=["WK-END-DD-KJN"]"
      *-----------------------------------------------------------------
                 IF  WK-END-DD-KJN = CNS-99
                 THEN
                   MOVE  WK-END-YMD-KJN-9   TO  WK-KJN-YMD-1
      *----------  月末日の日付取得処理
                   PERFORM  END-DATE-RTN
                 ELSE
                   CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":月末日の日付取得処理しない"
      *-----------------------------------------------------------------
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
                 IF  WK-STATUS < CNS-6
                 THEN
      *----------  日付の判断処理
                   PERFORM  DATE-CHECK-1-RTN
                 ELSE
                   CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":日付の判断処理しない"
      *-----------------------------------------------------------------
                 END-IF
               ELSE
                 CONTINUE
               END-IF
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *--------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-048        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SELECT-SQL作成(EXECUTE-TMP)  END***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-EXEC-TMP-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.4) 締めﾁｪｯｸ
      ******************************************************************
       SINU-CHECK-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 締めﾁｪｯｸ  START ***"
      *-----------------------------------------------------------------
      *----------  運用成果残高の日付を取得
           PERFORM  SELECT-KIJUN-2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  締めﾁｪｯｸ  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SINU-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    運用成果残高の日付を取得
      ******************************************************************
       SELECT-KIJUN-2-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  運用成果残高の日付を取得"
      D             " START  ***"
      *-----------------------------------------------------------------
      *----------  SQL作成(PREPARE2)
           PERFORM  SELECT-PREPARE2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-6
           THEN
      *----------  SELECT-SQL作成(EXECUTE2)
             PERFORM  SELECT-EXECUTE2-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** SEL-KJN-2(EXECUTE2)処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  運用成果残高の日付を取得"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-KIJUN-2-EXT.
           EXIT.
      ******************************************************************
      *    SQL作成（PREPARE2）
      ******************************************************************
       SELECT-PREPARE2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SELECT SQL作成(PREPARE2) START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT-S
                       HST-TKDYAA40-WHERE
                       HST-TKDYAA40-SELECT
                       WK-SELECT-FREE-MSG
      *----------  テーブルTKDYAA40
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TBL-TKDYAA40       OF  SQL-SLCT-TKDYAA40-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-TKDYAA40-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-TKDYAA40-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-TKDYAA40-WHERE
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-HYK-KRTU-CD          OF  HST-TKDYAA40-WHERE
      *----------  進捗タスクID:"運用成果残高"
           MOVE  CNS-ST00800
             TO  H-SHINTK-TASK-ID       OF  HST-TKDYAA40-WHERE
      *----------  進捗ステータス "確定済"
           MOVE  CNS-SHINTK-STS-000
             TO  H-SHINTK-STS           OF  HST-TKDYAA40-WHERE
           STRING  SQL-SLCT-TKDYAA40-1
                   DELIMITED BY SIZE
                   INTO SQLSTMT-S
           END-STRING
           STRING SQLSTMT-S(1:FUNCTION  LENGTH(SQL-SLCT-TKDYAA40-1))
                "[:V1="
                 H-KJN-YMD              OF  HST-TKDYAA40-SELECT
                "][:V2="
                 H-RIYO-CMP-CD          OF  HST-TKDYAA40-WHERE
                "][:V3="
                 H-FUND-CD              OF  HST-TKDYAA40-WHERE
                "][:V4="
                 H-PTF-CD               OF  HST-TKDYAA40-WHERE
                "][:V5="
                 H-HYK-KRTU-CD          OF  HST-TKDYAA40-WHERE
                "][:V6="
                 H-SHINTK-TASK-ID       OF  HST-TKDYAA40-WHERE
                "][:V7="
                 H-SHINTK-STS           OF  HST-TKDYAA40-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-SELECT-FREE-MSG
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-S         =["SQLSTMT-S"]"
      D    DISPLAY  CNS-PGM-ID":WK-SELECT-FREE-MSG =["
      D             WK-SELECT-FREE-MSG"]"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス=["
      D             H-SHINTK-STS        OF  HST-TKDYAA40-WHERE"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  SIMERECORD  FROM  :SQLSTMT-S
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE2)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-016        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SELECT SQL作成(PREPARE2)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-PREPARE2-EXT.
           EXIT.
      ******************************************************************
      *    SELECT-SQL作成(EXECUTE2)
      ******************************************************************
       SELECT-EXECUTE2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SELECT-SQL作成(EXECUTE2) START  ***"
      *-----------------------------------------------------------------
           EXEC SQL EXECUTE SIMERECORD
           USING  :HST-TKDYAA40-SELECT.H-KJN-YMD,
                  :HST-TKDYAA40-WHERE.H-RIYO-CMP-CD,
                  :HST-TKDYAA40-WHERE.H-FUND-CD,
                  :HST-TKDYAA40-WHERE.H-PTF-CD,
                  :HST-TKDYAA40-WHERE.H-HYK-KRTU-CD,
                  :HST-TKDYAA40-WHERE.H-SHINTK-TASK-ID,
                  :HST-TKDYAA40-WHERE.H-SHINTK-STS
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(EXECUTE2)= [" SQLCODE "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク期間TO=["WK-KIKAN-TO-9"]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間FROM=["WK-KIKAN-FR-9"]"
      D    DISPLAY  CNS-PGM-ID":取得した日付 =["
      D                         H-KJN-YMD OF HST-TKDYAA40-SELECT "]"
      *-----------------------------------------------------------------
               IF  H-KJN-YMD OF HST-TKDYAA40-SELECT NOT = ZERO
               THEN
                 MOVE  H-KJN-YMD OF HST-TKDYAA40-SELECT
                   TO  WK-END-YMD-KJN-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得した日付の下2桁=["WK-END-DD-KJN"]"
      *-----------------------------------------------------------------
                 IF  WK-END-DD-KJN = CNS-99
                 THEN
                   MOVE  WK-END-YMD-KJN-9   TO  WK-KJN-YMD-1
      *----------  月末日の日付取得処理
                   PERFORM  END-DATE-RTN
                 ELSE
                   CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":月末日の日付取得処理しない"
      *-----------------------------------------------------------------
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
                 IF  WK-STATUS < CNS-6
                 THEN
      *----------  日付の判断処理
                   PERFORM  DATE-CHECK-RTN
                 ELSE
                   CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":日付の判断処理しない"
      *-----------------------------------------------------------------
                 END-IF
               ELSE
                 CONTINUE
               END-IF
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *--------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-017        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SELECT-SQL作成(EXECUTE2)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-EXECUTE2-EXT.
           EXIT.
      ******************************************************************
      *    日付の判断1処理
      ******************************************************************
       DATE-CHECK-1-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  日付の判断1処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得した日付 = ["
      D                        H-KJN-YMD OF HST-TKDYAA40-SELECT-TMP  "]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間TO= [" WK-KIKAN-TO-9 "]"
      *-----------------------------------------------------------------
           IF  H-KJN-YMD                OF  HST-TKDYAA40-SELECT-TMP
               > WK-KIKAN-TO-9
           THEN
             CONTINUE
           ELSE
      *----------  ワーク期間TO←取得した日付
             MOVE  H-KJN-YMD            OF  HST-TKDYAA40-SELECT-TMP
               TO  WK-KIKAN-TO-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク期間TO= [" WK-KIKAN-TO-9 "]"
      *-----------------------------------------------------------------
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  日付の判断1処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATE-CHECK-1-EXT.
           EXIT.
      ******************************************************************
      *    日付の判断処理
      ******************************************************************
       DATE-CHECK-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  日付の判断処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD OF HST-TKDYAA40-SELECT = ["
      D                         H-KJN-YMD OF HST-TKDYAA40-SELECT  "]"
      D    DISPLAY  CNS-PGM-ID":WK-KIKAN-FR-9= [" WK-KIKAN-FR-9 "]"
      D    DISPLAY  CNS-PGM-ID":WK-KIKAN-TO-9= [" WK-KIKAN-TO-9 "]"
      *-----------------------------------------------------------------
           IF  H-KJN-YMD OF HST-TKDYAA40-SELECT
               NOT < WK-KIKAN-TO-9
           THEN
      *----------  次のポートフォリオ明細フラグ
             MOVE  CNS-ON           TO  FLG-NEXT-PTF-MEISAI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":次のポートフォリオ明細フラグ = ["
      D                         FLG-NEXT-PTF-MEISAI           "]"
      *-----------------------------------------------------------------
           ELSE
             IF ( H-KJN-YMD OF HST-TKDYAA40-SELECT
                NOT < WK-KIKAN-FR-9
              AND H-KJN-YMD OF HST-TKDYAA40-SELECT
                < WK-KIKAN-TO-9 )
             THEN
      *----------  翌日の日付取得処理
               PERFORM  DATE-GET-RTN
             ELSE
               CONTINUE
             END-IF
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  日付の判断処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATE-CHECK-EXT.
           EXIT.
      ******************************************************************
      *   3.2.2.5) 運用成果残高データ削除処理
      ******************************************************************
       DATA-DELETE-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  運用成果残高データ削除処理"
      D                       "  START  ***"
      *-----------------------------------------------------------------
           IF  WK-GIPS-MODE              =  CNS-X-1
           THEN
      *----------  【SUSCGP02】GIPSモード用銘柄取得ルーチン
             PERFORM  SUSCGP02-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  【SCZY1180】進捗管理データ削除
           PERFORM  SCZY1180-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-6
           THEN
      *----------  DELETE-SQL作成(PREPARE1)
             PERFORM  DELETE-PREPARE-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 運用成果取引テーブルかデータを削除"
      D                       "しない  ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
      *----------  DELETE-SQL作成(EXECUTE)
           IF  WK-STATUS < CNS-6
           THEN
      *----------  DELETE-SQL作成(EXECUTE)
             PERFORM  DELETE-EXECUTE-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":****  DELETE-SQL作成(EXECUTE)処理しない"
      D             " ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  運用成果残高データ削除処理"
      D                       "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-DELETE-EXT.
           EXIT.
      ******************************************************************
      *    ワーク銘柄テーブル作成処理
      ******************************************************************
       SUSCGP02-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SUSCGP02 GIPSモード用銘柄取得"
      D             "ルーチン START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSCGP02-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSCGP02-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSCGP02-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSCGP02-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSCGP02-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得ファンドコード("
      D             WK-IDX-J")=["
      D             WK-FUND-CD          OF  WK-PTF-GRP(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得ポートフォリオコード("
      D             WK-IDX-J")=["
      D             WK-PTF-CD           OF  WK-PTF-GRP(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得評価系列コード("
      D             WK-IDX-J")=["
      D             WK-HYK-KRTU-CD      OF  WK-PTF-GRP(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":SUSCGP02-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSCGP02-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSCGP02-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSCGP02-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSCGP02-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSCGP02 START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSCGP02"             USING  PARM-SUSCGP02-INOUT
                                               PARM-RTNPKG
      *    机上デバッグについて、RETURN-CODEの事前設定--START--
      *    MOVE  CNS-RTN-800
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    MOVE  CNS-RTN-901
      *      TO  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *    机上デバッグについて、RETURN-CODEの事前設定--END--
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSCGP02 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSCGP02)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               MOVE  MG-TBL-ID          OF  PARM-SUSCGP02-ARG2
                 TO  WK-MG-TBL-ID
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GIPSモード用銘柄取得  正常"
      D    DISPLAY  CNS-PGM-ID":ARG2.ワーク再処理要銘柄一覧テーブルID=["
      D             MG-TBL-ID           OF  PARM-SUSCGP02-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ワーク再処理要銘柄一覧テーブルID=["
      D             WK-MG-TBL-ID"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク実行ステータス=["WK-STATUS"]"
      *-----------------------------------------------------------------
      *---------- ワーク実行ステータス<4の場合
               IF  WK-STATUS < CNS-4
               THEN
      *----------  ワーク実行ステータス
                 MOVE  CNS-4            TO  WK-STATUS
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク実行ステータス=["WK-STATUS"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク実行ステータス=["WK-STATUS"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
               COMPUTE  WK-COUNT-3 = WK-COUNT-3 + CNS-1
      *----------  メッセージINSルーチン
               PERFORM  MSG-1000-RTN
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                 OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-1)
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  WK-GYOMU-FREE-MSG
                 OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GIPSモード用銘柄取得  エラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-046        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SUSCGP02 GIPSモード用銘柄取得"
      D             "ルーチン END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSCGP02-EXT.
           EXIT.
      ******************************************************************
      *    進捗管理データ削除
      ******************************************************************
       SCZY1180-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理データ削除  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1180-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1180-ARG1
      *----------  基準日FROM
           MOVE  WK-KIKAN-FR-9
             TO  KJN-YMD-FROM           OF  PARM-SCZY1180-ARG1
      *----------  基準日TO
           MOVE  WK-KIKAN-TO-9
             TO  KJN-YMD-TO             OF  PARM-SCZY1180-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SCZY1180-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SCZY1180-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SCZY1180-ARG1
      *----------  進捗タスクID
           MOVE  CNS-ST00800
             TO  SHINTK-TASK-ID         OF  PARM-SCZY1180-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日TO=["
      D             KJN-YMD-TO          OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":進捗タスクID=["
      D             SHINTK-TASK-ID      OF  PARM-SCZY1180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1180  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1180"             USING  PARM-SCZY1180-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY1180  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1180)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ＤＢ コミット処理
             PERFORM  DB-COMMIT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理データ削除  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理データ削除  エラー  ***"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-018          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理データ削除  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY1180-EXT.
           EXIT.
      ******************************************************************
      *    DELETE-SQL作成(PREPARE1)
      ******************************************************************
       DELETE-PREPARE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DELETE-SQL作成(PREPARE1) START ***"
      D    DISPLAY  CNS-PGM-ID":ワークＧＩＰＳモード=["WK-GIPS-MODE"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT-D
                       HST-DELETE-WHERE
                       WK-DELETE-FREE-MSG
      *----------  テーブルTKUSZT01
           MOVE  WK-TBL-TKUSZT01
             TO  SQL-TBL-TKUSZT01       OF  SQL-DELETE
      *----------  テーブルTKUSGP01
           IF  WK-GIPS-MODE  =  CNS-X-1
           THEN
             MOVE  WK-MG-TBL-ID
               TO  SQL-TBL-TKUSGP01     OF  SQL-DELETE-WHERE
                   SQL-TBL-TKUSGP01-1   OF  SQL-DELETE-WHERE
             MOVE  WK-MG-TBL-ID
               TO  SQL-TBL-TKUSGP01-2   OF  SQL-DELETE-WHERE
           ELSE
             CONTINUE
           END-IF
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-DELETE-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-DELETE-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-DELETE-WHERE
      *----------  残高日付
           MOVE  WK-KIKAN-FR-9
             TO  H-ZANTK-YMD            OF  HST-DELETE-WHERE
      *----------  残高日付
           MOVE  WK-KIKAN-TO-9
             TO  H-ZANTK-YMD1           OF  HST-DELETE-WHERE
      *---------- 評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-HYK-KRTU-CD          OF  HST-DELETE-WHERE
      *----------  決算日断面区分1-1
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  H-KSN-YMD-DMN-KBN      OF  HST-DELETE-WHERE
      *----------  決算日断面区分1-2
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  H-KSN-YMD-DMN-KBN2     OF  HST-DELETE-WHERE
      *----------  決算日断面区分2-1
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  H-KSN-YMD-DMN-KBN3     OF  HST-DELETE-WHERE
      *----------  決算日断面区分2-2
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  H-KSN-YMD-DMN-KBN4     OF  HST-DELETE-WHERE
      *----------  決算日断面区分3-1
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  H-KSN-YMD-DMN-KBN5     OF  HST-DELETE-WHERE
      *----------  決算日断面区分3-2
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  H-KSN-YMD-DMN-KBN6     OF  HST-DELETE-WHERE
      *----------  ワークＧＩＰＳモード
           IF  WK-GIPS-MODE  =  CNS-X-1
           THEN
             STRING  SQL-DELETE
                     SQL-DELETE-WHERE
                     DELIMITED BY SIZE
                     INTO SQLSTMT-D
             END-STRING
             COMPUTE  WK-DELETE-LENGH
                      = FUNCTION  LENGTH(SQL-DELETE)
                      + FUNCTION  LENGTH(SQL-DELETE-WHERE)
             STRING SQLSTMT-D(1:WK-DELETE-LENGH)
                "[:V1="
                 H-RIYO-CMP-CD            OF  HST-DELETE-WHERE
                "][:V2="
                 H-FUND-CD                OF  HST-DELETE-WHERE
                "][:V3="
                 H-PTF-CD                 OF  HST-DELETE-WHERE
                "][:V4="
                 H-ZANTK-YMD              OF  HST-DELETE-WHERE
                "][:V5="
                 H-ZANTK-YMD1             OF  HST-DELETE-WHERE
                "][:V6="
                 H-HYK-KRTU-CD            OF  HST-DELETE-WHERE
                "][:V7="
                 H-KSN-YMD-DMN-KBN        OF  HST-DELETE-WHERE
                "][:V8="
                 H-KSN-YMD-DMN-KBN2       OF  HST-DELETE-WHERE
                "][:V9="
                 H-KSN-YMD-DMN-KBN3       OF  HST-DELETE-WHERE
                "][:V10="
                 H-KSN-YMD-DMN-KBN4       OF  HST-DELETE-WHERE
                "][:V11="
                 H-KSN-YMD-DMN-KBN5       OF  HST-DELETE-WHERE
                "][:V12="
                 H-KSN-YMD-DMN-KBN6       OF  HST-DELETE-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-DELETE-FREE-MSG
             END-STRING
           ELSE
             STRING  SQL-DELETE
                     DELIMITED BY SIZE
                     INTO SQLSTMT-D
             END-STRING
             STRING SQLSTMT-D(1:FUNCTION  LENGTH(SQL-DELETE))
                "[:V1="
                 H-RIYO-CMP-CD            OF  HST-DELETE-WHERE
                "][:V2="
                 H-FUND-CD                OF  HST-DELETE-WHERE
                "][:V3="
                 H-PTF-CD                 OF  HST-DELETE-WHERE
                "][:V4="
                 H-ZANTK-YMD              OF  HST-DELETE-WHERE
                "][:V5="
                 H-ZANTK-YMD1             OF  HST-DELETE-WHERE
                "][:V6="
                 H-HYK-KRTU-CD            OF  HST-DELETE-WHERE
                "][:V7="
                 H-KSN-YMD-DMN-KBN        OF  HST-DELETE-WHERE
                "][:V8="
                 H-KSN-YMD-DMN-KBN2       OF  HST-DELETE-WHERE
                "][:V9="
                 H-KSN-YMD-DMN-KBN3       OF  HST-DELETE-WHERE
                "][:V10="
                 H-KSN-YMD-DMN-KBN4       OF  HST-DELETE-WHERE
                "][:V11="
                 H-KSN-YMD-DMN-KBN5       OF  HST-DELETE-WHERE
                "][:V12="
                 H-KSN-YMD-DMN-KBN6       OF  HST-DELETE-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-DELETE-FREE-MSG
             END-STRING
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-D      =["SQLSTMT-D"]"
      D    DISPLAY  CNS-PGM-ID":WK-DELETE-FREE-MSG =["
      D             WK-DELETE-FREE-MSG"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  SDEL  FROM  :SQLSTMT-D
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE1)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-019        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-DELETE-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DELETE-SQL作成(PREPARE1)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DELETE-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    DELETE-SQL作成(EXECUTE)
      ******************************************************************
       DELETE-EXECUTE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DELETE-SQL作成(EXECUTE) START  ***"
      *-----------------------------------------------------------------
           EXEC SQL EXECUTE SDEL
                 USING :HST-DELETE-WHERE.H-RIYO-CMP-CD,
                       :HST-DELETE-WHERE.H-FUND-CD,
                       :HST-DELETE-WHERE.H-PTF-CD,
                       :HST-DELETE-WHERE.H-ZANTK-YMD,
                       :HST-DELETE-WHERE.H-ZANTK-YMD1,
                       :HST-DELETE-WHERE.H-HYK-KRTU-CD,
                       :HST-DELETE-WHERE.H-KSN-YMD-DMN-KBN,
                       :HST-DELETE-WHERE.H-KSN-YMD-DMN-KBN2,
                       :HST-DELETE-WHERE.H-KSN-YMD-DMN-KBN3,
                       :HST-DELETE-WHERE.H-KSN-YMD-DMN-KBN4,
                       :HST-DELETE-WHERE.H-KSN-YMD-DMN-KBN5,
                       :HST-DELETE-WHERE.H-KSN-YMD-DMN-KBN6
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(EXECUTE)= [" SQLCODE "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
             WHEN  CNS-SQL-NOTFOUND
      *----------  ＤＢ コミット処理
               PERFORM  DB-COMMIT-RTN
             WHEN  OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *--------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-020        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-DELETE-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DELETE-SQL作成(EXECUTE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DELETE-EXECUTE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.6) SQL発行処理
      ******************************************************************
       SQL-HAKKO-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SQL発行処理 START ***"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                TO  FLG-CR-OPEN
           MOVE  CNS-OFF                TO  FLG-FETCH-END
      *----------  SQL作成(PREPARE)
           PERFORM  CR-PREPARE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
      *----------  カーソル作成(DECLARE，OPEN)
           IF  WK-STATUS < CNS-6
           THEN
             PERFORM  CR-OPEN-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソル作成しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-6
           THEN
      *----------  カーソルFETCH(FETCH)
             PERFORM  UNTIL  FLG-FETCH-END = CNS-ON
                         OR  WK-RTN-CODE   = CNS-16
               PERFORM  CR-FETCH-RTN
             END-PERFORM
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソル(FETCH)しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN=["FLG-CR-OPEN"]"
      *-----------------------------------------------------------------
      *----------  カーソルクローズ処理
           IF  FLG-CR-OPEN = CNS-ON
           THEN
             PERFORM  CR-CLOSE-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL発行処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SQL-HAKKO-EXT.
           EXIT.
      ******************************************************************
      *    SQL作成（PREPARE）
      ******************************************************************
       CR-PREPARE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL作成(PREPARE)  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT-S
                       HST-TKMZZR00-WHERE
                       HST-TKMZSR00-WHERE
                       HST-TKMZGZ00-WHERE
                       HST-TKMHHR00-WHERE
                       HST-TKDYAA402-WHERE
                       WK-SELECT-FREE-MSG
      *----------  テーブルTKMZZR00
           MOVE  WK-TBL-TKMZZR00
             TO  SQL-TBL-TKMZZR00       OF  SQL-SELECT
      *----------  テーブルTKMZSR00
           MOVE  WK-TBL-TKMZSR00
             TO  SQL-TBL-TKMZSR00       OF  SQL-SELECT
      *----------  テーブルTKMZGZ00
           MOVE  WK-TBL-TKMZGZ00
             TO  SQL-TBL-TKMZGZ00       OF  SQL-SELECT
      *----------  テーブルTKMHHR00
           MOVE  WK-TBL-TKMHHR00
             TO  SQL-TBL-TKMHHR00       OF  SQL-SELECT
      *----------  テーブルTKDYAA40
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TBL-TKDYAA40       OF  SQL-SELECT
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-TKMZZR00-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-TKMZZR00-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-TKMZZR00-WHERE
      *----------  決算日断面区分1
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  H-KSN-YMD-DMN-KBN      OF  HST-TKMZZR00-WHERE
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  H-KSN-YMD-DMN-KBN2     OF  HST-TKMZZR00-WHERE
      *----------  決算日断面区分2
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  H-KSN-YMD-DMN-KBN3     OF  HST-TKMZZR00-WHERE
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  H-KSN-YMD-DMN-KBN4     OF  HST-TKMZZR00-WHERE
      *----------  決算日断面区分3
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  H-KSN-YMD-DMN-KBN5     OF  HST-TKMZZR00-WHERE
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  H-KSN-YMD-DMN-KBN6     OF  HST-TKMZZR00-WHERE
      *---------- 基準日  ≧ ワーク期間(FROM)
           MOVE  WK-KIKAN-FR-9
             TO  H-TKMZZR00-KJN1        OF  HST-TKMZZR00-WHERE
      *---------- 基準日  ≦ ワーク期間(TO)
           MOVE  WK-KIKAN-TO-9
             TO  H-TKMZZR00-KJN2        OF  HST-TKMZZR00-WHERE
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-TKMZSR00-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-TKMZSR00-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-TKMZSR00-WHERE
      *----------  決算日断面区分1
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  H-KSN-YMD-DMN-KBN      OF  HST-TKMZSR00-WHERE
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  H-KSN-YMD-DMN-KBN2     OF  HST-TKMZSR00-WHERE
      *----------  決算日断面区分2
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  H-KSN-YMD-DMN-KBN3     OF  HST-TKMZSR00-WHERE
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  H-KSN-YMD-DMN-KBN4     OF  HST-TKMZSR00-WHERE
      *----------  決算日断面区分3
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  H-KSN-YMD-DMN-KBN5     OF  HST-TKMZSR00-WHERE
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  H-KSN-YMD-DMN-KBN6     OF  HST-TKMZSR00-WHERE
      *---------- 基準日  ≧ ワーク期間(FROM)
           MOVE  WK-KIKAN-FR-9
             TO  H-TKMZSR00-KJN1        OF  HST-TKMZSR00-WHERE
      *---------- 基準日  ≦ ワーク期間(TO)
           MOVE  WK-KIKAN-TO-9
             TO  H-TKMZSR00-KJN2        OF  HST-TKMZSR00-WHERE
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-TKMZGZ00-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-TKMZGZ00-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-TKMZGZ00-WHERE
      *---------- 基準日  ≧ ワーク期間(FROM)
           MOVE  WK-KIKAN-FR-9
             TO  H-TKMZGZ00-KJN1        OF  HST-TKMZGZ00-WHERE
      *---------- 基準日  ≦ ワーク期間(TO)
           MOVE  WK-KIKAN-TO-9
             TO  H-TKMZGZ00-KJN2        OF  HST-TKMZGZ00-WHERE
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-TKMHHR00-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-TKMHHR00-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-TKMHHR00-WHERE
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-HYK-KRTU-CD          OF  HST-TKMHHR00-WHERE
      *---------- 基準日  ≧ ワーク期間(FROM)
           MOVE  WK-KIKAN-FR-9
             TO  H-TKMHHR00-KJN1        OF  HST-TKMHHR00-WHERE
      *---------- 基準日  ≦ ワーク期間(TO)
           MOVE  WK-KIKAN-TO-9
             TO  H-TKMHHR00-KJN2        OF  HST-TKMHHR00-WHERE
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-TKDYAA402-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-TKDYAA402-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-TKDYAA402-WHERE
      *---------- 基準日  ≧ ワーク期間(FROM)
           MOVE  WK-KIKAN-FR-9
             TO  H-TKDYAA402-KJN1       OF  HST-TKDYAA402-WHERE
      *---------- 基準日  ≦ ワーク期間(TO)
           MOVE  WK-KIKAN-TO-9
             TO  H-TKDYAA402-KJN2       OF  HST-TKDYAA402-WHERE
           STRING  SQL-SELECT
                   DELIMITED BY SIZE
                   INTO SQLSTMT-S
           END-STRING
           STRING SQLSTMT-S(1:FUNCTION  LENGTH(SQL-SELECT))
                "[:V1="
                 H-RIYO-CMP-CD          OF  HST-TKMZZR00-WHERE
                "][:V2="
                 H-FUND-CD              OF  HST-TKMZZR00-WHERE
                "][:V3="
                 H-PTF-CD               OF  HST-TKMZZR00-WHERE
                "][:V4="
                 H-KSN-YMD-DMN-KBN      OF  HST-TKMZZR00-WHERE
                "][:V5="
                 H-KSN-YMD-DMN-KBN2     OF  HST-TKMZZR00-WHERE
                "][:V6="
                 H-KSN-YMD-DMN-KBN3     OF  HST-TKMZZR00-WHERE
                "][:V7="
                 H-KSN-YMD-DMN-KBN4     OF  HST-TKMZZR00-WHERE
                "][:V8="
                 H-KSN-YMD-DMN-KBN5     OF  HST-TKMZZR00-WHERE
                "][:V9="
                 H-KSN-YMD-DMN-KBN6     OF  HST-TKMZZR00-WHERE
                "][:V10="
                 H-TKMZZR00-KJN1        OF  HST-TKMZZR00-WHERE
                "][:V11="
                 H-TKMZZR00-KJN2        OF  HST-TKMZZR00-WHERE
                "][:V12="
                 H-RIYO-CMP-CD          OF  HST-TKMZSR00-WHERE
                 "][:V13="
                 H-FUND-CD              OF  HST-TKMZSR00-WHERE
                "][:V14="
                 H-PTF-CD               OF  HST-TKMZSR00-WHERE
                "][:V15="
                 H-KSN-YMD-DMN-KBN      OF  HST-TKMZSR00-WHERE
                "][:V16="
                 H-KSN-YMD-DMN-KBN2     OF  HST-TKMZSR00-WHERE
                "][:V17="
                 H-KSN-YMD-DMN-KBN3     OF  HST-TKMZSR00-WHERE
                "][:V18="
                 H-KSN-YMD-DMN-KBN4     OF  HST-TKMZSR00-WHERE
                "][:V19="
                 H-KSN-YMD-DMN-KBN5     OF  HST-TKMZSR00-WHERE
                "][:V20="
                 H-KSN-YMD-DMN-KBN6     OF  HST-TKMZSR00-WHERE
                "][:V21="
                 H-TKMZSR00-KJN1        OF  HST-TKMZSR00-WHERE
                "][:V22="
                 H-TKMZSR00-KJN2        OF  HST-TKMZSR00-WHERE
                "][:V23="
                 H-RIYO-CMP-CD          OF  HST-TKMZGZ00-WHERE
                "][:V24="
                 H-FUND-CD              OF  HST-TKMZGZ00-WHERE
                "][:V25="
                 H-PTF-CD               OF  HST-TKMZGZ00-WHERE
                "][:V26="
                 H-TKMZGZ00-KJN1        OF  HST-TKMZGZ00-WHERE
                "][:V27="
                 H-TKMZGZ00-KJN2        OF  HST-TKMZGZ00-WHERE
                "][:V28="
                 H-RIYO-CMP-CD          OF  HST-TKMHHR00-WHERE
                "][:V29="
                 H-FUND-CD              OF  HST-TKMHHR00-WHERE
                "][:V30="
                 H-PTF-CD               OF  HST-TKMHHR00-WHERE
                "][:V31="
                 H-HYK-KRTU-CD          OF  HST-TKMHHR00-WHERE
                "][:V32="
                 H-TKMHHR00-KJN1        OF  HST-TKMHHR00-WHERE
                "][:V33="
                 H-TKMHHR00-KJN2        OF  HST-TKMHHR00-WHERE
                "][:V34="
                 H-RIYO-CMP-CD          OF  HST-TKDYAA402-WHERE
                "][:V35="
                 H-FUND-CD              OF  HST-TKDYAA402-WHERE
                "][:V36="
                 H-PTF-CD               OF  HST-TKDYAA402-WHERE
                "][:V37="
                 H-TKDYAA402-KJN1       OF  HST-TKDYAA402-WHERE
                "][:V38="
                 H-TKDYAA402-KJN2       OF  HST-TKDYAA402-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-SELECT-FREE-MSG
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":H-RIYO-CMP-CD      =["
      D                 H-RIYO-CMP-CD   OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-FUND-CD          =["
      D                 H-FUND-CD       OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-PTF-CD           =["
      D                 H-PTF-CD        OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN  =["
      D                 H-KSN-YMD-DMN-KBN
      D                                 OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN2 =["
      D                 H-KSN-YMD-DMN-KBN2
      D                                 OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN3 =["
      D                 H-KSN-YMD-DMN-KBN3
      D                                 OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN4 =["
      D                 H-KSN-YMD-DMN-KBN4
      D                                 OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN5 =["
      D                 H-KSN-YMD-DMN-KBN5
      D                                 OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN6 =["
      D                 H-KSN-YMD-DMN-KBN6
      D                                 OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKMZZR00-KJN1 =["
      D                 H-TKMZZR00-KJN1 OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKMZZR00-KJN2 =["
      D                 H-TKMZZR00-KJN2 OF  HST-TKMZZR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-RIYO-CMP-CD      =["
      D                 H-RIYO-CMP-CD   OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-FUND-CD          =["
      D                 H-FUND-CD       OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-PTF-CD           =["
      D                 H-PTF-CD        OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN  =["
      D                 H-KSN-YMD-DMN-KBN
      D                                 OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN2 =["
      D                 H-KSN-YMD-DMN-KBN2
      D                                 OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN3 =["
      D                 H-KSN-YMD-DMN-KBN3
      D                                 OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN4 =["
      D                 H-KSN-YMD-DMN-KBN4
      D                                 OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN5 =["
      D                 H-KSN-YMD-DMN-KBN5
      D                                 OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-KSN-YMD-DMN-KBN6 =["
      D                 H-KSN-YMD-DMN-KBN6
      D                                 OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKMZSR00-KJN1 =["
      D                 H-TKMZSR00-KJN1 OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKMZSR00-KJN2 =["
      D                 H-TKMZSR00-KJN2 OF  HST-TKMZSR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-RIYO-CMP-CD      =["
      D                 H-RIYO-CMP-CD   OF  HST-TKMZGZ00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-FUND-CD          =["
      D                 H-FUND-CD       OF  HST-TKMZGZ00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-PTF-CD           =["
      D                 H-PTF-CD        OF  HST-TKMZGZ00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKMZGZ00-KJN1 =["
      D                 H-TKMZGZ00-KJN1 OF  HST-TKMZGZ00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKMZGZ00-KJN2 =["
      D                 H-TKMZGZ00-KJN2 OF  HST-TKMZGZ00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-RIYO-CMP-CD      =["
      D                 H-RIYO-CMP-CD   OF  HST-TKMHHR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-FUND-CD          =["
      D                 H-FUND-CD       OF  HST-TKMHHR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-PTF-CD           =["
      D                 H-PTF-CD        OF  HST-TKMHHR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-HYK-KRTU-CD =["
      D                 H-HYK-KRTU-CD   OF  HST-TKMHHR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKMHHR00-KJN1 =["
      D                 H-TKMHHR00-KJN1 OF  HST-TKMHHR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKMHHR00-KJN2 =["
      D                 H-TKMHHR00-KJN2 OF  HST-TKMHHR00-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-RIYO-CMP-CD =["
      D                 H-RIYO-CMP-CD   OF  HST-TKDYAA402-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-FUND-CD     =["
      D                 H-FUND-CD       OF  HST-TKDYAA402-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-PTF-CD      =["
      D                 H-PTF-CD        OF  HST-TKDYAA402-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKDYAA402-KJN1   =["
      D                 H-TKDYAA402-KJN1  OF  HST-TKDYAA402-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":H-TKDYAA402-KJN2   =["
      D                 H-TKDYAA402-KJN2  OF  HST-TKDYAA402-WHERE "]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-S      =["SQLSTMT-S"]"
      D    DISPLAY  CNS-PGM-ID":WK-SELECT-FREE-MSG =["
      D             WK-SELECT-FREE-MSG"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  KJNRECORD  FROM  :SQLSTMT-S
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-021        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL作成(PREPARE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    カーソル作成（DECLARE，OPEN）
      ******************************************************************
       CR-OPEN-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カーソル作成(DECLARE，OPEN)  START  ***"
      *-----------------------------------------------------------------
      *----------DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR  CURSOR  FOR  KJNRECORD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------OPEN    CURSOR
           EXEC  SQL
             OPEN  CR
           USING  :HST-TKMZZR00-WHERE.H-RIYO-CMP-CD,
                  :HST-TKMZZR00-WHERE.H-FUND-CD,
                  :HST-TKMZZR00-WHERE.H-PTF-CD,
                  :HST-TKMZZR00-WHERE.H-KSN-YMD-DMN-KBN,
                  :HST-TKMZZR00-WHERE.H-KSN-YMD-DMN-KBN2,
                  :HST-TKMZZR00-WHERE.H-KSN-YMD-DMN-KBN3,
                  :HST-TKMZZR00-WHERE.H-KSN-YMD-DMN-KBN4,
                  :HST-TKMZZR00-WHERE.H-KSN-YMD-DMN-KBN5,
                  :HST-TKMZZR00-WHERE.H-KSN-YMD-DMN-KBN6,
                  :HST-TKMZZR00-WHERE.H-TKMZZR00-KJN1,
                  :HST-TKMZZR00-WHERE.H-TKMZZR00-KJN2,
                  :HST-TKMZSR00-WHERE.H-RIYO-CMP-CD,
                  :HST-TKMZSR00-WHERE.H-FUND-CD,
                  :HST-TKMZSR00-WHERE.H-PTF-CD,
                  :HST-TKMZSR00-WHERE.H-KSN-YMD-DMN-KBN,
                  :HST-TKMZSR00-WHERE.H-KSN-YMD-DMN-KBN2,
                  :HST-TKMZSR00-WHERE.H-KSN-YMD-DMN-KBN3,
                  :HST-TKMZSR00-WHERE.H-KSN-YMD-DMN-KBN4,
                  :HST-TKMZSR00-WHERE.H-KSN-YMD-DMN-KBN5,
                  :HST-TKMZSR00-WHERE.H-KSN-YMD-DMN-KBN6,
                  :HST-TKMZSR00-WHERE.H-TKMZSR00-KJN1,
                  :HST-TKMZSR00-WHERE.H-TKMZSR00-KJN2,
                  :HST-TKMZGZ00-WHERE.H-RIYO-CMP-CD,
                  :HST-TKMZGZ00-WHERE.H-FUND-CD,
                  :HST-TKMZGZ00-WHERE.H-PTF-CD,
                  :HST-TKMZGZ00-WHERE.H-TKMZGZ00-KJN1,
                  :HST-TKMZGZ00-WHERE.H-TKMZGZ00-KJN2,
                  :HST-TKMHHR00-WHERE.H-RIYO-CMP-CD,
                  :HST-TKMHHR00-WHERE.H-FUND-CD,
                  :HST-TKMHHR00-WHERE.H-PTF-CD,
                  :HST-TKMHHR00-WHERE.H-HYK-KRTU-CD,
                  :HST-TKMHHR00-WHERE.H-TKMHHR00-KJN1,
                  :HST-TKMHHR00-WHERE.H-TKMHHR00-KJN2,
                  :HST-TKDYAA402-WHERE.H-RIYO-CMP-CD,
                  :HST-TKDYAA402-WHERE.H-FUND-CD,
                  :HST-TKDYAA402-WHERE.H-PTF-CD,
                  :HST-TKDYAA402-WHERE.H-TKDYAA402-KJN1,
                  :HST-TKDYAA402-WHERE.H-TKDYAA402-KJN2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN =["FLG-CR-OPEN"]"
      *-----------------------------------------------------------------
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-022        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カーソル作成(DECLARE，OPEN)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソル（FETCH）
      ******************************************************************
       CR-FETCH-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(FETCH)  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  HST-TBL-SELECT
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH CR
             INTO  :HST-TBL-SELECT.H-KJN-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR FETCH)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *---------- ワーク取得件数
               COMPUTE  WK-FETCH-KENSUU = WK-FETCH-KENSUU  + CNS-1
      *----------  (1)～(7)の処理を行う
               PERFORM  FETCH-GET-RTN
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-FETCH-END
      *-----------------------------------------------------------------
             WHEN  OTHER
               MOVE  CNS-ON             TO  FLG-FETCH-END
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-023        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(FETCH)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    カーソル(CLOSE)
      ******************************************************************
       CR-CLOSE-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR CLOSE)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN           =["FLG-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-024          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  WK-SELECT-FREE-MSG   TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    FETCH-GET NORMAL
      ******************************************************************
       FETCH-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  FETCH-GET NORMAL  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  FLG-SABU-GYOMU-ERR
                       WK-SCZY7080-INFO
                       WK-COUNT-5
      *----------  1) 進捗更新
           MOVE  H-KJN-YMD              OF  HST-TBL-SELECT
             TO  WK-KJN-YMD
           MOVE  WK-KJN-YMD             TO  WK-YKJ-YMD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日 = [" WK-KJN-YMD  "]"
      *-----------------------------------------------------------------
      *----------  運用成果進捗更新処理
           PERFORM  SUSC0406-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-PTF-JIKOU-KBN = ["
      D                         FLG-PTF-JIKOU-KBN  "]"
      *-----------------------------------------------------------------
           IF  FLG-PTF-JIKOU-KBN = CNS-OFF
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-FETCH-REC = ["
      D                         FLG-NEXT-FETCH-REC  "]"
      *-----------------------------------------------------------------
      *----------  2) 進捗ﾁｪｯｸ処理
             IF  FLG-NEXT-FETCH-REC = CNS-OFF
             THEN
               PERFORM  PROGRESS-CHECK-RTN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 進捗ﾁｪｯｸ処理しない ****"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-FETCH-REC = ["
      D                         FLG-NEXT-FETCH-REC  "]"
      *-----------------------------------------------------------------
      *----------  3) 残高履歴データを保存する
             IF  FLG-NEXT-FETCH-REC = CNS-OFF
             THEN
               PERFORM  SUSC0001-RTN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 残高履歴データを保存しない ****"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-FETCH-REC = ["
      D                         FLG-NEXT-FETCH-REC  "]"
      *-----------------------------------------------------------------
      *----------  4) 資金残履歴データを保存する
             IF  FLG-NEXT-FETCH-REC = CNS-OFF
             THEN
               PERFORM  SUSC0002-RTN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 資金残履歴データを保存しない ****"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-FETCH-REC = ["
      D                         FLG-NEXT-FETCH-REC  "]"
      *-----------------------------------------------------------------
      *----------  5) 元本残高データを保存する
             IF  FLG-NEXT-FETCH-REC = CNS-OFF
             THEN
               PERFORM  SUSC0003-RTN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 元本残高データを保存しない ****"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-FETCH-REC = ["
      D                         FLG-NEXT-FETCH-REC  "]"
      *-----------------------------------------------------------------
      *----------  6) 評価履歴データを保存する
             IF  FLG-NEXT-FETCH-REC = CNS-OFF
             THEN
               PERFORM  SUSC0004-RTN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 元本残高データを保存しない ****"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-KJN-REC = ["
      D                         FLG-NEXT-KJN-REC  "]"
      *-----------------------------------------------------------------
             IF  FLG-NEXT-KJN-REC = CNS-OFF
             THEN
      *----------  6) ＤＢコミット処理CHECK
               PERFORM  DB-COMMIT-CHCK-RTN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** ＤＢコミット処理ない ****"
      D    DISPLAY  CNS-PGM-ID":**** ＤＢロールバック処理処理ない ****"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
      *----------<残タスク117（決算扱い方法の追加）  START>-------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-SABU-GYOMU-ERR=["
      D             FLG-SABU-GYOMU-ERR"]"
      *-----------------------------------------------------------------
             IF  FLG-SABU-GYOMU-ERR = CNS-ON
             THEN
      *----------  業務エラー処理
               PERFORM  GYOMU-ERR-3-RTN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 業務エラー処理しない ****"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
      *----------<残タスク117（決算扱い方法の追加）  END>---------------
      *----------  7) 進捗更新2
             PERFORM  SUSC0406-2-RTN
      *----------  ＤＢ コミット処理
             PERFORM  DB-COMMIT-RTN
           ELSE
             CONTINUE
           END-IF
           INITIALIZE  WK-KJN-STATUS
                       FLG-PTF-JIKOU-KBN
                       FLG-NEXT-FETCH-REC
                       FLG-NEXT-KJN-REC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  FETCH-GET NORMAL  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       FETCH-GET-EXT.
           EXIT.
      ******************************************************************
      *    運用成果進捗更新処理
      ******************************************************************
       SUSC0406-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 運用成果進捗更新処理  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0406-INOUT
                       PARM-RTNPKG
      *----------  セッション区分←"0":先頭セッション
           MOVE  CNS-X-0
             TO  SESION-KBN             OF  PARM-SUSC0406-ARG1
      *----------  OL/BT区分←"BT":バッチ用
           MOVE  CNS-BT
             TO  OLBT-KBN               OF  PARM-SUSC0406-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0406-ARG2
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SUSC0406-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SUSC0406-ARG2
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SUSC0406-ARG2
      *----------  基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                OF  PARM-SUSC0406-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0406-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0406-ARG2
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0406-ARG2
      *----------  基準日FROM
           MOVE  WK-KIKAN-FR-9
             TO  KJN-YMD-FROM           OF  PARM-SUSC0406-ARG2
      *----------  実行ステータス
           MOVE  CNS-SHINTK-STS-600
             TO  JIKOU-STS              OF  PARM-SUSC0406-ARG2
      *----------  ポートフォリオ属性データエリア
           MOVE  PARM-SCZY4313-ARG2
             TO  PARM-SUSC0406-ARG5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSC0406-ARG1:"
      D    DISPLAY  CNS-PGM-ID":セッション区分=["
      D             SESION-KBN          OF  PARM-SUSC0406-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":OL/BT区分=["
      D             OLBT-KBN            OF  PARM-SUSC0406-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0406-ARG2:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日/基準年月=["
      D             KJN-YMD             OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":最終処理基準日=["
      D             SS-SYORI-YMD        OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ベビー未処理フラグ=["
      D             BABY-MISYORI-FLG    OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス=["
      D             JIKOU-STS           OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0406-ARG5:"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性データエリア=["
      D             PARM-SUSC0406-ARG5"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0406  START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0406"             USING  PARM-SUSC0406-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0406  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0406)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常の場合
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 運用成果進捗更新処理 正常  ***"
      D    DISPLAY  CNS-PGM-ID":PTF-JIKOU-KBN OF PARM-SUSC0406-ARG3 =["
      D                         PTF-JIKOU-KBN OF PARM-SUSC0406-ARG3 "]"
      *-----------------------------------------------------------------
      *----------  ポートフォリオ実行可能区分
               EVALUATE  PTF-JIKOU-KBN OF PARM-SUSC0406-ARG3
                 WHEN  CNS-X-0
                   CONTINUE
                 WHEN  CNS-X-1
      *----------  実行可能区分フラグ
                   MOVE  CNS-ON         TO  FLG-PTF-JIKOU-KBN
                 WHEN  CNS-X-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN=["FLG-CR-OPEN"]"
      *-----------------------------------------------------------------
      *----------  カーソルクローズ処理
                   IF  FLG-CR-OPEN = CNS-ON
                   THEN
                     PERFORM  CR-CLOSE-RTN
                   ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理しない ****"
      *-----------------------------------------------------------------
                     CONTINUE
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-MEISAI-GYOMU-ERR = ["
      D                         FLG-MEISAI-GYOMU-ERR "]"
      *-----------------------------------------------------------------
                   IF  FLG-MEISAI-GYOMU-ERR = CNS-ON
                   THEN
      *----------  6) 業務エラー1処理
                     PERFORM  GYOMU-ERR-1-RTN
                   ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 業務エラー1処理しない ****"
      *-----------------------------------------------------------------
                     CONTINUE
                   END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
                   IF  WK-RTN-CODE NOT = CNS-RTN-BT16
                   THEN
      *----------  後処理
                     PERFORM  END-RTN
                   ELSE
      *----------  エラー処理
                     PERFORM  ERR-RTN
                   END-IF
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行可能区分=["FLG-PTF-JIKOU-KBN"]"
      *-----------------------------------------------------------------
      *----------  ＤＢ コミット処理
               PERFORM  DB-COMMIT1-RTN
      *----------  データ取得不能の場合
             WHEN  CNS-RTN-113
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***運用成果進捗更新処理 データ取得不能 "
      *-----------------------------------------------------------------
               COMPUTE  WK-COUNT-3 = WK-COUNT-3 + CNS-1
      *----------  メッセージINSルーチン
               PERFORM  MSG-1000-RTN
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON              TO  FLG-MEISAI-GYOMU-ERR
      *---------- ファンドコード
               MOVE  WK-FUND-CD          OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD           OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 評価系列コード
               MOVE  WK-HYK-KRTU-CD      OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票ID
               MOVE  WK-REP-ID           OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-REP-ID
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票任意コード
               MOVE  WK-REP-ANY-CD       OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-REP-ANY-CD
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日From
               MOVE  WK-KJN-YMD
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日To
               MOVE  WK-KJN-YMD
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- メッセージID
               MOVE  CNS-MSG-E000217
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 置換文字
               MOVE  CNS-SINTYOKU-DATA
                 TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-1)
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *----------  実行可能区分フラグ
               MOVE  CNS-ON             TO  FLG-PTF-JIKOU-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-KJN-STATUS=["WK-KJN-STATUS"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
               IF  WK-KJN-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-KJN-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-STATUS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *----------  上記以外の場合
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 運用成果進捗更新処理 エラー ***"
      *-----------------------------------------------------------------
      *----------  次のフェッチレコードフラグ
               MOVE  CNS-ON             TO  FLG-NEXT-FETCH-REC
      *----------  次の基準日レコードフラグ
               MOVE  CNS-ON             TO  FLG-NEXT-KJN-REC
      *----------  基準日実行ステータス
               MOVE  CNS-16             TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-025        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                        (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 運用成果進捗更新処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0406-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミット処理
      ******************************************************************
       DB-COMMIT1-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミット処理  START  ***"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  次のフェッチレコードフラグ
             MOVE  CNS-ON               TO  FLG-NEXT-FETCH-REC
      *----------  基準日実行ステータス
             MOVE  CNS-16               TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-026          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-COMMIT-ERR       TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT1-EXT.
           EXIT.
      ******************************************************************
      *    進捗ﾁｪｯｸ処理
      ******************************************************************
       PROGRESS-CHECK-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗ﾁｪｯｸ処理  START ***"
      *-----------------------------------------------------------------
      *----------  進捗ステータス(残高)処理
           PERFORM  SUSC0402-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-FETCH-REC =["
      D                         FLG-NEXT-FETCH-REC "]"
      *-----------------------------------------------------------------
           IF  FLG-NEXT-FETCH-REC = CNS-OFF
           THEN
      *----------  進捗ステータス(評価)処理
             PERFORM  SUSC0403-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 進捗ステータス(評価)処理しない****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗ﾁｪｯｸ処理   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PROGRESS-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    進捗ステータス(残高)処理
      ******************************************************************
       SUSC0402-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗ステータス(残高)処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SUSC0402-INOUT
                        PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0402-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0402-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0402-ARG1
      *----------  基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                OF  PARM-SUSC0402-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0402-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0402-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0402-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SUSC0402-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0402  START  ***"
           CALL  "SUSC0402"             USING  PARM-SUSC0402-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0402  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0402)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常の場合
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高進捗チェック 正常  ***"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス=["
      D             SINSYOU-STS         OF  PARM-SUSC0402-ARG2"]"
      *-----------------------------------------------------------------
      *---------- 進捗ステータス
               EVALUATE  SINSYOU-STS    OF  PARM-SUSC0402-ARG2
      *---------- 進捗ステータス＝'000'（確定済）
                 WHEN  CNS-SHINTK-STS-000
      *---------- 進捗ステータス＝'100'(正常終了)
                 WHEN  CNS-SHINTK-STS-100
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得した進捗ステータス='100'(正常終了)"
      D                       " または'000'(確定済)の場合"
      *-----------------------------------------------------------------
                   CONTINUE
                 WHEN  SPACE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
                   IF  WK-STATUS < CNS-2
                   THEN
                     MOVE  CNS-2             TO  WK-STATUS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
                   IF  WK-RTN-CODE < CNS-RTN-BT2
                   THEN
                     MOVE  CNS-RTN-BT2       TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *----------  基準日実行ステータス
                   IF  WK-KJN-STATUS < CNS-2
                   THEN
                     MOVE  CNS-2             TO  WK-KJN-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   COMPUTE  WK-COUNT-3 = WK-COUNT-3 + CNS-1
      *----------  メッセージINSルーチン
                   PERFORM  MSG-1000-RTN
      *----------  明細業務エラーフラグ
                   MOVE  CNS-ON              TO  FLG-MEISAI-GYOMU-ERR
      *---------- ファンドコード
                   MOVE  WK-FUND-CD          OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-FUND-CD
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- ポートフォリオコード
                   MOVE  WK-PTF-CD           OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-PTF-CD
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 評価系列コード
                   MOVE  WK-HYK-KRTU-CD      OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-HYK-KRTU-CD
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票ID
                   MOVE  WK-REP-ID           OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-REP-ID
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票任意コード
                   MOVE  WK-REP-ANY-CD       OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-REP-ANY-CD
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日From
                   MOVE  WK-KJN-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日To
                   MOVE  WK-KJN-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- メッセージID
                   MOVE  CNS-MSG-W000600
                     TO  WK-GYOMU-MSG-ID
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 置換文字
                   MOVE  CNS-OUT-ZT
                     TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-1)
      *---------- フリーメッセージ
                   STRING  CNS-YKJ-YMD
                           WK-YKJ-YMD
                           DELIMITED BY SIZE
                     INTO  WK-GYOMU-FREE-MSG
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
                   END-STRING
      *----------  上記以外の場合
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
                   IF  WK-STATUS < CNS-2
                   THEN
                     MOVE  CNS-2             TO  WK-STATUS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
                   IF  WK-RTN-CODE < CNS-RTN-BT2
                   THEN
                     MOVE  CNS-RTN-BT2       TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *----------  基準日実行ステータス
                   IF  WK-KJN-STATUS < CNS-2
                   THEN
                     MOVE  CNS-2             TO  WK-KJN-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   COMPUTE  WK-COUNT-3 = WK-COUNT-3 + CNS-1
      *----------  メッセージINSルーチン
                   PERFORM  MSG-1000-RTN
      *----------  明細業務エラーフラグ
                   MOVE  CNS-ON              TO  FLG-MEISAI-GYOMU-ERR
      *---------- ファンドコード
                   MOVE  WK-FUND-CD          OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-FUND-CD
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- ポートフォリオコード
                   MOVE  WK-PTF-CD           OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-PTF-CD
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 評価系列コード
                   MOVE  WK-HYK-KRTU-CD      OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-HYK-KRTU-CD
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票ID
                   MOVE  WK-REP-ID           OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-REP-ID
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票任意コード
                   MOVE  WK-REP-ANY-CD       OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-REP-ANY-CD
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日From
                   MOVE  WK-KJN-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日To
                   MOVE  WK-KJN-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- メッセージID
                   MOVE  CNS-MSG-W000600
                     TO  WK-GYOMU-MSG-ID
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 置換文字
                   MOVE  CNS-OUT-ZT
                     TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-1)
      *---------- フリーメッセージ
                   STRING  CNS-YKJ-YMD
                           WK-YKJ-YMD
                           DELIMITED BY SIZE
                     INTO  WK-GYOMU-FREE-MSG
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
                   END-STRING
               END-EVALUATE
      *----------  上記以外の場合
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 残高進捗チェック エラー ***"
      *-----------------------------------------------------------------
      *----------  次のフェッチレコードフラグ
               MOVE  CNS-ON               TO  FLG-NEXT-FETCH-REC
      *----------  基準日実行ステータス
               MOVE  CNS-16               TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-027          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗ステータス処理(残高) END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0402-EXT.
           EXIT.
      ******************************************************************
      *    進捗ステータス(評価) 処理
      ******************************************************************
       SUSC0403-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗ステータス 処理(評価) START ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SUSC0403-INOUT
                        PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0403-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0403-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0403-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0403-ARG1
      *----------  基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                OF  PARM-SUSC0403-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0403-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0403-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0403-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0403-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SUSC0403-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0403  START  ***"
           CALL  "SUSC0403"             USING  PARM-SUSC0403-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0403  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0403)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常の場合
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 評価進捗チェック 正常  ***"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス=["
      D             SINSYOU-STS         OF  PARM-SUSC0403-ARG2"]"
      *-----------------------------------------------------------------
      *---------- 進捗ステータス
               EVALUATE  SINSYOU-STS    OF  PARM-SUSC0403-ARG2
      *---------- 進捗ステータス＝'000'（確定済）
                 WHEN  CNS-SHINTK-STS-000
      *---------- 進捗ステータス＝'100'(正常終了)
                 WHEN  CNS-SHINTK-STS-100
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得した進捗ステータス='100'(正常終了)"
      D                       " または'000'(確定済)の場合"
      *-----------------------------------------------------------------
                   CONTINUE
                 WHEN  SPACE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
                   IF  WK-STATUS < CNS-2
                   THEN
                     MOVE  CNS-2             TO  WK-STATUS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
                   IF  WK-RTN-CODE < CNS-RTN-BT2
                   THEN
                     MOVE  CNS-RTN-BT2       TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *----------  基準日実行ステータス
                   IF  WK-KJN-STATUS < CNS-2
                   THEN
                     MOVE  CNS-2             TO  WK-KJN-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   COMPUTE  WK-COUNT-3 = WK-COUNT-3 + CNS-1
      *----------  メッセージINSルーチン
                   PERFORM  MSG-1000-RTN
      *----------  明細業務エラーフラグ
                   MOVE  CNS-ON              TO  FLG-MEISAI-GYOMU-ERR
      *---------- ファンドコード
                   MOVE  WK-FUND-CD          OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-FUND-CD
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- ポートフォリオコード
                   MOVE  WK-PTF-CD           OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-PTF-CD
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 評価系列コード
                   MOVE  WK-HYK-KRTU-CD      OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-HYK-KRTU-CD
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票ID
                   MOVE  WK-REP-ID           OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-REP-ID
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票任意コード
                   MOVE  WK-REP-ANY-CD       OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-REP-ANY-CD
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日From
                   MOVE  WK-KJN-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日To
                   MOVE  WK-KJN-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- メッセージID
                   MOVE  CNS-MSG-W000600
                     TO  WK-GYOMU-MSG-ID
                             OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 置換文字
                   MOVE  CNS-OUT-HYK
                     TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-1)
      *---------- フリーメッセージ
                   STRING  CNS-YKJ-YMD
                           WK-YKJ-YMD
                           DELIMITED BY SIZE
                     INTO  WK-GYOMU-FREE-MSG
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
                   END-STRING
      *----------  上記以外の場合
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
                   IF  WK-STATUS < CNS-2
                   THEN
                     MOVE  CNS-2             TO  WK-STATUS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
                   IF  WK-RTN-CODE < CNS-RTN-BT2
                   THEN
                     MOVE  CNS-RTN-BT2       TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
      *----------  基準日実行ステータス
                   IF  WK-KJN-STATUS < CNS-2
                   THEN
                     MOVE  CNS-2             TO  WK-KJN-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   COMPUTE  WK-COUNT-3 = WK-COUNT-3 + CNS-1
      *----------  メッセージINSルーチン
                   PERFORM  MSG-1000-RTN
      *----------  明細業務エラーフラグ
                   MOVE  CNS-ON              TO  FLG-MEISAI-GYOMU-ERR
      *---------- ファンドコード
                   MOVE  WK-FUND-CD          OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-FUND-CD
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- ポートフォリオコード
                   MOVE  WK-PTF-CD           OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-PTF-CD
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 評価系列コード
                   MOVE  WK-HYK-KRTU-CD      OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-HYK-KRTU-CD
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票ID
                   MOVE  WK-REP-ID           OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-REP-ID
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票任意コード
                   MOVE  WK-REP-ANY-CD       OF  WK-PTF-GRP(WK-IDX-J)
                     TO  WK-GYOMU-REP-ANY-CD
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日From
                   MOVE  WK-KJN-YMD
                     TO  WK-GYOMU-KJN-YMD-FROM
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日To
                   MOVE  WK-KJN-YMD
                     TO  WK-GYOMU-KJN-YMD-TO
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- メッセージID
                   MOVE  CNS-MSG-W000600
                     TO  WK-GYOMU-MSG-ID
                           OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 置換文字
                   MOVE  CNS-OUT-HYK
                     TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-1)
      *---------- フリーメッセージ
                   STRING  CNS-YKJ-YMD
                           WK-YKJ-YMD
                           DELIMITED BY SIZE
                     INTO  WK-GYOMU-FREE-MSG
                       OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
                   END-STRING
               END-EVALUATE
      *----------  上記以外の場合
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 評価進捗チェック エラー ***"
      *-----------------------------------------------------------------
      *----------  次のフェッチレコードフラグ
               MOVE  CNS-ON               TO  FLG-NEXT-FETCH-REC
      *----------  基準日実行ステータス
               MOVE  CNS-16               TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-028          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗ステータス 処理(評価) END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0403-EXT.
           EXIT.
      ******************************************************************
      *   メッセージINSルーチン
      ******************************************************************
       MSG-1000-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** メッセージINSルーチン  START  ***"
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-3=["WK-COUNT-3"]"
      *-----------------------------------------------------------------
           IF  WK-COUNT-3 = CNS-1000
           THEN
      *---------- 業務エラー1処理
             PERFORM  GYOMU-ERR-1-RTN
             MOVE  CNS-1               TO  WK-COUNT-3
             INITIALIZE   WK-GYOMU-ERR-INFO
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  メッセージINSルーチン  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MSG-1000-EXT.
           EXIT.
      ******************************************************************
      *    残高履歴データを保存
      ******************************************************************
       SUSC0001-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴データを保存  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0001-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0001-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0001-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0001-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0001-ARG1
      *----------  決算日断面区分1
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0001-ARG1(CNS-1)
      *----------  決算日断面区分2
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0001-ARG1(CNS-2)
      *----------  決算日断面区分3
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0001-ARG1(CNS-3)
      *----------  基準日
           MOVE  H-KJN-YMD              OF  HST-TBL-SELECT
             TO  KJN-YMD                OF  PARM-SUSC0001-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SHORI-YMD              OF  PARM-SUSC0001-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SUSC0001-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SUSC0001-ARG1
      *----------  画面ＩＤ
           MOVE  CNS-GAMEN-ID
             TO  GAMEN                  OF  PARM-SUSC0001-ARG1
      *----------  更新ログインユーザ会社コード
           MOVE  COMPANY-CODE           OF  WK-AIFA
             TO  CMP-CD                 OF  PARM-SUSC0001-ARG1
      *----------  更新ユーザＩＤ
           MOVE  JOB-USER-ID            OF  WK-AIFA
             TO  JOB-USER-ID            OF  PARM-SUSC0001-ARG1
      *----------  予備１
           MOVE  SPACE
             TO  YOBI-1                 OF  PARM-SUSC0001-ARG1
      *----------  予備２
           MOVE  SPACE
             TO  YOBI-2                 OF  PARM-SUSC0001-ARG1
      *----------  ＧＩＰＳモード
           MOVE  WK-GIPS-MODE
             TO  GIPS-MODE              OF  PARM-SUSC0001-ARG1
      *----------  再処理要銘柄一覧テーブルID
           MOVE  WK-MG-TBL-ID
             TO  TAB-TKUSGP01           OF  PARM-SUSC0001-ARG1
      *----------  ポートフォリオ属性データエリア
           MOVE  PARM-SCZY4313-ARG2
             TO  PARM-SUSC0001-ARG4
      *----------  商品属性データエリア
           MOVE  PARM-SCZY4403-ARG2
             TO  PARM-SUSC0001-ARG5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSC0001-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分1=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0001-ARG1(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分2=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0001-ARG1(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分3=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0001-ARG1(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SHORI-YMD           OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":画面ＩＤ=["
      D             GAMEN               OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             CMP-CD              OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ=["
      D             JOB-USER-ID         OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備１=["
      D             YOBI-1              OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備２=["
      D             YOBI-2              OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード=["
      D             GIPS-MODE           OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":再処理要銘柄一覧テーブルID=["
      D             TAB-TKUSGP01        OF  PARM-SUSC0001-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0001-ARG4:"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性データエリア=["
      D             PARM-SUSC0001-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0001-ARG5:"
      D    DISPLAY  CNS-PGM-ID":商品属性データエリア=["
      D             PARM-SUSC0001-ARG5"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0001  START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0001"             USING  PARM-SUSC0001-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0001  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0001)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴データを保存  正常  ***"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
               CONTINUE
      *----------<残タスク117（決算扱い方法の追加）  START>-------------
             WHEN  CNS-RTN-100
             WHEN  CNS-RTN-113
      *----------  サブ業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-SABU-GYOMU-ERR
               MOVE  CNS-OFF            TO  FLG-STOP
               PERFORM                  VARYING  WK-COUNT-4
                 FROM  CNS-1 BY CNS-1
                 UNTIL ( WK-COUNT-4 > CNS-999 OR FLG-STOP = CNS-ON )
                 IF  MSG-ID  OF  PARM-SUSC0001-ARG2(WK-COUNT-4)
                     NOT = SPACE
                 THEN
                   COMPUTE  WK-COUNT-5 = WK-COUNT-5 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-5=["WK-COUNT-5"]"
      *-----------------------------------------------------------------
                   IF  WK-COUNT-5 < CNS-1000
                   THEN
                     MOVE  MESSAGE-AREA
                       OF  PARM-SUSC0001-ARG2(WK-COUNT-4)
                       TO  WK-SCZY7080-AREA(WK-COUNT-5)
                   ELSE
                     MOVE  CNS-ON       TO  FLG-STOP
                   END-IF
                 ELSE
                   MOVE  CNS-ON         TO  FLG-STOP
                 END-IF
               END-PERFORM
      *----------  ワーク年月日実行ステータス
               IF  WK-KJN-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-KJN-STATUS
               ELSE
                 CONTINUE
               END-IF
               IF  WK-STATUS < CNS-4
               THEN
      *----------  ワーク実行ステータス
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS =  [" WK-STATUS "]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *----------<残タスク117（決算扱い方法の追加）  END>---------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴データを保存  エラー  ***"
      *-----------------------------------------------------------------
      *----------  次のフェッチレコードフラグ
               MOVE  CNS-ON             TO  FLG-NEXT-FETCH-REC
      *----------  基準日実行ステータス
               MOVE  CNS-16             TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-029        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴データを保存  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0001-EXT.
           EXIT.
      ******************************************************************
      *    資金残履歴データを保存
      ******************************************************************
       SUSC0002-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴データを保存  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0002-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0002-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0002-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0002-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0002-ARG1
      *----------  決算日断面区分1
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0002-ARG1(CNS-1)
      *----------  決算日断面区分2
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0002-ARG1(CNS-2)
      *----------  決算日断面区分3
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0002-ARG1(CNS-3)
      *----------  基準日
           MOVE  H-KJN-YMD              OF  HST-TBL-SELECT
             TO  KJN-YMD                OF  PARM-SUSC0002-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SHORI-YMD              OF  PARM-SUSC0002-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SUSC0002-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SUSC0002-ARG1
      *----------  画面ＩＤ
           MOVE  CNS-GAMEN-ID
             TO  GAMEN                  OF  PARM-SUSC0002-ARG1
      *----------  更新ログインユーザ会社コード
           MOVE  COMPANY-CODE           OF  WK-AIFA
             TO  CMP-CD                 OF  PARM-SUSC0002-ARG1
      *----------  更新ユーザＩＤ
           MOVE  JOB-USER-ID            OF  WK-AIFA
             TO  JOB-USER-ID            OF  PARM-SUSC0002-ARG1
      *----------  予備１
           MOVE  SPACE
             TO  YOBI-1                 OF  PARM-SUSC0002-ARG1
      *----------  予備２
           MOVE  SPACE
             TO  YOBI-2                 OF  PARM-SUSC0002-ARG1
      *----------  ＧＩＰＳモード
           MOVE  WK-GIPS-MODE
             TO  GIPS-MODE              OF  PARM-SUSC0002-ARG1
      *----------  再処理要銘柄一覧テーブルID
           MOVE  WK-MG-TBL-ID
             TO  TAB-TKUSGP01           OF  PARM-SUSC0002-ARG1
      *----------  ポートフォリオ属性データエリア
           MOVE  PARM-SCZY4313-ARG2
             TO  PARM-SUSC0002-ARG4
      *----------  商品属性データエリア
           MOVE  PARM-SCZY4403-ARG2
             TO  PARM-SUSC0002-ARG5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSC0002-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分1=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0002-ARG1(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分2=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0002-ARG1(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分3=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0002-ARG1(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SHORI-YMD           OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":画面ＩＤ=["
      D             GAMEN               OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             CMP-CD              OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ=["
      D             JOB-USER-ID         OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備１=["
      D             YOBI-1              OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備２=["
      D             YOBI-2              OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード=["
      D             GIPS-MODE           OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":再処理要銘柄一覧テーブルID=["
      D             TAB-TKUSGP01        OF  PARM-SUSC0002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0002-ARG4:"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性データエリア=["
      D             PARM-SUSC0002-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0002-ARG5:"
      D    DISPLAY  CNS-PGM-ID":商品属性データエリア=["
      D             PARM-SUSC0002-ARG5"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0002  START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0002"             USING  PARM-SUSC0002-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0002  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0002)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴データを保存  正常  ***"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
               CONTINUE
      *----------<残タスク117（決算扱い方法の追加）  START>-------------
             WHEN  CNS-RTN-113
      *----------  サブ業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-SABU-GYOMU-ERR
               MOVE  CNS-OFF            TO  FLG-STOP
               PERFORM                  VARYING  WK-COUNT-4
                 FROM  CNS-1 BY CNS-1
                 UNTIL ( WK-COUNT-4 > CNS-999 OR FLG-STOP = CNS-ON )
                 IF  MSG-ID  OF  PARM-SUSC0002-ARG2(WK-COUNT-4)
                     NOT = SPACE
                 THEN
                   COMPUTE  WK-COUNT-5 = WK-COUNT-5 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-5=["WK-COUNT-5"]"
      *-----------------------------------------------------------------
                   IF  WK-COUNT-5 < CNS-1000
                   THEN
                     MOVE  MESSAGE-AREA
                       OF  PARM-SUSC0002-ARG2(WK-COUNT-4)
                       TO  WK-SCZY7080-AREA(WK-COUNT-5)
                   ELSE
                     MOVE  CNS-ON       TO  FLG-STOP
                   END-IF
                 ELSE
                   MOVE  CNS-ON         TO  FLG-STOP
                 END-IF
               END-PERFORM
      *----------  ワーク年月日実行ステータス
               IF  WK-KJN-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-KJN-STATUS
               ELSE
                 CONTINUE
               END-IF
               IF  WK-STATUS < CNS-4
               THEN
      *----------  ワーク実行ステータス
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS =  [" WK-STATUS "]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *----------<残タスク117（決算扱い方法の追加）  END>---------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴データを保存  エラー ***"
      *-----------------------------------------------------------------
      *----------  次のフェッチレコードフラグ
               MOVE  CNS-ON             TO  FLG-NEXT-FETCH-REC
      *----------  基準日実行ステータス
               MOVE  CNS-16             TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-030        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴データを保存  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0002-EXT.
           EXIT.
      ******************************************************************
      *    元本残高データを保存
      ******************************************************************
       SUSC0003-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高データを保存  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0003-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0003-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0003-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0003-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0003-ARG1
      *----------  決算日断面区分1
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0003-ARG1(CNS-1)
      *----------  決算日断面区分2
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0003-ARG1(CNS-2)
      *----------  決算日断面区分3
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0003-ARG1(CNS-3)
      *----------  基準日
           MOVE  H-KJN-YMD              OF  HST-TBL-SELECT
             TO  KJN-YMD                OF  PARM-SUSC0003-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SHORI-YMD              OF  PARM-SUSC0003-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SUSC0003-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SUSC0003-ARG1
      *----------  画面ＩＤ
           MOVE  CNS-GAMEN-ID
             TO  GAMEN                  OF  PARM-SUSC0003-ARG1
      *----------  更新ログインユーザ会社コード
           MOVE  COMPANY-CODE           OF  WK-AIFA
             TO  CMP-CD                 OF  PARM-SUSC0003-ARG1
      *----------  更新ユーザＩＤ
           MOVE  JOB-USER-ID            OF  WK-AIFA
             TO  JOB-USER-ID            OF  PARM-SUSC0003-ARG1
      *----------  予備１
           MOVE  SPACE
             TO  YOBI-1                 OF  PARM-SUSC0003-ARG1
      *----------  予備２
           MOVE  SPACE
             TO  YOBI-2                 OF  PARM-SUSC0003-ARG1
      *----------  ＧＩＰＳモード
           MOVE  WK-GIPS-MODE
             TO  GIPS-MODE              OF  PARM-SUSC0003-ARG1
      *----------  再処理要銘柄一覧テーブルID
           MOVE  WK-MG-TBL-ID
             TO  TAB-TKUSGP01           OF  PARM-SUSC0003-ARG1
      *----------  ポートフォリオ属性データエリア
           MOVE  PARM-SCZY4313-ARG2
             TO  PARM-SUSC0003-ARG4
      *----------  商品属性データエリア
           MOVE  PARM-SCZY4403-ARG2
             TO  PARM-SUSC0003-ARG5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSC0003-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分1=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0003-ARG1(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分2=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0003-ARG1(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分3=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0003-ARG1(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SHORI-YMD           OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":画面ＩＤ=["
      D             GAMEN               OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             CMP-CD              OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ=["
      D             JOB-USER-ID         OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備１=["
      D             YOBI-1              OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備２=["
      D             YOBI-2              OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード=["
      D             GIPS-MODE           OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":再処理要銘柄一覧テーブルID=["
      D             TAB-TKUSGP01        OF  PARM-SUSC0003-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0003-ARG4:"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性データエリア=["
      D             PARM-SUSC0003-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0003-ARG5:"
      D    DISPLAY  CNS-PGM-ID":商品属性データエリア=["
      D             PARM-SUSC0003-ARG5"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0003  START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0003"             USING  PARM-SUSC0003-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0003  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0003)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高データを保存  正常  ***"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
               CONTINUE
      *----------<残タスク117（決算扱い方法の追加）  START>-------------
             WHEN  CNS-RTN-113
      *----------  サブ業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-SABU-GYOMU-ERR
               MOVE  CNS-OFF            TO  FLG-STOP
               PERFORM                  VARYING  WK-COUNT-4
                 FROM  CNS-1 BY CNS-1
                 UNTIL ( WK-COUNT-4 > CNS-999 OR FLG-STOP = CNS-ON )
                 IF  MSG-ID  OF  PARM-SUSC0003-ARG2(WK-COUNT-4)
                     NOT = SPACE
                 THEN
                   COMPUTE  WK-COUNT-5 = WK-COUNT-5 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-5=["WK-COUNT-5"]"
      *-----------------------------------------------------------------
                   IF  WK-COUNT-5 < CNS-1000
                   THEN
                     MOVE  MESSAGE-AREA
                       OF  PARM-SUSC0003-ARG2(WK-COUNT-4)
                       TO  WK-SCZY7080-AREA(WK-COUNT-5)
                   ELSE
                     MOVE  CNS-ON       TO  FLG-STOP
                   END-IF
                 ELSE
                   MOVE  CNS-ON         TO  FLG-STOP
                 END-IF
               END-PERFORM
      *----------  ワーク年月日実行ステータス
               IF  WK-KJN-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-KJN-STATUS
               ELSE
                 CONTINUE
               END-IF
               IF  WK-STATUS < CNS-4
               THEN
      *----------  ワーク実行ステータス
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS =  [" WK-STATUS "]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *----------<残タスク117（決算扱い方法の追加）  END>---------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高データを保存  エラー ***"
      *-----------------------------------------------------------------
      *----------  次のフェッチレコードフラグ
               MOVE  CNS-ON             TO  FLG-NEXT-FETCH-REC
      *----------  基準日実行ステータス
               MOVE  CNS-16             TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-031        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高データを保存  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0003-EXT.
           EXIT.
      ******************************************************************
      *    DB-COMMIT-CHECK 処理
      ******************************************************************
       DB-COMMIT-CHCK-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DB-COMMIT-CHECK 処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":WK-KJN-STATUS = ["  WK-KJN-STATUS  "]"
      *-----------------------------------------------------------------
           IF  WK-KJN-STATUS NOT = CNS-16
           THEN
      *----------  ＤＢコミット処理
             PERFORM  DB-COMMIT2-RTN
           ELSE
      *----------  ＤＢロールバック処理
             PERFORM  DB-ROLLBACK-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DB-COMMIT-CHECK 処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT-CHCK-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミット処理
      ******************************************************************
       DB-COMMIT2-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミット処理  START  ***"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
             MOVE  CNS-16               TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-032          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-COMMIT-ERR       TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT2-EXT.
           EXIT.
      ******************************************************************
      *    運用成果進捗更新処理2
      ******************************************************************
       SUSC0406-2-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 運用成果進捗更新処理2 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0406-INOUT
                       PARM-RTNPKG
      *----------  セッション区分←"1":最終セッション
           MOVE  CNS-X-1
             TO  SESION-KBN             OF  PARM-SUSC0406-ARG1
      *----------  OL/BT区分←"BT":バッチ用
           MOVE  CNS-BT
             TO  OLBT-KBN               OF  PARM-SUSC0406-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0406-ARG2
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SUSC0406-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SUSC0406-ARG2
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SUSC0406-ARG2
      *----------  基準日
           MOVE  WK-KJN-YMD
             TO  KJN-YMD                OF  PARM-SUSC0406-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0406-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0406-ARG2
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0406-ARG2
      *----------  基準日FROM
           MOVE  WK-KIKAN-FR-9
             TO  KJN-YMD-FROM           OF  PARM-SUSC0406-ARG2
      *----------  実行ステータス
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-KJN-STATUS=["WK-KJN-STATUS"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-KJN-STATUS
             WHEN  ZERO
      *----------  実行ステータス0(正常終了)
               MOVE  CNS-STS-100
                 TO  JIKOU-STS          OF  PARM-SUSC0406-ARG2
             WHEN  CNS-2
      *----------  実行ステータス2(警告終了)
               MOVE  CNS-STS-200
                 TO  JIKOU-STS          OF  PARM-SUSC0406-ARG2
             WHEN  CNS-4
      *----------  実行ステータス4(業務エラー(続行可能))
               MOVE  CNS-STS-270
                 TO  JIKOU-STS          OF  PARM-SUSC0406-ARG2
             WHEN  CNS-6
      *----------  実行ステータス6(業務エラー（明細続行不可）)
               MOVE  CNS-STS-275
                 TO  JIKOU-STS          OF  PARM-SUSC0406-ARG2
             WHEN  CNS-8
      *----------  実行ステータス8(業務エラー(処理中メイン続行不可))
               MOVE  CNS-STS-277
                 TO  JIKOU-STS          OF  PARM-SUSC0406-ARG2
             WHEN  CNS-10
      *----------  実行ステータス10(業務エラー(業務タスク続行不可))
               MOVE  CNS-STS-375
                 TO  JIKOU-STS          OF  PARM-SUSC0406-ARG2
             WHEN  OTHER
      *----------  実行ステータス16(システムエラー)
               MOVE  CNS-STS-400
                 TO  JIKOU-STS          OF  PARM-SUSC0406-ARG2
           END-EVALUATE
      *----------  ポートフォリオ属性データエリア
           MOVE  PARM-SCZY4313-ARG2
             TO  PARM-SUSC0406-ARG5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSC0406-ARG1:"
      D    DISPLAY  CNS-PGM-ID":セッション区分=["
      D             SESION-KBN          OF  PARM-SUSC0406-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":OL/BT区分=["
      D             OLBT-KBN            OF  PARM-SUSC0406-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0406-ARG2:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日/基準年月=["
      D             KJN-YMD             OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":最終処理基準日=["
      D             SS-SYORI-YMD        OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ベビー未処理フラグ=["
      D             BABY-MISYORI-FLG    OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス=["
      D             JIKOU-STS           OF  PARM-SUSC0406-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0406-ARG5:"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性データエリア=["
      D             PARM-SUSC0406-ARG5"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0406  START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0406"             USING  PARM-SUSC0406-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0406  END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG       =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0406)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常の場合
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 運用成果進捗更新処理2 正常  ***"
      *-----------------------------------------------------------------
               CONTINUE
      *----------  データ取得不能の場合
             WHEN  CNS-RTN-113
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***運用成果進捗更新処理2 データ取得不能"
      *-----------------------------------------------------------------
               COMPUTE  WK-COUNT-3 = WK-COUNT-3 + CNS-1
      *----------  メッセージINSルーチン
               PERFORM  MSG-1000-RTN
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON              TO  FLG-MEISAI-GYOMU-ERR
      *---------- ファンドコード
               MOVE  WK-FUND-CD          OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD           OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 評価系列コード
               MOVE  WK-HYK-KRTU-CD      OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票ID
               MOVE  WK-REP-ID           OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-REP-ID
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 帳票任意コード
               MOVE  WK-REP-ANY-CD       OF  WK-PTF-GRP(WK-IDX-J)
                 TO  WK-GYOMU-REP-ANY-CD
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日From
               MOVE  WK-KJN-YMD
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 基準日To
               MOVE  WK-KJN-YMD
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- メッセージID
               MOVE  CNS-MSG-E000217
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *---------- 置換文字
               MOVE  CNS-SINTYOKU-DATA
                 TO  WK-GYOMU-TK-MOJI(WK-COUNT-3,CNS-1)
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-COUNT-3)
      *----------  実行可能区分フラグ
               MOVE  CNS-ON             TO  FLG-PTF-JIKOU-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-KJN-STATUS=["WK-KJN-STATUS"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
               IF  WK-KJN-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-KJN-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-STATUS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS= [" WK-STATUS "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
      *----------  上記以外の場合
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 運用成果進捗更新処理2エラー ***"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-033        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  運用成果進捗更新処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0406-2-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.7) 業務エラー1処理
      ******************************************************************
       GYOMU-ERR-1-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー1処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7080-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7080-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7080-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7080-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY7080-ARG1
      *----------  メッセージエリア
           MOVE  WK-GYOMU-ERR-INFO      TO  PARM-SCZY7080-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7080"             USING  PARM-SCZY7080-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7080)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ＤＢコミット処理
             PERFORM  DB-COMMIT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー1処理  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー1処理  エラー  ***"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-034          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー1処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GYOMU-ERR-1-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.8) 実行状況更新処理2
      ******************************************************************
       STATUS-KOUSIN-2-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況更新処理2 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7210-INOUT
                       PARM-RTNPKG
      *----------  セッション区分
           MOVE  CNS-X-1
             TO  SESSION-KBN            OF  PARM-SCZY7210-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7210-ARG2
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SCZY7210-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7210-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SCZY7210-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SCZY7210-ARG2
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SCZY7210-ARG2
      *----------  帳票ID
           MOVE  WK-REP-ID              OF  WK-PTF-GRP(WK-IDX-J)
             TO  REP-ID                 OF  PARM-SCZY7210-ARG2
      *----------  帳票任意コード
           MOVE  WK-REP-ANY-CD          OF  WK-PTF-GRP(WK-IDX-J)
             TO  REP-ANY-CD             OF  PARM-SCZY7210-ARG2
      *----------  基準日FROM
           MOVE  WK-KJN-YMD-FR          OF  WK-PTF-GRP(WK-IDX-J)
             TO  KJN-YMD-FROM           OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200より取得・基準日FROM=["
      D             WK-KJN-YMD-FR       OF  WK-PTF-GRP(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-STATUS
             WHEN  ZERO
      *----------  実行ステータス0(正常終了)
               MOVE  CNS-STS-100
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  CNS-2
      *----------  実行ステータス2(警告終了)
               MOVE  CNS-STS-200
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  CNS-4
      *----------  実行ステータス4(業務エラー(続行可能))
               MOVE  CNS-STS-270
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  CNS-6
      *----------  実行ステータス6(業務エラー(明細続行不可))
               MOVE  CNS-STS-275
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  CNS-8
      *----------  実行ステータス8(業務エラー(処理中メイン続行不可))
               MOVE  CNS-STS-277
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  CNS-10
      *----------  実行ステータス10(業務エラー(業務タスク続行不可))
               MOVE  CNS-STS-375
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  OTHER
      *----------  実行ステータス16(システムエラー)
               MOVE  CNS-STS-400
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7210-ARG:"
      D    DISPLAY  CNS-PGM-ID":SESSION-KBN   =["
      D             SESSION-KBN         OF  PARM-SCZY7210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD   =["
      D             RIYO-CMP-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":SYORI-YMD     =["
      D             SYORI-YMD           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":KIDOU-ID      =["
      D             KIDOU-ID            OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":FUND-CD       =["
      D             FUND-CD             OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PTF-CD        =["
      D             PTF-CD              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":HYK-KRTU-CD   =["
      D             HYK-KRTU-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":REP-ID        =["
      D             REP-ID              OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":REP-ANY-CD    =["
      D             REP-ANY-CD          OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":KJN-YMD-FROM  =["
      D             KJN-YMD-FROM        OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":JIKOU-STS     =["
      D             JIKOU-STS           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7210 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7210"             USING  PARM-SCZY7210-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7210 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7210)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況更新処理2  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況更新処理2 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-035          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況更新処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       STATUS-KOUSIN-2-EXT.
           EXIT.
      ******************************************************************
      *    3.3.後処理
      ******************************************************************
       END-RTN                SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":FLG-GYOMU-ERR=["FLG-GYOMU-ERR"]"
      *-----------------------------------------------------------------
      *----------  3.3.1.業務エラー2処理
           IF  FLG-GYOMU-ERR = CNS-ON
           THEN
             PERFORM  GYOMU-ERR-2-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 業務エラー2処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  3.3.2.ＤＢコミットリリース処理
           PERFORM  COMMIT-ORA-REL-RTN
      *----------  3.3.3.処理件数メッセージ出力処理
           PERFORM  SYORI-CNT-MSG-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  3.3.4.終了メッセージ出力処理
           IF  WK-RTN-CODE NOT < CNS-RTN-BT4
           THEN
             MOVE  CNS-U                TO  WK-ERR-SYUBETU
           ELSE
             MOVE  CNS-N                TO  WK-ERR-SYUBETU
           END-IF
           PERFORM  END-MSG-OUT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  END  ***"
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           STOP RUN  WK-RTN-CODE.
      ******************************************************************
      *    3.4.エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-SYSTEM-ERR=["FLG-SYSTEM-ERR"]"
      *-----------------------------------------------------------------
      *----------  3.4.1.エラー2情報追加処理
           IF  FLG-SYSTEM-ERR = CNS-OFF
           THEN
             PERFORM  ERR-MSG-OUT-RTN
           ELSE
             MOVE  CNS-OFF              TO  FLG-SYSTEM-ERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** エラー2情報追加処理しない ****"
      *-----------------------------------------------------------------
           END-IF
      *----------  3.4.2.ＤＢロールバックリリース処理
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
           IF  FLG-ORA-CONNECT         =  CNS-ON  THEN
             PERFORM  ROLLBACK-ORA-REL-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** ＤＢロールバックリリース処理"
      D            "しない****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  3.4.3.処理件数メッセージ出力処理
           PERFORM  SYORI-CNT-MSG-RTN
      *----------  3.4.4.終了メッセージ出力処理
           MOVE  CNS-S                  TO  WK-ERR-SYUBETU
           PERFORM  END-MSG-OUT-RTN
      *----------  プログラム終了(リターンコード=16)
           MOVE  CNS-RTN-BT16           TO  WK-RTN-CODE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CODE "]"
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           STOP RUN  WK-RTN-CODE.
      ******************************************************************
      *    業務エラー2処理
      ******************************************************************
       GYOMU-ERR-2-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー2処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7080-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7080-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7080-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7080-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY7080-ARG1
      *----------  メッセージエリア
           MOVE  WK-GYOMU-ERR-INFO      TO  PARM-SCZY7080-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日From=["
      D             KJN-YMD-FROM        OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日To=["
      D             KJN-YMD-TO          OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":メッセージID=["
      D             MSG-ID              OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":置換文字=["
      D             TIKAN-MOJI          OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ=["
      D             FREE-MSG            OF  PARM-SCZY7080-ARG2(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7080"             USING  PARM-SCZY7080-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7080)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ＤＢコミット処理
             PERFORM  DB-COMMIT3-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー2処理  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー2処理  エラー  ***"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-036          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー2処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GYOMU-ERR-2-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢロールバック処理
      ******************************************************************
       DB-ROLLBACK-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢロールバック処理  START  ***"
      *-----------------------------------------------------------------
      *----------  ROLLBACK
           EXEC SQL
               ROLLBACK
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(ROLLBACK)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢロールバック処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢロールバック処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
             MOVE  CNS-16               TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-037          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-ROLLBACK-ERR     TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢロールバック処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-ROLLBACK-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミットリリース処理
      ******************************************************************
       COMMIT-ORA-REL-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミットリリース処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT RELEASE
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT RELEASE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF                   TO  FLG-ORA-CONNECT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミットリリース処理 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミットリリース処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16              TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID                TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-038               TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900               TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE                   TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1              TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-COM-RELEASE-ERR       TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミットリリース処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       COMMIT-ORA-REL-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢロールバックリリース処理
      ******************************************************************
       ROLLBACK-ORA-REL-RTN   SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢロールバックリリース処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                TO  FLG-ORA-CONNECT
      *----------  ROLLBACK
           EXEC SQL
               ROLLBACK RELEASE
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(ROLLBACK RELEASE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢロールバックリリース処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢロールバックリリース処理"
      D             " システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-039          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-ROLLBACK-ERR     TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢロールバックリリース処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ROLLBACK-ORA-REL-EXT.
           EXIT.
      ******************************************************************
      *    処理件数メッセージ出力処理
      ******************************************************************
       SYORI-CNT-MSG-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  処理件数メッセージ出力処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7040-IN
      *----------  接続用パラメータの設定
      *----------  テーブル・ファイル数
           MOVE  CNS-1
             TO  TABLE-FILE-NUM         OF  PARM-SCZY7040-IN
      *----------  識別子(1)
           STRING
               WK-TBL-TKMZZR00
                " "
               WK-TBL-TKMZSR00
                " "
               WK-TBL-TKMZGZ00
               DELIMITED  BY  SIZE
               INTO  IDENT-ID           OF  PARM-SCZY7040-IN(1)
           END-STRING
      *----------  対象処理(1)
           MOVE  CNS-FETCH
             TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(1)
      *----------  取得件数(1)
           MOVE  WK-FETCH-KENSUU
             TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7040-ARG:"
      D    DISPLAY  CNS-PGM-ID":テーブル・ファイル数=["
      D             TABLE-FILE-NUM      OF  PARM-SCZY7040-IN   "]"
      D    DISPLAY  CNS-PGM-ID":識別子(1)           =["
      D             IDENT-ID            OF  PARM-SCZY7040-IN(1)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(1)         =["
      D             OBJECT-DISPOSAL     OF  PARM-SCZY7040-IN(1)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(1)         =["
      D             DISPOSAL-NUM        OF  PARM-SCZY7040-IN(1)"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7040 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7040"             USING  PARM-SCZY7040-IN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7040 END  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  処理件数メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SYORI-CNT-MSG-EXT.
           EXIT.
      ******************************************************************
      *    エラー2情報追加処理
      ******************************************************************
       ERR-MSG-OUT-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー2情報追加処理  START  ***"
      *-----------------------------------------------------------------
      *---------- エラーリターンパッケージ
           INITIALIZE  PARM-SCZY1170-IN
           MOVE  WK-SYS-ERR-INFO        TO  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG            =["
      D             PARM-SCZY1170-RTNPKG                      "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  エラー2情報追加処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-MSG-OUT-EXT.
           EXIT.
      ******************************************************************
      *    終了メッセージ出力処理
      ******************************************************************
       END-MSG-OUT-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  終了メッセージ出力処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":WK-ERR-SYUBETU=["WK-ERR-SYUBETU"]"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7020-INOUT
                       PARM-RTNPKG
      *----------  エラー種別
           MOVE  WK-ERR-SYUBETU
             TO  ERR-SYUBETU            OF  PARM-SCZY7020-ARG1
      *----------  プログラムID
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7020-ARG2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7020-ARG2
      *----------  基準日
           MOVE  WK-SHORI-YMD
             TO  KJN-YMD                OF  PARM-SCZY7020-ARG2
      *----------  実行処理ID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  JIKOU-SYORI-ID         OF  PARM-SCZY7020-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7020-ARG2
      *---------- リターンパッケージをセットする
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7020-ARG:"
      D    DISPLAY  CNS-PGM-ID":エラー種別    =["
      D             ERR-SYUBETU         OF  PARM-SCZY7020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":プログラムID  =["
      D             PGM-ID              OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":実行処理ID    =["
      D             JIKOU-SYORI-ID      OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日        =["
      D             KJN-YMD             OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID        =["
      D             KIDOU-ID            OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["
      D             PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7020"             USING  PARM-SCZY7020-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  終了メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-MSG-OUT-EXT.
           EXIT.
      ******************************************************************
      *    サブエラーメッセージ出力処理
      ******************************************************************
       SUB-ERR-MSG-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  サブエラーメッセージ出力処理"
      D             "  START  ***"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-ERR-CNT
           PERFORM                  VARYING  WK-ERR-CNT
             FROM  CNS-1 BY CNS-1
             UNTIL WK-ERR-CNT > COUNTER OF PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-ERR-CNT=["WK-ERR-CNT"]"
      *-----------------------------------------------------------------
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  ERR-PGM-ID           OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  ERR-POS              OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  DETAIL-RTN-CD        OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  DETAIL-RTN-CD-FLG    OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  FREE-MSG             OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-PERFORM
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  サブエラーメッセージ出力処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUB-ERR-MSG-EXT.
           EXIT.
      *----------<残タスク117（決算扱い方法の追加）  START>-------------
      ******************************************************************
      *     業務エラー3処理
      ******************************************************************
       GYOMU-ERR-3-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー3処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7080-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7080-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7080-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7080-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY7080-ARG1
      *----------  メッセージエリア
           MOVE  WK-SCZY7080-INFO       TO  PARM-SCZY7080-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7080"             USING  PARM-SCZY7080-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7080)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ＤＢコミット処理
             PERFORM  DB-COMMIT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー3処理  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー3処理  エラー  ***"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-040          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー3処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GYOMU-ERR-3-EXT.
           EXIT.
      *----------<残タスク117（決算扱い方法の追加）  END>---------------
      ******************************************************************
      *    評価履歴から運用成果残高データ保存
      ******************************************************************
       SUSC0004-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  評価履歴から運用成果残高データ保存"
      D             "  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0004-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0004-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-PTF-GRP(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0004-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-PTF-GRP(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0004-ARG1
      *----------  評価系列コード
           MOVE  WK-HYK-KRTU-CD         OF  WK-PTF-GRP(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0004-ARG1
      *----------  決算日断面区分1
           MOVE  WK-KSN-YMD-DMN-KBN-1
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0004-ARG1(CNS-1)
      *----------  決算日断面区分2
           MOVE  WK-KSN-YMD-DMN-KBN-2
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0004-ARG1(CNS-2)
      *----------  決算日断面区分3
           MOVE  WK-KSN-YMD-DMN-KBN-3
             TO  KSN-YMD-DMN-KBN        OF  PARM-SUSC0004-ARG1(CNS-3)
      *----------  基準日
           MOVE  H-KJN-YMD              OF  HST-TBL-SELECT
             TO  KJN-YMD                OF  PARM-SUSC0004-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SHORI-YMD              OF  PARM-SUSC0004-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SUSC0004-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SUSC0004-ARG1
      *----------  画面ＩＤ
           MOVE  CNS-GAMEN-ID
             TO  GAMEN                  OF  PARM-SUSC0004-ARG1
      *----------  更新ログインユーザ会社コード
           MOVE  COMPANY-CODE           OF  WK-AIFA
             TO  CMP-CD                 OF  PARM-SUSC0004-ARG1
      *----------  更新ユーザＩＤ
           MOVE  JOB-USER-ID            OF  WK-AIFA
             TO  JOB-USER-ID            OF  PARM-SUSC0004-ARG1
      *----------  予備１
           MOVE  SPACE
             TO  YOBI-1                 OF  PARM-SUSC0004-ARG1
      *----------  予備２
           MOVE  SPACE
             TO  YOBI-2                 OF  PARM-SUSC0004-ARG1
      *----------  ＧＩＰＳモード
           MOVE  WK-GIPS-MODE
             TO  GIPS-MODE              OF  PARM-SUSC0004-ARG1
      *----------  再処理要銘柄一覧テーブルID
           MOVE  WK-MG-TBL-ID
             TO  TAB-TKUSGP01           OF  PARM-SUSC0004-ARG1
      *----------  ポートフォリオ属性データエリア
           MOVE  PARM-SCZY4313-ARG2
             TO  PARM-SUSC0004-ARG4
      *----------  商品属性データエリア
           MOVE  PARM-SCZY4403-ARG2
             TO  PARM-SUSC0004-ARG5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSC0004-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分1=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0004-ARG1(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分2=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0004-ARG1(CNS-2)"]"
      D    DISPLAY  CNS-PGM-ID":決算日断面区分3=["
      D             KSN-YMD-DMN-KBN     OF  PARM-SUSC0004-ARG1(CNS-3)"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SHORI-YMD           OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":画面ＩＤ=["
      D             GAMEN               OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新ログインユーザ会社コード=["
      D             CMP-CD              OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":更新ユーザＩＤ=["
      D             JOB-USER-ID         OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備１=["
      D             YOBI-1              OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":予備２=["
      D             YOBI-2              OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ＧＩＰＳモード=["
      D             GIPS-MODE           OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":再処理要銘柄一覧テーブルID=["
      D             TAB-TKUSGP01        OF  PARM-SUSC0004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0004-ARG4:"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ属性データエリア=["
      D             PARM-SUSC0004-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":SUSC0004-ARG5:"
      D    DISPLAY  CNS-PGM-ID":商品属性データエリア=["
      D             PARM-SUSC0004-ARG5"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0004  START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0004"             USING  PARM-SUSC0004-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0004  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0004)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
             WHEN  CNS-RTN-110
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高データを保存  正常  ***"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-100
             WHEN  CNS-RTN-113
      *----------  サブ業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-SABU-GYOMU-ERR
               MOVE  CNS-OFF            TO  FLG-STOP
               PERFORM                  VARYING  WK-COUNT-4
                 FROM  CNS-1 BY CNS-1
                 UNTIL ( WK-COUNT-4 > CNS-999 OR FLG-STOP = CNS-ON )
                 IF  MSG-ID  OF  PARM-SUSC0004-ARG2(WK-COUNT-4)
                     NOT = SPACE
                 THEN
                   COMPUTE  WK-COUNT-5 = WK-COUNT-5 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-5=["WK-COUNT-5"]"
      *-----------------------------------------------------------------
                   IF  WK-COUNT-5 < CNS-1000
                   THEN
                     MOVE  MESSAGE-AREA
                       OF  PARM-SUSC0004-ARG2(WK-COUNT-4)
                       TO  WK-SCZY7080-AREA(WK-COUNT-5)
                   ELSE
                     MOVE  CNS-ON       TO  FLG-STOP
                   END-IF
                 ELSE
                   MOVE  CNS-ON         TO  FLG-STOP
                 END-IF
               END-PERFORM
      *----------  ワーク年月日実行ステータス
               IF  WK-KJN-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-KJN-STATUS
               ELSE
                 CONTINUE
               END-IF
               IF  WK-STATUS < CNS-4
               THEN
      *----------  ワーク実行ステータス
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS =  [" WK-STATUS "]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE= [" WK-RTN-CODE "]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  評価履歴から運用成果残高データ保存"
      D             "  エラー ***"
      *-----------------------------------------------------------------
      *----------  次のフェッチレコードフラグ
               MOVE  CNS-ON             TO  FLG-NEXT-FETCH-REC
      *----------  基準日実行ステータス
               MOVE  CNS-16             TO  WK-KJN-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-041        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  評価履歴から運用成果残高データ保存"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0004-EXT.
           EXIT.
      ******************************************************************
      *    期間FROM～期間TOの月数の取得
      ******************************************************************
       KJN-FR-MONTH-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":** 期間FROM～期間TOの月数取得 START **"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1020-INOUT
                       PARM-RTNPKG
                       WK-KJN-FR-MONTH
      *---------- 機能区分
           MOVE  CNS-X-2
             TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *---------- 基準年月日1
           MOVE  WK-SUB-KIKAN-FR
             TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-ARG1
      *---------- 計算ベース区分
           MOVE  CNS-X-1
             TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *---------- 前後区分1
           MOVE  SPACE
             TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *---------- 前後区分2
           MOVE  CNS-X-1
             TO  IXCAL-ZENGO-KBN-2      OF  PARM-SCZY1020-ARG1
      *---------- 単位区分
           MOVE  CNS-X-2
             TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *---------- 日数
           MOVE  ZERO
             TO  IXCAL-DAYS             OF  PARM-SCZY1020-ARG1
      *---------- 基準年月日2
           MOVE  WK-SUB-KIKAN-TO
             TO  IXCAL-KJN-YMD2         OF  PARM-SCZY1020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク電文情報.基準日FROM =["
      D             I-KJN-YMD-FR        OF  WK-DENBUN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":機能区分      =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日1   =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":計算ベース区分=["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":前後区分1     =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":前後区分2     =["
      D             IXCAL-ZENGO-KBN-2   OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":単位区分      =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":日数          =["
      D             IXCAL-DAYS          OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日2   =["
      D             IXCAL-KJN-YMD2      OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1020"             USING  PARM-SCZY1020-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)            =["
      D             RTN-CD   OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  IXCAL-DAYS                 OF PARM-SCZY1020-ARG1
               TO  WK-KJN-FR-MONTH
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間FROM～期間TOの月数取得正常"
      D    DISPLAY  CNS-PGM-ID":取得した日数=["
      D                       IXCAL-DAYS      OF PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク月数=["WK-KJN-FR-MONTH"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間FROM～期間TOの月数取得異常"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16       TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG        TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-049        TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD             OF  PARM-RTNPKG
                                          (COUNTER OF PARM-RTNPKG)
                                      TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":** 期間FROM～期間TOの月数取得 END **"
      *-----------------------------------------------------------------
           CONTINUE.
       KJN-FR-MONTH-EXT.
           EXIT.
      ******************************************************************
      *    ワーク期間(FROM)_補充、ワーク期間(TO)_補充を設定する
      ******************************************************************
       SUB-KIKAN-TO-FR-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワーク期間(FROM)_補充、"
      D             "ワーク期間(TO)_補充を設定  START  ***"
      *-----------------------------------------------------------------
           MOVE  I-KJN-YMD-FR           OF  WK-DENBUN-INFO
             TO  WK-SUB-KIKAN-FR        OF  WK-SUB-KIKAN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク電文情報.基準日FROM =["
      D             I-KJN-YMD-FR        OF  WK-DENBUN-INFO "]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間(FROM)_補充     =["
      D             WK-SUB-KIKAN-FR     OF  WK-SUB-KIKAN "]"
      D    DISPLAY  CNS-PGM-ID":ワーク電文情報.基準日TO   =["
      D             I-KJN-YMD-TO        OF  WK-DENBUN-INFO "]"
      *-----------------------------------------------------------------
           IF  I-KJN-YMD-TO OF WK-DENBUN-INFO NOT = SPACE
           THEN
             MOVE  I-KJN-YMD-TO         OF  WK-DENBUN-INFO
               TO  WK-SUB-KIKAN-TO      OF  WK-SUB-KIKAN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク電文情報.基準日TO =["
      D             I-KJN-YMD-TO        OF  WK-DENBUN-INFO "]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間(TO)_補充     =["
      D             WK-SUB-KIKAN-TO     OF  WK-SUB-KIKAN "]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間(FROM)_補充     =["
      D             WK-SUB-KIKAN-FR     OF  WK-SUB-KIKAN "]"
      *-----------------------------------------------------------------
             IF  WK-SUB-KIKAN-FR-9 > WK-SUB-KIKAN-TO-9
             THEN
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT10       TO  WK-RTN-CODE
      *----------  ワーク業務エラーを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               MOVE  WK-SUB-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                                        OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-SUB-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                                        OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-E000257
                 TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  CNS-KJN-TO
                 TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
               MOVE  CNS-KJN-FROM
                 TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-2)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-GYOMU-ERR
      *----------  後処理
               PERFORM  END-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
             MOVE  WK-SHORI-YMD
               TO  WK-SUB-KIKAN-TO      OF  WK-SUB-KIKAN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークシステム日付        =["
      D             WK-SHORI-YMD "]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間(TO)_補充       =["
      D             WK-SUB-KIKAN-TO     OF  WK-SUB-KIKAN "]"
      D    DISPLAY  CNS-PGM-ID":ワーク期間(FROM)_補充     =["
      D             WK-SUB-KIKAN-FR     OF  WK-SUB-KIKAN "]"
      *-----------------------------------------------------------------
             IF  WK-SUB-KIKAN-FR-9 > WK-SUB-KIKAN-TO-9
             THEN
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT10       TO  WK-RTN-CODE
      *----------  ワーク業務エラーを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               MOVE  WK-SUB-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                                        OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-SUB-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                                        OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-E000259
                 TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  CNS-KJN-FROM
                 TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
               STRING  CNS-SYS-DATE
                       WK-SHORI-YMD
                 INTO  WK-GYOMU-TK-MOJI(CNS-1,CNS-2)
               END-STRING
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-GYOMU-ERR
      *----------  後処理
               PERFORM  END-RTN
             ELSE
               CONTINUE
             END-IF
           END-IF
      *----------  期間FROM～期間TOの月数のチェック
           PERFORM  KJN-FR-MONTH-RTN
      *
           IF  WK-KJN-FR-MONTH NOT > CNS-13
           THEN
             CONTINUE
           ELSE
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT10         TO  WK-RTN-CODE
      *----------  ワーク業務エラーを編集
             INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
             MOVE  WK-SUB-KIKAN-FR
               TO  WK-GYOMU-KJN-YMD-FROM
                                        OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
             MOVE  WK-SUB-KIKAN-TO
               TO  WK-GYOMU-KJN-YMD-TO  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
             MOVE  CNS-MSG-E000430
               TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
             MOVE  CNS-SITEYI-KIKAN
               TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
             MOVE  CNS-TUKI
               TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-2)
      *----------  後処理業務エラーフラグ
             MOVE  CNS-ON           TO  FLG-GYOMU-ERR
      *----------  後処理
             PERFORM  END-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワーク期間(FROM)_補充、"
      D             "ワーク期間(TO)_補充を設定  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUB-KIKAN-TO-FR-EXT.
           EXIT.
