      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ2110
      * プログラム名称 : 未収配当計算
      * 処理概要       : 権利落日取引の未収配当データ作成処理して、
      *                  変更日の未収配当データ作成処理して、
      *                  入金取引の未収配当データ作成処理する。
      * 参照ＤＢ       : 対象取引情報(TKMZBW04),
      *                  取引テーブル(TKMXTR00),
      *                  未収収益計算データ(TKMZBW08),
      *                  未収収益(TKMZMS00)
      * 更新ＤＢ       : 未収収益計算データ(TKMZBW08)
      * 引数           : IN  銘柄別断面情報
      *                : IN  基準日断面情報
      *                : IN  通貨デフォールト端数処理
      *                : IN  各属性データ
      *                : OUT ワークエラー区分
      *                : OUT RTNパッケージ
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- ----  ---------  ------  ------------------------
      * 20080219   新規  SCS        王偉領   新規作成
      * 20080424   修正  SCS        尹吉磊
      * 20080718   修正  SCS        梁偉     テーマMZ-009対応
      * 20081219   修正  SCS        王粒
      * 20081224   修正  SCS        王粒     残タスク100,128対応
      * 20090206   修正  SCS        徐曉俊   残タスク146対応
      * 20090316   修正  SCS        王飛     残タスク202対応
      * 20090508   修正  SCS        王飛     テーマ91対応
      * 20090617   修正  SCS        王飛     総合障害675対応
      * 20090618   修正  SCS        王飛     総合障害953対応
      * 20090702   修正  SCS        王飛     総合障害1331
      * 20090714   修正  SCS        王飛     総合障害836
      * 20090720   修正  SCS        王飛     総合障害1498
      * 20090727   修正  SCS        王飛     総合障害1579対応
      * 20090728   修正  SCS        王飛     総合障害1678対応
      * 20090813   修正  SCS        王飛     総合障害2062
      * 20090910   修正  SCS        楊超     総合障害1870
      * 20090922   修正  SCS        惲旭来   総合障害1870
      * 20091218   修正  SCS        何傑文   テーマ2285
      * 20100209   修正  SCS        孫潔雲   マスタデータのBL側での
      *                                      オンメモリ化
      * 20101208   修正  SCS        楊超     テーマ3131
      * @SEINO@@   修正  BTH        山崎     性能改善対応
      * 20110419   修正  SCS        兪志杰   性能改善対応
      * 20130116   修正  SCS        雷学武   テーマ3467
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ2110.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-02-19.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ2110".
      *----------  対象取引情報(TKMZBW04)
         05  CNS-TBL-TKMZBW04      PIC  X(08)  VALUE  "TKMZBW04".
      *----------  取引テーブル(TKMXTR00)
         05  CNS-TBL-TKMXTR00      PIC  X(08)  VALUE  "TKMXTR00".
      *----------  未収収益計算データ(TKMZBW08)
         05  CNS-TBL-TKMZBW08      PIC  X(08)  VALUE  "TKMZBW08".
      *----------  未収収益(TKMZMS00)
         05  CNS-TBL-TKMZMS00      PIC  X(08)  VALUE  "TKMZMS00".
      *----------  未収計算対象フラグ
         05  CNS-MSKS-TARGET-FLG-1 PIC  X(01)  VALUE  "1".
      *----------  源泉税
         05  CNS-GSZ-2             PIC  X(01)  VALUE  "2".
      *----------  未収計算種類
         05  CNS-MSKS-SHRU-21      PIC  X(02)  VALUE  "21".
         05  CNS-MSKS-SHRU-22      PIC  X(02)  VALUE  "22".
      *----------  現地源泉税課税区分
         05  CNS-G-GSZ-KAZEI-KBN-1 PIC  X(01)  VALUE  "1".
      *----------  パラメータエラーメッセージ
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-SQL-MSG-INSERT    PIC  X(17)  VALUE
                                               " SQL-MSG(INSERT):".
         05  CNS-SQL-MSG-UPDATE    PIC  X(17)  VALUE
                                               " SQL-MSG(UPDATE):".
      *---------- 計算項目
         05  CNS-CALC-KUMK-00      PIC  X(02)  VALUE  "00".
      *---------- 市場通貨／運用通貨区分
         05  CNS-SJUY-TUKA-KBN-1   PIC  X(01)  VALUE  "1".
      *----------  データフラグ
         05  CNS-FLG-0             PIC  X(01)  VALUE  "0".
         05  CNS-FLG-1             PIC  X(01)  VALUE  "1".
         05  CNS-FLG-01            PIC  X(02)  VALUE  "01".
         05  CNS-FLG-02            PIC  X(02)  VALUE  "02".
         05  CNS-FLG-03            PIC  X(02)  VALUE  "03".
         05  CNS-FLG-04            PIC  X(02)  VALUE  "04".
      *----------  臨時常量
         05  CNS-1                 PIC  9(01)  VALUE  1.
         05  CNS-100               PIC  9(03)  VALUE  100.
         05  CNS-500               PIC  9(03)  VALUE  500.
         05  CNS-ALL-9             PIC  9(12)V9(06)
                                   VALUE  999999999999.999999.
         05  CNS-ALL-9-0           PIC  9(15)V9(03)
                                   VALUE  999999999999999.999.
      *----------  予実区分'1'(予想)
         05  CNS-YOJI-KBN-1        PIC  X(01)  VALUE  "1".
      *----------  予実区分'2'(実績)
         05  CNS-YOJI-KBN-2        PIC  X(01)  VALUE  "2".
      ******************************************************************
      *    フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *----------  対象取引情報データカーソルオープンフラグ１
         05  FLG-TKMZBW04-1-CR-OPEN
                                   PIC  9(01).
      *----------  対象取引情報データカーソルオープンフラグ2
         05  FLG-TKMZBW04-2-CR-OPEN
                                   PIC  9(01).
      *----------  取引テーブルカーソルオープンフラグ2
         05  FLG-TKMXTR00-2-CR-OPEN
                                   PIC  9(01).
      *----------  未収収益計算データカーソルオープンフラグ1
         05  FLG-TKMZBW08-1-CR-OPEN
                                   PIC  9(01).
      *----------  未収収益カーソルオープンフラグ1
         05  FLG-TKMZMS00-1-CR-OPEN
                                   PIC  9(01).
         05  FLG-TKMZBW08-S3-INSERT                                     @SEINO@@
                                   PIC  9(01).                          @SEINO@@
         05  FLG-TKMZBW08-S10-UPDATE                                    @SEINO@@
                                   PIC  9(01).                          @SEINO@@
      *----------  入金日以前の未収配当データカーソルオープンフラグ
      *   05  FLG-NYUKN-CR-OPEN     PIC  9(01).
         05  FLG-NK-CR-OPEN        PIC  9(01).
       01  FLG-AREA-2.                                                  @SEINO@@
      *----------  FETCH終了フラグ
         05  FLG-CYCLES-EXIT-1     PIC  9(01).
         05  FLG-CYCLES-EXIT-2     PIC  9(01).
      *----------  ワーク直前未収収益計算データフラグ
         05  FLG-WK-TKMZBW08       PIC  X(01).
      *----------  ワーク直前未収収益フラグ
         05  FLG-WK-TKMZMS00       PIC  X(01).
      *----------  LOOP
         05  FLG-LOOP              PIC  9(01).
       01  FIRST-SW                PIC  X(03)  VALUE  'YES'.            @SEINO@@
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-SMZJ2110-ARG1.
      *----------  銘柄別断面情報
           10  WK-TKMZBW03-PARM.
      *----------  銘柄別断面情報.処理実行日
             15  WK-SYORI-YMD      PIC  S9(08).
      *----------  銘柄別断面情報.起動ID
             15  WK-KIDOU-ID       PIC  X(04).
      *----------  銘柄別断面情報.利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  銘柄別断面情報.ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  銘柄別断面情報.ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  銘柄別断面情報.基準日
             15  WK-KJN-YMD        PIC  S9(08).
      *----------  銘柄別断面情報.銘柄コード
             15  WK-MEG-CD         PIC  X(15).
      *----------  銘柄別断面情報.証券種別コード
             15  WK-SEC-SBT-CD     PIC  X(04).
      *----------  銘柄別断面情報.資産負債・買建売建フラグ
             15  WK-TATE-FLG       PIC  X(01).
      *----------  銘柄別断面情報.玉ID
             15  WK-GYOKU-ID       PIC  X(10).
      *----------  銘柄別断面情報.市場通貨コード
             15  WK-SIJO-TUKA-CD   PIC  X(04).
      *----------  基準日断面情報
           10  WK-TKMZBW02-PARM.
      *----------  開始基準日の翌日
             15  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  料率パターンコード
             15  WK-COMMISSION-PATTERN
                                   PIC  X(04).
      *----------  未収配当計上割合
             15  WK-MISYU-HAITOU-WARIAI
                                   PIC  S9(08)V9(10).
      *----------  通貨デフォールト端数処理
           10  WK-TUKA-DEF-HASU-SYRI-PARM.
      *----------  運用通貨端数処理方法
             15  WK-LC-HS          PIC  X(01).
      *----------  運用通貨小数点以下桁数
             15  WK-LC-SYOSU-TENYIKA-KETASU
                                   PIC  S9(02).
      *----------  市場通貨端数処理方法
             15  WK-BC-HS          PIC  X(01).
      *----------  市場通貨小数点以下桁数
             15  WK-BC-SYOSU-TENYIKA-KETASU
                                   PIC  S9(02).
      *----------  各属性データ
           10  WK-ZOK-DATA-PARM.
      *----------  各属性データ.現地源泉税課税区分
             15  WK-G-GSZ-KAZEI-KBN
                                   PIC  X(01).
      *----------  投資対象国コード
           10  WK-TSTSK-CD         PIC  X(04).
      *----------  数量単位
           10  WK-SURYO-TANI       PIC  S9(12)V9(06).
      *----------  ワーク市場通貨未収収益
         05  WK-SJTK-MS-SHEKI      PIC  S9(15)V9(03).
      *----------  ワーク市場通貨源泉税
         05  WK-SJTK-GENSEN-TAX    PIC  S9(15)V9(03).
      *----------  ワーク市場国源泉税率
         05  WK-SJTK-KUNI-GSZ-TAX-RT
                                   PIC  S9(08)V9(10).
      *----------  ワーク市場通貨未収収益(中間)
         05  WK-SJTK-MS-SHEKI-CHKN PIC  S9(18)V9(18).
      *----------  ワーク市場通貨源泉税(中間)
         05  WK-SJTK-GENSEN-TAX-CHKN
                                   PIC  S9(18)V9(18).
      *----------  ワーク配当合計単価
         05  WK-HAIT-TTL-TNK       PIC  S9(08)V9(10).
      *----------  ワーク権利落日（直前データ検索用）
         05  WK-KENRI-OTI-YMD-SE   PIC  S9(08).
      *----------  ワーク適用開始日（直前データ検索用）
         05  WK-TEKIYO-FROM-SE     PIC  S9(08).
      *----------  未収配当情報データなしフラグ
         05  WK-MISYU-HT-DATA-NASI-FLG
                                   PIC  9(01).
      *----------  ワーク権利落日配当情報
         05  WK-KENRI-OTI-HAIT.
           10  WK-KENRI-OTHT       OCCURS  500.
      *----------  権利落日
             15  WK-KENRI-OTI-YMD  PIC  S9(08).
      *----------  適用開始日
             15  WK-TEKIYO-FROM    PIC  S9(08).
      *----------  配当合計単価
             15  WK-HAIT-TTL-TK    PIC  S9(08)V9(10).
      *----------  予実区分
             15  WK-YOJI-KBN       PIC  X(01).
      *----------  ワーク変更日配当情報
         05  WK-REVISE-YMD-HAIT.
           10  WK-REVISE-YMDHT     OCCURS  500.
      *----------  権利落日
             15  WK-KENRI-OTI-YMD  PIC  S9(08).
      *----------  適用開始日
             15  WK-TEKIYO-FROM    PIC  S9(08).
      *----------  配当合計単価
             15  WK-HAIT-TTL-TK    PIC  S9(08)V9(10).
      *----------  予実区分
             15  WK-YOJI-KBN       PIC  X(01).
      *----------  ワーク権利落日配当情報件数
         05  WK-KENRI-OTI-HAIT-KENSU
                                   PIC  S9(04).
      *----------  ワーク変更日配当情報件数
         05  WK-REVISE-YMD-HAIT-KENSU
                                   PIC  S9(04).
      *----------  データありフラグ
         05  WK-DATA-ARI-FLG       PIC  9(01).
      *----------  ワーク直前未収収益計算データ
         05  WK-TKMZBW08.
      *----------  適用開始日
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *----------  権利付数量
           10  WK-RIT-SRY          PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  権利落日
           10  WK-KENRI-OTI-YMD    PIC  S9(08).
      *----------  未入金対象数量残高
           10  WK-MNK-TSHO-SRYZN   PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  WK-SJTK-MS-SHEKI-T  PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX-T
                                   PIC  S9(15)V9(03).
      *----------  ワーク直前未収収益
         05  WK-TKMZMS00.
      *----------  適用開始日
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *----------  権利付数量
           10  WK-RIT-SRY          PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  権利落日
           10  WK-KENRI-OTI-YMD    PIC  S9(08).
      *----------  未入金対象数量残高
           10  WK-MNK-TSHO-SRYZN   PIC  S9(12)V9(06).
      *----------  未入金対象数量残高（入力値）
           10  WK-MNK-TSHO-SRYZN-IN
                                   PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  WK-SJTK-MS-SHEKI-T  PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX-T
                                   PIC  S9(15)V9(03).
      *----------  市場通貨未収収益（入力値）
           10  WK-SJTK-MS-SHEKI-IN PIC  S9(15)V9(03).
      *----------  市場通貨源泉税（入力値）
           10  WK-SJTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  運用通貨未収収益（入力値）
           10  WK-UYTK-MS-SHEKI-IN PIC  S9(15)V9(03).
      *----------  運用通貨源泉税（入力値）
           10  WK-UYTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  評価為替レート（入力値）
           10  WK-HYK-KWS-IN       PIC  S9(08)V9(10).
      *----------  源泉税評価為替レート（入力値）
           10  WK-GENS-TAX-HYK-KWS-IN
                                   PIC  S9(08)V9(10).
      *----------  ワーク直前未収収益確定
         05  WK-TKMZMS00-KAKUTE.
      *----------  権利付数量
           10  WK-RIT-SRY          PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  権利落日
           10  WK-KENRI-OTI-YMD    PIC  S9(08).
      *----------  未入金対象数量残高
           10  WK-MNK-TSHO-SRYZN   PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  WK-SJTK-MS-SHEKI-K  PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  WK-SJTK-GENSEN-TAX-K
                                   PIC  S9(15)V9(03).
      *----------  未入金対象数量残高
         05  WK-SRYZN-CALC         PIC  S9(12)V9(06).
      *----------  入力データ
         05  WK-IN-SUTI            PIC  S9(18)V9(18).
      *----------  ポジション
         05  WK-ERR-POS            PIC  X(04).
         05  WK-ERR-POS1           PIC  X(04).
         05  WK-ERR-POS2           PIC  X(04).
         05  WK-ERR-POS3           PIC  X(04).
      *----------  出力データ
         05  WK-OUT-SUTI           PIC  S9(18)V9(18).
      *----------  INDEX
         05  WK-INDEX1             PIC  9(03).
         05  WK-INDEX2             PIC  9(03).
         05  WK-INDEX3             PIC  9(03).
      *----------  基準値
         05  WK-KJN-TI             PIC  S9(15)V9(03).
      *----------  ワーク権利落日 ワーク適用開始日
         05  WK-YMD.
      *----------  権利落日
           10  WK-KENRI-OTI-YMD    PIC  S9(08).
      *----------  適用開始日
           10  WK-TEKIYO-FROM      PIC  S9(08).
      *----------  ワーク終了フラグ
         05  WK-END-FLG            PIC  9(01).
      *----------  データ計数←0
         05  WK-DATA-KEISU         PIC  9(03).
      *----------  次のカーソルフェッチフラグ
         05  WK-SKIP-FLG           PIC  9(01).
      *----------FETCH終了フラグ
      *   05  WK-1-10-FETCH-FLG     PIC  9(01).
      *----------  ワーク変更日未収収益計算フラグ
         05  WK-HKM-FLG            PIC  9(01).
      *----------  ワーク入金計算フラグ
         05  WK-NYUKN-FLG          PIC  9(01).
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      ******************************************************************
      *    ＯＲＡＣＬＥホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  対象取引情報(別紙1-1)
         05  H-TKMZBW04-1.
      *----------  権利数量_合計
           10  H-KENRI-SURYO-TTL   PIC  S9(13)V9(06).
      *----------  約定日
           10  H-YKJ-YMD           PIC  S9(08).
      *----------  対象取引情報(別紙1-5)
         05  H-TKMZBW04.
      *----------  原取引ID
           10  H-TORI-ID           PIC  S9(10).
      *----------  対象取引情報(別紙1-1,別紙1-5)
         05  H-TKMZBW04-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *----------  未収計算対象フラグ
           10  H-MSKS-TARGET-FLG   PIC  X(01).
      *----------  未収計算種類
           10  H-MSKS-SHRU         PIC  X(02).
      *----------  取引テーブル(別紙1-6)
         05  H-TKMXTR00-1.
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  権利数量
           10  H-KENRI-SURYO       PIC  S9(12)V9(06).
      *----------  効力発生日
           10  H-KOURYOKU-YMD      PIC  S9(08).
      *----------  取引テーブル(別紙1-6)
         05  H-TKMXTR00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  未収収益計算データ(別紙1-3,別紙1-4,別紙1-7)
         05  H-TKMZBW08-I.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  権利付数量
           10  H-RIT-SRY           PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  H-SJTK-MS-SHEKI     PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  未入金対象数量残高
           10  H-MNK-TSHO-SRYZN    PIC  S9(12)V9(06).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  未収収益計算データ(別紙1-8)
         05  H-TKMZBW08.
      *----------  権利付数量
           10  H-RIT-SRY           PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  未入金対象数量残高
           10  H-MNK-TSHO-SRYZN    PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  H-SJTK-MS-SHEKI     PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  未収収益計算データ(別紙1-8)
         05  H-TKMZBW08-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  未収収益(別紙1-9)
         05  H-TKMZMS00.
      *----------  権利付数量
           10  H-RIT-SRY           PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  未入金対象数量残高
           10  H-MNK-TSHO-SRYZN    PIC  S9(12)V9(06).
      *----------  未入金対象数量残高（入力値）
           10  H-MNK-TSHO-SRYZN-IN PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  H-SJTK-MS-SHEKI     PIC  S9(15)V9(03).
      *----------  市場通貨未収収益（入力値）
           10  H-SJTK-MS-SHEKI-IN  PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  市場通貨源泉税（入力値）
           10  H-SJTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  運用通貨未収収益（入力値）
           10  H-UYTK-MS-SHEKI-IN  PIC  S9(15)V9(03).
      *----------  運用通貨源泉税（入力値）
           10  H-UYTK-GENSEN-TAX-IN
                                   PIC  S9(15)V9(03).
      *----------  評価為替レート（入力値）
           10  H-HYK-KWS-IN        PIC  S9(08)V9(10).
      *----------  源泉税評価為替レート（入力値）
           10  H-GENS-TAX-HYK-KWS-IN
                                   PIC  S9(08)V9(10).
      *----------  未収収益(別紙1-9)
         05  H-TKMZMS00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  入金日以前の未収配当データ(別紙1-10)
         05  H-NYUKN-IRAI.
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
         05  H-NYUKN-IRAI-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD1      PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD1          PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD1           PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD1           PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD1       PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG1         PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID1         PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM1      PIC  S9(08).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD2      PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD2          PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD2           PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD2           PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD2       PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG2         PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID2         PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM2      PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD2        PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID2         PIC  X(04).
      *----------  未収収益計算データ(別紙1-12)
         05  H-TKMZBW08-U.
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  権利付数量
           10  H-RIT-SRY           PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  H-SJTK-MS-SHEKI     PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
      *----------  未入金対象数量残高
           10  H-MNK-TSHO-SRYZN    PIC  S9(12)V9(06).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  入金日以前の未収配当データの権利落日を取得(別紙1-13)
         05  H-SQL-1-13-S.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
         05  H-SQL-1-13.
      *----------  権利付数量
           10  H-RIT-SRY           PIC  S9(12)V9(06).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  適用開始日
           10  H-TEKIYO-FROM       PIC  S9(08).
      *----------  権利落日
           10  H-KENRI-OTI-YMD     PIC  S9(08).
      *----------  未入金対象数量残高
           10  H-MNK-TSHO-SRYZN    PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  H-SJTK-MS-SHEKI     PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  H-SJTK-GENSEN-TAX   PIC  S9(15)V9(03).
         05  SQLSTMT1              PIC  X(437).                         @3212SEINO@@
         05  SQLSTMT2              PIC  X(560).                         @3212SEINO@@
         05  SQLSTMT3              PIC  X(459).                         @3212SEINO@@
         05  SQLSTMT4              PIC  X(539).                         @3212SEINO@@
         05  SQLSTMT5              PIC  X(394).                         @3212SEINO@@
         05  SQLSTMT6              PIC  X(123).                         @3212SEINO@@
         05  SQLSTMT8              PIC  X(2020).                        @3212SEINO@@
         05  SQLSTMT9              PIC  X(603).                         @3212SEINO@@
           EXEC  SQL  END      DECLARE  SECTION  END-EXEC.
      ******************************************************************
      *            SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  対象取引情報を取得SQL文(別紙1-1)
         05  SQL-SELECT-TKMZBW04-1.
           10  S-SELECT-TKMZBW04-1.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  権利数量_合計
             15  FILLER            PIC  X(44)  VALUE
               " NVL(SUM(KENRI_SURYO),0) AS KENRI_SURYO_TTL,".
      *----------  約定日
             15  FILLER            PIC  X(08)  VALUE
               " YKJ_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " FROM ".
             15  SQL-TBL-TKMZBW04-1
                                   PIC  X(13).
      *---------- WHERE
           10  S-WHERE-TKMZBW04-1.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(24)  VALUE
               "SYORI_YMD = :P_SYORI_YMD".
      *----------  起動ID
             15  FILLER            PIC  X(27)  VALUE
               " AND KIDOU_ID = :P_KIDOU_ID".
      *----------  利用会社コード
             15  FILLER            PIC  X(33)  VALUE
               " AND RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)  VALUE
               " AND FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
               " AND PTF_CD = :P_PTF_CD".
      *----------  基準日
             15  FILLER            PIC  X(25)  VALUE
               " AND KJN_YMD = :P_KJN_YMD".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)  VALUE
               " AND MEG_CD = :P_MEG_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)  VALUE
               " AND SEC_SBT_CD = :P_SEC_SBT_CD".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)  VALUE
               " AND TATE_FLG = :P_TATE_FLG".
      *----------  玉ID
             15  FILLER            PIC  X(27)  VALUE
               " AND GYOKU_ID = :P_GYOKU_ID".
      *----------  未収計算対象フラグ
             15  FILLER            PIC  X(41)  VALUE
               " AND MSKS_TARGET_FLG = :P_MSKS_TARGET_FLG".
      *----------  未収計算種類
             15  FILLER            PIC  X(28)  VALUE
               " AND MSKS_SHRU= :P_MSKS_SHRU".
      *----------  GROUP BY
             15  FILLER            PIC  X(10)  VALUE
              " GROUP BY ".
      *----------  約定日
             15  FILLER            PIC  X(08)  VALUE
               " YKJ_YMD".
      *----------  対象取引情報を取得SQL文(別紙1-5)
         05  SQL-SELECT-TKMZBW04.
           10  S-SELECT-TKMZBW04.
             15  FILLER            PIC  X(07)  VALUE
               "SELECT ".
      *----------  原取引ID
             15  FILLER            PIC  X(08)  VALUE
               " TORI_ID".
             15  FILLER            PIC  X(06)  VALUE
               " FROM ".
             15  SQL-TBL-TKMZBW04  PIC  X(13).
      *---------- WHERE
           10  S-WHERE-TKMZBW04.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(24)  VALUE
               "SYORI_YMD = :P_SYORI_YMD".
      *----------  起動ID
             15  FILLER            PIC  X(27)  VALUE
               " AND KIDOU_ID = :P_KIDOU_ID".
      *----------  利用会社コード
             15  FILLER            PIC  X(33)  VALUE
               " AND RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)  VALUE
               " AND FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
               " AND PTF_CD = :P_PTF_CD".
      *----------  基準日
             15  FILLER            PIC  X(25)  VALUE
               " AND KJN_YMD = :P_KJN_YMD".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)  VALUE
               " AND MEG_CD = :P_MEG_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)  VALUE
               " AND SEC_SBT_CD = :P_SEC_SBT_CD".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)  VALUE
               " AND TATE_FLG = :P_TATE_FLG".
      *----------  玉ID
             15  FILLER            PIC  X(27)  VALUE
               " AND GYOKU_ID = :P_GYOKU_ID".
      *----------  未収計算対象フラグ
             15  FILLER            PIC  X(41)  VALUE
               " AND MSKS_TARGET_FLG = :P_MSKS_TARGET_FLG".
      *----------  未収計算種類
             15  FILLER            PIC  X(28)  VALUE
               " AND MSKS_SHRU= :P_MSKS_SHRU".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
              " ORDER BY ".
      *----------  処理順
             15  FILLER            PIC  X(09)  VALUE
               "SRJUN ASC".
      *----------  取引テーブルSQL文(別紙1-6)
         05  SQL-SELECT-TKMXTR00.
      *----------  取引テーブルSQL文(別紙1-6)
           10  S-SELECT-1-6.
             15  FILLER            PIC  X(08)  VALUE
               " SELECT ".
      *----------  受渡日
             15  FILLER            PIC  X(09)  VALUE
               " UKE_YMD,".
      *----------  権利数量
             15  FILLER            PIC  X(13)  VALUE
               " KENRI_SURYO,".
      *----------  効力発生日
             15  FILLER            PIC  X(13)  VALUE
               " KOURYOKU_YMD".
             15  FILLER            PIC  X(06)  VALUE
               " FROM ".
             15  SQL-TBL-1-6       PIC  X(13).
      *---------- WHERE
           10  S-WHERE-TKMXTR00.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)  VALUE
               " RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *----------  原取引ID
             15  FILLER            PIC  X(25)  VALUE
               " AND TORI_ID = :P_TORI_ID".
      *----------  未収収益計算データ (別紙1-3,別紙1-4,別紙1-7)
         05  SQL-INSERT-TKMZBW08.
           10  S-INSERT-TKMZBW08.
             15  FILLER            PIC  X(13)  VALUE
               " INSERT INTO ".
             15  SQL-TBL-TKMZBW08  PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
               " (".
      *----------  処理実行日
             15  FILLER            PIC  X(11)  VALUE
               " SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(10)  VALUE
               " KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE
               " RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE
               " FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE
               " PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE
               " SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE
               " MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE
               " TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE
               " GYOKU_ID,".
      *----------  適用開始日
             15  FILLER            PIC  X(13)  VALUE
               " TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE
               " KENRI_OTI_YMD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE
               " SIJO_TUKA_CD,".
      *----------  権利付数量
             15  FILLER            PIC  X(09)  VALUE
               " RIT_SRY,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(15)  VALUE
               " SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(17)  VALUE
               " SJTK_GENSEN_TAX,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(16)  VALUE
               " MNK_TSHO_SRYZN,".
      *----------  取消区分
             15  FILLER            PIC  X(12)  VALUE
               " SAKUJO_KBN,".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE
               " UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)  VALUE
               " UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE
               " UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE
               " UPD_PGMID )".
           10  S-VALUES-TKMZBW08.
             15  FILLER            PIC  X(07)  VALUE
               " VALUES".
             15  FILLER            PIC  X(03)  VALUE
               " ( ".
      *----------  処理実行日
             15  FILLER            PIC  X(13)  VALUE
              ":P_SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(12)  VALUE
              ":P_KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE
              ":P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE
              ":P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE
              ":P_PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(14)  VALUE
              ":P_SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(10)  VALUE
              ":P_MEG_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE
              ":P_TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(12)  VALUE
              ":P_GYOKU_ID,".
      *----------  適用開始日
             15  FILLER            PIC  X(15)  VALUE
              ":P_TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(17)  VALUE
              ":P_KENRI_OTI_YMD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(16)  VALUE
              ":P_SIJO_TUKA_CD,".
      *----------  権利付数量
             15  FILLER            PIC  X(11)  VALUE
              ":P_RIT_SRY,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(17)  VALUE
              ":P_SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(19)  VALUE
              ":P_SJTK_GENSEN_TAX,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(18)  VALUE
              ":P_MNK_TSHO_SRYZN,".
      *----------  取消区分
             15  FILLER            PIC  X(04)  VALUE
              "' ',".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE
              "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
              ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(04)  VALUE
              "' ',".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE
              "'SMZJ2110' )".
      *----------  未収収益計算データ(別紙1-8 )
         05  SQL-SELECT-1-8.
           10  S-SELECT-1-8.
             15  FILLER            PIC  X(08)  VALUE
              " SELECT ".
      *----------  権利付数量
             15  FILLER            PIC  X(09)  VALUE
              " RIT_SRY,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE
              " SIJO_TUKA_CD,".
      *----------  適用開始日
             15  FILLER            PIC  X(13)  VALUE
              " TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE
              " KENRI_OTI_YMD,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(16)  VALUE
              " MNK_TSHO_SRYZN,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(15)  VALUE
              " SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
             " SJTK_GENSEN_TAX".
             15  FILLER            PIC  X(06)  VALUE
              " FROM ".
             15  SQL-TBL-1-8       PIC  X(13).
      *---------- WHERE
           10  S-WHERE-1-8.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(28)  VALUE
               " RIYO_CMP_CD =:P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(24)  VALUE
               " AND FUND_CD =:P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(22)  VALUE
               " AND PTF_CD =:P_PTF_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(30)  VALUE
               " AND SEC_SBT_CD =:P_SEC_SBT_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(22)  VALUE
               " AND MEG_CD =:P_MEG_CD".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(26)  VALUE
               " AND TATE_FLG =:P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(26)  VALUE
               " AND GYOKU_ID =:P_GYOKU_ID".
      *----------  権利落日
             15  FILLER            PIC  X(36)  VALUE
               " AND KENRI_OTI_YMD =:P_KENRI_OTI_YMD".
      *----------  処理実行日
             15  FILLER            PIC  X(28)  VALUE
               " AND SYORI_YMD =:P_SYORI_YMD".
      *----------  起動ID
             15  FILLER            PIC  X(26)  VALUE
               " AND KIDOU_ID =:P_KIDOU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(33)  VALUE
               " AND TEKIYO_FROM <=:P_TEKIYO_FROM".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
              " ORDER BY ".
      *----------  適用開始日
             15  FILLER            PIC  X(16)  VALUE
              "TEKIYO_FROM DESC".
      *----------  未収収益(別紙1-9 )
         05  SQL-SELECT-1-9.
           10  S-SELECT-1-9.
             15  FILLER            PIC  X(06)  VALUE
              "SELECT".
      *----------  権利付数量
             15  FILLER            PIC  X(09)  VALUE
              " RIT_SRY,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE
              " SIJO_TUKA_CD,".
      *----------  適用開始日
             15  FILLER            PIC  X(13)  VALUE
              " TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE
              " KENRI_OTI_YMD,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(16)  VALUE
              " MNK_TSHO_SRYZN,".
      *----------  未入金対象数量残高（入力値）
             15  FILLER            PIC  X(19)  VALUE
              " MNK_TSHO_SRYZN_IN,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(15)  VALUE
              " SJTK_MS_SHEKI,".
      *----------  市場通貨未収収益（入力値）
             15  FILLER            PIC  X(18)  VALUE
              " SJTK_MS_SHEKI_IN,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(17)  VALUE
              " SJTK_GENSEN_TAX,".
      *----------  市場通貨源泉税（入力値）
             15  FILLER            PIC  X(20)  VALUE
              " SJTK_GENSEN_TAX_IN,".
      *----------  運用通貨未収収益（入力値）
             15  FILLER            PIC  X(18)  VALUE
               " UYTK_MS_SHEKI_IN,".
      *----------  運用通貨源泉税（入力値）
             15  FILLER            PIC  X(20)  VALUE
               " UYTK_GENSEN_TAX_IN,".
      *----------  評価為替レート（入力値）
             15  FILLER            PIC  X(12)  VALUE
               " HYK_KWS_IN,".
      *----------  源泉税評価為替レート（入力値）
             15  FILLER            PIC  X(20)  VALUE
               " GENS_TAX_HYK_KWS_IN".
             15  FILLER            PIC  X(06)  VALUE
               " FROM ".
             15  SQL-TBL-1-9       PIC  X(13).
      *---------- WHERE
           10  S-WHERE-1-9.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)  VALUE
               " RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)  VALUE
               " AND FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
               " AND PTF_CD = :P_PTF_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)  VALUE
               " AND SEC_SBT_CD = :P_SEC_SBT_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)  VALUE
               " AND MEG_CD = :P_MEG_CD".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)  VALUE
               " AND TATE_FLG = :P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(27)  VALUE
               " AND GYOKU_ID = :P_GYOKU_ID".
      *----------  権利落日
             15  FILLER            PIC  X(37)  VALUE
               " AND KENRI_OTI_YMD = :P_KENRI_OTI_YMD".
      *----------  適用開始日
             15  FILLER            PIC  X(33)  VALUE
               " AND TEKIYO_FROM <=:P_TEKIYO_FROM".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
              " ORDER BY ".
      *----------  適用開始日
             15  FILLER            PIC  X(16)  VALUE
              "TEKIYO_FROM DESC".
      *----------  入金日以前の未収配当SQL文(別紙1-10)
         05  SQL-SELECT-1-10.
           10  S-SELECT-1-10.
             15  FILLER            PIC  X(07)  VALUE  "SELECT ".
      *----------  権利落日
             15  FILLER            PIC  X(16)  VALUE
               "A.KENRI_OTI_YMD ".
             15  FILLER            PIC  X(05)  VALUE  "FROM ".
             15  FILLER            PIC  X(09)  VALUE  "((SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ID
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  権利落日
             15  FILLER            PIC  X(14)  VALUE  "KENRI_OTI_YMD ".
             15  FILLER            PIC  X(05)  VALUE  "FROM ".
             15  SQL-TBL-TKMZMS00  PIC  X(13).
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
             15  FILLER            PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(10)  VALUE  "FUND_CD = ".
             15  FILLER            PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(09)  VALUE  "PTF_CD = ".
             15  FILLER            PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(09)  VALUE  "MEG_CD = ".
             15  FILLER            PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(13)  VALUE  "SEC_SBT_CD = ".
             15  FILLER            PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(11)  VALUE  "TATE_FLG = ".
             15  FILLER            PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(11)  VALUE  "GYOKU_ID = ".
             15  FILLER            PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(15)  VALUE  "TEKIYO_FROM <= ".
             15  FILLER            PIC  X(10)  VALUE  ":P_UKE_YMD".
             15  FILLER            PIC  X(13)  VALUE  ") UNION ALL (".
             15  FILLER            PIC  X(07)  VALUE  "SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE  "RIYO_CMP_CD, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ID
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  権利落日
             15  FILLER            PIC  X(14)  VALUE  "KENRI_OTI_YMD ".
             15  FILLER            PIC  X(05)  VALUE  "FROM ".
             15  SQL-TBL-TKMZBW08  PIC  X(13).
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
             15  FILLER            PIC  X(14)  VALUE  ":P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(10)  VALUE  "FUND_CD = ".
             15  FILLER            PIC  X(10)  VALUE  ":P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(09)  VALUE  "PTF_CD = ".
             15  FILLER            PIC  X(09)  VALUE  ":P_PTF_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(09)  VALUE  "MEG_CD = ".
             15  FILLER            PIC  X(09)  VALUE  ":P_MEG_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(13)  VALUE  "SEC_SBT_CD = ".
             15  FILLER            PIC  X(13)  VALUE  ":P_SEC_SBT_CD".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(11)  VALUE  "TATE_FLG = ".
             15  FILLER            PIC  X(11)  VALUE  ":P_TATE_FLG".
      *----------  玉ID
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(11)  VALUE  "GYOKU_ID = ".
             15  FILLER            PIC  X(11)  VALUE  ":P_GYOKU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(15)  VALUE  "TEKIYO_FROM <= ".
             15  FILLER            PIC  X(10)  VALUE  ":P_UKE_YMD".
      *----------  処理実行日
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(12)  VALUE  "SYORI_YMD = ".
             15  FILLER            PIC  X(12)  VALUE  ":P_SYORI_YMD".
      *----------  起動ID
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(11)  VALUE  "KIDOU_ID = ".
             15  FILLER            PIC  X(11)  VALUE  ":P_KIDOU_ID".
             15  FILLER            PIC  X(04)  VALUE  ")) A".
      *----------  GROUP BY
             15  FILLER            PIC  X(10)  VALUE  " GROUP BY ".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE  "A.RIYO_CMP_CD, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE  "A.FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE  "A.PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(14)  VALUE  "A.SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(10)  VALUE  "A.MEG_CD, ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(12)  VALUE  "A.TATE_FLG, ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(12)  VALUE  "A.GYOKU_ID, ".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE  "A.KENRI_OTI_YMD".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
              " ORDER BY ".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE
               "A.KENRI_OTI_YMD".
      *----------  未収収益計算データ(別紙1-12)
         05  SQL-UPDATE-1-12.
           10  S-UPDATE-1-12.
             15  FILLER            PIC  X(07)  VALUE "UPDATE ".
             15  SQL-TBL-TKMZBW08  PIC  X(13).
             15  FILLER            PIC  X(05)  VALUE " SET ".
      *----------  市場通貨コード
             15  FILLER            PIC  X(31)  VALUE
               "SIJO_TUKA_CD = :P_SIJO_TUKA_CD,".
      *----------  権利付数量
             15  FILLER            PIC  X(22)  VALUE
               " RIT_SRY = :P_RIT_SRY,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(34)  VALUE
               " SJTK_MS_SHEKI = :P_SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(38)  VALUE
               " SJTK_GENSEN_TAX = :P_SJTK_GENSEN_TAX,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(36)  VALUE
               " MNK_TSHO_SRYZN = :P_MNK_TSHO_SRYZN,".
      *----------  更新日時
             15  FILLER            PIC  X(20)  VALUE
               " UPD_DATE = SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(40)  VALUE
               " UPD_LOGIN_CMP_CD = :P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(15)  VALUE
               " UPD_SID = ' ',".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(24)  VALUE
               " UPD_PGMID = 'SMZJ2110' ".
      *---------- WHERE
           10  S-WHERE-1-12.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(29)  VALUE
               " RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)  VALUE
               " AND FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
               " AND PTF_CD = :P_PTF_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)  VALUE
               " AND SEC_SBT_CD = :P_SEC_SBT_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)  VALUE
               " AND MEG_CD = :P_MEG_CD".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)  VALUE
               " AND TATE_FLG = :P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(27)  VALUE
               " AND GYOKU_ID = :P_GYOKU_ID".
      *----------  権利落日
             15  FILLER            PIC  X(37)  VALUE
               " AND KENRI_OTI_YMD = :P_KENRI_OTI_YMD".
      *----------  適用開始日
             15  FILLER            PIC  X(33)  VALUE
               " AND TEKIYO_FROM = :P_TEKIYO_FROM".
      *----------  処理実行日
             15  FILLER            PIC  X(29)  VALUE
               " AND SYORI_YMD = :P_SYORI_YMD".
      *----------  起動ID
             15  FILLER            PIC  X(27)  VALUE
               " AND KIDOU_ID = :P_KIDOU_ID".
      *----------  入金日以前の未収配当データの権利落日を取得SQL文(別紙1-13)
         05  SQL-SELECT-1-13.
           10  S-SELECT-1-13.
             15  FILLER            PIC  X(06)  VALUE
              "SELECT".
      *----------  権利付数量
             15  FILLER            PIC  X(09)  VALUE
              " RIT_SRY,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE
              " SIJO_TUKA_CD,".
      *----------  適用開始日
             15  FILLER            PIC  X(13)  VALUE
              " TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE
              " KENRI_OTI_YMD,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(16)  VALUE
              " MNK_TSHO_SRYZN,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(15)  VALUE
              " SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
              " SJTK_GENSEN_TAX".
             15  FILLER            PIC  X(14)  VALUE
               " FROM ( SELECT".
      *----------  権利付数量
             15  FILLER            PIC  X(09)  VALUE
              " RIT_SRY,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE
              " SIJO_TUKA_CD,".
      *----------  適用開始日
             15  FILLER            PIC  X(13)  VALUE
              " TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE
              " KENRI_OTI_YMD,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(16)  VALUE
              " MNK_TSHO_SRYZN,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(15)  VALUE
              " SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
              " SJTK_GENSEN_TAX".
             15  FILLER            PIC  X(14)  VALUE
               " FROM ( SELECT".
      *----------  権利付数量
             15  FILLER            PIC  X(09)  VALUE
              " RIT_SRY,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE
              " SIJO_TUKA_CD,".
      *----------  適用開始日
             15  FILLER            PIC  X(13)  VALUE
              " TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE
              " KENRI_OTI_YMD,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(46)  VALUE
              " DECODE(MNK_TSHO_SRYZN_IN,999999999999.999999,".
             15  FILLER            PIC  X(52)  VALUE
              "MNK_TSHO_SRYZN,MNK_TSHO_SRYZN_IN) AS MNK_TSHO_SRYZN,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(45)  VALUE
              " DECODE(SJTK_MS_SHEKI_IN,999999999999999.999,".
             15  FILLER            PIC  X(49)  VALUE
              "SJTK_MS_SHEKI,SJTK_MS_SHEKI_IN) AS SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(47)  VALUE
              " DECODE(SJTK_GENSEN_TAX_IN,999999999999999.999,".
             15  FILLER            PIC  X(54)  VALUE
              "SJTK_GENSEN_TAX,SJTK_GENSEN_TAX_IN) AS SJTK_GENSEN_TAX".
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL1-TKMZMS00 PIC  X(13).
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
             15  FILLER            PIC  X(52)  VALUE
              "(FUND_CD,PTF_CD,SEC_SBT_CD,MEG_CD,TATE_FLG,GYOKU_ID,".
             15  FILLER            PIC  X(38)  VALUE
               "KENRI_OTI_YMD,TEKIYO_FROM) IN( SELECT ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ID
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE  "KENRI_OTI_YMD, ".
      *----------  適用開始日
             15  FILLER            PIC  X(16)  VALUE
              "MAX(TEKIYO_FROM)".
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL2-TKMZMS00 PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
               " FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
               " AND PTF_CD = :P_PTF_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)  VALUE
               " AND MEG_CD = :P_MEG_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)  VALUE
               " AND SEC_SBT_CD = :P_SEC_SBT_CD".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)  VALUE
               " AND TATE_FLG = :P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(27)  VALUE
               " AND GYOKU_ID = :P_GYOKU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(30)  VALUE
               " AND TEKIYO_FROM <= :P_UKE_YMD".
      *----------  権利落日
             15  FILLER            PIC  X(30)  VALUE
               " AND (:P_KOURYOKU_YMD = 0  OR ".
             15  FILLER            PIC  X(33)  VALUE
                "KENRI_OTI_YMD <> :P_KOURYOKU_YMD)".
      *----------  GROUP BY
             15  FILLER            PIC  X(10)  VALUE  " GROUP BY ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  権利落日
             15  FILLER            PIC  X(14)  VALUE  "KENRI_OTI_YMD)".
      *----------  UNION ALL
             15  FILLER            PIC  X(11)  VALUE  " UNION ALL ".
             15  FILLER            PIC  X(06)  VALUE  "SELECT".
      *----------  権利付数量
             15  FILLER            PIC  X(09)  VALUE
              " RIT_SRY,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE
              " SIJO_TUKA_CD,".
      *----------  適用開始日
             15  FILLER            PIC  X(13)  VALUE
              " TEKIYO_FROM,".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE
              " KENRI_OTI_YMD,".
      *----------  未入金対象数量残高
             15  FILLER            PIC  X(16)  VALUE
              " MNK_TSHO_SRYZN,".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(15)  VALUE
              " SJTK_MS_SHEKI,".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(16)  VALUE
              " SJTK_GENSEN_TAX".
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL1-TKMZBW08 PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
             15  FILLER            PIC  X(53)  VALUE
              "(SYORI_YMD,KIDOU_ID,FUND_CD,PTF_CD,SEC_SBT_CD,MEG_CD,".
             15  FILLER            PIC  X(55)  VALUE
              "TATE_FLG,GYOKU_ID,KENRI_OTI_YMD,TEKIYO_FROM) IN( SELECT".
      *----------  処理実行日
             15  FILLER            PIC  X(11)  VALUE  " SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(10)  VALUE  " KIDOU_ID,".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  " FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  " PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  " SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  " MEG_CD,".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(10)  VALUE  " TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE  " GYOKU_ID,".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE  " KENRI_OTI_YMD,".
      *----------  適用開始日
             15  FILLER            PIC  X(17)  VALUE
              " MAX(TEKIYO_FROM)".
             15  FILLER            PIC  X(06)  VALUE  " FROM ".
             15  SQL-TBL2-TKMZBW08 PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
               " FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
               " AND PTF_CD = :P_PTF_CD".
      *----------  銘柄コード
             15  FILLER            PIC  X(23)  VALUE
               " AND MEG_CD = :P_MEG_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(31)  VALUE
               " AND SEC_SBT_CD = :P_SEC_SBT_CD".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(27)  VALUE
               " AND TATE_FLG = :P_TATE_FLG".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(27)  VALUE
               " AND GYOKU_ID = :P_GYOKU_ID".
      *----------  適用開始日
             15  FILLER            PIC  X(30)  VALUE
               " AND TEKIYO_FROM <= :P_UKE_YMD".
      *----------  権利落日
             15  FILLER            PIC  X(30)  VALUE
               " AND (:P_KOURYOKU_YMD = 0  OR ".
             15  FILLER            PIC  X(33)  VALUE
                "KENRI_OTI_YMD <> :P_KOURYOKU_YMD)".
      *----------  処理実行日
             15  FILLER            PIC  X(29)  VALUE
               " AND SYORI_YMD = :P_SYORI_YMD".
      *----------  起動ID
             15  FILLER            PIC  X(27)  VALUE
               " AND KIDOU_ID = :P_KIDOU_ID".
      *----------  GROUP BY
             15  FILLER            PIC  X(10)  VALUE  " GROUP BY ".
      *----------  処理実行日
             15  FILLER            PIC  X(11)  VALUE  "SYORI_YMD, ".
      *----------  起動ID
             15  FILLER            PIC  X(10)  VALUE  "KIDOU_ID, ".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE  "FUND_CD, ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE  "PTF_CD, ".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE  "SEC_SBT_CD, ".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE  "MEG_CD, ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(10)  VALUE  "TATE_FLG, ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE  "GYOKU_ID, ".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE  "KENRI_OTI_YMD))".
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  市場通貨未収収益
             15  FILLER            PIC  X(22)  VALUE
              " SJTK_MS_SHEKI <> 0 OR".
      *----------  市場通貨源泉税
             15  FILLER            PIC  X(21)  VALUE
              " SJTK_GENSEN_TAX <> 0".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE  " ORDER BY ".
      *----------  権利落日
             15  FILLER            PIC  X(15)  VALUE  "KENRI_OTI_YMD, ".
      *----------  適用開始日
             15  FILLER            PIC  X(12)  VALUE  "TEKIYO_FROM)".
             15  FILLER            PIC  X(07)  VALUE  " WHERE ".
             15  FILLER            PIC  X(08)  VALUE  "rownum=1".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *----------  SELECT SQL文(別紙1-1,別紙1-5)
         05  WK-MSG-TKMZBW04.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-SQL-TBL-TKMZBW04 PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  処理実行日
           10  FILLER              PIC  X(12)  VALUE
             "SYORI_YMD = ".
           10  WK-SQL-SYORI-YMD    PIC  S9(08).
      *----------  起動ID
           10  FILLER              PIC  X(17)  VALUE
             " AND KIDOU_ID = '".
           10  WK-SQL-KIDOU-ID     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  利用会社コード
           10  FILLER              PIC  X(20)  VALUE
             " AND RIYO_CMP_CD = '".
           10  WK-SQL-RIYO-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)  VALUE
             " AND FUND_CD = '".
           10  WK-SQL-FUND-CD      PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
             " AND PTF_CD = '".
           10  WK-SQL-PTF-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  基準日
           10  FILLER              PIC  X(15)  VALUE
             " AND KJN_YMD = ".
           10  WK-SQL-KJN-YMD      PIC  S9(08).
      *----------  銘柄コード
           10  FILLER              PIC  X(15)  VALUE
             " AND MEG_CD = '".
           10  WK-SQL-MEG-CD       PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)  VALUE
             " AND SEC_SBT_CD = '".
           10  WK-SQL-SEC-SBT-CD   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)  VALUE
             " AND TATE_FLG = '".
           10  WK-SQL-TATE-FLG     PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)  VALUE
             " AND GYOKU_ID = '".
           10  WK-SQL-GYOKU-ID     PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  未収計算対象フラグ
           10  FILLER              PIC  X(24)  VALUE
             " AND MSKS_TARGET_FLG = '".
           10  WK-SQL-MSKS-TARGET-FLG
                                   PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  未収計算種類
           10  FILLER              PIC  X(17)  VALUE
             " AND MSKS_SHRU= '".
           10  WK-SQL-MSKS-SHRU    PIC  X(02).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  SELECT SQL文(別紙1-6)
         05  WK-MSG-TKMXTR00.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-SQL-TBL-TKMXTR00 PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(16)  VALUE
            " RIYO_CMP_CD = '".
           10  WK-SQL-RIYO-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  原取引ID
           10  FILLER              PIC  X(16)  VALUE
             " AND TORI_ID = '".
           10  WK-SQL-TORI-ID      PIC  S9(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  INSERT SQL文(別紙1-3,別紙1-4,別紙1-7)
         05  WK-MSG-TKMZBW08.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-SQL-TBL-TKMZBW08 PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE
            " VALUES".
           10  FILLER              PIC  X(03)  VALUE
            " ( ".
      *----------  処理実行日
           10  FILLER              PIC  X(12)  VALUE
               "SYORI_YMD = ".
           10  WK-SQL-SYORI-YMD    PIC  S9(08).
      *----------  起動ID
           10  FILLER              PIC  X(13)  VALUE
               ", KIDOU_ID= '".
           10  WK-SQL-KIDOU-ID     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  利用会社コード
           10  FILLER              PIC  X(16)  VALUE
               ", RIYO_CMP_CD= '".
           10  WK-SQL-RIYO-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(12)  VALUE
               ", FUND_CD= '".
           10  WK-SQL-FUND-CD      PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(11)  VALUE
               ", PTF_CD= '".
           10  WK-SQL-PTF-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(15)  VALUE
               ", SEC_SBT_CD= '".
           10  WK-SQL-SEC-SBT-CD   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(11)  VALUE
               ", MEG_CD= '".
           10  WK-SQL-MEG-CD       PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(13)  VALUE
               ", TATE_FLG= '".
           10  WK-SQL-TATE-FLG     PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(13)  VALUE
               ", GYOKU_ID= '".
           10  WK-SQL-GYOKU-ID     PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  適用開始日
           10  FILLER              PIC  X(15)  VALUE
               ", TEKIYO_FROM= ".
           10  WK-SQL-TEKIYO-FROM  PIC  S9(08).
      *----------  権利落日
           10  FILLER              PIC  X(17)  VALUE
               ", KENRI_OTI_YMD= ".
           10  WK-SQL-KENRI-OTI-YMD
                                   PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  市場通貨コード
           10  FILLER              PIC  X(17)  VALUE
               ", SIJO_TUKA_CD= '".
           10  WK-SQL-SIJO-TUKA-CD PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  権利付数量
           10  FILLER              PIC  X(11)  VALUE
               ", RIT_SRY= ".
           10  WK-SQL-RIT-SRY      PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  FILLER              PIC  X(17)  VALUE
               ", SJTK_MS_SHEKI= ".
           10  WK-SQL-SJTK-MS-SHEKI
                                   PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(19)  VALUE
               ", SJTK_GENSEN_TAX= ".
           10  WK-SQL-SJTK-GENSEN-TAX
                                   PIC  S9(15)V9(03).
      *----------  未入金対象数量残高
           10  FILLER              PIC  X(18)  VALUE
               ", MNK_TSHO_SRYZN= ".
           10  WK-SQL-MNK-TSHO-SRYZN
                                   PIC  S9(12)V9(06).
      *----------  取消区分
           10  FILLER              PIC  X(16)  VALUE
               ", SAKUJO_KBN=' '".
      *---------- 更新日時
           10  FILLER              PIC  X(20)  VALUE
               ", UPD_DATE = SYSDATE".
      *---------- 更新ログインユーザ会社コード
           10  FILLER              PIC  X(20)  VALUE
               ", UPD_LOGIN_CMP_CD='".
           10  WK-SQL-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *---------- 更新ユーザＩＤ
           10  FILLER              PIC  X(15)  VALUE
               ", UPD_SID = ' '".
      *---------- 更新プログラムＩＤ
           10  FILLER              PIC  X(26)  VALUE
               ", UPD_PGMID = 'SMZJ2110' )".
      *----------  SELECT SQL文(別紙1-8)
         05  WK-MSG-1-8.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-SQL-TBL-1-8      PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)  VALUE
            "RIYO_CMP_CD = '".
           10  WK-SQL-RIYO-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)  VALUE
            " AND FUND_CD = '".
           10  WK-SQL-FUND-CD      PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
             " AND PTF_CD = '".
           10  WK-SQL-PTF-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)  VALUE
             " AND SEC_SBT_CD = '".
           10  WK-SQL-SEC-SBT-CD   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(15)  VALUE
             " AND MEG_CD = '".
           10  WK-SQL-MEG-CD       PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)  VALUE
             " AND TATE_FLG = '".
           10  WK-SQL-TATE-FLG     PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)  VALUE
             " AND GYOKU_ID = '".
           10  WK-SQL-GYOKU-ID     PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  権利落日
           10  FILLER              PIC  X(21)  VALUE
             " AND KENRI_OTI_YMD = ".
           10  WK-SQL-KENRI-OTI-YMD
                                   PIC  S9(08).
      *----------  処理実行日
           10  FILLER              PIC  X(17)  VALUE
             " AND SYORI_YMD = ".
           10  WK-SQL-SYORI-YMD    PIC  S9(08).
      *----------  起動ID
           10  FILLER              PIC  X(17)  VALUE
             " AND KIDOU_ID = '".
           10  WK-SQL-KIDOU-ID     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  適用開始日
           10  FILLER              PIC  X(20)  VALUE
             " AND TEKIYO_FROM <= ".
           10  WK-SQL-TEKIYO-FROM  PIC  S9(08).
      *----------  SELECT SQL文(別紙1-9)
         05  WK-MSG-1-9.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-SQL-TBL-1-9      PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  利用会社コード
           10  FILLER              PIC  X(15)  VALUE
            "RIYO_CMP_CD = '".
           10  WK-SQL-RIYO-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)  VALUE
             " AND FUND_CD = '".
           10  WK-SQL-FUND-CD      PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
             " AND PTF_CD = '".
           10  WK-SQL-PTF-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)  VALUE
             " AND SEC_SBT_CD = '".
           10  WK-SQL-SEC-SBT-CD   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(15)  VALUE
             " AND MEG_CD = '".
           10  WK-SQL-MEG-CD       PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)  VALUE
             " AND TATE_FLG = '".
           10  WK-SQL-TATE-FLG     PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)  VALUE
             " AND GYOKU_ID = '".
           10  WK-SQL-GYOKU-ID     PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  権利落日
           10  FILLER              PIC  X(21)  VALUE
             " AND KENRI_OTI_YMD = ".
           10  WK-SQL-KENRI-OTI-YMD
                                   PIC  S9(08).
      *----------  適用開始日
           10  FILLER              PIC  X(20)  VALUE
             " AND TEKIYO_FROM <= ".
           10  WK-SQL-TEKIYO-FROM  PIC  S9(08).
      *---------- SELECT SQL文(別紙1-10)
         05  WK-MSG-1-10.
           10  WK-MSG-TKMZMS00-1-10.
             15  FILLER            PIC  X(08)  VALUE
                 " TBL-ID(".
             15  WK-TBL-TKMZMS00   PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(15)  VALUE
                 " RIYO_CMP_CD ='".
             15  WK-SQL-RIYO-CMP-CD1
                                   PIC  X(04).
             15  FILLER            PIC  X(16)  VALUE
                 "' AND FUND_CD ='".
             15  WK-SQL-FUND-CD1   PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-SQL-PTF-CD1    PIC  X(04).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND MEG_CD ='".
             15  WK-SQL-MEG-CD1    PIC  X(15).
             15  FILLER            PIC  X(19)  VALUE
                 "' AND SEC_SBT_CD ='".
             15  WK-SQL-SEC-SBT-CD1
                                   PIC  X(04).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND TATE_FLG ='".
             15  WK-SQL-TATE-FLG1  PIC  X(01).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND GYOKU_ID ='".
             15  WK-SQL-GYOKU-ID1  PIC  X(10).
             15  FILLER            PIC  X(21)  VALUE
                 "' AND TEKIYO_FROM <= ".
             15  WK-SQL-TEKIYO-FROM1
                                   PIC  S9(08).
           10  WK-MSG-TKMZBW08-1-10.
             15  FILLER            PIC  X(08)  VALUE
                 " TBL-ID(".
             15  WK-TBL-TKMZBW08   PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(15)  VALUE
                 " RIYO_CMP_CD ='".
             15  WK-SQL-RIYO-CMP-CD2
                                   PIC  X(04).
             15  FILLER            PIC  X(16)  VALUE
                 "' AND FUND_CD ='".
             15  WK-SQL-FUND-CD2   PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-SQL-PTF-CD2    PIC  X(04).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND MEG_CD ='".
             15  WK-SQL-MEG-CD2    PIC  X(15).
             15  FILLER            PIC  X(19)  VALUE
                 "' AND SEC_SBT_CD ='".
             15  WK-SQL-SEC-SBT-CD2
                                   PIC  X(04).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND TATE_FLG ='".
             15  WK-SQL-TATE-FLG2  PIC  X(01).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND GYOKU_ID ='".
             15  WK-SQL-GYOKU-ID2  PIC  X(10).
             15  FILLER            PIC  X(21)  VALUE
                 "' AND TEKIYO_FROM <= ".
             15  WK-SQL-TEKIYO-FROM2
                                   PIC  S9(08).
             15  FILLER            PIC  X(17)  VALUE
                 " AND SYORI_YMD = ".
             15  WK-SQL-SYORI-YMD2 PIC  S9(08).
             15  FILLER            PIC  X(16)  VALUE
                 " AND KIDOU_ID ='".
             15  WK-SQL-KIDOU-ID2  PIC  X(04).
             15  FILLER            PIC  X(01)  VALUE
                 "'".
      *----------  UPDATE SQL文(別紙1-12)
         05  WK-MSG-1-12.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW08     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
      *----------  市場通貨コード
           10  FILLER              PIC  X(21)  VALUE
               "SET (SIJO_TUKA_CD = '".
           10  WK-SQL-SIJO-TUKA-CD PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  権利付数量
           10  FILLER              PIC  X(12)  VALUE
               ", RIT_SRY = ".
           10  WK-SQL-RIT-SRY      PIC  S9(12)V9(06).
      *----------  市場通貨未収収益
           10  FILLER              PIC  X(18)  VALUE
               ", SJTK_MS_SHEKI = ".
           10  WK-SQL-SJTK-MS-SHEKI
                                   PIC  S9(15)V9(03).
      *----------  市場通貨源泉税
           10  FILLER              PIC  X(20)  VALUE
               ", SJTK_GENSEN_TAX = ".
           10  WK-SQL-SJTK-GENSEN-TAX
                                   PIC  S9(15)V9(03).
      *----------  未入金対象数量残高
           10  FILLER              PIC  X(19)  VALUE
               ", MNK_TSHO_SRYZN = ".
           10  WK-SQL-MNK-TSHO-SRYZN
                                   PIC  S9(12)V9(06).
      *----------  更新日時
           10  FILLER              PIC  X(20)  VALUE
               ", UPD_DATE = SYSDATE".
      *---------- 更新ログインユーザ会社コード
           10  FILLER              PIC  X(20)  VALUE
               ", UPD_LOGIN_CMP_CD='".
           10  WK-SQL-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *---------- 更新ユーザＩＤ
           10  FILLER              PIC  X(15)  VALUE
               ", UPD_SID = ' '".
      *---------- 更新プログラムＩＤ
           10  FILLER              PIC  X(26)  VALUE
               ", UPD_PGMID = 'SMZJ2110' )".
      *----------  利用会社コード
           10  FILLER              PIC  X(22)  VALUE
             " WHERE RIYO_CMP_CD = '".
           10  WK-SQL-RIYO-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)  VALUE
             " AND FUND_CD = '".
           10  WK-SQL-FUND-CD      PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)  VALUE
             " AND PTF_CD = '".
           10  WK-SQL-PTF-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  証券種別コード
           10  FILLER              PIC  X(19)  VALUE
             " AND SEC_SBT_CD = '".
           10  WK-SQL-SEC-SBT-CD   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  銘柄コード
           10  FILLER              PIC  X(15)  VALUE
             " AND MEG_CD = '".
           10  WK-SQL-MEG-CD       PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  資産/負債・買建/売建フラグ
           10  FILLER              PIC  X(17)  VALUE
             " AND TATE_FLG = '".
           10  WK-SQL-TATE-FLG     PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE "'".
      *----------  玉ID
           10  FILLER              PIC  X(17)  VALUE
             " AND GYOKU_ID = '".
           10  WK-SQL-GYOKU-ID     PIC  X(10).
      *----------  権利落日
           10  FILLER              PIC  X(22)  VALUE
             "' AND KENRI_OTI_YMD = ".
           10  WK-SQL-KENRI-OTI-YMD
                                   PIC  S9(08).
      *----------  適用開始日
           10  FILLER              PIC  X(19)  VALUE
             " AND TEKIYO_FROM = ".
           10  WK-SQL-TEKIYO-FROM  PIC  S9(08).
      *----------  処理実行日
           10  FILLER              PIC  X(17)  VALUE
             " AND SYORI_YMD = ".
           10  WK-SQL-SYORI-YMD    PIC  S9(08).
      *----------  起動ID
           10  FILLER              PIC  X(17)  VALUE
             " AND KIDOU_ID = '".
           10  WK-SQL-KIDOU-ID     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE "'".
      *---------- SELECT SQL文(別紙1-13)
         05  WK-MSG-1-13.
           10  WK-MSG-TKMZMS00-1-13.
             15  FILLER            PIC  X(08)  VALUE
                 " TBL-ID(".
             15  WK-TBL-TKMZMS00   PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(11)  VALUE
                 " FUND_CD ='".
             15  WK-SQL-FUND-CD1   PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-SQL-PTF-CD1    PIC  X(04).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND MEG_CD ='".
             15  WK-SQL-MEG-CD1    PIC  X(15).
             15  FILLER            PIC  X(19)  VALUE
                 "' AND SEC_SBT_CD ='".
             15  WK-SQL-SEC-SBT-CD1
                                   PIC  X(04).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND TATE_FLG ='".
             15  WK-SQL-TATE-FLG1  PIC  X(01).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND GYOKU_ID ='".
             15  WK-SQL-GYOKU-ID1  PIC  X(10).
             15  FILLER            PIC  X(21)  VALUE
                 "' AND TEKIYO_FROM <= ".
             15  WK-SQL-TEKIYO-FROM1
                                   PIC  S9(08).
             15  FILLER            PIC  X(21)  VALUE
                 " AND KENRI_OTI_YMD <>".
             15  WK-SQL-KOURYOKU-YMD1
                                   PIC  S9(08).
           10  WK-MSG-TKMZBW08-1-13.
             15  FILLER            PIC  X(08)  VALUE
                 " TBL-ID(".
             15  WK-TBL-TKMZBW08   PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 "),".
             15  FILLER            PIC  X(11)  VALUE
                 " FUND_CD ='".
             15  WK-SQL-FUND-CD2   PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-SQL-PTF-CD2    PIC  X(04).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND MEG_CD ='".
             15  WK-SQL-MEG-CD2    PIC  X(15).
             15  FILLER            PIC  X(19)  VALUE
                 "' AND SEC_SBT_CD ='".
             15  WK-SQL-SEC-SBT-CD2
                                   PIC  X(04).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND TATE_FLG ='".
             15  WK-SQL-TATE-FLG2  PIC  X(01).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND GYOKU_ID ='".
             15  WK-SQL-GYOKU-ID2  PIC  X(10).
             15  FILLER            PIC  X(21)  VALUE
                 "' AND TEKIYO_FROM <= ".
             15  WK-SQL-TEKIYO-FROM2
                                   PIC  S9(08).
             15  FILLER            PIC  X(21)  VALUE
                 " AND KENRI_OTI_YMD <>".
             15  WK-SQL-KOURYOKU-YMD2
                                   PIC  S9(08).
             15  FILLER            PIC  X(17)  VALUE
                 " AND SYORI_YMD = ".
             15  WK-SQL-SYORI-YMD  PIC  S9(08).
             15  FILLER            PIC  X(16)  VALUE
                 " AND KIDOU_ID ='".
             15  WK-SQL-KIDOU-ID   PIC  X(04).
             15  FILLER            PIC  X(01)  VALUE "'".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  SCZY3020 配当情報一括取得ルーチン
       01  PARM-SCZY3020-INOUT.
           COPY  "SCZY3020.cpy".
      *----------  SMZC1501 リターンパッケージセットルーチン
       01  PARM-SMZC1501-INOUT.
           COPY  "SMZC1501.cpy".
      *----------  SCZY4408 料率情報取得処理ルーチン
       01  PARM-SCZY4408-INOUT.
           COPY  "SCZY4408.cpy".
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ2110-INOUT.
           COPY  "SMZJ2110.cpy".
      *----------  RTNパッケージ
       01  PARM-SMZJ2110-RTNPKG.
         05  PARM-SMZJ2110-ARG3.
             COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ2110-INOUT
                  PARM-SMZJ2110-RTNPKG.
      ******************************************************************
      *                 未収配当計算
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ2110処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ2110処理  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           EXIT.
      ******************************************************************
      *                 3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBL-ID-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
      **** INITIALIZE     FLG-AREA                                      @SEINO@@
           INITIALIZE     FLG-AREA-2                                    @SEINO@@
                          WORK-AREA
                          HST-AREA
                          SQL-AREA
                          E-MSG-TBL
                          PARM-SCZY1160-INOUT
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-SMZC1501-INOUT
                          PARM-SCZY4408-INOUT
                          PARM-SCZY3020-INOUT
                          PARM-RTNPKG
                          PARM-SMZJ2110-ARG2
                          PARM-SMZJ2110-ARG3
      *----初回コール時のみFLAG-AREAを初期化する                        @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":初回ＣＡＬＬ時のみフラグエリア２の初期化を行う"
      D    DISPLAY  CNS-PGM-ID":複数回起動チェック =[ "FIRST-SW "]"
      *-----------------------------------------------------------------
           IF  FIRST-SW = 'YES'                                         @SEINO@@
           THEN                                                         @SEINO@@
             INITIALIZE  FLG-AREA                                       @SEINO@@
             MOVE  'NO '                TO  FIRST-SW                    @SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":複数回起動チェック =[ "FIRST-SW "]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-AREA         = ["FLG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLG-AREA-2       = ["FLG-AREA-2"]"      @SEINO@@
      D    DISPLAY  CNS-PGM-ID":WORK-AREA        = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HST-AREA         = ["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA         = ["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL        = ["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT = ["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN = ["PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG= ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZC1501-INOUT = ["
      D             PARM-SMZC1501-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4408-INOUT = ["
      D             PARM-SCZY4408-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY3020-INOUT = ["
      D             PARM-SCZY3020-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG = ["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2110-ARG2= ["
      D             PARM-SMZJ2110-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2110-ARG3= ["
      D             PARM-SMZJ2110-ARG3"]"
      *-----------------------------------------------------------------
      *----------  リターンコード
           MOVE  CNS-RTN-000
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD  OF  PARM-SCZY1170-ARG1 = ["
      D             RTN-CD OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  銘柄別断面情報.処理実行日
           MOVE  SYORI-YMD              OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-SYORI-YMD           OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.起動ID
           MOVE  KIDOU-ID               OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-KIDOU-ID            OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.利用会社コード
           MOVE  RIYO-CMP-CD            OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-RIYO-CMP-CD         OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.ファンドコード
           MOVE  FUND-CD                OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-FUND-CD             OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.ポートフォリオコード
           MOVE  PTF-CD                 OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-PTF-CD              OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.基準日
           MOVE  KJN-YMD                OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-KJN-YMD             OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.銘柄コード
           MOVE  MEG-CD                 OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-MEG-CD              OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.証券種別コード
           MOVE  SEC-SBT-CD             OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-SEC-SBT-CD          OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.資産負債・買建売建フラグ
           MOVE  TATE-FLG               OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-TATE-FLG            OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.玉ID
           MOVE  GYOKU-ID               OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-GYOKU-ID            OF  WK-TKMZBW03-PARM
      *----------  銘柄別断面情報.市場通貨コード
           MOVE  SIJO-TUKA-CD           OF  TKMZBW03-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-SIJO-TUKA-CD        OF  WK-TKMZBW03-PARM
      *----------  基準日断面情報.開始基準日の翌日
           MOVE  KAISI-KJN-YMD-NEXT     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-KAISI-KJN-YMD-NEXT  OF  WK-TKMZBW02-PARM
      *----------  基準日断面情報.料率パターンコード
           MOVE  COMMISSION-PATTERN     OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-COMMISSION-PATTERN  OF  WK-TKMZBW02-PARM
      *----------  未収配当計上割合
           MOVE  MISYU-HAITOU-WARIAI    OF  TKMZBW02-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-MISYU-HAITOU-WARIAI OF  WK-TKMZBW02-PARM
      *----------  通貨デフォールト端数処理
           MOVE  TUKA-DEF-HASU-SYRI-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-TUKA-DEF-HASU-SYRI-PARM
      *----------  各属性データ.現地源泉税課税区分
           MOVE  G-GSZ-KAZEI-KBN        OF  ZOK-DATA-PARM
                                        OF  PARM-SMZJ2110-ARG1
             TO  WK-G-GSZ-KAZEI-KBN     OF  WK-ZOK-DATA-PARM
      *----------  投資対象国コード
           MOVE  TSTSK-CD               OF  PARM-SMZJ2110-ARG1
             TO  WK-TSTSK-CD
      *----------  数量単位
           MOVE  SURYO-TANI             OF  PARM-SMZJ2110-ARG1
             TO  WK-SURYO-TANI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.処理実行日= ["
      D             WK-SYORI-YMD        OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.起動ID= ["
      D             WK-KIDOU-ID         OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.利用会社コード= ["
      D             WK-RIYO-CMP-CD      OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.ファンドコード= ["
      D             WK-FUND-CD          OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.ポートフォリオコード= ["
      D             WK-PTF-CD           OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.基準日= ["
      D             WK-KJN-YMD          OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.銘柄コード=["
      D             WK-MEG-CD           OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.証券種別コード= ["
      D             WK-SEC-SBT-CD       OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.資産負債・買建売建"
      D             "フラグ= ["WK-TATE-FLG  OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.玉ID= ["
      D             WK-GYOKU-ID         OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.市場通貨コード= ["
      D             WK-SIJO-TUKA-CD     OF  WK-TKMZBW03-PARM"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面情報.開始基準日の翌日= ["
      D             WK-KAISI-KJN-YMD-NEXT   OF  WK-TKMZBW02-PARM"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面情報.料率パターンコード= ["
      D             WK-COMMISSION-PATTERN   OF  WK-TKMZBW02-PARM"]"
      D    DISPLAY  CNS-PGM-ID":基準日断面情報.未収配当計上割合= ["
      D             WK-MISYU-HAITOU-WARIAI OF  WK-TKMZBW02-PARM"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨端数処理方法= ["
      D             WK-LC-HS            OF WK-TUKA-DEF-HASU-SYRI-PARM"]"
      D    DISPLAY  CNS-PGM-ID":運用通貨小数点以下桁数= ["
      D             WK-LC-SYOSU-TENYIKA-KETASU
      D                                 OF WK-TUKA-DEF-HASU-SYRI-PARM"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨端数処理方法= ["
      D             WK-BC-HS            OF WK-TUKA-DEF-HASU-SYRI-PARM"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨小数点以下桁数= ["
      D             WK-BC-SYOSU-TENYIKA-KETASU
      D                                 OF WK-TUKA-DEF-HASU-SYRI-PARM"]"
      D    DISPLAY  CNS-PGM-ID":各属性データ.現地源泉税課税区分= ["
      D             WK-G-GSZ-KAZEI-KBN  OF  WK-ZOK-DATA-PARM"]"
      D    DISPLAY  CNS-PGM-ID":投資対象国コード= ["WK-TSTSK-CD"]"
      D    DISPLAY  CNS-PGM-ID":数量単位        = ["WK-SURYO-TANI"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *        3.1.2 テーブルID取得処理
      ******************************************************************
       TBL-ID-GET-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  対象取引情報(TKMZBW04)
           MOVE  CNS-TBL-TKMZBW04
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  取引テーブル(TKMXTR00)
           MOVE  CNS-TBL-TKMXTR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *----------  未収収益計算データ(TKMZBW08)
           MOVE  CNS-TBL-TKMZBW08
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *----------  未収収益(TKMZMS00)
           MOVE  CNS-TBL-TKMZMS00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":対象取引情報=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":取引テーブル=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":未収収益=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(4)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  対象取引情報(TKMZBW04)
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  SQL-TBL-TKMZBW04-1,
                   SQL-TBL-TKMZBW04,
                   WK-SQL-TBL-TKMZBW04
      *----------  取引テーブル(TKMXTR00)
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  SQL-TBL-1-6,
                   WK-SQL-TBL-TKMXTR00
      *----------  未収収益計算データ(TKMZBW08)
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  SQL-TBL-TKMZBW08     OF  SQL-SELECT-1-10,
                   SQL-TBL1-TKMZBW08    OF  SQL-SELECT-1-13,
                   SQL-TBL2-TKMZBW08    OF  SQL-SELECT-1-13,
                   SQL-TBL-TKMZBW08     OF  SQL-UPDATE-1-12,
                   SQL-TBL-TKMZBW08     OF  SQL-INSERT-TKMZBW08,
                   SQL-TBL-1-8,
                   WK-SQL-TBL-TKMZBW08,
                   WK-SQL-TBL-1-8,
                   WK-TBL-TKMZBW08      OF  WK-MSG-1-10,
                   WK-TBL-TKMZBW08      OF  WK-MSG-1-12,
                   WK-TBL-TKMZBW08      OF  WK-MSG-1-13
      *----------  未収収益(TKMZMS00)
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  SQL-TBL-1-9,
                   SQL-TBL1-TKMZMS00    OF  SQL-SELECT-1-13,
                   SQL-TBL2-TKMZMS00    OF  SQL-SELECT-1-13,
                   WK-SQL-TBL-1-9,
                   WK-TBL-TKMZMS00      OF  WK-MSG-1-10,
                   WK-TBL-TKMZMS00      OF  WK-MSG-1-13
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引テーブル(別紙1-1)=["
      D             SQL-TBL-TKMZBW04-1"]"
      D    DISPLAY  CNS-PGM-ID":対象取引情報(別紙1-5)=["
      D             SQL-TBL-TKMZBW04"]"
      D    DISPLAY  CNS-PGM-ID":取引テーブル(別紙1-6)=["
      D             SQL-TBL-1-6"]"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ(別紙1-3,別紙1-4"
      D             ",別紙1-7)=["
      D             SQL-TBL-TKMZBW08    OF  SQL-INSERT-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ(別紙1-8)=["
      D             SQL-TBL-1-8"]"
      D    DISPLAY  CNS-PGM-ID":未収収益(別紙1-9)=["
      D             SQL-TBL-1-9"]"
      D    DISPLAY  CNS-PGM-ID":未収収益(別紙1-10)=["
      D             WK-TBL-TKMZMS00     OF  WK-MSG-1-10"]"
      D    DISPLAY  CNS-PGM-ID":未収収益(別紙1-13)=["
      D             WK-TBL-TKMZMS00     OF  WK-MSG-1-13"]"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ(別紙1-10)=["
      D             WK-TBL-TKMZBW08     OF  WK-MSG-1-10"]"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ(別紙1-12)=["
      D             WK-TBL-TKMZBW08     OF  WK-MSG-1-12"]"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ(別紙1-13)=["
      D             WK-TBL-TKMZBW08     OF  WK-MSG-1-13"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得処理  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-GET-EXT.
           EXIT.
      ******************************************************************
      *                 3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  主処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.2.1. 配当情報取得
           PERFORM  HAIT-JYOHO-GET-RTN
      *----------  3.2.1. 権利落日計算の処理
           PERFORM  KENRI-OTI-YMD-RTN
      *----------  3.2.2. 変更日計算の処理
           PERFORM  REVISE-YMD-SHORI-RTN
      *----------  3.2.3. 入金取引計算の処理
           PERFORM  NYUKN-TRHK-SHORI-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1. 配当情報取得
      ******************************************************************
       HAIT-JYOHO-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  配当情報取得  START  ***"
      D    DISPLAY  CNS-PGM-ID
      D    ":***【SCZY3020】配当情報一括取得ルーチン  START***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3020-INOUT
                       PARM-RTNPKG
      *----------   会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03-PARM
             TO  RIYO-CMP-CD            OF  PARM-SCZY3020-ARG1
      *----------   内部銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03-PARM
             TO  NAIBU-MEG-CD           OF  PARM-SCZY3020-ARG1
      *----------   基準日From
           IF  WK-KAISI-KJN-YMD-NEXT    OF  WK-TKMZBW02-PARM = ZERO
           THEN
             MOVE  19800101
               TO  KIJYUN-BI-FROM       OF  PARM-SCZY3020-ARG1
           ELSE
             MOVE  WK-KAISI-KJN-YMD-NEXT
                                        OF  WK-TKMZBW02-PARM
               TO  KIJYUN-BI-FROM       OF  PARM-SCZY3020-ARG1
           END-IF
      *----------   基準日To
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03-PARM
             TO  KIJYUN-BI-TO           OF  PARM-SCZY3020-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":会社コード     =["
      D             RIYO-CMP-CD         OF  PARM-SCZY3020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":内部銘柄コード =["
      D             NAIBU-MEG-CD        OF  PARM-SCZY3020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日From     =["
      D             KIJYUN-BI-FROM      OF  PARM-SCZY3020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日To       =["
      D             KIJYUN-BI-TO        OF  PARM-SCZY3020-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY3020"             USING  PARM-SCZY3020-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF  PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY3020)=["
      D             RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG (COUNTER OF PARM-RTNPKG)
      *----------   リターンコード＝'000'（正常）の場合
             WHEN  CNS-RTN-000
               CONTINUE
      *----------   リターンコード＝'002'（取得可能の件数は500件超過した）の場合
             WHEN  CNS-RTN-002
      *----------  エラー
               MOVE  PARM-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-002
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-002
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG (COUNTER
                                        OF  PARM-RTNPKG )
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
      *----------   リターンコード＝'110'（データなし）の場合
             WHEN  CNS-RTN-110
      *----------  3.2.1. 権利落日計算の処理
               PERFORM  KENRI-OTI-YMD-RTN
      *----------  3.2.2. 変更日計算の処理
               PERFORM  REVISE-YMD-SHORI-RTN
      *----------  3.2.3. 入金取引計算の処理
               PERFORM  NYUKN-TRHK-SHORI-RTN
               PERFORM  END-RTN
             WHEN  OTHER
      *----------  エラー
               MOVE  PARM-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-003
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG (COUNTER
                                        OF  PARM-RTNPKG )
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    INITIALIZE  WK-INDEX1
      D    PERFORM   VARYING   WK-INDEX1
      D    FROM  CNS-1  BY  CNS-1  UNTIL  WK-INDEX1  >  CNS-500
      D    DISPLAY  CNS-PGM-ID":権利落日("WK-INDEX1")=["
      D             KENRI-OTI-YMD  OF  PARM-SCZY3020-ARG2(WK-INDEX1)"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日("WK-INDEX1")=["
      D             TEKIYO-FROM    OF  PARM-SCZY3020-ARG2(WK-INDEX1)"]"
      D    DISPLAY  CNS-PGM-ID":一株当り金額("WK-INDEX1")=["
      D             YIKABU-PER-KN  OF  PARM-SCZY3020-ARG2(WK-INDEX1)"]"
      D    END-PERFORM
      D    DISPLAY  CNS-PGM-ID
      D    ":***【SCZY3020】配当情報一括取得ルーチン  END***"
      *-----------------------------------------------------------------
      *----------  ワークINDEX1が１から500まで、下記処理を繰り返す
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":***ワークINDEX1が１から500まで、下記処理を繰り返すSTART***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-INDEX1
                       WK-INDEX2
                       WK-INDEX3
           MOVE  CNS-1                  TO  WK-INDEX1
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [HAIT-JYOHO-GET-RTN]"          GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  GROUP-SEIRI-RTN     UNTIL  WK-INDEX1  >  CNS-500
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [HAIT-JYOHO-GET-RTN]"          GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":***ワークINDEX1が１から500まで、下記処理を繰り返すEND***"
      *-----------------------------------------------------------------
      *----------  ワーク権利落日配当情報件数←ワークINDEX2
           MOVE  WK-INDEX2              TO  WK-KENRI-OTI-HAIT-KENSU
      *----------  ワーク変更日配当情報件数←ワークINDEX3
           MOVE  WK-INDEX3              TO  WK-REVISE-YMD-HAIT-KENSU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク権利落日配当情報件数  =["
      D             WK-KENRI-OTI-HAIT-KENSU"]"
      D    DISPLAY  CNS-PGM-ID":ワーク変更日配当情報件数    =["
      D             WK-REVISE-YMD-HAIT-KENSU"]"
      D    DISPLAY  CNS-PGM-ID  ":***  配当情報取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       HAIT-JYOHO-GET-EXT.
           EXIT.
      ******************************************************************
      *        ワークINDEX1が１から500まで、下記処理を繰り返す
      ******************************************************************
       GROUP-SEIRI-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークINDEX1  =["WK-INDEX1"]"
      D    DISPLAY  CNS-PGM-ID":ワークINDEX2  =["WK-INDEX2"]"
      D    DISPLAY  CNS-PGM-ID":ワークINDEX3  =["WK-INDEX3"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":【SCZY3020】.ARG2.配当情報("WK-INDEX1").権利落日=["
      D             KENRI-OTI-YMD  OF  HAITO-JYOHO
      D                            OF  PARM-SCZY3020-ARG2(WK-INDEX1)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":【SCZY3020】.ARG2.配当情報("WK-INDEX1").適用開始日=["
      D             TEKIYO-FROM    OF  HAITO-JYOHO
      D                            OF  PARM-SCZY3020-ARG2(WK-INDEX1)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク権利落日  =["
      D             WK-KENRI-OTI-YMD OF WK-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク適用開始日  =["
      D             WK-TEKIYO-FROM   OF WK-YMD"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":【SCZY3020】.ARG2.配当情報("WK-INDEX1").予実区分 =["
      D             YOJI-KBN       OF  HAITO-JYOHO
      D                            OF  PARM-SCZY3020-ARG2(WK-INDEX1)"]"
      *-----------------------------------------------------------------
      *----------  ①◇【SCZY3020】.ARG2.配当情報(ワークINDEX1).権利落日
      *＞＝【SCZY3020】.ARG2.配当情報(ワークINDEX1).適用開始日の場合
           IF  KENRI-OTI-YMD  OF  HAITO-JYOHO
                              OF  PARM-SCZY3020-ARG2(WK-INDEX1)
             >= TEKIYO-FROM   OF  HAITO-JYOHO
                              OF  PARM-SCZY3020-ARG2(WK-INDEX1)
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":①◇【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).権利落日 ＞＝【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).適用開始日の場合"
      *-----------------------------------------------------------------
      *----------  【SCZY3020】.ARG2.配当情報(ワークINDEX1).権利落日＝ワーク権利落日の場合
             IF  KENRI-OTI-YMD    OF  HAITO-JYOHO
                                  OF  PARM-SCZY3020-ARG2(WK-INDEX1)
               = WK-KENRI-OTI-YMD OF  WK-YMD
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).権利落日＝ワーク権利落日の場合"
      *-----------------------------------------------------------------
               IF  TEKIYO-FROM    OF  HAITO-JYOHO
                                  OF  PARM-SCZY3020-ARG2(WK-INDEX1)
               =   WK-TEKIYO-FROM OF  WK-YMD
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D             "(ワークINDEX1).適用開始日＝ワーク適用開始日の場合"
      *-----------------------------------------------------------------
                 IF  YOJI-KBN       OF  HAITO-JYOHO
                                    OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   = WK-YOJI-KBN    OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":A)【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).予実区分＝ワーク権利落日配当情報"
      D    "（ワークINDEX2).予実区分の場合"
      *-----------------------------------------------------------------
      *----------  ワーク権利落日配当情報（ワークINDEX2).配当合計単価←
      * ワーク権利落日配当情報（ワークINDEX2).配当合計単価＋
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).一株当り金額
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").配当合計単価=["
      D             WK-HAIT-TTL-TK OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":【SCZY3020】.ARG2.配当情報("WK-INDEX1").一株当り金額=["
      D             YIKABU-PER-KN  OF  HAITO-JYOHO
      D                            OF  PARM-SCZY3020-ARG2(WK-INDEX1)"]"
      *-----------------------------------------------------------------
                 COMPUTE  WK-HAIT-TTL-TK OF WK-KENRI-OTI-HAIT(WK-INDEX2)
                       =  WK-HAIT-TTL-TK OF WK-KENRI-OTI-HAIT(WK-INDEX2)
                       +  YIKABU-PER-KN  OF  HAITO-JYOHO
                                        OF PARM-SCZY3020-ARG2(WK-INDEX1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").配当合計単価=["
      D             WK-HAIT-TTL-TK   OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      *-----------------------------------------------------------------
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").予実区分   =["
      D            WK-YOJI-KBN       OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      *-----------------------------------------------------------------
                 EVALUATE  WK-YOJI-KBN  OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
                 WHEN  CNS-YOJI-KBN-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク権利落日配当情報（ワークINDEX2"
      D             ").予実区分＝'2'(実績)の場合"
      *-----------------------------------------------------------------
                   CONTINUE
                 WHEN  CNS-YOJI-KBN-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク権利落日配当情報（ワークINDEX2"
      D             ").予実区分＝'1'(予想)の場合"
      *-----------------------------------------------------------------
                   IF  YOJI-KBN       OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                     = CNS-YOJI-KBN-2
                   THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D             "(ワークINDEX1).予実区分＝'2'(実績)の場合"
      *-----------------------------------------------------------------
      *----------  ワーク権利落日配当情報（ワークINDEX2).配当合計単価
                     MOVE  YIKABU-PER-KN  OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                       TO WK-HAIT-TTL-TK OF WK-KENRI-OTI-HAIT(WK-INDEX2)
      *----------  ワーク権利落日配当情報（ワークINDEX2).予実区分
                     MOVE  YOJI-KBN       OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                       TO WK-YOJI-KBN    OF WK-KENRI-OTI-HAIT(WK-INDEX2)
                   ELSE
                     CONTINUE
                   END-IF
                 WHEN  OTHER
      *----------  ワーク権利落日配当情報（ワークINDEX2).配当合計単価
                    MOVE  YIKABU-PER-KN  OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                      TO  WK-HAIT-TTL-TK OF WK-KENRI-OTI-HAIT(WK-INDEX2)
      *----------  ワーク権利落日配当情報（ワークINDEX2).予実区分
                    MOVE  YOJI-KBN       OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                      TO  WK-YOJI-KBN    OF WK-KENRI-OTI-HAIT(WK-INDEX2)
                 END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").配当合計単価  =["
      D             WK-HAIT-TTL-TK   OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").予実区分      =["
      D             WK-YOJI-KBN    OF WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      *-----------------------------------------------------------------
                 END-IF
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D          "(ワークINDEX1).適用開始日＝ワーク適用開始日の場合以外"
      *-----------------------------------------------------------------
      *----------  ワークINDEX2←ワークINDEX2＋1
                 COMPUTE  WK-INDEX2 =  WK-INDEX2 + CNS-1
      *----------  ワーク権利落日配当情報（ワークINDEX2).予実区分
                 MOVE  YOJI-KBN       OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO  WK-YOJI-KBN    OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
      *----------  ワーク権利落日配当情報（ワークINDEX2).権利落日
                 MOVE  KENRI-OTI-YMD  OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO  WK-KENRI-OTI-YMD OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
      *----------  ワーク権利落日配当情報（ワークINDEX2).配当合計単価
                 MOVE  YIKABU-PER-KN  OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO  WK-HAIT-TTL-TK OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
      *----------  ワーク権利落日配当情報（ワークINDEX2).適用開始日
                 MOVE  TEKIYO-FROM    OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO  WK-TEKIYO-FROM OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークINDEX2  =["WK-INDEX2"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").予実区分=["
      D             WK-YOJI-KBN      OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").権利落日=["
      D             WK-KENRI-OTI-YMD OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").配当合計単価=["
      D             WK-HAIT-TTL-TK   OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").適用開始日=["
      D             WK-TEKIYO-FROM   OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      *-----------------------------------------------------------------
               END-IF
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).権利落日＝ワーク権利落日の場合以外"
      *-----------------------------------------------------------------
      *----------  ワークINDEX2←ワークINDEX2＋1
               COMPUTE  WK-INDEX2 = WK-INDEX2 + CNS-1
      *----------  ワーク権利落日配当情報（ワークINDEX2).権利落日←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).権利落日
               MOVE  KENRI-OTI-YMD     OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                 TO  WK-KENRI-OTI-YMD  OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
      *----------  ワーク権利落日配当情報（ワークINDEX2).予実区分←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).予実区分
               MOVE  YOJI-KBN          OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                 TO  WK-YOJI-KBN       OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
      *----------  ワーク権利落日配当情報（ワークINDEX2).配当合計単価←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).一株当り金額
               MOVE  YIKABU-PER-KN     OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                 TO  WK-HAIT-TTL-TK    OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
      *----------  ワーク権利落日配当情報（ワークINDEX2).適用開始日←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).適用開始日
               MOVE  TEKIYO-FROM       OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO  WK-TEKIYO-FROM  OF  WK-KENRI-OTI-HAIT(WK-INDEX2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークINDEX2  =["WK-INDEX2"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").権利落日=["
      D             WK-KENRI-OTI-YMD OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").予実区分=["
      D             WK-YOJI-KBN      OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").配当合計単価=["
      D             WK-HAIT-TTL-TK   OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報（"WK-INDEX2").適用開始日=["
      D             WK-TEKIYO-FROM   OF  WK-KENRI-OTI-HAIT(WK-INDEX2)"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":①◇【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).権利落日 ＞＝【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).適用開始日の場合以外"
      *-----------------------------------------------------------------
      *----------  【SCZY3020】.ARG2.配当情報(ワークINDEX1).権利落日＝ワーク権利落日の場合
             IF  KENRI-OTI-YMD    OF  HAITO-JYOHO
                                  OF  PARM-SCZY3020-ARG2(WK-INDEX1)
               = WK-KENRI-OTI-YMD OF  WK-YMD
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).権利落日＝ワーク権利落日の場合"
      *-----------------------------------------------------------------
      *----------  【SCZY3020】.ARG2.配当情報(ワークINDEX1).適用開始日＝ワーク適用開始日の場合
               IF  TEKIYO-FROM       OF  HAITO-JYOHO
                                     OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                 = WK-TEKIYO-FROM    OF  WK-YMD
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).適用開始日＝ワーク適用開始日の場合"
      *-----------------------------------------------------------------
                 IF  YOJI-KBN        OF HAITO-JYOHO
                                     OF PARM-SCZY3020-ARG2(WK-INDEX1)
                   = WK-YOJI-KBN     OF WK-REVISE-YMD-HAIT(WK-INDEX3)
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":A)【SCZY3020】.ARG2.配当情報"
      D             "(ワークINDEX1).予実区分＝ワーク変更日配当情報"
      D             "（ワークINDEX3).予実区分の場合"
      *-----------------------------------------------------------------
      *----------  ワーク変更日配当情報（ワークINDEX3).配当合計単価
      * ←ワーク変更日配当情報（ワークINDEX3).配当合計単価＋
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).一株当り金額
                 COMPUTE WK-HAIT-TTL-TK OF WK-REVISE-YMD-HAIT(WK-INDEX3)
                     =  WK-HAIT-TTL-TK  OF WK-REVISE-YMD-HAIT(WK-INDEX3)
                     +  YIKABU-PER-KN   OF HAITO-JYOHO
                                        OF PARM-SCZY3020-ARG2(WK-INDEX1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークINDEX3  =["WK-INDEX3"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク変更日配当情報（"WK-INDEX3").配当合計単価=["
      D             WK-HAIT-TTL-TK  OF  WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      *-----------------------------------------------------------------
                 ELSE
                   EVALUATE WK-YOJI-KBN OF WK-REVISE-YMD-HAIT(WK-INDEX3)
                   WHEN  CNS-YOJI-KBN-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク変更日配当情報（ワークINDEX3)."
      D             "予実区分＝'2'(実績)の場合"
      *-----------------------------------------------------------------
                     CONTINUE
                   WHEN  CNS-YOJI-KBN-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク変更日配当情報（ワークINDEX3)."
      D             "予実区分＝'1'(予想)の場合"
      *-----------------------------------------------------------------
                     IF  YOJI-KBN      OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                       = CNS-YOJI-KBN-2
                     THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D             "(ワークINDEX1).予実区分＝'2'(実績)の場合"
      *-----------------------------------------------------------------
      *----------  ワーク変更日配当情報（ワークINDEX3).配当合計単価
                       MOVE  YIKABU-PER-KN  OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                         TO  WK-HAIT-TTL-TK
                                       OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
      *----------  ワーク変更日配当情報（ワークINDEX3).予実区分
                       MOVE  YOJI-KBN  OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                         TO WK-YOJI-KBN OF WK-REVISE-YMD-HAIT(WK-INDEX3)
                     ELSE
                       CONTINUE
                     END-IF
                   WHEN  OTHER
      *----------  ワーク変更日配当情報（ワークINDEX3).配当合計単価
                     MOVE  YIKABU-PER-KN   OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                       TO  WK-HAIT-TTL-TK
                                       OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
      *----------  ワーク変更日配当情報（ワークINDEX3).予実区分
                     MOVE  YOJI-KBN    OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                       TO  WK-YOJI-KBN OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
                   END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク変更日配当情報（"WK-INDEX3
      D    ").配当合計単価=["WK-HAIT-TTL-TK
      D                             OF  WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク変更日配当情報（"WK-INDEX3
      D    ").予実区分    =["WK-YOJI-KBN
      D                             OF  WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      *-----------------------------------------------------------------
                 END-IF
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).適用開始日＝ワーク適用開始日の場合以外"
      *-----------------------------------------------------------------
      *----------  ワークINDEX3←ワークINDEX3＋1
                 COMPUTE  WK-INDEX3 = WK-INDEX3 + CNS-1
      *----------  ワーク変更日配当情報（ワークINDEX3).予実区分
                 MOVE  YOJI-KBN        OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO  WK-YOJI-KBN     OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
      *----------  ワーク変更日配当情報（ワークINDEX3).権利落日←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).権利落日
                 MOVE  KENRI-OTI-YMD   OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO WK-KENRI-OTI-YMD OF WK-REVISE-YMD-HAIT(WK-INDEX3)
      *----------  ワーク変更日配当情報（ワークINDEX3).配当合計単価←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).一株当り金額
                 MOVE  YIKABU-PER-KN   OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO  WK-HAIT-TTL-TK  OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
      *----------  ワーク変更日配当情報（ワークINDEX3).適用開始日←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).適用開始日
                 MOVE  TEKIYO-FROM     OF  HAITO-JYOHO
                                       OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                   TO  WK-TEKIYO-FROM  OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークINDEX3  =["WK-INDEX3"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク変更日配当情報（"WK-INDEX3").予実区分=["
      D             WK-YOJI-KBN      OF WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク変更日配当情報（"WK-INDEX3").権利落日=["
      D             WK-KENRI-OTI-YMD OF WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク変更日配当情報（"WK-INDEX3").配当合計単価=["
      D             WK-HAIT-TTL-TK  OF  WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      D    ":ワーク変更日配当情報（"WK-INDEX3").適用開始日=["
      D             WK-TEKIYO-FROM  OF  WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      *-----------------------------------------------------------------
               END-IF
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).権利落日＝ワーク権利落日の場合以外"
      *-----------------------------------------------------------------
      *----------  ワークINDEX3←ワークINDEX3＋1
               COMPUTE  WK-INDEX3 = WK-INDEX3 + CNS-1
      *----------  ワーク変更日配当情報（ワークINDEX3).予実区分
               MOVE  YOJI-KBN         OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                 TO  WK-YOJI-KBN      OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
      *----------  ワーク変更日配当情報（ワークINDEX3).権利落日←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).権利落日
               MOVE  KENRI-OTI-YMD    OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                 TO  WK-KENRI-OTI-YMD OF WK-REVISE-YMD-HAIT(WK-INDEX3)
      *----------  ワーク変更日配当情報（ワークINDEX3).配当合計単価←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).一株当り金額
               MOVE  YIKABU-PER-KN    OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                 TO  WK-HAIT-TTL-TK   OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
      *----------  ワーク変更日配当情報（ワークINDEX3).適用開始日←
      *【SCZY3020】.ARG2.配当情報(ワークINDEX1).適用開始日
               MOVE  TEKIYO-FROM      OF  HAITO-JYOHO
                                      OF  PARM-SCZY3020-ARG2(WK-INDEX1)
                 TO  WK-TEKIYO-FROM   OF  WK-REVISE-YMD-HAIT(WK-INDEX3)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークINDEX3  =["WK-INDEX3"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク変更日配当情報（"WK-INDEX3").予実区分=["
      D             WK-YOJI-KBN      OF WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク変更日配当情報（"WK-INDEX3").権利落日=["
      D             WK-KENRI-OTI-YMD OF WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク変更日配当情報（"WK-INDEX3").配当合計単価=["
      D             WK-HAIT-TTL-TK  OF  WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      D    ":ワーク変更日配当情報（"WK-INDEX3").適用開始日=["
      D             WK-TEKIYO-FROM  OF  WK-REVISE-YMD-HAIT(WK-INDEX3)"]"
      *-----------------------------------------------------------------
             END-IF
           END-IF
      *----------  ②◇【SCZY3020】.ARG2.配当情報(ワークINDEX1).適用開始日＝ワーク適用開始日の場合
           IF  TEKIYO-FROM       OF  HAITO-JYOHO
                                 OF  PARM-SCZY3020-ARG2(WK-INDEX1)
             = WK-TEKIYO-FROM    OF  WK-YMD
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":②◇【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).適用開始日＝ワーク適用開始日の場合"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":②◇【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).適用開始日＝ワーク適用開始日の場合以外"
      *-----------------------------------------------------------------
      *----------  ワーク適用開始日←【SCZY3020】.ARG2.配当情報(ワークINDEX1).適用開始日
             MOVE  TEKIYO-FROM       OF  HAITO-JYOHO
                                     OF  PARM-SCZY3020-ARG2(WK-INDEX1)
               TO  WK-TEKIYO-FROM    OF  WK-YMD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク適用開始日  =["
      D             WK-TEKIYO-FROM   OF  WK-YMD"]"
      *-----------------------------------------------------------------
           END-IF
      *----------  ③◇【SCZY3020】.ARG2.配当情報(ワークINDEX1).権利落日＝ワーク権利落日の場合
           IF  KENRI-OTI-YMD     OF  HAITO-JYOHO
                                 OF  PARM-SCZY3020-ARG2(WK-INDEX1)
             = WK-KENRI-OTI-YMD  OF  WK-YMD
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":③◇【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).権利落日＝ワーク権利落日の場合"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":③◇【SCZY3020】.ARG2.配当情報"
      D    "(ワークINDEX1).権利落日＝ワーク権利落日の場合以外"
      *-----------------------------------------------------------------
      *----------  ワーク権利落日←【SCZY3020】.ARG2.配当情報(ワークINDEX1).権利落日
             MOVE  KENRI-OTI-YMD     OF  HAITO-JYOHO
                                     OF  PARM-SCZY3020-ARG2(WK-INDEX1)
               TO  WK-KENRI-OTI-YMD  OF  WK-YMD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク権利落日  =["
      D             WK-KENRI-OTI-YMD OF  WK-YMD"]"
      *-----------------------------------------------------------------
           END-IF
      *----------  ④ワークINDEX1←ワークINDEX1＋1
           COMPUTE  WK-INDEX1 = WK-INDEX1 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークINDEX1  =["WK-INDEX1"]"
      *-----------------------------------------------------------------
           CONTINUE.
       GROUP-SEIRI-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1. 権利落日計算の処理
      ******************************************************************
       KENRI-OTI-YMD-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  権利落日計算の処理  START  ***"
      *-----------------------------------------------------------------
      *----------   対象取引情報(別紙1-1) CURSOR PREPARE
           PERFORM  TKMZBW04-PRE1-RTN
      *----------   対象取引情報(別紙1-1) CURSOR OPEN
           PERFORM  TKMZBW04-OPEN1-RTN
      *----------   対象取引情報(別紙1-1) CURSOR FETCH
           MOVE  CNS-OFF                TO   FLG-CYCLES-EXIT-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CYCLES-EXIT-1=["
      D             FLG-CYCLES-EXIT-1"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KENRI-OTI-YMD-RTN]"           GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW04-FETCH1-RTN
             UNTIL  FLG-CYCLES-EXIT-1 = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KENRI-OTI-YMD-RTN]"           GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------   対象取引情報(別紙1-1) CURSOR CLOSE
      **** PERFORM  TKMZBW04-CLOSE1-RTN                                 @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  権利落日計算の処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KENRI-OTI-YMD-EXT.
           EXIT.
      ******************************************************************
      *    対象取引情報(別紙1-1) CURSOR PREPARE
      ******************************************************************
       TKMZBW04-PRE1-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 対象取引情報(別紙1-1)CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE                   SQLSTMT1                        @3212SEINO@@
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW04-S,
                 WK-SQL-SYORI-YMD       OF  WK-MSG-TKMZBW04
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW04-S,
                 WK-SQL-KIDOU-ID        OF  WK-MSG-TKMZBW04
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW04-S,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-TKMZBW04
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW04-S,
                 WK-SQL-FUND-CD         OF  WK-MSG-TKMZBW04
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW04-S,
                 WK-SQL-PTF-CD          OF  WK-MSG-TKMZBW04
      *----------  基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZBW04-S,
                 WK-SQL-KJN-YMD         OF  WK-MSG-TKMZBW04
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZBW04-S,
                 WK-SQL-MEG-CD          OF  WK-MSG-TKMZBW04
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZBW04-S,
                 WK-SQL-SEC-SBT-CD      OF  WK-MSG-TKMZBW04
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZBW04-S,
                 WK-SQL-TATE-FLG        OF  WK-MSG-TKMZBW04
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZBW04-S,
                 WK-SQL-GYOKU-ID        OF  WK-MSG-TKMZBW04
      *----------  未収計算対象フラグ
           MOVE  CNS-MSKS-TARGET-FLG-1
             TO  H-MSKS-TARGET-FLG      OF  H-TKMZBW04-S,
                 WK-SQL-MSKS-TARGET-FLG OF  WK-MSG-TKMZBW04
      *----------  未収計算種類
           MOVE  CNS-MSKS-SHRU-21
             TO  H-MSKS-SHRU            OF  H-TKMZBW04-S,
                 WK-SQL-MSKS-SHRU       OF  WK-MSG-TKMZBW04
      *----ＳＱＬ文
           MOVE  SQL-SELECT-TKMZBW04-1  TO  SQLSTMT1                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日=["
      D            H-SYORI-YMD          OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":起動ID=["
      D            H-KIDOU-ID           OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-FUND-CD            OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      D            H-PTF-CD             OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":基準日=["
      D            H-KJN-YMD            OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード=["
      D            H-MEG-CD             OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード=["
      D            H-SEC-SBT-CD         OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":玉ID=["
      D            H-GYOKU-ID           OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":未収計算対象フラグ=["
      D            H-MSKS-TARGET-FLG    OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":未収計算種類=["
      D            H-MSKS-SHRU          OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"                   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-MSG-TKMZBW04=["WK-MSG-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW04-1-CR-OPEN=[ "
      D            FLG-TKMZBW04-1-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZBW04-1-CR-OPEN = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS1第一回"
      *-----------------------------------------------------------------
      *----------  対象取引情報(別紙1-1)CURSOR PREPARE
           EXEC  SQL
             PREPARE  S1  FROM :SQLSTMT1                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":対象取引情報(別紙1-1) SQLCODE-PREPARE=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-1) SQL処理 (PREPARE)  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-1) SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-004
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-TKMZBW04    DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  対象取引情報(別紙1-1)CURSOR DECLARE
           EXEC  SQL
             DECLARE  TKMZBW04_CUR1 CURSOR FOR  S1
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報(別紙1-1)SQLCODE-DECLARE=["
      D             SQLCODE"]"
      *-----------------------------------------------------------------@SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D              ":***対象取引情報(別紙1-1) CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-PRE1-EXT.
           EXIT.
      ******************************************************************
      *    対象取引情報(別紙1-1) CURSOR OPEN
      ******************************************************************
       TKMZBW04-OPEN1-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 対象取引情報(別紙1-1) CURSOR OPEN  START ***"
      *-----------------------------------------------------------------
      *----------  対象取引情報 CURSOR OPEN
           EXEC  SQL
               OPEN TKMZBW04_CUR1
                 USING :H-TKMZBW04-S.H-SYORI-YMD,
                       :H-TKMZBW04-S.H-KIDOU-ID,
                       :H-TKMZBW04-S.H-RIYO-CMP-CD,
                       :H-TKMZBW04-S.H-FUND-CD,
                       :H-TKMZBW04-S.H-PTF-CD,
                       :H-TKMZBW04-S.H-KJN-YMD,
                       :H-TKMZBW04-S.H-MEG-CD,
                       :H-TKMZBW04-S.H-SEC-SBT-CD,
                       :H-TKMZBW04-S.H-TATE-FLG,
                       :H-TKMZBW04-S.H-GYOKU-ID,
                       :H-TKMZBW04-S.H-MSKS-TARGET-FLG,
                       :H-TKMZBW04-S.H-MSKS-SHRU
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報(別紙1-1) SQLCODE-OPEN=["
      D             SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON             TO  FLG-TKMZBW04-1-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-1) CURSOR OPEN  正常"
      D    DISPLAY CNS-PGM-ID":対象取引情報データカーソルオープン"
      D            "フラグ１=["FLG-TKMZBW04-1-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-1)SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-005
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-TKMZBW04    DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 対象取引情報(別紙1-1) CURSOR OPEN   END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-OPEN1-EXT.
           EXIT.
      ******************************************************************
      *       対象取引情報(別紙1-1) CURSOR FETCH
      ******************************************************************
       TKMZBW04-FETCH1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***対象取引情報(別紙1-1) CURSOR FETCH  START ***"
      *-----------------------------------------------------------------
      *----------  対象取引情報 CURSOR FETCH
           INITIALIZE              H-TKMZBW04-1
           EXEC  SQL
               FETCH
                    TKMZBW04_CUR1
               INTO :H-TKMZBW04-1.H-KENRI-SURYO-TTL,
                    :H-TKMZBW04-1.H-YKJ-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": 対象取引情報(別紙1-1) SQLCODE FETCH=["
      D             SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-1) CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":権利数量_合計=["
      D             H-KENRI-SURYO-TTL   OF  H-TKMZBW04-1"]"
      D    DISPLAY  CNS-PGM-ID":約定日=["
      D             H-YKJ-YMD           OF  H-TKMZBW04-1"]"
      *-----------------------------------------------------------------
               IF  H-KENRI-SURYO-TTL   OF  H-TKMZBW04-1 >= ZERO
               THEN
      *----------  A)権利落日の配当合計単価を取得処理
                 PERFORM  KRYMD-HTNK-GET-RTN
                 IF  WK-SKIP-FLG = CNS-OFF THEN
      *----------  B)未収収益と源泉税算出1
                   PERFORM  MYSYUEKI-GSZ1-RTN
      *----------  C)未収収益計算データINSERT処理 (「別紙1-3 SQL説明」を参照)
                   PERFORM  TKMZBW08-INSERT1-RTN
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-CYCLES-EXIT-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-1) CURSOR FETCH  NOTFOUND"
      D    DISPLAY CNS-PGM-ID":FLG-CYCLES-EXIT-1="FLG-CYCLES-EXIT-1
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-1) SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-006
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-TKMZBW04  DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***対象取引情報(別紙1-1) CURSOR FETCH  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-FETCH1-EXT.
           EXIT.
      ******************************************************************
      *        A)権利落日の配当合計単価を取得処理
      ******************************************************************
       KRYMD-HTNK-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***A)権利落日の配当合計単価を取得処理  START ***"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF    TO  WK-SKIP-FLG
      *----------  データありフラグ←0
           MOVE  ZERO                   TO  WK-DATA-ARI-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":データありフラグ=["WK-DATA-ARI-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク権利落日配当情報件数=["
      D             WK-KENRI-OTI-HAIT-KENSU"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-INDEX1
                       FLG-LOOP
           MOVE  WK-KENRI-OTI-HAIT-KENSU        TO  WK-INDEX1
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KRYMD-HTNK-GET-RTN]"          GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  UNTIL  WK-INDEX1  = ZERO    OR
                    FLG-LOOP = CNS-1
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [KRYMD-HTNK-GET-RTN]"          GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワークINDEX1=["WK-INDEX1"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報(ワークINDEX1).権利落日=["
      D             WK-KENRI-OTI-YMD OF WK-KENRI-OTI-HAIT(WK-INDEX1)"]"
      D    DISPLAY  CNS-PGM-ID ":「別紙1-1 SQL説明」.約定日=["
      D             H-YKJ-YMD           OF  H-TKMZBW04-1"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク権利落日配当情報（"WK-INDEX1
      D             ").予実区分 =["
      D             WK-YOJI-KBN      OF  WK-KENRI-OTI-HAIT(WK-INDEX1)"]"
      *-----------------------------------------------------------------
      *----------  ワーク権利落日配当情報(ワークINDEX1).権利落日＝取得したデータ.約定日の場合
             IF  WK-KENRI-OTI-YMD  OF  WK-KENRI-OTI-HAIT(WK-INDEX1) =
                 H-YKJ-YMD  OF  H-TKMZBW04-1
             THEN
               IF  WK-YOJI-KBN     OF  WK-KENRI-OTI-HAIT(WK-INDEX1)
                =  CNS-YOJI-KBN-2
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク権利落日配当情報"
      D             "（ワークINDEX1).予実区分＝'2'（実績）の場合"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク権利落日配当情報(ワークINDEX1).配当合計単価=["
      D             WK-HAIT-TTL-TK   OF  WK-KENRI-OTI-HAIT(WK-INDEX1)"]"
      *-----------------------------------------------------------------
                 MOVE  WK-HAIT-TTL-TK   OF  WK-KENRI-OTI-HAIT(WK-INDEX1)
                   TO  WK-HAIT-TTL-TNK
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク権利落日配当情報（"WK-INDEX1
      D             ").配当合計単価 =["
      D             WK-HAIT-TTL-TK OF WK-KENRI-OTI-HAIT(WK-INDEX1)"]"
      D    DISPLAY  CNS-PGM-ID ":ARG1.基準日断面情報.未収配当計上割合=["
      D             WK-MISYU-HAITOU-WARIAI  OF  WK-TKMZBW02-PARM"]"
      *-----------------------------------------------------------------
      *----------  ワーク配当合計単価←ワーク権利落日配当情報（ワークINDEX1).配当合計単価×ARG1.基準日断面情報.未収配当計上割合/100
                 COMPUTE  WK-HAIT-TTL-TNK
                       =  WK-HAIT-TTL-TK OF WK-KENRI-OTI-HAIT(WK-INDEX1)
                       *  WK-MISYU-HAITOU-WARIAI  OF  WK-TKMZBW02-PARM
                       /  CNS-100
               END-IF
      *----------  データありフラグ←1
               MOVE  CNS-1              TO  WK-DATA-ARI-FLG
      *----------  繰り返す終了
               MOVE  CNS-1              TO  FLG-LOOP
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク配当合計単価=["
      D             WK-HAIT-TTL-TNK"]"
      D    DISPLAY  CNS-PGM-ID ":データありフラグ=["WK-DATA-ARI-FLG"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *----------  ワークINDEX1←ワークINDEX1-１
             COMPUTE  WK-INDEX1  =  WK-INDEX1  -  CNS-1
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":データありフラグ=["WK-DATA-ARI-FLG"]"
      *-----------------------------------------------------------------
      *----------  データありフラグ=0の場合
           IF  WK-DATA-ARI-FLG  =  ZERO
           THEN
             MOVE  CNS-ON  TO  WK-SKIP-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":データありフラグ=0の場合,"
      D                       "次のフェッチ処理へ進む"
      D    DISPLAY  CNS-PGM-ID ":WK-SKIP-FLG=["
      D             WK-SKIP-FLG"]"
      *-----------------------------------------------------------------
      *----------  ワークエラー区分←'04'
             MOVE  CNS-FLG-04
               TO  WORK-ERR-KBN         OF  PARM-SMZJ2110-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワークエラー区分=["
      D             WORK-ERR-KBN        OF  PARM-SMZJ2110-ARG2"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-011
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-110
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":ワーク配当合計単価=["
      D             WK-HAIT-TTL-TNK"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***A)権利落日の配当合計単価を取得処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KRYMD-HTNK-GET-EXT.
           EXIT.
      ******************************************************************
      *        B)未収収益と源泉税算出1
      ******************************************************************
       MYSYUEKI-GSZ1-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益と源泉税算出1 START ***"
      *-----------------------------------------------------------------
      *----------  (a)ワーク市場通貨未収収益(中間) ← 「別紙1-1 SQL説明」.権利数量_合計×ワーク配当合計単価×ARG1.数量単位
           COMPUTE  WK-SJTK-MS-SHEKI-CHKN
                  = H-KENRI-SURYO-TTL   OF  H-TKMZBW04-1
                  * WK-HAIT-TTL-TNK
                  * WK-SURYO-TANI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":「別紙1-1 SQL説明」.権利数量_合計=["
      D             H-KENRI-SURYO-TTL   OF  H-TKMZBW04-1"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク配当合計単価=["
      D             WK-HAIT-TTL-TNK"]"
      D    DISPLAY  CNS-PGM-ID ":ARG1.数量単位     =["
      D             WK-SURYO-TANI"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨未収収益(中間)=["
      D             WK-SJTK-MS-SHEKI-CHKN"]"
      *-----------------------------------------------------------------
      *----------  (b)未収収益の端数処理
           MOVE  WK-SJTK-MS-SHEKI-CHKN
             TO  WK-IN-SUTI
           MOVE  CNS-POS-013            TO  WK-ERR-POS
           PERFORM  IDO-CALC-KMHS-RTN
      *----------  ワーク市場通貨未収収益
           MOVE  WK-OUT-SUTI            TO  WK-SJTK-MS-SHEKI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨未収収益  =["
      D             WK-SJTK-MS-SHEKI"]"
      D    DISPLAY  CNS-PGM-ID ":ARG1.各属性データ.現地源泉税課税区分=["
      D                                            WK-G-GSZ-KAZEI-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ARG1.投資対象国コード=["WK-TSTSK-CD"]"
      D    DISPLAY  CNS-PGM-ID ":料率パターンコード  =["
      D             WK-COMMISSION-PATTERN  OF  WK-TKMZBW02-PARM"]"
      *-----------------------------------------------------------------
      *----------  (c)ARG1．各属性データ．現地源泉税課税区分＝"1" 課税
      *----------  且つ ARG1.投資対象国コード≠SPACEの場合
      *----------  且つARG1.基準日断面情報.料率パターンコード≠SPACE
           IF  WK-G-GSZ-KAZEI-KBN   =  CNS-G-GSZ-KAZEI-KBN-1
               AND  WK-TSTSK-CD  NOT =  SPACE
               AND  WK-COMMISSION-PATTERN
                                    OF  WK-TKMZBW02-PARM  NOT = SPACE
           THEN
             COMPUTE  WK-KJN-TI
                      =  H-KENRI-SURYO-TTL  OF  H-TKMZBW04-1
                      *  WK-HAIT-TTL-TNK
                      *  WK-SURYO-TANI
      *----------  ①【SCZY4408】料率情報取得処理
             PERFORM  SCZY4408-RTN
      *----------  ③ワーク市場通貨源泉税(中間)＝「別紙1-1 SQL説明」.権利数量_合計×ワーク配当合計単価×ARG1.数量単位×ワーク市場国源泉税率
             COMPUTE  WK-SJTK-GENSEN-TAX-CHKN
                    = H-KENRI-SURYO-TTL     OF  H-TKMZBW04-1
                    * WK-HAIT-TTL-TNK
                    * WK-SURYO-TANI
                    * WK-SJTK-KUNI-GSZ-TAX-RT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":取得した取引．権利数量×ワーク配当"
      D            "合計単価×ARG1.数量単位×ワーク市場国源泉税率 =["
      D                                       WK-SJTK-GENSEN-TAX-CHKN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税(中間)=["
      D                                       WK-SJTK-GENSEN-TAX-CHKN"]"
      *-----------------------------------------------------------------
           ELSE
             MOVE  ZERO                 TO  WK-SJTK-GENSEN-TAX-CHKN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税(中間)=["
      D                                       WK-SJTK-GENSEN-TAX-CHKN"]"
      *-----------------------------------------------------------------
           END-IF
      *----------  (c)端数処理
      *----------  源泉税の端数処理【SMZC1501】異動計算項目端数処理に接続用パラメータの設定を行なう
           MOVE  WK-SJTK-GENSEN-TAX-CHKN
             TO  WK-IN-SUTI
           MOVE  CNS-POS-012            TO  WK-ERR-POS
           PERFORM  IDO-CALC-KMHS-RTN
      *----------  ワーク市場通貨源泉税
           MOVE  WK-OUT-SUTI            TO  WK-SJTK-GENSEN-TAX
      *----------  (d)ワーク市場通貨未収収益  ←  ワーク市場通貨未収収益  －  ワーク市場通貨源泉税
           COMPUTE  WK-SJTK-MS-SHEKI
                    =  WK-SJTK-MS-SHEKI  -  WK-SJTK-GENSEN-TAX
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税  =["
      D             WK-SJTK-GENSEN-TAX"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨未収収益  =["
      D             WK-SJTK-MS-SHEKI"]"
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益と源泉税算出1  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MYSYUEKI-GSZ1-EXT.
           EXIT.
      ******************************************************************
      *    【SCZY4408】料率情報取得処理
      ******************************************************************
       SCZY4408-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 【SCZY4408】料率情報取得処理"
      D                                                   "  START ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SCZY4408-INOUT
                        PARM-RTNPKG
      *----------  料率パターンコード
           MOVE  WK-COMMISSION-PATTERN  OF  WK-TKMZBW02-PARM
             TO  COMMISSION-PATTERN     OF  PARM-SCZY4408-ARG1
      *----------  料率区分
           MOVE  CNS-GSZ-2
             TO  RYORITU-KBN            OF  PARM-SCZY4408-ARG1
      *----------  国コード
           MOVE  WK-TSTSK-CD
             TO  KUNI-CD                OF  PARM-SCZY4408-ARG1
      *----------  適用日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03-PARM
             TO  TEKIYOBI               OF  PARM-SCZY4408-ARG1
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03-PARM
             TO  SEC-SBT-CD             OF  PARM-SCZY4408-ARG1
      *----------  基準値
           MOVE  WK-KJN-TI
             TO  KJN-TI                 OF  PARM-SCZY4408-ARG1
      *----------  料率データエリア
           MOVE  RYORITU-DATA-AREA      OF  PARM-SMZJ2110-ARG1
             TO  PARM-SCZY4408-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":料率パターンコード  =["
      D             COMMISSION-PATTERN  OF  PARM-SCZY4408-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":料率区分  =["
      D             RYORITU-KBN         OF  PARM-SCZY4408-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":国コード  =["
      D             KUNI-CD             OF  PARM-SCZY4408-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":適用日  =["
      D             TEKIYOBI            OF  PARM-SCZY4408-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":証券種別コード  =["
      D             SEC-SBT-CD          OF  PARM-SCZY4408-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":基準値  =["
      D             KJN-TI              OF  PARM-SCZY4408-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":料率データエリア  =["
      D             PARM-SCZY4408-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "SCZY4408"             USING  PARM-SCZY4408-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4408)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             WHEN  CNS-RTN-000
               MOVE  RYORITU            OF  PARM-SCZY4408-ARG3
                 TO  WK-SJTK-KUNI-GSZ-TAX-RT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク市場国源泉税率  =["
      D                                   WK-SJTK-KUNI-GSZ-TAX-RT"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
               MOVE  ZERO               TO  WK-SJTK-KUNI-GSZ-TAX-RT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク市場国源泉税率  =["
      D                                   WK-SJTK-KUNI-GSZ-TAX-RT"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー
               MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-069
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":【SCZY4408】料率情報取得処理  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** 【SCZY4408】料率情報取得処理"
      D                                                   "  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4408-EXT.
           EXIT.
      ******************************************************************
      *    C)未収収益計算データINSERT処理 (「別紙1-3 SQL説明」を参照)
      ******************************************************************
       TKMZBW08-INSERT1-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** C)未収収益計算データINSERT処理"
      D             "(「別紙1-3 SQL説明」を参照)処理  START ***"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW08-I,
                 WK-SQL-SYORI-YMD       OF  WK-MSG-TKMZBW08
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW08-I,
                 WK-SQL-KIDOU-ID        OF  WK-MSG-TKMZBW08
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW08-I,
                 H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW08-I,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-TKMZBW08,
                 WK-SQL-UPD-LOGIN-CMP-CD
                                        OF  WK-MSG-TKMZBW08
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW08-I,
                 WK-SQL-FUND-CD         OF  WK-MSG-TKMZBW08
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW08-I,
                 WK-SQL-PTF-CD          OF  WK-MSG-TKMZBW08
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZBW08-I,
                 WK-SQL-SEC-SBT-CD      OF  WK-MSG-TKMZBW08
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZBW08-I,
                 WK-SQL-MEG-CD          OF  WK-MSG-TKMZBW08
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZBW08-I,
                 WK-SQL-TATE-FLG        OF  WK-MSG-TKMZBW08
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZBW08-I,
                 WK-SQL-GYOKU-ID        OF  WK-MSG-TKMZBW08
      *----------  適用開始日
           MOVE  H-YKJ-YMD              OF  H-TKMZBW04-1
             TO  H-TEKIYO-FROM          OF  H-TKMZBW08-I,
                 WK-SQL-TEKIYO-FROM     OF  WK-MSG-TKMZBW08
      *----------  権利落日
           MOVE  H-YKJ-YMD              OF  H-TKMZBW04-1
             TO  H-KENRI-OTI-YMD        OF  H-TKMZBW08-I,
                 WK-SQL-KENRI-OTI-YMD   OF  WK-MSG-TKMZBW08
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD        OF  WK-TKMZBW03-PARM
             TO  H-SIJO-TUKA-CD         OF  H-TKMZBW08-I,
                 WK-SQL-SIJO-TUKA-CD    OF  WK-MSG-TKMZBW08
      *----------  権利付数量
           MOVE  H-KENRI-SURYO-TTL      OF  H-TKMZBW04-1
             TO  H-RIT-SRY              OF  H-TKMZBW08-I,
                 WK-SQL-RIT-SRY         OF  WK-MSG-TKMZBW08
      *----------  市場通貨未収収益
           MOVE  WK-SJTK-MS-SHEKI
             TO  H-SJTK-MS-SHEKI        OF  H-TKMZBW08-I,
                 WK-SQL-SJTK-MS-SHEKI   OF  WK-MSG-TKMZBW08
      *----------  市場通貨源泉税
           MOVE  WK-SJTK-GENSEN-TAX
             TO  H-SJTK-GENSEN-TAX      OF  H-TKMZBW08-I,
                 WK-SQL-SJTK-GENSEN-TAX OF  WK-MSG-TKMZBW08
      *----------  未入金対象数量残高
           MOVE  H-KENRI-SURYO-TTL      OF  H-TKMZBW04-1
             TO  H-MNK-TSHO-SRYZN       OF  H-TKMZBW08-I,
                 WK-SQL-MNK-TSHO-SRYZN  OF  WK-MSG-TKMZBW08
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日=["
      D            H-SYORI-YMD          OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":起動ID=["
      D            H-KIDOU-ID           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-FUND-CD            OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      D            H-PTF-CD             OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード=["
      D            H-MEG-CD             OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード=["
      D            H-SEC-SBT-CD         OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":玉ID=["
      D            H-GYOKU-ID           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":適用開始日=["
      D            H-TEKIYO-FROM        OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":権利落日=["
      D            H-KENRI-OTI-YMD      OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨コード=["
      D            H-SIJO-TUKA-CD       OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":権利付数量=["
      D            H-RIT-SRY            OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨未収収益=["
      D            H-SJTK-MS-SHEKI      OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨源泉税=["
      D            H-SJTK-GENSEN-TAX    OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":未入金対象数量残高=["
      D            H-MNK-TSHO-SRYZN     OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード=["
      D            H-UPD-LOGIN-CMP-CD   OF  H-TKMZBW08-I"]"
      *-----------------------------------------------------------------
           MOVE  CNS-POS-014            TO  WK-ERR-POS
           MOVE  CNS-POS-015            TO  WK-ERR-POS1
           MOVE  CNS-POS-016            TO  WK-ERR-POS2
           PERFORM  TKMZBW08-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":*** C)未収収益計算データINSERT処理"
      D             "(「別紙1-3 SQL説明」を参照)処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-INSERT1-EXT.
           EXIT.
      ******************************************************************
      *     未収収益計算データINSERT処理
      ******************************************************************
       TKMZBW08-INSERT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***未収収益計算データINSERT処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-INSERT-TKMZBW08     TO  SQLSTMT2                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT2=["SQLSTMT2"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-TKMZBW08=["WK-MSG-TKMZBW08"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW08-S3-INSERT =["
      D            FLG-TKMZBW08-S3-INSERT"]"
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @SEINO@@
           IF  FLG-TKMZBW08-S3-INSERT = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
      *----------  未収収益計算データ INSERT PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS3第一回"
      *-----------------------------------------------------------------
           EXEC SQL
             PREPARE  S3  FROM :SQLSTMT2                                @3212SEINO@@
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ INSERT PREPARE "
      D             "SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データINSERT PREPARE  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データINSERT PREPARE  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-TKMZBW08    DELIMITED  BY SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *----------  未収収益計算データ INSERT EXECUTE
           EXEC SQL
               EXECUTE S3
                 USING :H-TKMZBW08-I
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ INSERT  EXECUTE "
      D             " SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ INSERT  正常"
      *-----------------------------------------------------------------
               MOVE  CNS-ON             TO  FLG-TKMZBW08-S3-INSERT      @SEINO@@
               CONTINUE
             WHEN  CNS-SQL-UNIQUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ INSERT 一意制約違反"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
               MOVE  WK-ERR-POS1
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-300
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-TKMZBW08   DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データ INSERT  異常"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
               MOVE  WK-ERR-POS2
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-TKMZBW08   DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***未収収益計算データINSERT処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-INSERT-EXT.
           EXIT.
      ******************************************************************
      *           対象取引情報(別紙1-1) CURSOR CLOSE
      ******************************************************************
      *TKMZBW04-CLOSE1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *             ":*** 対象取引情報(別紙1-1) CURSOR CLOSE START ***"
      *-------------------<DEBUG>---------------------------------------
      *    EXEC  SQL
      *      CLOSE TKMZBW04_CUR1
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":対象取引情報(別紙1-1) CURSOR CLOSE "
      *    " SQLCODE=[" SQLCODE "]"
      *-------------------<DEBUG>---------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZBW04-1-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-1) CURSOR CLOSE  正常 "
      *    DISPLAY  CNS-PGM-ID":対象取引情報データカーソルオープン"
      *             "フラグ１=[" FLG-TKMZBW04-1-CR-OPEN "]"
      *-------------------<DEBUG>---------------------------------------
      *    ELSE
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-1) CURSOR CLOSE エラー"
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-018
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-TKMZBW04    DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ポジション             =["
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *             ":*** 対象取引情報(別紙1-1) CURSOR CLOSE  END ***"
      *-------------------<DEBUG>---------------------------------------
      *    CONTINUE.
      *TKMZBW04-CLOSE1-EXT.
      *    EXIT.
      ******************************************************************
      *         3.2.2. 変更日計算の処理
      ******************************************************************
       REVISE-YMD-SHORI-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  変更日計算の処理 START ***"
      *-----------------------------------------------------------------
      *----------  3.2.2 2)ワークINDEX1は1からワーク変更日配当情報件数まで、下記処理を繰り返す
      *-----------------------------------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク変更日配当情報件数 =["
      D             WK-REVISE-YMD-HAIT-KENSU"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-INDEX1
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [REVISE-YMD-SHORI-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  RS-YMD-SHORI-RTN  VARYING  WK-INDEX1
           FROM  CNS-1  BY  CNS-1
             UNTIL  WK-INDEX1  >  WK-REVISE-YMD-HAIT-KENSU
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [REVISE-YMD-SHORI-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  変更日計算の処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       REVISE-YMD-SHORI-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2 2)ワークINDEX1は1からワーク変更日配当情報件数まで、下記処理を繰り返す
      ******************************************************************
       RS-YMD-SHORI-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":変更日ごとに下記処理を繰り返す処理 START ***"
      D    DISPLAY  CNS-PGM-ID  ":ワークINDEX1=["WK-INDEX1"]"
      D    DISPLAY  CNS-PGM-ID":ワーク変更日配当情報（"WK-INDEX1
      D             ").予実区分 =["
      D             WK-YOJI-KBN     OF  WK-REVISE-YMD-HAIT(WK-INDEX1)"]"
      *-----------------------------------------------------------------
      *----------  ①ワーク権利落日（直前データ検索用）←ワーク変更日配当情報(ワークINDEX1)．権利落日
           MOVE  WK-KENRI-OTI-YMD      OF  WK-REVISE-YMD-HAIT(WK-INDEX1)
             TO  WK-KENRI-OTI-YMD-SE
      *----------  ワーク適用開始日（直前データ検索用）←ワーク変更日配当情報(ワークINDEX1)．適用開始日
           MOVE  WK-TEKIYO-FROM        OF  WK-REVISE-YMD-HAIT(WK-INDEX1)
             TO  WK-TEKIYO-FROM-SE
      *----------  未収配当情報データなしフラグ←0
           MOVE  ZERO                  TO  WK-MISYU-HT-DATA-NASI-FLG
           IF  WK-YOJI-KBN             OF  WK-REVISE-YMD-HAIT(WK-INDEX1)
            =  CNS-YOJI-KBN-2
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク変更日配当情報（ワークINDEX1)."
      D             "予実区分)＝'2'（実績）の場合"
      *-----------------------------------------------------------------
      *----------  ワーク配当合計単価←ワーク変更日配当情報(ワークINDEX1)．配当合計単価
             MOVE  WK-HAIT-TTL-TK      OF  WK-REVISE-YMD-HAIT(WK-INDEX1)
               TO  WK-HAIT-TTL-TNK
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク変更日配当情報("WK-INDEX1
      D             ")．配当合計単価 =["
      D             WK-HAIT-TTL-TK  OF  WK-REVISE-YMD-HAIT(WK-INDEX1)"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.未収配当計上割合 =["
      D             WK-MISYU-HAITOU-WARIAI  OF  WK-TKMZBW02-PARM"]"
      *-----------------------------------------------------------------
      *----------  ワーク配当合計単価←ワーク変更日配当情報(ワークINDEX1)．配当合計単価×ARG1.基準日断面情報.未収配当計上割合/100
             COMPUTE  WK-HAIT-TTL-TNK
                   =  WK-HAIT-TTL-TK   OF  WK-REVISE-YMD-HAIT(WK-INDEX1)
                   *  WK-MISYU-HAITOU-WARIAI  OF  WK-TKMZBW02-PARM
                   /  CNS-100
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":ワーク権利落日（直前データ検索用）=["
      D             WK-KENRI-OTI-YMD-SE"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク適用開始日（直前データ検索用）=["
      D             WK-TEKIYO-FROM-SE"]"
      D    DISPLAY  CNS-PGM-ID  ":未収配当情報データなしフラグ=["
      D             WK-MISYU-HT-DATA-NASI-FLG"]"
      D    DISPLAY  CNS-PGM-ID  ":ワーク配当合計単価=["
      D             WK-HAIT-TTL-TNK"]"
      *-----------------------------------------------------------------
      *----------  ②直前の未収配当情報を取得処理
           PERFORM  TZ-MISYU-HT-GET-RTN
           IF  WK-HKM-FLG = CNS-OFF  THEN
      *----------  ③未収収益と源泉税算出2
             PERFORM  MYSYUEKI-GSZ2-RTN
      *----------  ④未収収益計算データINSERT処理 (「別紙1-4 SQL説明」を参照)
             PERFORM  TKMZBW08-INSERT2-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***変更日ごとに、下記処理を繰り返す処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       RS-YMD-SHORI-EXT.
           EXIT.
      ******************************************************************
      *        直前の未収配当情報を取得処理
      ******************************************************************
       TZ-MISYU-HT-GET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  直前の未収配当情報を取得処理  START ***"
      *-----------------------------------------------------------------
      *----------  3.5直前の未収配当情報取得処理
           MOVE  CNS-OFF  TO  WK-HKM-FLG
      *----------  1)直前の未収収益計算データを取得する
           MOVE  CNS-POS-019            TO  WK-ERR-POS
           MOVE  CNS-POS-020            TO  WK-ERR-POS1
           MOVE  CNS-POS-021            TO  WK-ERR-POS2
           MOVE  CNS-POS-022            TO  WK-ERR-POS3
           PERFORM  TZ-MS-SHEKI-GET-RTN
      *----------  2)直前の未収配当を取得する
           MOVE  CNS-POS-023            TO  WK-ERR-POS
           MOVE  CNS-POS-024            TO  WK-ERR-POS1
           MOVE  CNS-POS-025            TO  WK-ERR-POS2
           MOVE  CNS-POS-026            TO  WK-ERR-POS3
           PERFORM  TZ-MS-HAIT-GET-RTN
      *----------  3)直前の未収配当情報を確定処理
           PERFORM  TZ-MS-HAIT-INFO-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":未収配当情報データなしフラグ=["
      D             WK-MISYU-HT-DATA-NASI-FLG"]"
      D    DISPLAY  CNS-PGM-ID  ":ワーク直前未収収益確定.権利付数量=["
      D             WK-RIT-SRY OF WK-TKMZMS00-KAKUTE"]"
      *-----------------------------------------------------------------
      *----------  未収配当情報データなしフラグ＝1の場合
           IF  WK-MISYU-HT-DATA-NASI-FLG  =  CNS-1
            OR  WK-RIT-SRY OF WK-TKMZMS00-KAKUTE = ZERO
           THEN
             MOVE  CNS-ON  TO  WK-HKM-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":未収配当情報データなしフラグ＝1の場合,"
      D                       "次の繰り返す処理へ進む"
      D    DISPLAY  CNS-PGM-ID ":ワーク変更日未収収益計算フラグ=["
      D             WK-HKM-FLG"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  直前の未収配当情報を取得処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TZ-MISYU-HT-GET-EXT.
           EXIT.
      ******************************************************************
      *         1)直前の未収収益計算データを取得する
      ******************************************************************
       TZ-MS-SHEKI-GET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***直前の未収収益計算データを取得する  START***"
      *-----------------------------------------------------------------
      *----------  未収収益計算データ (別紙1-8)CURSOR PREPARE
           PERFORM  TKMZBW08-PREPARE-RTN
      *----------  未収収益計算データ (別紙1-8)CURSOR OPEN
           PERFORM  TKMZBW08-OPEN-RTN
      *----------  未収収益計算データ (別紙1-8)CURSOR FETCH
           PERFORM  TKMZBW08-FETCH-RTN
      *----------  未収収益計算データ (別紙1-8)CURSOR CLOSE
      **** PERFORM  TKMZBW08-CLOSE-RTN                                  @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の未収収益計算データを取得する  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TZ-MS-SHEKI-GET-EXT.
           EXIT.
      ******************************************************************
      *    未収収益計算データ (別紙1-8)CURSOR PREPARE
      ******************************************************************
       TKMZBW08-PREPARE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未収収益計算データ (別紙1-8)"
      D             "CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE   SQLSTMT3                                        @3212SEINO@@
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW08-S,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-1-8
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW08-S,
                 WK-SQL-FUND-CD         OF  WK-MSG-1-8
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW08-S,
                 WK-SQL-PTF-CD          OF  WK-MSG-1-8
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZBW08-S,
                 WK-SQL-SEC-SBT-CD      OF  WK-MSG-1-8
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZBW08-S,
                 WK-SQL-MEG-CD          OF  WK-MSG-1-8
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZBW08-S,
                 WK-SQL-TATE-FLG        OF  WK-MSG-1-8
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZBW08-S,
                 WK-SQL-GYOKU-ID        OF  WK-MSG-1-8
      *----------  権利落日
           MOVE  WK-KENRI-OTI-YMD-SE
             TO  H-KENRI-OTI-YMD        OF  H-TKMZBW08-S,
                 WK-SQL-KENRI-OTI-YMD   OF  WK-MSG-1-8
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW08-S,
                 WK-SQL-SYORI-YMD       OF  WK-MSG-1-8
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW08-S,
                 WK-SQL-KIDOU-ID        OF  WK-MSG-1-8
      *----------  適用開始日
           MOVE  WK-TEKIYO-FROM-SE
             TO  H-TEKIYO-FROM          OF  H-TKMZBW08-S,
                 WK-SQL-TEKIYO-FROM     OF  WK-MSG-1-8
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-8           TO  SQLSTMT3                  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-FUND-CD            OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      D            H-PTF-CD             OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":銘柄コド=["
      D            H-MEG-CD             OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別コド=["
      D            H-SEC-SBT-CD         OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":玉ID=["
      D            H-GYOKU-ID           OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":権利落日=["
      D            H-KENRI-OTI-YMD      OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":処理実行日=["
      D            H-SYORI-YMD          OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":起動ID=["
      D            H-KIDOU-ID           OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":適用開始日=["
      D            H-TEKIYO-FROM        OF  H-TKMZBW08-S"]"
      D    DISPLAY CNS-PGM-ID":SQLSTMT3=["SQLSTMT3"]"                   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-MSG-1-8=["WK-MSG-1-8"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW08-1-CR-OPEN =["
      D            FLG-TKMZBW08-1-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZBW08-1-CR-OPEN = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
      *----------  未収収益計算データ (別紙1-8)CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS4第一回"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S4  FROM :SQLSTMT3                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID": 未収収益計算データ (別紙1-8)CURSOR"
      D            " PREPARE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-8) SQL処理 (PREPARE)  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-8) SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-8         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  未収収益計算データ (別紙1-8)CURSOR DECLARE
           EXEC  SQL
             DECLARE  TKMZBW08_CUR  CURSOR FOR  S4
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":未収収益計算データ (別紙1-8)CURSOR"
      D            " DECLARE  SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------@SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID":*** 未収収益計算データ (別紙1-8)"
      D             "CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    未収収益計算データ (別紙1-8)CURSOR OPEN
      ******************************************************************
       TKMZBW08-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未収収益計算データ (別紙1-8)"
      D             "CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  未収収益計算データ (別紙1-8)CURSOR OPEN
           EXEC  SQL
               OPEN TKMZBW08_CUR
                 USING :H-TKMZBW08-S.H-RIYO-CMP-CD,
                       :H-TKMZBW08-S.H-FUND-CD,
                       :H-TKMZBW08-S.H-PTF-CD,
                       :H-TKMZBW08-S.H-SEC-SBT-CD,
                       :H-TKMZBW08-S.H-MEG-CD,
                       :H-TKMZBW08-S.H-TATE-FLG,
                       :H-TKMZBW08-S.H-GYOKU-ID,
                       :H-TKMZBW08-S.H-KENRI-OTI-YMD,
                       :H-TKMZBW08-S.H-SYORI-YMD,
                       :H-TKMZBW08-S.H-KIDOU-ID,
                       :H-TKMZBW08-S.H-TEKIYO-FROM
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":未収収益計算データ (別紙1-8)CURSOR "
      D            "OPEN SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE =  CNS-SQL-NORMAL
           THEN
      *----------  未収収益計算データカーソルオープンフラグ1
               MOVE  CNS-ON             TO  FLG-TKMZBW08-1-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-8) SQL処理 (OPEN)  正常"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データカーソルオープン"
      D             "フラグ1=["FLG-TKMZBW08-1-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-8) SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS1
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-8         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未収収益計算データ (別紙1-8)"
      D             "CURSOR OPEN END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    未収収益計算データ (別紙1-8)CURSOR FETCH
      ******************************************************************
       TKMZBW08-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未収収益計算データ (別紙1-8)"
      D             "CURSOR FETCH  START ***"
      *-----------------------------------------------------------------
      *----------  未収収益計算データ (別紙1-8)CURSOR FETCH
           INITIALIZE              H-TKMZBW08
           EXEC  SQL
               FETCH
                    TKMZBW08_CUR
               INTO :H-TKMZBW08.H-RIT-SRY,
                    :H-TKMZBW08.H-SIJO-TUKA-CD,
                    :H-TKMZBW08.H-TEKIYO-FROM,
                    :H-TKMZBW08.H-KENRI-OTI-YMD,
                    :H-TKMZBW08.H-MNK-TSHO-SRYZN,
                    :H-TKMZBW08.H-SJTK-MS-SHEKI,
                    :H-TKMZBW08.H-SJTK-GENSEN-TAX
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":未収収益計算データ (別紙1-8)CURSOR "
      D            "FETCH SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-8) SQL処理 (FETCH)  正常"
      *-----------------------------------------------------------------
      *---------- ワーク直前未収収益計算データ.適用開始日
               MOVE  H-TEKIYO-FROM      OF  H-TKMZBW08
                 TO  WK-TEKIYO-FROM     OF  WK-TKMZBW08
      *----------  ワーク直前未収収益計算データ.権利付数量
               MOVE  H-RIT-SRY          OF  H-TKMZBW08
                 TO  WK-RIT-SRY         OF  WK-TKMZBW08
      *---------- ワーク直前未収収益計算データ.市場通貨コード
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZBW08
                 TO  WK-SIJO-TUKA-CD    OF  WK-TKMZBW08
      *---------- ワーク直前未収収益計算データ.権利落日
               MOVE  H-KENRI-OTI-YMD    OF  H-TKMZBW08
                 TO  WK-KENRI-OTI-YMD   OF  WK-TKMZBW08
      *---------- ワーク直前未収収益計算データ.未入金対象数量残高
               MOVE  H-MNK-TSHO-SRYZN   OF  H-TKMZBW08
                 TO  WK-MNK-TSHO-SRYZN  OF  WK-TKMZBW08
      *---------- ワーク直前未収収益計算データ.市場通貨未収収益
               MOVE  H-SJTK-MS-SHEKI    OF  H-TKMZBW08
                 TO  WK-SJTK-MS-SHEKI-T OF  WK-TKMZBW08
      *---------- ワーク直前未収収益計算データ.市場通貨源泉税
               MOVE  H-SJTK-GENSEN-TAX  OF  H-TKMZBW08
                 TO  WK-SJTK-GENSEN-TAX-T
                                        OF  WK-TKMZBW08
      *---------- ワーク直前未収収益計算データフラグ
               MOVE  CNS-FLG-1          TO  FLG-WK-TKMZBW08
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.適用開"
      D             "始日=["WK-TEKIYO-FROM           OF  WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.権利付数"
      D             "量=["WK-RIT-SRY                 OF  WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.市場通貨"
      D             "コード=["WK-SIJO-TUKA-CD        OF  WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.権利落日=["
      D             WK-KENRI-OTI-YMD                 OF  WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.未入金対"
      D             "象数量残高=["WK-MNK-TSHO-SRYZN  OF  WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.市場通貨"
      D             "未収収益=["WK-SJTK-MS-SHEKI-T   OF  WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.市場通貨"
      D             "源泉税=["WK-SJTK-GENSEN-TAX-T   OF  WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データフラグ=["
      D             FLG-WK-TKMZBW08"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-8) SQL処理 (FETCH)  NOTFOUND"
      *-----------------------------------------------------------------
      *---------- ワーク直前未収収益計算データフラグ
               MOVE  CNS-FLG-0          TO  FLG-WK-TKMZBW08
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データフラグ=["
      D             FLG-WK-TKMZBW08"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未収収益計算データ (別紙1-8)"
      D             "CURSOR FETCH  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-FETCH-EXT.
           EXIT.
      ******************************************************************
      *   未収収益計算データ (別紙1-8)CURSOR CLOSE
      ******************************************************************
      *TKMZBW08-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":*** 未収収益計算データ (別紙1-8)"
      *             "CURSOR CLOSE  START ***"
      *-----------------------------------------------------------------
      *----------  未収収益計算データ (別紙1-8)CURSOR CLOSE
      *    EXEC  SQL
      *      CLOSE TKMZBW08_CUR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":未収収益計算データ(別紙1-8)CURSOR CLOSE"
      *             " SQLCODE=[" SQLCODE "]"
      *-------------------<DEBUG>---------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *----------  未収収益計算データカーソルオープンフラグ1
      *        MOVE  CNS-OFF            TO  FLG-TKMZBW08-1-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-8) SQL処理 (CLOSE)  正常"
      *    DISPLAY  CNS-PGM-ID":未収収益計算データカーソルオープン"
      *             "フラグ1=["FLG-TKMZBW08-1-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY CNS-PGM-ID":(別紙1-8)SQL処理エラー (CLOSE)"
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  WK-ERR-POS3
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-8         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ポジション             =["
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":*** 未収収益計算データ (別紙1-8)"
      *             "CURSOR CLOSE  END ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZBW08-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *         2)直前の未収配当を取得する
      ******************************************************************
       TZ-MS-HAIT-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***直前の未収配当を取得する  START***"
      *-----------------------------------------------------------------
      *----------  未収収益(別紙1-9)CURSOR PREPARE
           PERFORM  TKMZMS00-PREPARE-RTN
      *----------  未収収益(別紙1-9)CURSOR OPEN
           PERFORM  TKMZMS00-OPEN-RTN
      *----------  未収収益(別紙1-9)CURSOR FETCH
           PERFORM  TKMZMS00-FETCH-RTN
      *----------  未収収益(別紙1-9)CURSOR CLOSE
      **** PERFORM  TKMZMS00-CLOSE-RTN                                  @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 直前の未収配当を取得する  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TZ-MS-HAIT-GET-EXT.
           EXIT.
      ******************************************************************
      *    未収収益(別紙1-9)CURSOR PREPARE
      ******************************************************************
       TKMZMS00-PREPARE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 未収収益(別紙1-9)CURSOR PREPARE  START ***"
      *-----------------------------------------------------------------
           INITIALIZE      SQLSTMT4                                     @3212SEINO@@
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZMS00-S,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-1-9
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZMS00-S,
                 WK-SQL-FUND-CD         OF  WK-MSG-1-9
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZMS00-S,
                 WK-SQL-PTF-CD          OF  WK-MSG-1-9
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZMS00-S,
                 WK-SQL-SEC-SBT-CD      OF  WK-MSG-1-9
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZMS00-S,
                 WK-SQL-MEG-CD          OF  WK-MSG-1-9
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZMS00-S,
                 WK-SQL-TATE-FLG        OF  WK-MSG-1-9
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZMS00-S,
                 WK-SQL-GYOKU-ID        OF  WK-MSG-1-9
      *----------  権利落日
           MOVE  WK-KENRI-OTI-YMD-SE
             TO  H-KENRI-OTI-YMD        OF  H-TKMZMS00-S,
                 WK-SQL-KENRI-OTI-YMD   OF  WK-MSG-1-9
      *----------  適用開始日
           MOVE  WK-TEKIYO-FROM-SE
             TO  H-TEKIYO-FROM          OF  H-TKMZMS00-S,
                 WK-SQL-TEKIYO-FROM     OF  WK-MSG-1-9
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-9         TO  SQLSTMT4                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-FUND-CD            OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      D            H-PTF-CD             OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード=["
      D            H-MEG-CD             OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード=["
      D            H-SEC-SBT-CD         OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":玉ID=["
      D            H-GYOKU-ID           OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":権利落日=["
      D            H-KENRI-OTI-YMD      OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":適用開始日=["
      D            H-TEKIYO-FROM        OF  H-TKMZMS00-S"]"
      D    DISPLAY CNS-PGM-ID":SQLSTMT4=["SQLSTMT4"]"                   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-MSG-1-9=["WK-MSG-1-9"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZMS00-1-CR-OPEN =["
      D            FLG-TKMZMS00-1-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZMS00-1-CR-OPEN = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
      *----------  未収収益(別紙1-9)CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS5第一回"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S5  FROM :SQLSTMT4                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":未収収益(別紙1-9)CURSOR PREPARE "
      D            "SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9) SQL処理 (PREPARE)  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-9) SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  未収収益(別紙1-9)CURSOR DECLARE
           EXEC  SQL
             DECLARE  TKMZMS00_CUR CURSOR FOR  S5
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":未収収益(別紙1-9)CURSOR DECLARE "
      D            "SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------@SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 未収収益(別紙1-9)CURSOR PREPARE  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    未収収益(別紙1-9)CURSOR OPEN
      ******************************************************************
       TKMZMS00-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***未収収益(別紙1-9)CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  未収収益(別紙1-9)CURSOR OPEN
           EXEC  SQL
               OPEN TKMZMS00_CUR
                 USING :H-TKMZMS00-S.H-RIYO-CMP-CD,
                       :H-TKMZMS00-S.H-FUND-CD,
                       :H-TKMZMS00-S.H-PTF-CD,
                       :H-TKMZMS00-S.H-SEC-SBT-CD,
                       :H-TKMZMS00-S.H-MEG-CD,
                       :H-TKMZMS00-S.H-TATE-FLG,
                       :H-TKMZMS00-S.H-GYOKU-ID,
                       :H-TKMZMS00-S.H-KENRI-OTI-YMD,
                       :H-TKMZMS00-S.H-TEKIYO-FROM
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":未収収益(別紙1-9)CURSOR OPEN SQLCODE=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE =  CNS-SQL-NORMAL
           THEN
      *----------  未収収益カーソルオープンフラグ1
               MOVE  CNS-ON             TO  FLG-TKMZMS00-1-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9) SQL処理 (OPEN)  正常"
      D    DISPLAY CNS-PGM-ID":未収収益カーソルオープンフラグ1=["
      D            FLG-TKMZMS00-1-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-9) SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS1
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***未収収益(別紙1-9)CURSOR OPEN START ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    未収収益(別紙1-9)CURSOR FETCH
      ******************************************************************
       TKMZMS00-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 未収収益(別紙1-9)CURSOR FETCH  START ***"
      *-----------------------------------------------------------------
      *----------  未収収益(別紙1-9)CURSOR FETCH
           INITIALIZE              H-TKMZMS00
           EXEC  SQL
               FETCH
                    TKMZMS00_CUR
               INTO :H-TKMZMS00.H-RIT-SRY,
                    :H-TKMZMS00.H-SIJO-TUKA-CD,
                    :H-TKMZMS00.H-TEKIYO-FROM,
                    :H-TKMZMS00.H-KENRI-OTI-YMD,
                    :H-TKMZMS00.H-MNK-TSHO-SRYZN,
                    :H-TKMZMS00.H-MNK-TSHO-SRYZN-IN,
                    :H-TKMZMS00.H-SJTK-MS-SHEKI,
                    :H-TKMZMS00.H-SJTK-MS-SHEKI-IN,
                    :H-TKMZMS00.H-SJTK-GENSEN-TAX,
                    :H-TKMZMS00.H-SJTK-GENSEN-TAX-IN,
                    :H-TKMZMS00.H-UYTK-MS-SHEKI-IN,
                    :H-TKMZMS00.H-UYTK-GENSEN-TAX-IN,
                    :H-TKMZMS00.H-HYK-KWS-IN,
                    :H-TKMZMS00.H-GENS-TAX-HYK-KWS-IN
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":未収収益(別紙1-9)CURSOR FETCH SQLCODE=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9) SQL処理 (FETCH)  正常"
      *-----------------------------------------------------------------
      *----------  ワーク直前未収収益.適用開始日
               MOVE  H-TEKIYO-FROM      OF  H-TKMZMS00
                 TO  WK-TEKIYO-FROM     OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.権利付数量
               MOVE  H-RIT-SRY          OF  H-TKMZMS00
                 TO  WK-RIT-SRY         OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.市場通貨コード
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZMS00
                 TO  WK-SIJO-TUKA-CD    OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.権利落日
               MOVE  H-KENRI-OTI-YMD    OF  H-TKMZMS00
                 TO  WK-KENRI-OTI-YMD   OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.未入金対象数量残高
               MOVE  H-MNK-TSHO-SRYZN   OF  H-TKMZMS00
                 TO  WK-MNK-TSHO-SRYZN  OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.未入金対象数量残高（入力値）
               MOVE  H-MNK-TSHO-SRYZN-IN
                                        OF  H-TKMZMS00
                 TO  WK-MNK-TSHO-SRYZN-IN
                                        OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.市場通貨未収収益
               MOVE  H-SJTK-MS-SHEKI    OF  H-TKMZMS00
                 TO  WK-SJTK-MS-SHEKI-T OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.市場通貨源泉税
               MOVE  H-SJTK-GENSEN-TAX     OF  H-TKMZMS00
                 TO  WK-SJTK-GENSEN-TAX-T  OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.市場通貨未収収益（入力値）
               MOVE  H-SJTK-MS-SHEKI-IN    OF  H-TKMZMS00
                 TO  WK-SJTK-MS-SHEKI-IN   OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.市場通貨源泉税（入力値）
               MOVE  H-SJTK-GENSEN-TAX-IN  OF  H-TKMZMS00
                 TO  WK-SJTK-GENSEN-TAX-IN OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.運用通貨未収収益（入力値）
               MOVE  H-UYTK-MS-SHEKI-IN OF  H-TKMZMS00
                 TO  WK-UYTK-MS-SHEKI-IN
                                        OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.運用通貨源泉税（入力値）
               MOVE  H-UYTK-GENSEN-TAX-IN
                                        OF  H-TKMZMS00
                 TO  WK-UYTK-GENSEN-TAX-IN
                                        OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.評価為替レート（入力値）
               MOVE  H-HYK-KWS-IN       OF  H-TKMZMS00
                 TO  WK-HYK-KWS-IN      OF  WK-TKMZMS00
      *----------  ワーク直前未収収益.源泉税評価為替レート（入力値）
               MOVE  H-GENS-TAX-HYK-KWS-IN
                                        OF  H-TKMZMS00
                 TO  WK-GENS-TAX-HYK-KWS-IN
                                        OF  WK-TKMZMS00
      *----------  ワーク直前未収収益フラグ
               MOVE  CNS-FLG-1          TO  FLG-WK-TKMZMS00
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.適用開始日=["
      D             WK-TEKIYO-FROM      OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.権利付数量=["
      D             WK-RIT-SRY          OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨コード=["
      D             WK-SIJO-TUKA-CD     OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.権利落日=["
      D             WK-KENRI-OTI-YMD    OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.未入金対象数量残高=["
      D             WK-MNK-TSHO-SRYZN   OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク直前未収収益.未入金対象数量残高（入力値）=["
      D             WK-MNK-TSHO-SRYZN-IN
      D                                 OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨未収収益=["
      D             WK-SJTK-MS-SHEKI-T  OF  WK-TKMZMS00 "]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX-T OF  WK-TKMZMS00 "]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨未収収益"
      D             "（入力値）=["WK-SJTK-MS-SHEKI-IN OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨源泉税"
      D           "（入力値）=["WK-SJTK-GENSEN-TAX-IN OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "運用通貨未収収益（入力値）    =["
      D             WK-UYTK-MS-SHEKI-IN OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "運用通貨源泉税（入力値）      =["
      D             WK-UYTK-GENSEN-TAX-IN
      D                                 OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "評価為替レート（入力値）      =["
      D             WK-HYK-KWS-IN       OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "源泉税評価為替レート（入力値）=["
      D             WK-GENS-TAX-HYK-KWS-IN
      D                                 OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益フラグ=["
      D             FLG-WK-TKMZMS00 "]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-9) SQL処理 (FETCH)  NOTFOUND"
      *-----------------------------------------------------------------
               MOVE  CNS-FLG-0          TO  FLG-WK-TKMZMS00
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":ワーク直前未収収益フラグ=["
      D            FLG-WK-TKMZMS00"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-9)  SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 未収収益(別紙1-9)CURSOR FETCH  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-FETCH-EXT.
           EXIT.
      ******************************************************************
      *   未収収益(別紙1-9)CURSOR CLOSE
      ******************************************************************
      *TKMZMS00-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *             ":*** 未収収益(別紙1-9)CURSOR CLOSE  START ***"
      *-----------------------------------------------------------------
      *----------  未収収益(別紙1-9)CURSOR CLOSE
      *    EXEC  SQL
      *      CLOSE TKMZMS00_CUR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":未収収益(別紙1-9)CURSOR CLOSE SQLCODE=["
      *     SQLCODE "]"
      *-------------------<DEBUG>---------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *----------  未収収益カーソルオープンフラグ1
      *        MOVE  CNS-OFF            TO  FLG-TKMZMS00-1-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-9) SQL処理 (CLOSE)  正常"
      *    DISPLAY  CNS-PGM-ID":未収収益カーソルオープンフラグ1=["
      *             FLG-TKMZBW08-1-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-8) SQL処理エラー (CLOSE)"
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  WK-ERR-POS3
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-9         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ポジション             =["
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *             ":*** 未収収益(別紙1-9)CURSOR CLOSE  END ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *TKMZMS00-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *         3)直前の未収配当情報を確定処理
      ******************************************************************
       TZ-MS-HAIT-INFO-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の未収配当情報を確定処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データフラグ=["
      D             FLG-WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益フラグ=["
      D             FLG-WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.適用開"
      D             "始日=["WK-TEKIYO-FROM  OF  WK-TKMZBW08"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.適用開始日=["
      D             WK-TEKIYO-FROM          OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "市場通貨未収収益（入力値）    =["
      D             WK-SJTK-MS-SHEKI-IN     OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "市場通貨源泉税（入力値）      =["
      D              WK-SJTK-GENSEN-TAX-IN  OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "未入金対象数量残高（入力値）  =["
      D             WK-MNK-TSHO-SRYZN-IN    OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "運用通貨未収収益（入力値）    =["
      D             WK-UYTK-MS-SHEKI-IN     OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "運用通貨源泉税（入力値）      =["
      D             WK-UYTK-GENSEN-TAX-IN   OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "評価為替レート（入力値）      =["
      D             WK-HYK-KWS-IN           OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益."
      D             "源泉税評価為替レート（入力値）=["
      D             WK-GENS-TAX-HYK-KWS-IN  OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク適用開始日（直前データ検索用）=["
      D             WK-TEKIYO-FROM-SE"]"
      *-----------------------------------------------------------------
      *---------- ①ワーク直前未収収益計算データフラグ＝0 かつワーク直前未収収益フラグ＝0
           IF  FLG-WK-TKMZBW08 = CNS-FLG-0  AND
               FLG-WK-TKMZMS00 = CNS-FLG-0
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク直前未収収益計算データフラグ"
      D    "＝0 かつワーク直前未収収益フラグ＝0 の場合"
      *-----------------------------------------------------------------
      *----------  未収配当情報データなしフラグ←1
             MOVE  CNS-1                TO  WK-MISYU-HT-DATA-NASI-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収配当情報データなしフラグ=["
      D             WK-MISYU-HT-DATA-NASI-FLG"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *---------- ◇ワーク入金計算フラグ＝1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク入金計算フラグ=["WK-NYUKN-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-NYUKN-FLG = CNS-1
           THEN
      *---------- ◇(((ワーク直前未収収益計算データフラグ＝1 かつ ワーク直前未収収益フラグ＝1)
      *且つ(ワーク直前未収収益計算データ.適用開始日≦ワーク直前未収収益.適用開始日))
      *又は(ワーク直前未収収益計算データフラグ＝0 かつ ワーク直前未収収益フラグ＝1))
      *且つ(ワーク直前未収収益.市場通貨未収収益（入力値）≠ 999999999999999.999
      *OR ワーク直前未収収益.市場通貨源泉税（入力値）≠ 999999999999999.999
      *OR ワーク直前未収収益.未入金対象数量残高（入力値）≠ 999999999999.999999
      *OR ワーク直前未収収益.運用通貨未収収益（入力値）≠ 999999999999999.999
      *OR ワーク直前未収収益.運用通貨源泉税（入力値）≠ 999999999999999.999
      *OR ワーク直前未収収益.評価為替レート（入力値）≠ 99999999.9999999999
      *OR ワーク直前未収収益.源泉税評価為替レート（入力値）≠ 99999999.9999999999）
      *且つ （ワーク直前未収収益.適用開始日＝ワーク適用開始日（直前データ検索用））
             IF  (((FLG-WK-TKMZBW08 = CNS-FLG-1 AND
                    FLG-WK-TKMZMS00 = CNS-FLG-1)
               AND (WK-TEKIYO-FROM  OF  WK-TKMZBW08 <=
                    WK-TEKIYO-FROM  OF  WK-TKMZMS00))      OR
                   (FLG-WK-TKMZBW08 = CNS-FLG-0 AND
                    FLG-WK-TKMZMS00 = CNS-FLG-1))
               AND (WK-SJTK-MS-SHEKI-IN    OF  WK-TKMZMS00
                    NOT= 999999999999999.999               OR
                    WK-SJTK-GENSEN-TAX-IN  OF  WK-TKMZMS00
                    NOT= 999999999999999.999               OR
                    WK-MNK-TSHO-SRYZN-IN   OF  WK-TKMZMS00
                    NOT= 999999999999.999999               OR
                    WK-UYTK-MS-SHEKI-IN    OF  WK-TKMZMS00
                    NOT= 999999999999999.999               OR
                    WK-UYTK-GENSEN-TAX-IN  OF  WK-TKMZMS00
                    NOT= 999999999999999.999               OR
                    WK-HYK-KWS-IN          OF  WK-TKMZMS00
                    NOT= 99999999.9999999999               OR
                    WK-GENS-TAX-HYK-KWS-IN OF  WK-TKMZMS00
                    NOT= 99999999.9999999999)
               AND (WK-TEKIYO-FROM  OF  WK-TKMZMS00 = WK-TEKIYO-FROM-SE)
             THEN
      *----------  未収配当情報データなしフラグ←1
               MOVE  CNS-1              TO  WK-MISYU-HT-DATA-NASI-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収配当情報データなしフラグ=["
      D             WK-MISYU-HT-DATA-NASI-FLG"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *---------- ◇未収配当情報データなしフラグ≠1の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収配当情報データなしフラグ=["
      D             WK-MISYU-HT-DATA-NASI-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-MISYU-HT-DATA-NASI-FLG NOT= CNS-1
           THEN
      *---------- ②条件１：ワーク直前未収収益計算データフラグ＝1 かつ ワーク直前未収収益フラグ＝0
      *           又は 条件２：（ワーク直前未収収益計算データフラグ＝1 かつ ワーク直前未収収益フラグ＝1）
      *           かつ ワーク直前未収収益計算データ.適用開始日＞ワーク直前未収収益.適用開始日
             IF  (FLG-WK-TKMZBW08 = CNS-FLG-1  AND
                 FLG-WK-TKMZMS00 = CNS-FLG-0)  OR
                 ((FLG-WK-TKMZBW08 = CNS-FLG-1  AND
                 FLG-WK-TKMZMS00 = CNS-FLG-1)   AND
                 WK-TEKIYO-FROM OF WK-TKMZBW08 >
                 WK-TEKIYO-FROM OF WK-TKMZMS00)
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ②条件１：ワーク直前未収収益計算"
      D    "データフラグ＝1 かつ ワーク直前未収収益フラグ＝0 又は "
      D    "条件２：（ワーク直前未収収益計算データフラグ＝1 かつ "
      D    "ワーク直前未収収益フラグ＝1） かつ ワーク直前未収収益計算"
      D    "データ.適用開始日＞ワーク直前未収収益.適用開始日の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前未収収益確定.権利付数量  ←  ワーク直前未収収益計算データ.権利付数量
               MOVE  WK-RIT-SRY           OF  WK-TKMZBW08
                 TO  WK-RIT-SRY           OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.市場通貨コード  ←  ワーク直前未収収益計算データ.市場通貨コード
               MOVE  WK-SIJO-TUKA-CD      OF  WK-TKMZBW08
                 TO  WK-SIJO-TUKA-CD      OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.権利落日  ←  ワーク直前未収収益計算データ.権利落日
               MOVE  WK-KENRI-OTI-YMD     OF  WK-TKMZBW08
                 TO  WK-KENRI-OTI-YMD     OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.未入金対象数量残高  ←  ワーク直前未収収益計算データ.未入金対象数量残高
               MOVE  WK-MNK-TSHO-SRYZN    OF  WK-TKMZBW08
                 TO  WK-MNK-TSHO-SRYZN    OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.市場通貨未収収益    ←  ワーク直前未収収益計算データ.市場通貨未収収益
               MOVE  WK-SJTK-MS-SHEKI-T   OF  WK-TKMZBW08
                 TO  WK-SJTK-MS-SHEKI-K   OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.市場通貨源泉税      ←  ワーク直前未収収益計算データ.市場通貨源泉税
               MOVE  WK-SJTK-GENSEN-TAX-T OF  WK-TKMZBW08
                 TO  WK-SJTK-GENSEN-TAX-K OF  WK-TKMZMS00-KAKUTE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.権利付数量=["
      D             WK-RIT-SRY                OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨コード=["
      D             WK-SIJO-TUKA-CD           OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.権利落日=["
      D             WK-KENRI-OTI-YMD          OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.未入金対象数量"
      D             "残高=["WK-MNK-TSHO-SRYZN OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨未収収益"
      D             "=["WK-SJTK-MS-SHEKI-K    OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨源泉税"
      D             "=["WK-SJTK-GENSEN-TAX-K  OF  WK-TKMZMS00-KAKUTE"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *---------- ③（ワーク直前未収収益計算データフラグ＝1 かつ ワーク直前未収収益フラグ＝1）
      *           かつ ワーク直前未収収益計算データ.適用開始日＝ワーク直前未収収益.適用開始日の場合
             IF  (FLG-WK-TKMZBW08 = CNS-FLG-1  AND
                 FLG-WK-TKMZMS00 = CNS-FLG-1)  AND
                 WK-TEKIYO-FROM OF WK-TKMZBW08 =
                 WK-TEKIYO-FROM OF WK-TKMZMS00
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ③（ワーク直前未収収益計算データ"
      D    "フラグ＝1 かつ ワーク直前未収収益フラグ＝1）かつ ワーク"
      D    "直前未収収益計算データ.適用開始日＝ワーク直前未収収益."
      D    "適用開始日の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前未収収益確定.権利付数量  ←  ワーク直前未収収益計算データ.権利付数量
               MOVE  WK-RIT-SRY         OF  WK-TKMZBW08
                 TO  WK-RIT-SRY         OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.市場通貨コード  ←  ワーク直前未収収益計算データ.市場通貨コード
               MOVE  WK-SIJO-TUKA-CD    OF  WK-TKMZBW08
                 TO  WK-SIJO-TUKA-CD    OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.権利落日  ←  ワーク直前未収収益計算データ.権利落日
               MOVE  WK-KENRI-OTI-YMD   OF  WK-TKMZBW08
                 TO  WK-KENRI-OTI-YMD   OF  WK-TKMZMS00-KAKUTE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.権利付数量=["
      D             WK-RIT-SRY                OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨コード=["
      D             WK-SIJO-TUKA-CD           OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.権利落日=["
      D             WK-KENRI-OTI-YMD          OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク直前未収収益.未入金対象数量残高（入力値）=["
      D             WK-MNK-TSHO-SRYZN-IN      OF  WK-TKMZMS00"]"
      *-----------------------------------------------------------------
      *----------  ワーク直前未収収益.未入金対象数量残高（入力値）＝初期値（全部9）の場合
               IF  WK-MNK-TSHO-SRYZN-IN   OF  WK-TKMZMS00 = CNS-ALL-9
               THEN
      *----------  ワーク直前未収収益確定.未入金対象数量残高  ←  ワーク直前未収収益計算データ.未入金対象数量残高
                 MOVE  WK-MNK-TSHO-SRYZN  OF  WK-TKMZBW08
                   TO  WK-MNK-TSHO-SRYZN  OF  WK-TKMZMS00-KAKUTE
               ELSE
      *----------  ワーク直前未収収益確定.未入金対象数量残高  ←  ワーク直前未収収益計算データ.未入金対象数量残高
                 MOVE  WK-MNK-TSHO-SRYZN-IN
                                          OF  WK-TKMZMS00
                   TO  WK-MNK-TSHO-SRYZN  OF  WK-TKMZMS00-KAKUTE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.未入金対象数量"
      D             "残高=["WK-MNK-TSHO-SRYZN OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨未収収益（入"
      D             "力値）=["WK-SJTK-MS-SHEKI-IN OF WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.市場通貨未"
      D             "収収益=["WK-SJTK-MS-SHEKI-T  OF WK-TKMZBW08"]"
      *-----------------------------------------------------------------
      *----------  b)◇ワーク直前未収収益.市場通貨未収収益（入力値）＝初期値（全部9）の場合
               IF  WK-SJTK-MS-SHEKI-IN    OF  WK-TKMZMS00 = CNS-ALL-9-0
               THEN
      *----------  ワーク直前未収収益確定.市場通貨未収収益  ←  ワーク直前未収収益計算データ.市場通貨未収収益
                 MOVE  WK-SJTK-MS-SHEKI-T OF  WK-TKMZBW08
                   TO  WK-SJTK-MS-SHEKI-K OF  WK-TKMZMS00-KAKUTE
               ELSE
      *----------  ワーク直前未収収益確定.市場通貨未収収益  ←  ワーク直前未収収益.市場通貨未収収益（入力値）
                 MOVE  WK-SJTK-MS-SHEKI-IN
                                          OF  WK-TKMZMS00
                   TO  WK-SJTK-MS-SHEKI-K OF  WK-TKMZMS00-KAKUTE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨未収収益"
      D             "=["WK-SJTK-MS-SHEKI-K    OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨源泉税（入力"
      D             "値）=["WK-SJTK-GENSEN-TAX-IN OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益計算データ.市場通貨源"
      D             "泉税=["WK-SJTK-GENSEN-TAX-T  OF  WK-TKMZBW08"]"
      *-----------------------------------------------------------------
      *----------  c)◇ワーク直前未収収益.市場通貨源泉税（入力値）＝初期値（全部9）の場合
               IF  WK-SJTK-GENSEN-TAX-IN  OF  WK-TKMZMS00 = CNS-ALL-9-0
               THEN
      *----------  ワーク直前未収収益確定.市場通貨源泉税  ←  ワーク直前未収収益計算データ.市場通貨源泉税
                 MOVE  WK-SJTK-GENSEN-TAX-T  OF  WK-TKMZBW08
                   TO  WK-SJTK-GENSEN-TAX-K  OF  WK-TKMZMS00-KAKUTE
               ELSE
      *----------  ワーク直前未収収益確定.市場通貨源泉税  ←  ワーク直前未収収益.市場通貨源泉税（入力値）
                 MOVE  WK-SJTK-GENSEN-TAX-IN OF  WK-TKMZMS00
                   TO  WK-SJTK-GENSEN-TAX-K  OF  WK-TKMZMS00-KAKUTE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨源泉税"
      D             "=["WK-SJTK-GENSEN-TAX-K  OF  WK-TKMZMS00-KAKUTE"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *---------- ④条件１：ワーク直前未収収益計算データフラグ＝0 かつ ワーク直前未収収益フラグ＝1
      *           又は 条件２：（ワーク直前未収収益計算データフラグ＝1 かつ ワーク直前未収収益フラグ＝1）
      *           かつ ワーク直前未収収益計算データ.適用開始日＜ワーク直前未収収益.適用開始日
             IF  (FLG-WK-TKMZBW08 = CNS-FLG-0  AND
                 FLG-WK-TKMZMS00 = CNS-FLG-1)  OR
                 ((FLG-WK-TKMZBW08 = CNS-FLG-1 AND
                 FLG-WK-TKMZMS00 = CNS-FLG-1) AND
                 WK-TEKIYO-FROM OF WK-TKMZBW08 <
                 WK-TEKIYO-FROM OF WK-TKMZMS00)
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ④条件１：ワーク直前未収収益計算"
      D    "データフラグ＝0 かつ ワーク直前未収収益フラグ＝1 又は "
      D    "条件２：（ワーク直前未収収益計算データフラグ＝1 かつ "
      D    "ワーク直前未収収益フラグ＝1） かつ ワーク直前未収収益計算"
      D    "データ.適用開始日＜ワーク直前未収収益.適用開始日の場合"
      *-----------------------------------------------------------------
      *----------  ワーク直前未収収益確定.権利付数量    ←  ワーク直前未収収益.権利付数量
               MOVE  WK-RIT-SRY         OF  WK-TKMZMS00
                 TO  WK-RIT-SRY         OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.市場通貨コード    ←  ワーク直前未収収益.市場通貨コード
               MOVE  WK-SIJO-TUKA-CD    OF  WK-TKMZMS00
                 TO  WK-SIJO-TUKA-CD    OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.権利落日    ←  ワーク直前未収収益.権利落日
               MOVE  WK-KENRI-OTI-YMD   OF  WK-TKMZMS00
                 TO  WK-KENRI-OTI-YMD   OF  WK-TKMZMS00-KAKUTE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.権利付数量=["
      D             WK-RIT-SRY                OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨コード=["
      D             WK-SIJO-TUKA-CD           OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.権利落日=["
      D             WK-KENRI-OTI-YMD          OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID
      D    ":ワーク直前未収収益.未入金対象数量残高（入力値）=["
      D             WK-MNK-TSHO-SRYZN-IN      OF  WK-TKMZMS00"]"
      *-----------------------------------------------------------------
      *----------  ワーク直前未収収益.未入金対象数量残高（入力値）＝初期値（全部9）の場合
               IF  WK-MNK-TSHO-SRYZN-IN   OF  WK-TKMZMS00 = CNS-ALL-9
               THEN
      *----------  ワーク直前未収収益確定.未入金対象数量残高  ←  ワーク直前未収収益.未入金対象数量残高
                 MOVE  WK-MNK-TSHO-SRYZN  OF  WK-TKMZMS00
                   TO  WK-MNK-TSHO-SRYZN  OF  WK-TKMZMS00-KAKUTE
               ELSE
      *----------  ワーク直前未収収益確定.未入金対象数量残高  ←  ワーク直前未収収益計算データ.未入金対象数量残高
                 MOVE  WK-MNK-TSHO-SRYZN-IN
                                          OF  WK-TKMZMS00
                   TO  WK-MNK-TSHO-SRYZN  OF  WK-TKMZMS00-KAKUTE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.未入金対象数量"
      D             "残高=["WK-MNK-TSHO-SRYZN OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨未収収益（入"
      D             "力値）=["WK-SJTK-MS-SHEKI-IN OF WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨未収収益"
      D             "=["WK-SJTK-MS-SHEKI-T OF  WK-TKMZMS00"]"
      *-----------------------------------------------------------------
      *----------  b)◇ワーク直前未収収益.市場通貨未収収益（入力値）＝初期値（全部9）の場合
               IF  WK-SJTK-MS-SHEKI-IN    OF  WK-TKMZMS00 = CNS-ALL-9-0
               THEN
      *----------  ワーク直前未収収益確定.市場通貨未収収益  ←  ワーク直前未収収益.市場通貨未収収益
                 MOVE  WK-SJTK-MS-SHEKI-T OF  WK-TKMZMS00
                   TO  WK-SJTK-MS-SHEKI-K OF  WK-TKMZMS00-KAKUTE
               ELSE
      *----------  ワーク直前未収収益確定.市場通貨未収収益  ←  ワーク直前未収収益.市場通貨未収収益（入力値）
                 MOVE  WK-SJTK-MS-SHEKI-IN
                                          OF  WK-TKMZMS00
                   TO  WK-SJTK-MS-SHEKI-K OF  WK-TKMZMS00-KAKUTE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨未収収益"
      D             "=["WK-SJTK-MS-SHEKI-K OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨源泉税（入力"
      D             "値）=["WK-SJTK-GENSEN-TAX-IN OF  WK-TKMZMS00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益.市場通貨源泉税"
      D             "=["WK-SJTK-GENSEN-TAX-T OF  WK-TKMZMS00"]"
      *-----------------------------------------------------------------
      *----------  c)◇ワーク直前未収収益.市場通貨源泉税（入力値）＝初期値（全部9）の場合
               IF  WK-SJTK-GENSEN-TAX-IN  OF  WK-TKMZMS00 = CNS-ALL-9-0
               THEN
      *----------  ワーク直前未収収益確定.市場通貨源泉税  ←  ワーク直前未収収益.市場通貨源泉税
                 MOVE  WK-SJTK-GENSEN-TAX-T  OF  WK-TKMZMS00
                   TO  WK-SJTK-GENSEN-TAX-K  OF  WK-TKMZMS00-KAKUTE
               ELSE
      *----------  ワーク直前未収収益確定.市場通貨源泉税  ←  ワーク直前未収収益.市場通貨源泉税（入力値）
                 MOVE  WK-SJTK-GENSEN-TAX-IN OF  WK-TKMZMS00
                   TO  WK-SJTK-GENSEN-TAX-K  OF  WK-TKMZMS00-KAKUTE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨源泉税"
      D             "=["WK-SJTK-GENSEN-TAX-K  OF  WK-TKMZMS00-KAKUTE"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 直前の未収配当情報を確定処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TZ-MS-HAIT-INFO-EXT.
           EXIT.
      ******************************************************************
      *        ③未収収益と源泉税算出2
      ******************************************************************
       MYSYUEKI-GSZ2-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益と源泉税算出2 START ***"
      *-----------------------------------------------------------------
      *----------  (a)ワーク市場通貨未収収益(中間) ← ワーク直前未収収益確定.権利付数量×ワーク配当合計単価×ARG1.数量単位
           COMPUTE  WK-SJTK-MS-SHEKI-CHKN
                  = WK-RIT-SRY        OF  WK-TKMZMS00-KAKUTE
                  * WK-HAIT-TTL-TNK
                  * WK-SURYO-TANI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨未収収益(中間)=["
      D             WK-SJTK-MS-SHEKI-CHKN"]"
      *-----------------------------------------------------------------
      *----------  (b)未収収益の端数処理
           MOVE  WK-SJTK-MS-SHEKI-CHKN
             TO  WK-IN-SUTI
           MOVE  CNS-POS-070            TO  WK-ERR-POS
           PERFORM  IDO-CALC-KMHS-RTN
      *----------  ワーク市場通貨未収収益
           MOVE  WK-OUT-SUTI            TO  WK-SJTK-MS-SHEKI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨未収収益  =["
      D             WK-SJTK-MS-SHEKI"]"
      D    DISPLAY  CNS-PGM-ID ":ARG1.各属性データ.現地源泉税課税区分=["
      D                                            WK-G-GSZ-KAZEI-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ARG1.投資対象国コード=["WK-TSTSK-CD"]"
      D    DISPLAY  CNS-PGM-ID ":料率パターンコード***=["
      D             WK-COMMISSION-PATTERN  OF  WK-TKMZBW02-PARM"]"
      *-----------------------------------------------------------------
      *----------  (b)ARG1.各属性データ.現地源泉税課税区分＝"1" 課税
      *----------  且つ ARG1.投資対象国コード≠SPACEの場合
      *----------  且つ ARG1.料率パターンコード  NOT = SAPCE の場合
           IF  WK-G-GSZ-KAZEI-KBN   =  CNS-G-GSZ-KAZEI-KBN-1
               AND  WK-TSTSK-CD  NOT =  SPACE
               AND  WK-COMMISSION-PATTERN
                                  OF  WK-TKMZBW02-PARM  NOT = SPACE
           THEN
             COMPUTE  WK-KJN-TI
                      =  WK-RIT-SRY     OF  WK-TKMZMS00-KAKUTE
                      * WK-HAIT-TTL-TNK
                      * WK-SURYO-TANI
      *----------  ①【SCZY4408】料率情報取得処理
             PERFORM  SCZY4408-RTN
      *----------  ③ワーク市場通貨源泉税(中間)＝ワーク直前未収収益確定.権利付数量×ワーク配当合計単価×ARG1.数量単位×ワーク市場国源泉税率
             COMPUTE  WK-SJTK-GENSEN-TAX-CHKN
                    =  WK-RIT-SRY       OF  WK-TKMZMS00-KAKUTE
                    * WK-HAIT-TTL-TNK
                    * WK-SURYO-TANI
                    * WK-SJTK-KUNI-GSZ-TAX-RT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク直前未収収益確定.権利付数量×"
      D    "ワーク配当合計単価×ARG1.数量単位×ワーク市場国源泉税率 =["
      D                                       WK-SJTK-GENSEN-TAX-CHKN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税(中間)=["
      D                                       WK-SJTK-GENSEN-TAX-CHKN"]"
      *-----------------------------------------------------------------
           ELSE
             MOVE  ZERO                 TO  WK-SJTK-GENSEN-TAX-CHKN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税(中間)=["
      D                                       WK-SJTK-GENSEN-TAX-CHKN"]"
      *-----------------------------------------------------------------
           END-IF
      *----------  (c)端数処理
      *----------  源泉税の端数処理【SMZC1501】異動計算項目端数処理に接続用パラメータの設定を行なう
           MOVE  WK-SJTK-GENSEN-TAX-CHKN
             TO  WK-IN-SUTI
           MOVE  CNS-POS-028            TO  WK-ERR-POS
           PERFORM  IDO-CALC-KMHS-RTN
      *----------  ワーク市場通貨源泉税
           MOVE  WK-OUT-SUTI            TO  WK-SJTK-GENSEN-TAX
      *----------  (d)ワーク市場通貨未収収益  ←  ワーク市場通貨未収収益  －  ワーク市場通貨源泉税
           COMPUTE  WK-SJTK-MS-SHEKI
                    =  WK-SJTK-MS-SHEKI  -  WK-SJTK-GENSEN-TAX
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨源泉税  =["
      D             WK-SJTK-GENSEN-TAX"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク市場通貨未収収益  =["
      D             WK-SJTK-MS-SHEKI"]"
      D    DISPLAY  CNS-PGM-ID  ":***  未収収益と源泉税算出2  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MYSYUEKI-GSZ2-EXT.
           EXIT.
      ******************************************************************
      *         ④未収収益計算データINSERT処理 (「別紙1-4 SQL説明」を参照)
      ******************************************************************
       TKMZBW08-INSERT2-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***④未収収益計算データINSERT処理"
      D             " (「別紙1-4 SQL説明」を参照)処理  START  ***"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW08-I,
                 WK-SQL-SYORI-YMD       OF  WK-MSG-TKMZBW08
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW08-I,
                 WK-SQL-KIDOU-ID        OF  WK-MSG-TKMZBW08
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW08-I,
                 H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW08-I,
                 WK-SQL-UPD-LOGIN-CMP-CD
                                        OF  WK-MSG-TKMZBW08,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-TKMZBW08
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW08-I,
                 WK-SQL-FUND-CD         OF  WK-MSG-TKMZBW08
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW08-I,
                 WK-SQL-PTF-CD          OF  WK-MSG-TKMZBW08
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZBW08-I,
                 WK-SQL-SEC-SBT-CD      OF  WK-MSG-TKMZBW08
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZBW08-I,
                 WK-SQL-MEG-CD          OF  WK-MSG-TKMZBW08
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZBW08-I,
                 WK-SQL-TATE-FLG        OF  WK-MSG-TKMZBW08
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZBW08-I,
                 WK-SQL-GYOKU-ID        OF  WK-MSG-TKMZBW08
      *----------  適用開始日
           MOVE  WK-TEKIYO-FROM       OF  WK-REVISE-YMD-HAIT(WK-INDEX1)
             TO  H-TEKIYO-FROM          OF  H-TKMZBW08-I,
                 WK-SQL-TEKIYO-FROM     OF  WK-MSG-TKMZBW08
      *----------  権利落日
           MOVE  WK-KENRI-OTI-YMD       OF  WK-TKMZMS00-KAKUTE
             TO  H-KENRI-OTI-YMD        OF  H-TKMZBW08-I,
                 WK-SQL-KENRI-OTI-YMD   OF  WK-MSG-TKMZBW08
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD        OF  WK-TKMZMS00-KAKUTE
             TO  H-SIJO-TUKA-CD         OF  H-TKMZBW08-I,
                 WK-SQL-SIJO-TUKA-CD    OF  WK-MSG-TKMZBW08
      *----------  権利付数量
           MOVE  WK-RIT-SRY             OF  WK-TKMZMS00-KAKUTE
             TO  H-RIT-SRY              OF  H-TKMZBW08-I,
                 WK-SQL-RIT-SRY         OF  WK-MSG-TKMZBW08
      *----------  市場通貨未収収益
           MOVE  WK-SJTK-MS-SHEKI
             TO  H-SJTK-MS-SHEKI        OF  H-TKMZBW08-I,
                 WK-SQL-SJTK-MS-SHEKI   OF  WK-MSG-TKMZBW08
      *----------  市場通貨源泉税
           MOVE  WK-SJTK-GENSEN-TAX
             TO  H-SJTK-GENSEN-TAX      OF  H-TKMZBW08-I,
                 WK-SQL-SJTK-GENSEN-TAX OF  WK-MSG-TKMZBW08
      *----------  未入金対象数量残高
           MOVE  WK-RIT-SRY             OF  WK-TKMZMS00-KAKUTE
             TO  H-MNK-TSHO-SRYZN       OF  H-TKMZBW08-I,
                 WK-SQL-MNK-TSHO-SRYZN  OF  WK-MSG-TKMZBW08
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日=["
      D            H-SYORI-YMD          OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":起動ID=["
      D            H-KIDOU-ID           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-FUND-CD            OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      D            H-PTF-CD             OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード=["
      D            H-SEC-SBT-CD         OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード=["
      D            H-MEG-CD             OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":玉ID=["
      D            H-GYOKU-ID           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":適用開始日=["
      D            H-TEKIYO-FROM        OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":権利落日=["
      D            H-KENRI-OTI-YMD      OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨コード=["
      D            H-SIJO-TUKA-CD       OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":権利付数量=["
      D            H-RIT-SRY            OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨未収収益=["
      D            H-SJTK-MS-SHEKI      OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨源泉税=["
      D            H-SJTK-GENSEN-TAX    OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":未入金対象数量残高=["
      D            H-MNK-TSHO-SRYZN     OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード=["
      D            H-UPD-LOGIN-CMP-CD   OF  H-TKMZBW08-I"]"
      *-----------------------------------------------------------------
           MOVE  CNS-POS-030            TO  WK-ERR-POS
           MOVE  CNS-POS-031            TO  WK-ERR-POS1
           MOVE  CNS-POS-032            TO  WK-ERR-POS2
           PERFORM  TKMZBW08-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***④未収収益計算データINSERT処理"
      D             " (「別紙1-4 SQL説明」を参照)処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-INSERT2-EXT.
           EXIT.
      ******************************************************************
      *        3.2.3. 入金取引計算の処理
      ******************************************************************
       NYUKN-TRHK-SHORI-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  入金取引計算の処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-1                  TO  WK-NYUKN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク入金計算フラグ=["WK-NYUKN-FLG"]"
      *-----------------------------------------------------------------
      *----------   対象取引情報(別紙1-5) CURSOR PREPARE
           PERFORM  TKMZBW04-PRE2-RTN
      *----------   対象取引情報(別紙1-5) CURSOR OPEN
           PERFORM  TKMZBW04-OPEN2-RTN
      *----------   対象取引情報(別紙1-5) CURSOR FETCH
           MOVE  CNS-OFF                TO   FLG-CYCLES-EXIT-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CYCLES-EXIT-2=["
      D             FLG-CYCLES-EXIT-2"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [NYUKN-TRHK-SHORI-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW04-FETCH2-RTN
             UNTIL  FLG-CYCLES-EXIT-2 = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [NYUKN-TRHK-SHORI-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------   対象取引情報(別紙1-5) CURSOR CLOSE
      **** PERFORM  TKMZBW04-CLOSE2-RTN                                 @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  入金取引計算の処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       NYUKN-TRHK-SHORI-EXT.
           EXIT.
      ******************************************************************
      *    対象取引情報(別紙1-5) CURSOR PREPARE
      ******************************************************************
       TKMZBW04-PRE2-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 対象取引情報(別紙1-5)CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE                   SQLSTMT5                        @3212SEINO@@
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW04-S,
                 WK-SQL-SYORI-YMD       OF  WK-MSG-TKMZBW04
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW04-S,
                 WK-SQL-KIDOU-ID        OF  WK-MSG-TKMZBW04
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW04-S,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-TKMZBW04
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW04-S,
                 WK-SQL-FUND-CD         OF  WK-MSG-TKMZBW04
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW04-S,
                 WK-SQL-PTF-CD          OF  WK-MSG-TKMZBW04
      *----------  基準日
           MOVE  WK-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZBW04-S,
                 WK-SQL-KJN-YMD         OF  WK-MSG-TKMZBW04
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZBW04-S,
                 WK-SQL-MEG-CD          OF  WK-MSG-TKMZBW04
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZBW04-S,
                 WK-SQL-SEC-SBT-CD      OF  WK-MSG-TKMZBW04
      *----------  資産 負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZBW04-S,
                 WK-SQL-TATE-FLG        OF  WK-MSG-TKMZBW04
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZBW04-S,
                 WK-SQL-GYOKU-ID        OF  WK-MSG-TKMZBW04
      *----------  未収計算対象フラグ
           MOVE  CNS-MSKS-TARGET-FLG-1
             TO  H-MSKS-TARGET-FLG      OF  H-TKMZBW04-S,
                 WK-SQL-MSKS-TARGET-FLG OF  WK-MSG-TKMZBW04
      *----------  未収計算種類
           MOVE  CNS-MSKS-SHRU-22
             TO  H-MSKS-SHRU            OF  H-TKMZBW04-S,
                 WK-SQL-MSKS-SHRU       OF  WK-MSG-TKMZBW04
      *----ＳＱＬ文
           MOVE  SQL-SELECT-TKMZBW04    TO  SQLSTMT5                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日=["
      D            H-SYORI-YMD          OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":起動ID=["
      D            H-KIDOU-ID           OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-FUND-CD            OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      D            H-PTF-CD             OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":基準日=["
      D            H-KJN-YMD            OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード=["
      D            H-MEG-CD             OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード=["
      D            H-SEC-SBT-CD         OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":玉ID=["
      D            H-GYOKU-ID           OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":未収計算対象フラグ=["
      D            H-MSKS-TARGET-FLG    OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":未収計算種類=["
      D            H-MSKS-SHRU          OF  H-TKMZBW04-S"]"
      D    DISPLAY CNS-PGM-ID":SQLSTMT5=[" SQLSTMT5"]"                  @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-MSG-TKMZBW04=["WK-MSG-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW04-2-CR-OPEN =["
      D            FLG-TKMZBW04-2-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMZBW04-2-CR-OPEN = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
      *----------  対象取引情報(別紙1-5)CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS6第一回"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S6  FROM :SQLSTMT5                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":対象取引情報(別紙1-5)CURSOR PREPARE "
      D            "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE =  CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-5) SQL処理 (PREPARE)  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-5) SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-033
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-TKMZBW04    DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
             DECLARE  TKMZBW04_CUR2 CURSOR FOR  S6
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報(別紙1-5) DECLARE SQLCODE=["
      D             SQLCODE"]"
      *-----------------------------------------------------------------@SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D              ":***対象取引情報(別紙1-5) CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-PRE2-EXT.
           EXIT.
      ******************************************************************
      *    対象取引情報(別紙1-5) CURSOR OPEN
      ******************************************************************
       TKMZBW04-OPEN2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 対象取引情報(別紙1-5) CURSOR OPEN  START ***"
      *-----------------------------------------------------------------
      *----------  対象取引情報(別紙1-5) CURSOR OPEN
           EXEC  SQL
               OPEN TKMZBW04_CUR2
                 USING :H-TKMZBW04-S.H-SYORI-YMD,
                       :H-TKMZBW04-S.H-KIDOU-ID,
                       :H-TKMZBW04-S.H-RIYO-CMP-CD,
                       :H-TKMZBW04-S.H-FUND-CD,
                       :H-TKMZBW04-S.H-PTF-CD,
                       :H-TKMZBW04-S.H-KJN-YMD,
                       :H-TKMZBW04-S.H-MEG-CD,
                       :H-TKMZBW04-S.H-SEC-SBT-CD,
                       :H-TKMZBW04-S.H-TATE-FLG,
                       :H-TKMZBW04-S.H-GYOKU-ID,
                       :H-TKMZBW04-S.H-MSKS-TARGET-FLG,
                       :H-TKMZBW04-S.H-MSKS-SHRU
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報(別紙1-5) CURSOR OPEN "
      D             "SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON             TO  FLG-TKMZBW04-2-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-5) CURSOR OPEN  正常"
      D    DISPLAY CNS-PGM-ID":対象取引情報データカーソルオープン"
      D            "フラグ2 =["FLG-TKMZBW04-2-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-5)SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-034
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-TKMZBW04    DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 対象取引情報(別紙1-5) CURSOR OPEN   END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-OPEN2-EXT.
           EXIT.
      ******************************************************************
      *       対象取引情報(別紙1-5) CURSOR FETCH
      ******************************************************************
       TKMZBW04-FETCH2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***対象取引情報(別紙1-5) CURSOR FETCH  START ***"
      *-----------------------------------------------------------------
      *----------  対象取引情報(別紙1-5) CURSOR FETCH
           INITIALIZE              H-TKMZBW04
           EXEC  SQL
               FETCH
                    TKMZBW04_CUR2
               INTO :H-TKMZBW04.H-TORI-ID
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID": 対象取引情報(別紙1-5) SQLCODE FETCH=["
      D             SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-5) CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":原取引ID=["
      D             H-TORI-ID           OF  H-TKMZBW04"]"
      *-----------------------------------------------------------------
      *----------  ① 取引TBLから入金落日データを取得する(「別紙1-6 SQL説明」を参照)
               PERFORM  TKMXTR00-NYUKN-RTN
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-CYCLES-EXIT-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-5) CURSOR FETCH  NOTFOUND"
      D    DISPLAY CNS-PGM-ID":FLG-CYCLES-EXIT-2="FLG-CYCLES-EXIT-2
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-5) SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-035
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-TKMZBW04  DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***対象取引情報(別紙1-5) CURSOR FETCH  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-FETCH2-EXT.
           EXIT.
      ******************************************************************
      *    ① 取引TBLから入金落日データを取得する(「別紙1-6 SQL説明」を参照)
      ******************************************************************
       TKMXTR00-NYUKN-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***取引TBLから入金落日データを取得する"
      D             "(「別紙1-6 SQL説明」を参照)  START ***"
      *-----------------------------------------------------------------
      *----------  取引テーブル(別紙1-6)CURSOR PREPARE
           PERFORM  TKMXTR00-PRE2-RTN
      *----------  取引テーブル(別紙1-6)CURSOR OPEN
           PERFORM  TKMXTR00-OPEN2-RTN
      *----------  取引テーブル(別紙1-6)CURSOR FETCH
           PERFORM  TKMXTR00-FETCH2-RTN
      *----------  取引テーブル(別紙1-6)CURSOR CLOSE
      **** PERFORM  TKMXTR00-CLOSE2-RTN                                 @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***取引TBLから入金落日データを取得する"
      D             "(「別紙1-6 SQL説明」を参照)  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-NYUKN-EXT.
           EXIT.
      ******************************************************************
      *    取引テーブル(別紙1-6)CURSOR PREPARE
      ******************************************************************
       TKMXTR00-PRE2-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***取引テーブル(別紙1-6)CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT6                                         @3212SEINO@@
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMXTR00-S,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-TKMXTR00
      *----------  原取引ＩＤ
           MOVE  H-TORI-ID              OF  H-TKMZBW04
             TO  H-TORI-ID              OF  H-TKMXTR00-S,
                 WK-SQL-TORI-ID         OF  WK-MSG-TKMXTR00
      *----------  ＳＱＬ文
           STRING  S-SELECT-1-6,
                   S-WHERE-TKMXTR00     DELIMITED  BY  SIZE
             INTO  SQLSTMT6                                             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-TORI-ID            OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":SQLSTMT6=["SQLSTMT6"]"                   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-MSG-TKMXTR00=["WK-MSG-TKMXTR00"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMXTR00-2-CR-OPEN =["
      D            FLG-TKMXTR00-2-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-TKMXTR00-2-CR-OPEN = CNS-OFF                         @SEINO@@
           THEN                                                         @SEINO@@
      *----------  取引テーブル(別紙1-6)CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS7第一回"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S7  FROM :SQLSTMT6                                @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引テーブル(別紙1-6)SQLCODE PREPARE=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE =  CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-6) SQL処理 (PREPARE)  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-6) SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-036
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-TKMXTR00    DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  取引テーブル(別紙1-6)CURSOR DECLARE
           EXEC  SQL
             DECLARE  TKMXTR00_CUR2 CURSOR FOR  S7
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引テーブル(別紙1-6)SQLCODE DECLARE=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------@SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D             ":***取引テーブル(別紙1-6)CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-PRE2-EXT.
           EXIT.
      ******************************************************************
      *    取引テーブル(別紙1-6)CURSOR OPEN
      ******************************************************************
       TKMXTR00-OPEN2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 取引テーブル(別紙1-6)CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  取引テーブル(別紙1-6) CURSOR OPEN
           EXEC  SQL
               OPEN TKMXTR00_CUR2
                 USING :H-TKMXTR00-S.H-RIYO-CMP-CD,
                       :H-TKMXTR00-S.H-TORI-ID
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引テーブル(別紙1-6)SQLCODE OPEN=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON             TO  FLG-TKMXTR00-2-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-6) CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID":取引テーブルカーソルオープンフラグ2=["
      D             FLG-TKMXTR00-2-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-6) SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-037
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-TKMXTR00    DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 取引テーブル(別紙1-6)CURSOR OPEN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-OPEN2-EXT.
           EXIT.
      ******************************************************************
      *    取引テーブル(別紙1-6)CURSOR FETCH
      ******************************************************************
       TKMXTR00-FETCH2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 取引テーブル(別紙1-6)CURSOR FETCH START ***"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF  TO WK-SKIP-FLG
      *----------  取引テーブル(別紙1-6) CURSOR FETCH
           INITIALIZE              H-TKMXTR00-1
           EXEC  SQL
               FETCH
                    TKMXTR00_CUR2
               INTO :H-TKMXTR00-1.H-UKE-YMD,
                    :H-TKMXTR00-1.H-KENRI-SURYO,
                    :H-TKMXTR00-1.H-KOURYOKU-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引テーブル(別紙1-6)SQLCODE FETCH=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-6) CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":受渡日=["
      D             H-UKE-YMD           OF  H-TKMXTR00-1"]"
      D    DISPLAY  CNS-PGM-ID":権利数量=["
      D             H-KENRI-SURYO       OF  H-TKMXTR00-1"]"
      D    DISPLAY  CNS-PGM-ID":効力発生日=["
      D             H-KOURYOKU-YMD      OF  H-TKMXTR00-1"]"
      *-----------------------------------------------------------------
      *----------  A)◇取得取引．効力発生日≠0の場合
               IF  H-KOURYOKU-YMD  OF  H-TKMXTR00-1 NOT = ZERO
               THEN
      *----------  a)ワーク適用開始日（直前データ検索用）←取得取引．受渡日
                 MOVE  H-UKE-YMD        OF  H-TKMXTR00-1
                   TO  WK-TEKIYO-FROM-SE
      *----------  ワーク権利落日（直前データ検索用）←取得取引．効力発生日
                 MOVE  H-KOURYOKU-YMD   OF  H-TKMXTR00-1
                   TO  WK-KENRI-OTI-YMD-SE
      *----------  未収配当情報データなしフラグ←0
                 MOVE  ZERO             TO  WK-MISYU-HT-DATA-NASI-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク適用開始日（直前データ検索用）=["
      D             WK-TEKIYO-FROM-SE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク権利落日（直前データ検索用）=["
      D             WK-KENRI-OTI-YMD-SE"]"
      D    DISPLAY  CNS-PGM-ID":未収配当情報データなしフラグ=["
      D             WK-MISYU-HT-DATA-NASI-FLG"]"
      *-----------------------------------------------------------------
      *----------  b)直前の未収配当情報を取得処理
      *----------  3.5直前の未収配当情報取得処理
      *----------  1)直前の未収収益計算データを取得する
                 MOVE  CNS-POS-038      TO  WK-ERR-POS
                 MOVE  CNS-POS-039      TO  WK-ERR-POS1
                 MOVE  CNS-POS-040      TO  WK-ERR-POS2
                 MOVE  CNS-POS-041      TO  WK-ERR-POS3
                 PERFORM  TZ-MS-SHEKI-GET-RTN
      *----------  2)直前の未収配当を取得する
                 MOVE  CNS-POS-042      TO  WK-ERR-POS
                 MOVE  CNS-POS-043      TO  WK-ERR-POS1
                 MOVE  CNS-POS-044      TO  WK-ERR-POS2
                 MOVE  CNS-POS-045      TO  WK-ERR-POS3
                 PERFORM  TZ-MS-HAIT-GET-RTN
      *----------  3)直前の未収配当情報を確定処理
                 PERFORM  TZ-MS-HAIT-INFO-RTN
               ELSE
                 CONTINUE
               END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収配当情報データなしフラグ=["
      D             WK-MISYU-HT-DATA-NASI-FLG"]"
      *-----------------------------------------------------------------
      *----------  B)◇取得取引．効力発生日＝0 または 未収配当情報データなしフラグ=1の場合
               IF  H-KOURYOKU-YMD  OF  H-TKMXTR00-1 = ZERO  OR
                   WK-MISYU-HT-DATA-NASI-FLG = CNS-1
               THEN
      *----------  a)ワーク終了フラグ←0
      *          MOVE  ZERO             TO  WK-END-FLG
      *----------  データ計数←0
      *          MOVE  ZERO             TO  WK-DATA-KEISU
      *-----------------------DEBUG-------------------------------------
      *    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      *    DISPLAY  CNS-PGM-ID":データ計数=["WK-DATA-KEISU"]"
      *-----------------------------------------------------------------
      *----------  b)入金日以前の未収配当データの権利落日を取得する
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *             ":***入金日以前の未収配当データの権利落日を取得する"
      *             "(「別紙1-10 SQL説明」を参照)  START ***"
      *-----------------------------------------------------------------
      *----------  入金日以前の未収配当データ(別紙1-10)CURSOR PREPARE
      *          PERFORM  NYUKN-IRAI-PRE-RTN
      *----------  入金日以前の未収配当データ(別紙1-10)CURSOR OPEN
      *          PERFORM  NYUKN-IRAI-OPEN-RTN
      *----------  入金日以前の未収配当データ(別紙1-10)CURSOR FETCH
      *          MOVE  CNS-OFF TO  WK-1-10-FETCH-FLG
      *          PERFORM  NYUKN-IRAI-FETCH-RTN
      *            UNTIL  WK-END-FLG  NOT = ZERO
      *             OR  WK-1-10-FETCH-FLG = CNS-ON
      *-----------------------DEBUG-------------------------------------
      *    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      *-----------------------------------------------------------------
      *          IF  WK-END-FLG = ZERO
      *          THEN
      *            MOVE  CNS-ON   TO    WK-SKIP-FLG
      *----------  ワークエラー区分←'03'
      *            MOVE  CNS-FLG-03
      *              TO  WORK-ERR-KBN   OF  PARM-SMZJ2110-ARG2
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID ":ワークエラー区分=["
      *             WORK-ERR-KBN        OF  PARM-SMZJ2110-ARG2"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
      *            MOVE  CNS-PGM-ID
      *              TO  ERR-PGM-ID     OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *            MOVE  CNS-POS-046
      *              TO  ERR-POS        OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *            MOVE  CNS-RTN-110
      *              TO  RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *            MOVE  SQLCODE
      *              TO  DETAIL-RTN-CD  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *            MOVE  CNS-DETAIL-1
      *              TO  DETAIL-RTN-CD-FLG
      *                                 OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
      *            MOVE  SPACE
      *              TO  FREE-MSG       OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ポジション             =["
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *          ELSE
      *            CONTINUE
      *          END-IF
      *----------  入金日以前の未収配当データ(別紙1-10)CURSOR CLOSE
      *          PERFORM  NYUKN-IRAI-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *             ":***入金日以前の未収配当データの権利落日を取得する"
      *             "(「別紙1-10 SQL説明」を参照)  END ***"
      *-----------------------------------------------------------------
      *----------  入金日以前の未収配当データの権利落日を取得する（「別紙1-13 SQL説明」を参照）
                 PERFORM  TKMZMS00-FET-RTN
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK-SKIP-FLG=["
      D             WK-SKIP-FLG"]"
      *-----------------------------------------------------------------
               IF  WK-SKIP-FLG = CNS-OFF THEN
      *----------  C)未収収益計算データUPDATE処理 (「別紙1-12 SQL説明」を参照)
                 PERFORM  TKMZBW08-UPDATE-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *----------  ワークエラー区分←'02'
               MOVE  CNS-FLG-02
                 TO  WORK-ERR-KBN       OF  PARM-SMZJ2110-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワークエラー区分=["
      D             WORK-ERR-KBN        OF  PARM-SMZJ2110-ARG2"]"
      D    DISPLAY CNS-PGM-ID":(別紙1-6) CURSOR FETCH  NOTFOUND "
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-047
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":(別紙1-6) SQL処理エラー  (FETCH) "
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-048
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-TKMXTR00  DELIMITED  BY  SIZE
                INTO   FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 取引テーブル(別紙1-6)CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-FETCH2-EXT.
           EXIT.
      ******************************************************************
      *    入金日以前の未収配当データ(別紙1-10)CURSOR PREPARE
      ******************************************************************
      * NYUKN-IRAI-PRE-RTN     SECTION.
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D    ":***入金日以前の未収配当データ(別紙1-10)CURSOR PREPARE"
      *D    " START ***"
      **-----------------------------------------------------------------
      *     INITIALIZE  SQLSTMT1
      **----------  利用会社コード
      *     MOVE  WK-RIYO-CMP-CD
      *       TO  H-RIYO-CMP-CD1         OF  H-NYUKN-IRAI-S,
      *           H-RIYO-CMP-CD2         OF  H-NYUKN-IRAI-S,
      *           WK-SQL-RIYO-CMP-CD1    OF  WK-MSG-1-10,
      *           WK-SQL-RIYO-CMP-CD2    OF  WK-MSG-1-10
      **----------  ファンドコード
      *     MOVE  WK-FUND-CD
      *       TO  H-FUND-CD1             OF  H-NYUKN-IRAI-S,
      *           H-FUND-CD2             OF  H-NYUKN-IRAI-S,
      *           WK-SQL-FUND-CD1        OF  WK-MSG-1-10,
      *           WK-SQL-FUND-CD2        OF  WK-MSG-1-10
      **----------  ポートフォリオコード
      *     MOVE  WK-PTF-CD
      *       TO  H-PTF-CD1              OF  H-NYUKN-IRAI-S,
      *           H-PTF-CD2              OF  H-NYUKN-IRAI-S,
      *           WK-SQL-PTF-CD1         OF  WK-MSG-1-10,
      *           WK-SQL-PTF-CD2         OF  WK-MSG-1-10
      **----------  銘柄コード
      *     MOVE  WK-MEG-CD
      *       TO  H-MEG-CD1              OF  H-NYUKN-IRAI-S,
      *           H-MEG-CD2              OF  H-NYUKN-IRAI-S,
      *           WK-SQL-MEG-CD1         OF  WK-MSG-1-10,
      *           WK-SQL-MEG-CD2         OF  WK-MSG-1-10
      **----------  証券種別コード
      *     MOVE  WK-SEC-SBT-CD
      *       TO  H-SEC-SBT-CD1          OF  H-NYUKN-IRAI-S,
      *           H-SEC-SBT-CD2          OF  H-NYUKN-IRAI-S,
      *           WK-SQL-SEC-SBT-CD1     OF  WK-MSG-1-10,
      *           WK-SQL-SEC-SBT-CD2     OF  WK-MSG-1-10
      **----------  資産 負債・買建売建フラグ
      *     MOVE  WK-TATE-FLG
      *       TO  H-TATE-FLG1            OF  H-NYUKN-IRAI-S,
      *           H-TATE-FLG2            OF  H-NYUKN-IRAI-S,
      *           WK-SQL-TATE-FLG1       OF  WK-MSG-1-10,
      *           WK-SQL-TATE-FLG2       OF  WK-MSG-1-10
      **----------  玉ID
      *     MOVE  WK-GYOKU-ID
      *       TO  H-GYOKU-ID1            OF  H-NYUKN-IRAI-S,
      *           H-GYOKU-ID2            OF  H-NYUKN-IRAI-S,
      *           WK-SQL-GYOKU-ID1       OF  WK-MSG-1-10,
      *           WK-SQL-GYOKU-ID2       OF  WK-MSG-1-10
      **----------  適用開始日
      *     MOVE  H-UKE-YMD              OF  H-TKMXTR00-1
      *       TO  H-TEKIYO-FROM1         OF  H-NYUKN-IRAI-S,
      *           H-TEKIYO-FROM2         OF  H-NYUKN-IRAI-S,
      *           WK-SQL-TEKIYO-FROM1    OF  WK-MSG-1-10,
      *           WK-SQL-TEKIYO-FROM2    OF  WK-MSG-1-10
      **----------  処理実行日
      *     MOVE  WK-SYORI-YMD
      *       TO  H-SYORI-YMD2           OF  H-NYUKN-IRAI-S,
      *           WK-SQL-SYORI-YMD2      OF  WK-MSG-1-10
      **----------  起動ID
      *     MOVE  WK-KIDOU-ID
      *       TO  H-KIDOU-ID2            OF  H-NYUKN-IRAI-S,
      *           WK-SQL-KIDOU-ID2       OF  WK-MSG-1-10
      **----------  ＳＱＬ文
      *     MOVE  SQL-SELECT-1-10        TO  SQLSTMT1
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID":未収収益:"
      *D    DISPLAY CNS-PGM-ID":利用会社コード=["
      *D            H-RIYO-CMP-CD1       OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":ファンドコード=["
      *D            H-FUND-CD1           OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      *D            H-PTF-CD1            OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":銘柄コード=["
      *D            H-MEG-CD1            OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":証券種別コード=["
      *D            H-SEC-SBT-CD1        OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      *D            H-TATE-FLG1          OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":玉ID=["
      *D            H-GYOKU-ID1          OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":適用開始日=["
      *D            H-TEKIYO-FROM1       OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":未収収益計算データ:"
      *D    DISPLAY CNS-PGM-ID":利用会社コード=["
      *D            H-RIYO-CMP-CD2       OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":ファンドコード=["
      *D            H-FUND-CD2           OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      *D            H-PTF-CD2            OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":銘柄コード=["
      *D            H-MEG-CD2            OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":証券種別コード=["
      *D            H-SEC-SBT-CD2        OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      *D            H-TATE-FLG2          OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":玉ID=["
      *D            H-GYOKU-ID2          OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":適用開始日=["
      *D            H-TEKIYO-FROM2       OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":処理実行日=["
      *D            H-SYORI-YMD2         OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":起動ID=["
      *D            H-KIDOU-ID2          OF  H-NYUKN-IRAI-S"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"
      *D    DISPLAY CNS-PGM-ID":WK-MSG-1-10=["WK-MSG-1-10"]"
      *D    DISPLAY CNS-PGM-ID"カーソル検査"
      *D    DISPLAY CNS-PGM-ID"FLG-TKMZBW08-S3-INSERT =["
      *D            FLG-TKMZBW08-S3-INSERT"]"
      **-----------------------------------------------------------------
      **----------  入金日以前の未収配当データ(別紙1-10)CURSOR PREPARE
      *     EXEC  SQL
      *       PREPARE  S11  FROM :SQLSTMT1
      *     END-EXEC
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID
      *D    ":入金日以前の未収配当データ(別紙1-10)SQLCODE PREPARE=["
      *D            SQLCODE"]"
      **-----------------------------------------------------------------
      *     IF  SQLCODE =  CNS-SQL-NORMAL
      *     THEN
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":(別紙1-10) SQL処理 (PREPARE)  正常"
      **-----------------------------------------------------------------
      *       CONTINUE
      *     ELSE
      **----------------------<DEBUG>------------------------------------
      *D    DISPLAY CNS-PGM-ID":(別紙1-10) SQL処理エラー  (PREPARE)"
      **-----------------------------------------------------------------
      **----------  エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *       MOVE  CNS-POS-049
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      **----------  フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-10        DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      **----------  入金日以前の未収配当データ(別紙1-10)CURSOR DECLARE
      *     EXEC  SQL
      *       DECLARE  NYUKN_CUR CURSOR FOR  S11
      *     END-EXEC
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID
      *D    ":入金日以前の未収配当データ(別紙1-10)SQLCODE DECLARE=["
      *D            SQLCODE"]"
      *D    DISPLAY  CNS-PGM-ID ":***入金日以前の未収配当データ"
      *D    "(別紙1-10)CURSOR PREPARE END ***"
      **-----------------------------------------------------------------
      *     CONTINUE.
      * NYUKN-IRAI-PRE-EXT.
      *     EXIT.
      ******************************************************************
      *    取引テーブル(別紙1-6)CURSOR OPEN
      ******************************************************************
      * NYUKN-IRAI-OPEN-RTN    SECTION.
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      *D    "(別紙1-10)CURSOR OPEN START ***"
      **-----------------------------------------------------------------
      **----------  取引テーブル(別紙1-6) CURSOR OPEN
      *     EXEC  SQL
      *         OPEN NYUKN_CUR
      *           USING :H-NYUKN-IRAI-S.H-RIYO-CMP-CD1,
      *                 :H-NYUKN-IRAI-S.H-FUND-CD1,
      *                 :H-NYUKN-IRAI-S.H-PTF-CD1,
      *                 :H-NYUKN-IRAI-S.H-MEG-CD1,
      *                 :H-NYUKN-IRAI-S.H-SEC-SBT-CD1,
      *                 :H-NYUKN-IRAI-S.H-TATE-FLG1,
      *                 :H-NYUKN-IRAI-S.H-GYOKU-ID1,
      *                 :H-NYUKN-IRAI-S.H-TEKIYO-FROM1,
      *                 :H-NYUKN-IRAI-S.H-RIYO-CMP-CD2,
      *                 :H-NYUKN-IRAI-S.H-FUND-CD2,
      *                 :H-NYUKN-IRAI-S.H-PTF-CD2,
      *                 :H-NYUKN-IRAI-S.H-MEG-CD2,
      *                 :H-NYUKN-IRAI-S.H-SEC-SBT-CD2,
      *                 :H-NYUKN-IRAI-S.H-TATE-FLG2,
      *                 :H-NYUKN-IRAI-S.H-GYOKU-ID2,
      *                 :H-NYUKN-IRAI-S.H-TEKIYO-FROM2,
      *                 :H-NYUKN-IRAI-S.H-SYORI-YMD2,
      *                 :H-NYUKN-IRAI-S.H-KIDOU-ID2
      *     END-EXEC
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID
      *D    ":入金日以前の未収配当データ(別紙1-10)SQLCODE OPEN=["
      *D            SQLCODE"]"
      **-----------------------------------------------------------------
      *     IF  SQLCODE = CNS-SQL-NORMAL
      *     THEN
      *       MOVE  CNS-ON               TO  FLG-NYUKN-CR-OPEN
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":(別紙1-10) CURSOR OPEN  正常"
      *D    DISPLAY  CNS-PGM-ID
      *D    ":入金日以前の未収配当データルカーソルオープンフラグ=["
      *D             FLG-NYUKN-CR-OPEN"]"
      **-----------------------------------------------------------------
      *     ELSE
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID":(別紙1-10) SQL処理エラー  (OPEN)"
      **-----------------------------------------------------------------
      **----------  エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *       MOVE  CNS-POS-050
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      **----------  フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-10        DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      *D    "(別紙1-10)CURSOR OPEN  END ***"
      **-----------------------------------------------------------------
      *     CONTINUE.
      * NYUKN-IRAI-OPEN-EXT.
      *     EXIT.
      *******************************************************************
      **    入金日以前の未収配当データ(別紙1-10)CURSOR FETCH
      *******************************************************************
      * NYUKN-IRAI-FETCH-RTN   SECTION.
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      *D    "(別紙1-10)CURSOR FETCH START ***"
      **-----------------------------------------------------------------
      **----------  入金日以前の未収配当データ(別紙1-10) CURSOR FETCH
      *     INITIALIZE              H-NYUKN-IRAI
      *     EXEC  SQL
      *         FETCH
      *              NYUKN_CUR
      *         INTO :H-NYUKN-IRAI.H-KENRI-OTI-YMD
      *     END-EXEC
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID
      *D    ":入金日以前の未収配当データ(別紙1-10)SQLCODE FETCH=["
      *D            SQLCODE"]"
      **-----------------------------------------------------------------
      *     EVALUATE  SQLCODE
      *       WHEN  CNS-SQL-NORMAL
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":(別紙1-10) CURSOR FETCH  正常"
      *D    DISPLAY  CNS-PGM-ID":権利落日=["
      *D             H-KENRI-OTI-YMD     OF  H-NYUKN-IRAI"]"
      **-----------------------------------------------------------------
      **----------  ①ワーク適用開始日（直前データ検索用）←「別紙1-6 SQL説明」取得したデータ．受渡日
      *         MOVE  H-UKE-YMD          OF  H-TKMXTR00-1
      *           TO  WK-TEKIYO-FROM-SE
      **----------  ワーク権利落日（直前データ検索用）←取得取引．権利落日
      *         MOVE  H-KENRI-OTI-YMD    OF  H-NYUKN-IRAI
      *           TO  WK-KENRI-OTI-YMD-SE
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":ワーク適用開始日（直前データ検索用）=["
      *D             WK-TEKIYO-FROM-SE"]"
      *D    DISPLAY  CNS-PGM-ID":ワーク権利落日（直前データ検索用）=["
      *D             WK-KENRI-OTI-YMD-SE"]"
      **-----------------------------------------------------------------
      **----------  ②直前の未収配当情報を取得処理
      **----------  3.5直前の未収配当情報取得処理
      **----------  1)直前の未収収益計算データを取得する
      *         MOVE  CNS-POS-051        TO  WK-ERR-POS
      *         MOVE  CNS-POS-052        TO  WK-ERR-POS1
      *         MOVE  CNS-POS-053        TO  WK-ERR-POS2
      *         MOVE  CNS-POS-054        TO  WK-ERR-POS3
      *         PERFORM  TZ-MS-SHEKI-GET-RTN
      **----------  2)直前の未収配当を取得する
      *         MOVE  CNS-POS-055        TO  WK-ERR-POS
      *         MOVE  CNS-POS-056        TO  WK-ERR-POS1
      *         MOVE  CNS-POS-057        TO  WK-ERR-POS2
      *         MOVE  CNS-POS-058        TO  WK-ERR-POS3
      *         PERFORM  TZ-MS-HAIT-GET-RTN
      **----------  3)直前の未収配当情報を確定処理
      *         PERFORM  TZ-MS-HAIT-INFO-RTN
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨未収収益"
      *D             "=["WK-SJTK-MS-SHEKI-K   OF WK-TKMZMS00-KAKUTE"]"
      *D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨源泉税"
      *D             "=["WK-SJTK-GENSEN-TAX-K OF WK-TKMZMS00-KAKUTE"]"
      **-----------------------------------------------------------------
      **----------  ③ワーク直前未収収益確定.市場通貨未収収益≠0 又は ワーク直前未収収益確定.市場通貨源泉税≠0の場合
      *         IF  WK-SJTK-MS-SHEKI-K   OF WK-TKMZMS00-KAKUTE NOT = ZERO
      *         OR  WK-SJTK-GENSEN-TAX-K OF WK-TKMZMS00-KAKUTE NOT = ZERO
      *         THEN
      **----------  ワーク終了フラグ←1
      *           MOVE  CNS-1            TO  WK-END-FLG
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      **-----------------------------------------------------------------
      *         ELSE
      *           CONTINUE
      *         END-IF
      **----------  ④データ計数←データ計数＋１
      *         COMPUTE  WK-DATA-KEISU = WK-DATA-KEISU + CNS-1
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":データ計数=["WK-DATA-KEISU"]"
      *D    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      **-----------------------------------------------------------------
      *       WHEN  CNS-SQL-NOTFOUND
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":データ計数=["WK-DATA-KEISU"]"
      **-----------------------------------------------------------------
      **----------  データ計数=0の場合
      *         IF  WK-DATA-KEISU = ZERO
      *         THEN
      *           MOVE  CNS-ON   TO  WK-SKIP-FLG
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID ":データ計数=0の場合,"
      *D           "次の『対象取引情報データ』カーソルフェッチ処理へ進む"
      **-----------------------------------------------------------------
      **----------  ワークエラー区分←'03'
      *           MOVE  CNS-FLG-03
      *             TO  WORK-ERR-KBN     OF  PARM-SMZJ2110-ARG2
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID ":ワークエラー区分=["
      *D             WORK-ERR-KBN        OF  PARM-SMZJ2110-ARG2"]"
      **-----------------------------------------------------------------
      **----------  エラー検知プログラム名
      *           MOVE  CNS-PGM-ID
      *             TO  ERR-PGM-ID       OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *           MOVE  CNS-POS-059
      *             TO  ERR-POS          OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *           MOVE  CNS-RTN-110
      *             TO  RTN-CD           OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *           MOVE  SQLCODE
      *             TO  DETAIL-RTN-CD    OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *           MOVE  CNS-DETAIL-1
      *             TO  DETAIL-RTN-CD-FLG
      *                                  OF  PARM-SCZY1170-ARG1
      **----------  フリーメッセージ
      *           MOVE  SPACE
      *             TO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  ワーク終了フラグ←1
      *           MOVE  CNS-1            TO  WK-END-FLG
      *           MOVE  CNS-ON           TO  WK-1-10-FETCH-FLG
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      **-----------------------------------------------------------------
      *         ELSE
      **----------  FETCH終了フラグ←1
      *           MOVE  CNS-ON           TO  WK-1-10-FETCH-FLG
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":ワーク終了フラグ=["WK-END-FLG"]"
      **-----------------------------------------------------------------
      *         END-IF
      *       WHEN  OTHER
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID":(別紙1-10) SQL処理エラー  (FETCH) "
      **-----------------------------------------------------------------
      **----------  エラー検知プログラム名
      *         MOVE  CNS-PGM-ID
      *           TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *         MOVE  CNS-POS-060
      *           TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *         MOVE  CNS-RTN-900
      *           TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *         MOVE  SQLCODE
      *           TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *         MOVE  CNS-DETAIL-1
      *           TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      **----------  フリーメッセージ
      *         STRING  CNS-SQL-MSG-SELECT,
      *                 WK-MSG-1-10      DELIMITED  BY  SIZE
      *           INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  エラー処理
      *         PERFORM  ERR-RTN
      *     END-EVALUATE
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      *D    "(別紙1-10)CURSOR FETCH END ***"
      **-----------------------------------------------------------------
      *     CONTINUE.
      * NYUKN-IRAI-FETCH-EXT.
      *     EXIT.
      ******************************************************************
      *           入金日以前の未収配当データ(別紙1-10)CURSOR CLOSE
      ******************************************************************
      *NYUKN-IRAI-CLOSE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      *    "(別紙1-10)CURSOR CLOSE START ***"
      *-------------------<DEBUG>---------------------------------------
      *----------  取引テーブル(別紙1-6) CURSOR CLOSE
      *    EXEC  SQL
      *      CLOSE NYUKN_CUR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY CNS-PGM-ID
      *    ":入金日以前の未収配当データ(別紙1-10)CURSOR CLOSE "
      *            "SQLCODE=["SQLCODE"]"
      *-------------------<DEBUG>---------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-NYUKN-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-10) SQL処理 (CLOSE)  正常"
      *    DISPLAY  CNS-PGM-ID
      *    ":入金日以前の未収配当データカーソルオープンフラグ2=["
      *             FLG-NYUKN-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-10) SQL処理エラー  (CLOSE)"
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-061
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-10        DELIMITED  BY  SIZE
      *       INTO   FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ポジション             =["
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      *    "(別紙1-10)CURSOR CLOSE END ***"
      *-------------------<DEBUG>---------------------------------------
      *    CONTINUE.
      *NYUKN-IRAI-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    入金日以前の未収配当データの権利落日を取得する（「別紙1-13 SQL説明」を参照）
      ******************************************************************
       TKMZMS00-FET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":入金日以前の未収配当データの権利落日"
      D             "を取得処理  START  ****"
      *-----------------------------------------------------------------
      *----------  入金日以前の未収配当データ(別紙1-13)CURSOR PREPARE
           PERFORM  NK-IRAI-PRE-RTN
      *----------  入金日以前の未収配当データ(別紙1-13)CURSOR OPEN
           PERFORM  NK-IRAI-OPEN-RTN
      *----------  入金日以前の未収配当データ(別紙1-13)CURSOR FETCH
           PERFORM  NK-IRAI-FETCH-RTN
      *----------  入金日以前の未収配当データ(別紙1-13)CURSOR CLOSE
      **** PERFORM  NK-IRAI-CLOSE-RTN                                   @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":入金日以前の未収配当データの権利落日"
      D             "を取得処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-FET-EXT.
           EXIT.
      ******************************************************************
      *    入金日以前の未収配当データ(別紙1-13)CURSOR PREPARE
      ******************************************************************
       NK-IRAI-PRE-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***入金日以前の未収配当データ(別紙1-13)"
      D             "CURSOR PREPARE START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT8                                         @3212SEINO@@
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-SQL-1-13-S,
                 WK-SQL-FUND-CD1        OF  WK-MSG-1-13,
                 WK-SQL-FUND-CD2        OF  WK-MSG-1-13
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-SQL-1-13-S,
                 WK-SQL-PTF-CD1         OF  WK-MSG-1-13,
                 WK-SQL-PTF-CD2         OF  WK-MSG-1-13
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-SQL-1-13-S,
                 WK-SQL-MEG-CD1         OF  WK-MSG-1-13,
                 WK-SQL-MEG-CD2         OF  WK-MSG-1-13
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-SQL-1-13-S,
                 WK-SQL-SEC-SBT-CD1     OF  WK-MSG-1-13,
                 WK-SQL-SEC-SBT-CD2     OF  WK-MSG-1-13
      *----------  資産 負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-SQL-1-13-S,
                 WK-SQL-TATE-FLG1       OF  WK-MSG-1-13,
                 WK-SQL-TATE-FLG2       OF  WK-MSG-1-13
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-SQL-1-13-S,
                 WK-SQL-GYOKU-ID1       OF  WK-MSG-1-13,
                 WK-SQL-GYOKU-ID2       OF  WK-MSG-1-13
      *----------  適用開始日
           MOVE  H-UKE-YMD              OF  H-TKMXTR00-1
             TO  H-TEKIYO-FROM          OF  H-SQL-1-13-S,
                 WK-SQL-TEKIYO-FROM1    OF  WK-MSG-1-13,
                 WK-SQL-TEKIYO-FROM2    OF  WK-MSG-1-13
      *----------  権利落日
           MOVE  H-KOURYOKU-YMD         OF  H-TKMXTR00-1
             TO  H-KENRI-OTI-YMD        OF  H-SQL-1-13-S,
                 WK-SQL-KOURYOKU-YMD1   OF  WK-MSG-1-13,
                 WK-SQL-KOURYOKU-YMD2   OF  WK-MSG-1-13
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-SQL-1-13-S,
                 WK-SQL-SYORI-YMD       OF  WK-MSG-1-13
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-SQL-1-13-S,
                 WK-SQL-KIDOU-ID        OF  WK-MSG-1-13
      *----------  ＳＱＬ文
           MOVE  SQL-SELECT-1-13        TO  SQLSTMT8                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD           OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD            OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD            OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD        OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG          OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":玉ID=["
      D             H-GYOKU-ID          OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日=["
      D             H-TEKIYO-FROM       OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":権利落日=["
      D             H-KENRI-OTI-YMD     OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             H-SYORI-YMD         OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             H-KIDOU-ID          OF  H-SQL-1-13-S"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT8 =["SQLSTMT8"]"                 @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-13=["WK-MSG-1-13"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-NK-CR-OPEN =["
      D            FLG-NK-CR-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @SEINO@@
           IF  FLG-NK-CR-OPEN = CNS-OFF                                 @SEINO@@
           THEN                                                         @SEINO@@
      *----------  入金日以前の未収配当データ(別紙1-13)CURSOR PREPARE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS13第一回"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S13  FROM :SQLSTMT8                               @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":入金日以前の未収配当データ(別紙1-13)SQLCODE PREPARE=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE =  CNS-SQL-NORMAL
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-13) SQL処理 (PREPARE)  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-13) SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-071
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-13        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  入金日以前の未収配当データ(別紙1-13)CURSOR DECLARE
           EXEC  SQL
             DECLARE  CUR13 CURSOR FOR  S13
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":入金日以前の未収配当データ(別紙1-13)SQLCODE DECLARE=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------@SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
      *-----------------------------------------------------------------@SEINO@@
      D    DISPLAY  CNS-PGM-ID ":***入金日以前の未収配当データ"
      D    "(別紙1-13)CURSOR PREPARE END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       NK-IRAI-PRE-EXT.
           EXIT.
      ******************************************************************
      *    入金日以前の未収配当データ(別紙1-13) CURSOR OPEN
      ******************************************************************
       NK-IRAI-OPEN-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      D    "(別紙1-13)CURSOR OPEN START ***"
      *-----------------------------------------------------------------
      *----------  入金日以前の未収配当データ(別紙1-13) CURSOR OPEN
           EXEC  SQL
               OPEN CUR13
                 USING :H-SQL-1-13-S.H-FUND-CD,
                       :H-SQL-1-13-S.H-PTF-CD,
                       :H-SQL-1-13-S.H-MEG-CD,
                       :H-SQL-1-13-S.H-SEC-SBT-CD,
                       :H-SQL-1-13-S.H-TATE-FLG,
                       :H-SQL-1-13-S.H-GYOKU-ID,
                       :H-SQL-1-13-S.H-TEKIYO-FROM,
                       :H-SQL-1-13-S.H-KENRI-OTI-YMD,
                       :H-SQL-1-13-S.H-KENRI-OTI-YMD,
                       :H-SQL-1-13-S.H-FUND-CD,
                       :H-SQL-1-13-S.H-PTF-CD,
                       :H-SQL-1-13-S.H-MEG-CD,
                       :H-SQL-1-13-S.H-SEC-SBT-CD,
                       :H-SQL-1-13-S.H-TATE-FLG,
                       :H-SQL-1-13-S.H-GYOKU-ID,
                       :H-SQL-1-13-S.H-TEKIYO-FROM,
                       :H-SQL-1-13-S.H-KENRI-OTI-YMD,
                       :H-SQL-1-13-S.H-KENRI-OTI-YMD,
                       :H-SQL-1-13-S.H-SYORI-YMD,
                       :H-SQL-1-13-S.H-KIDOU-ID
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":入金日以前の未収配当データ(別紙1-13)SQLCODE OPEN=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-NK-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-13) CURSOR OPEN  正常"
      D    DISPLAY  CNS-PGM-ID
      D    ":入金日以前の未収配当データルカーソルオープンフラグ=["
      D              FLG-NK-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-13) SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-072
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-13        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      D             "(別紙1-13)CURSOR OPEN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       NK-IRAI-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    入金日以前の未収配当データ(別紙1-13)CURSOR FETCH
      ******************************************************************
       NK-IRAI-FETCH-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":*** 入金日以前の未収配当データ"
      D              "(別紙1-13)CURSOR FETCH START ***"
      *-----------------------------------------------------------------
      *----------  入金日以前の未収配当データ(別紙1-13) CURSOR FETCH
           INITIALIZE              H-SQL-1-13
           EXEC  SQL
               FETCH
                    CUR13
                 INTO :H-SQL-1-13
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D    ":入金日以前の未収配当データ(別紙1-13)SQLCODE FETCH=["
      D            SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-13) CURSOR FETCH  正常"
      D    DISPLAY  CNS-PGM-ID":権利付数量=["
      D             H-RIT-SRY           OF  H-SQL-1-13"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["
      D             H-SIJO-TUKA-CD      OF  H-SQL-1-13"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日=["
      D             H-TEKIYO-FROM       OF  H-SQL-1-13"]"
      D    DISPLAY  CNS-PGM-ID":権利落日=["
      D             H-KENRI-OTI-YMD     OF  H-SQL-1-13"]"
      D    DISPLAY  CNS-PGM-ID":未入金対象数量残高=["
      D             H-MNK-TSHO-SRYZN    OF  H-SQL-1-13"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨未収収益=["
      D             H-SJTK-MS-SHEKI     OF  H-SQL-1-13"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨源泉税=["
      D             H-SJTK-GENSEN-TAX   OF  H-SQL-1-13"]"
      *-----------------------------------------------------------------
      *----------  ワーク直前未収収益確定.権利付数量 ← フェッチした権利付数量
               MOVE  H-RIT-SRY          OF  H-SQL-1-13
                 TO  WK-RIT-SRY         OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.市場通貨コード ← フェッチした市場通貨コード
               MOVE  H-SIJO-TUKA-CD     OF  H-SQL-1-13
                 TO  WK-SIJO-TUKA-CD    OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.権利落日 ← フェッチした権利落日
               MOVE  H-KENRI-OTI-YMD    OF  H-SQL-1-13
                 TO  WK-KENRI-OTI-YMD   OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.未入金対象数量残高 ← フェッチした未入金対象数量残高
               MOVE  H-MNK-TSHO-SRYZN   OF  H-SQL-1-13
                 TO  WK-MNK-TSHO-SRYZN  OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.市場通貨未収収益 ← フェッチした市場通貨未収収益
               MOVE  H-SJTK-MS-SHEKI    OF  H-SQL-1-13
                 TO  WK-SJTK-MS-SHEKI-K OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク直前未収収益確定.市場通貨源泉税 ← フェッチした市場通貨源泉税
               MOVE  H-SJTK-GENSEN-TAX  OF  H-SQL-1-13
                 TO  WK-SJTK-GENSEN-TAX-K
                                        OF  WK-TKMZMS00-KAKUTE
      *----------  ワーク権利落日（直前データ検索用）←取得.権利落日
               MOVE  H-KENRI-OTI-YMD    OF  H-SQL-1-13
                 TO  WK-KENRI-OTI-YMD-SE
      *----------  ①ワーク適用開始日（直前データ検索用）←「別紙1-6 SQL説明」取得したデータ．受渡日
               MOVE  H-UKE-YMD          OF  H-TKMXTR00-1
                 TO  WK-TEKIYO-FROM-SE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.権利付数量=["
      D             WK-RIT-SRY          OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨コード=["
      D             WK-SIJO-TUKA-CD     OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.権利落日=["
      D             WK-KENRI-OTI-YMD    OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.未入金対象数量残"
      D       "高=["WK-MNK-TSHO-SRYZN   OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨未収収益"
      D         "=["WK-SJTK-MS-SHEKI-K  OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク直前未収収益確定.市場通貨源泉税=["
      D             WK-SJTK-GENSEN-TAX-K
      D                                 OF  WK-TKMZMS00-KAKUTE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク権利落日（直前データ検索用）=["
      D             WK-KENRI-OTI-YMD-SE"]"
      D    DISPLAY  CNS-PGM-ID":ワーク適用開始日（直前データ検索用）=["
      D             WK-TEKIYO-FROM-SE"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------  ワークエラー区分←'03'
               MOVE  CNS-FLG-03
                 TO  WORK-ERR-KBN       OF  PARM-SMZJ2110-ARG2
               MOVE  CNS-ON             TO  WK-SKIP-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークエラー区分=["
      D             WORK-ERR-KBN        OF  PARM-SMZJ2110-ARG2"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-073
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-13) SQL処理エラー  (FETCH) "
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-074
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-13      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      D             "(別紙1-13)CURSOR FETCH END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       NK-IRAI-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    入金日以前の未収配当データ(別紙1-13) CURSOR CLOSE
      ******************************************************************
      *NK-IRAI-CLOSE-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      *             "(別紙1-13)CURSOR CLOSE START ***"
      *-------------------<DEBUG>---------------------------------------
      *----------  入金日以前の未収配当データ(別紙1-6) CURSOR CLOSE
      *    EXEC  SQL
      *      CLOSE  CUR13
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":入金日以前の未収配当データ(別紙1-13):"
      *             "CURSOR CLOSE SQLCODE=["SQLCODE"]"
      *-------------------<DEBUG>---------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-NK-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-13) SQL処理 (CLOSE)  正常"
      *    DISPLAY  CNS-PGM-ID
      *    ":入金日以前の未収配当データカーソルオープンフラグ=["
      *             FLG-NK-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY   CNS-PGM-ID":(別紙1-13) SQL処理エラー  (CLOSE)"
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-075
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-13        DELIMITED  BY  SIZE
      *       INTO   FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ポジション             =["
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":*** 入金日以前の未収配当データ"
      *             "(別紙1-13)CURSOR CLOSE END ***"
      *-------------------<DEBUG>---------------------------------------
      *    CONTINUE.
      *NK-IRAI-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    未収収益計算データUPDATE処理
      ******************************************************************
       TKMZBW08-UPDATE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収収益計算データUPDATE処理  START ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZBW08-U
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD        OF  WK-TKMZMS00-KAKUTE
             TO  H-SIJO-TUKA-CD         OF  H-TKMZBW08-U,
                 WK-SQL-SIJO-TUKA-CD    OF  WK-MSG-1-12
      *----------  権利付数量
           MOVE  WK-RIT-SRY             OF  WK-TKMZMS00-KAKUTE
             TO  H-RIT-SRY              OF  H-TKMZBW08-U,
                 WK-SQL-RIT-SRY         OF  WK-MSG-1-12
      *----------  市場通貨未収収益
           MOVE  ZERO
             TO  H-SJTK-MS-SHEKI        OF  H-TKMZBW08-U,
                 WK-SQL-SJTK-MS-SHEKI   OF  WK-MSG-1-12
      *----------  市場通貨源泉税
           MOVE  ZERO
             TO  H-SJTK-GENSEN-TAX      OF  H-TKMZBW08-U,
                 WK-SQL-SJTK-GENSEN-TAX OF  WK-MSG-1-12
      *----------  未入金対象数量残高
           COMPUTE  WK-SRYZN-CALC
                 =  WK-MNK-TSHO-SRYZN   OF  WK-TKMZMS00-KAKUTE -
                    H-KENRI-SURYO       OF  H-TKMXTR00-1
           IF  WK-SRYZN-CALC < ZERO
           THEN
             MOVE  ZERO                 TO  WK-SRYZN-CALC
           ELSE
             CONTINUE
           END-IF
           MOVE  WK-SRYZN-CALC
             TO  H-MNK-TSHO-SRYZN       OF  H-TKMZBW08-U,
                 WK-SQL-MNK-TSHO-SRYZN  OF  WK-MSG-TKMZBW08
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW08-U,
                 WK-SQL-UPD-LOGIN-CMP-CD
                                        OF  WK-MSG-1-12
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW08-U,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-1-12
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW08-U,
                 WK-SQL-FUND-CD         OF  WK-MSG-1-12
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW08-U,
                 WK-SQL-PTF-CD          OF  WK-MSG-1-12
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZBW08-U,
                 WK-SQL-SEC-SBT-CD      OF  WK-MSG-1-12
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZBW08-U,
                 WK-SQL-MEG-CD          OF  WK-MSG-1-12
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZBW08-U,
                 WK-SQL-TATE-FLG        OF  WK-MSG-1-12
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZBW08-U,
                 WK-SQL-GYOKU-ID        OF  WK-MSG-1-12
      *----------  権利落日
           MOVE  WK-KENRI-OTI-YMD-SE
             TO  H-KENRI-OTI-YMD        OF  H-TKMZBW08-U,
                 WK-SQL-KENRI-OTI-YMD   OF  WK-MSG-1-12
      *----------  適用開始日
           MOVE  WK-TEKIYO-FROM-SE
             TO  H-TEKIYO-FROM          OF  H-TKMZBW08-U,
                 WK-SQL-TEKIYO-FROM     OF  WK-MSG-1-12
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW08-U,
                 WK-SQL-SYORI-YMD       OF  WK-MSG-1-12
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW08-U,
                 WK-SQL-KIDOU-ID        OF  WK-MSG-1-12
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":市場通貨コード=["
      D            H-SIJO-TUKA-CD       OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":権利付数量=["
      D            H-RIT-SRY            OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":市場通貨未収収益=["
      D            H-SJTK-MS-SHEKI      OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":市場通貨源泉税=["
      D            H-SJTK-GENSEN-TAX    OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":未入金対象数量残高=["
      D            H-MNK-TSHO-SRYZN     OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード=["
      D            H-UPD-LOGIN-CMP-CD   OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-FUND-CD            OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      D            H-PTF-CD             OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード=["
      D            H-MEG-CD             OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード=["
      D            H-SEC-SBT-CD         OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":玉ID=["
      D            H-GYOKU-ID           OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":適用開始日=["
      D            H-TEKIYO-FROM        OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":処理実行日=["
      D            H-SYORI-YMD          OF  H-TKMZBW08-U"]"
      D    DISPLAY CNS-PGM-ID":起動ID=["
      D            H-KIDOU-ID           OF  H-TKMZBW08-U"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT9                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-UPDATE-1-12        TO  SQLSTMT9                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT9=["SQLSTMT9"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-12=["WK-MSG-1-12"]"
      D    DISPLAY CNS-PGM-ID"カーソル検査"
      D    DISPLAY CNS-PGM-ID"FLG-TKMZBW08-S10-UPDATE =["
      D            FLG-TKMZBW08-S10-UPDATE"]"
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @SEINO@@
           IF  FLG-TKMZBW08-S10-UPDATE = CNS-OFF                        @SEINO@@
           THEN                                                         @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"カーソルS10第一回"
      *-----------------------------------------------------------------
           EXEC SQL
               PREPARE S10 FROM :SQLSTMT9                               @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-062
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-MSG-1-12        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @SEINO@@
           EXEC SQL
               EXECUTE S10
                 USING :H-TKMZBW08-U
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-UPDATE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW08-S10-UPDATE     @SEINO@@
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-TKMZBW08-S10-UPDATE     @3212SEINO@@
               PERFORM  TKMZBW08-INSERT3-RTN
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データUPDATE処理  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-063
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-MSG-1-12      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収収益計算データUPDATE処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *  未収収益計算データINSERT処理 (「別紙1-7 SQL説明」を参照)
      ******************************************************************
       TKMZBW08-INSERT3-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***C)未収収益計算データINSERT処理 "
      D             " (「別紙1-7 SQL説明」を参照)処理  START  ***"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW08-I,
                 WK-SQL-SYORI-YMD       OF  WK-MSG-TKMZBW08,
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW08-I,
                 WK-SQL-KIDOU-ID        OF  WK-MSG-TKMZBW08
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW08-I,
                 H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW08-I,
                 WK-SQL-RIYO-CMP-CD     OF  WK-MSG-TKMZBW08,
                 WK-SQL-UPD-LOGIN-CMP-CD
                                        OF  WK-MSG-TKMZBW08
      *----------  ファンドコード
           MOVE  WK-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW08-I,
                 WK-SQL-FUND-CD         OF  WK-MSG-TKMZBW08
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW08-I,
                 WK-SQL-PTF-CD          OF  WK-MSG-TKMZBW08
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD
             TO  H-SEC-SBT-CD           OF  H-TKMZBW08-I,
                 WK-SQL-SEC-SBT-CD      OF  WK-MSG-TKMZBW08
      *----------  銘柄コード
           MOVE  WK-MEG-CD
             TO  H-MEG-CD               OF  H-TKMZBW08-I,
                 WK-SQL-MEG-CD          OF  WK-MSG-TKMZBW08
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG
             TO  H-TATE-FLG             OF  H-TKMZBW08-I,
                 WK-SQL-TATE-FLG        OF  WK-MSG-TKMZBW08
      *----------  玉ID
           MOVE  WK-GYOKU-ID
             TO  H-GYOKU-ID             OF  H-TKMZBW08-I,
                 WK-SQL-GYOKU-ID        OF  WK-MSG-TKMZBW08
      *----------  適用開始日
           MOVE  H-UKE-YMD              OF  H-TKMXTR00-1
             TO  H-TEKIYO-FROM          OF  H-TKMZBW08-I,
                 WK-SQL-TEKIYO-FROM     OF  WK-MSG-TKMZBW08
      *----------  権利落日
           MOVE  WK-KENRI-OTI-YMD       OF  WK-TKMZMS00-KAKUTE
             TO  H-KENRI-OTI-YMD        OF  H-TKMZBW08-I,
                 WK-SQL-KENRI-OTI-YMD   OF  WK-MSG-TKMZBW08
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD        OF  WK-TKMZMS00-KAKUTE
             TO  H-SIJO-TUKA-CD         OF  H-TKMZBW08-I,
                 WK-SQL-SIJO-TUKA-CD    OF  WK-MSG-TKMZBW08
      *----------  権利付数量
           MOVE  WK-RIT-SRY             OF  WK-TKMZMS00-KAKUTE
             TO  H-RIT-SRY              OF  H-TKMZBW08-I,
                 WK-SQL-RIT-SRY         OF  WK-MSG-TKMZBW08
      *----------  市場通貨未収収益
           MOVE  ZERO
             TO  H-SJTK-MS-SHEKI        OF  H-TKMZBW08-I,
                 WK-SQL-SJTK-MS-SHEKI   OF  WK-MSG-TKMZBW08
      *----------  市場通貨源泉税
           MOVE  ZERO
             TO  H-SJTK-GENSEN-TAX      OF  H-TKMZBW08-I,
                 WK-SQL-SJTK-GENSEN-TAX OF  WK-MSG-TKMZBW08
      *----------  未入金対象数量残高
           COMPUTE  H-MNK-TSHO-SRYZN    OF  H-TKMZBW08-I
                 =  WK-MNK-TSHO-SRYZN   OF  WK-TKMZMS00-KAKUTE
                 -  H-KENRI-SURYO       OF  H-TKMXTR00-1
           IF  H-MNK-TSHO-SRYZN         OF  H-TKMZBW08-I  <  ZERO
           THEN
             MOVE  ZERO
               TO  H-MNK-TSHO-SRYZN     OF  H-TKMZBW08-I
           ELSE
             CONTINUE
           END-IF
           MOVE  H-MNK-TSHO-SRYZN       OF  H-TKMZBW08-I
             TO  WK-SQL-MNK-TSHO-SRYZN  OF  WK-MSG-TKMZBW08
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日=["
      D            H-SYORI-YMD          OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":起動ID=["
      D            H-KIDOU-ID           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード=["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード=["
      D            H-FUND-CD            OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード=["
      D            H-PTF-CD             OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード=["
      D            H-SEC-SBT-CD         OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード=["
      D            H-MEG-CD             OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":玉ID=["
      D            H-GYOKU-ID           OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":適用開始日=["
      D            H-TEKIYO-FROM        OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":権利落日=["
      D            H-KENRI-OTI-YMD      OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨コード=["
      D            H-SIJO-TUKA-CD       OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":権利付数量=["
      D            H-RIT-SRY            OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨未収収益=["
      D            H-SJTK-MS-SHEKI      OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":市場通貨源泉税=["
      D            H-SJTK-GENSEN-TAX    OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":未入金対象数量残高=["
      D            H-MNK-TSHO-SRYZN     OF  H-TKMZBW08-I"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード=["
      D            H-UPD-LOGIN-CMP-CD   OF  H-TKMZBW08-I"]"
      *-----------------------------------------------------------------
           MOVE  CNS-POS-064            TO  WK-ERR-POS
           MOVE  CNS-POS-065            TO  WK-ERR-POS1
           MOVE  CNS-POS-066            TO  WK-ERR-POS2
           PERFORM  TKMZBW08-INSERT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***C)未収収益計算データINSERT処理"
      D             " (「別紙1-7 SQL説明」を参照)処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW08-INSERT3-EXT.
           EXIT.
      ******************************************************************
      *           取引テーブル(別紙1-6)CURSOR CLOSE
      ******************************************************************
      *TKMXTR00-CLOSE2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *             ":*** 取引テーブル(別紙1-6)CURSOR CLOSE START ***"
      *-------------------<DEBUG>---------------------------------------
      *----------  取引テーブル(別紙1-6) CURSOR CLOSE
      *    EXEC  SQL
      *      CLOSE TKMXTR00_CUR2
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY CNS-PGM-ID":取引テーブル(別紙1-6)CURSOR CLOSE "
      *            "SQLCODE=["SQLCODE"]"
      *-------------------<DEBUG>---------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMXTR00-2-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-6) SQL処理 (CLOSE)  正常"
      *    DISPLAY  CNS-PGM-ID":取引テーブルカーソルオープンフラグ2=["
      *             FLG-TKMXTR00-2-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-6) SQL処理エラー  (CLOSE)"
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-067
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-TKMXTR00    DELIMITED  BY  SIZE
      *       INTO   FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ポジション             =["
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *             ":*** 取引テーブル(別紙1-6)CURSOR CLOSE END ***"
      *-------------------<DEBUG>---------------------------------------
      *    CONTINUE.
      *TKMXTR00-CLOSE2-EXT.
      *    EXIT.
      ******************************************************************
      *      対象取引情報(別紙1-5) CURSOR CLOSE
      ******************************************************************
      *TKMZBW04-CLOSE2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *              ":*** 対象取引情報(別紙1-5) CURSOR CLOSE  START"
      *-------------------<DEBUG>---------------------------------------
      *    EXEC  SQL
      *      CLOSE TKMZBW04_CUR2
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":対象取引情報(別紙1-5) CURSOR CLOSE "
      *    " SQLCODE=[" SQLCODE "]"
      *-------------------<DEBUG>---------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZBW04-2-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-5) CURSOR CLOSE  正常 "
      *    DISPLAY  CNS-PGM-ID":対象取引情報データカーソルオープン"
      *             "フラグ2 =[" FLG-TKMZBW04-2-CR-OPEN "]"
      *-------------------<DEBUG>---------------------------------------
      *    ELSE
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID":(別紙1-5) CURSOR CLOSE エラー"
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-068
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-TKMZBW04    DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":ポジション             =["
      *             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *    DISPLAY  CNS-PGM-ID
      *              ":*** 対象取引情報(別紙1-5) CURSOR CLOSE  END"
      *-------------------<DEBUG>---------------------------------------
      *    CONTINUE.
      *TKMZBW04-CLOSE2-EXT.
      *    EXIT.
      ******************************************************************
      *         異動計算項目端数処理
      ******************************************************************
       IDO-CALC-KMHS-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  異動計算項目端数処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE   PARM-SMZC1501-INOUT
                        PARM-RTNPKG
      *----------  【SMZC1501】異動計算項目端数処理に接続用パラメータの設定を行なう
      *----------  入力データ
           MOVE  WK-IN-SUTI
             TO  IN-SUTI                OF  PARM-SMZC1501-ARG1
      *----------  通貨デフォールト端数処理
           MOVE  WK-TUKA-DEF-HASU-SYRI-PARM
                                        OF  WK-SMZJ2110-ARG1
             TO  TUKA-DEF-HASU-SYRI-PARM
                                        OF  PARM-SMZC1501-ARG1
      *----------  市場通貨／運用通貨区分
           MOVE  CNS-SJUY-TUKA-KBN-1
             TO  SIJO-UNYOU-TUKA-KBN    OF  PARM-SMZC1501-ARG1
      *----------  計算項目
           MOVE  CNS-CALC-KUMK-00
             TO  CALC-KOUMO             OF  PARM-SMZC1501-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":入力データ                  =["
      D             IN-SUTI             OF  PARM-SMZC1501-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":通貨デフォールト端数処理=["
      D             TUKA-DEF-HASU-SYRI-PARM OF  PARM-SMZC1501-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":異動計算パターン             =["
      D             YIDOU-CALC-PARM     OF  PARM-SMZC1501-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":市場通貨／運用通貨区分=["
      D             SIJO-UNYOU-TUKA-KBN OF  PARM-SMZC1501-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":計算項目                     =["
      D             CALC-KOUMO          OF  PARM-SMZC1501-ARG1"]"
      *-----------------------------------------------------------------
      *---------- 【SMZC1501】異動計算項目端数処理をコールして、出力データを取得する
           CALL   "SMZC1501"             USING  PARM-SMZC1501-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["
      D             PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZC1501)=["
      D             RTN-CD              OF  PARM-RTNPKG(COUNTER
      D                                 OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-RTNPKG=["
      D             COUNTER             OF  PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":異動計算項目端数処理  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":異動計算項目端数処理  異常"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG (COUNTER
                                        OF  PARM-RTNPKG )
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  出力データ
           MOVE  OUT-SUTI               OF  PARM-SMZC1501-ARG2
             TO  WK-OUT-SUTI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":出力データ =[" WK-OUT-SUTI"]"
      D    DISPLAY  CNS-PGM-ID ":***  異動計算項目端数処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       IDO-CALC-KMHS-EXT.
           EXIT.
      ******************************************************************
      *     3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***   後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ2110-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG   = ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":PARM-SMZJ2110-ARG2=["
      D            PARM-SMZJ2110-ARG2    "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ2110-ARG3   = ["
      D             PARM-SMZJ2110-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":COUNT = ["
      D             COUNTER             OF PARM-SMZJ2110-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 = ["
      D             ERR-PGM-ID          OF PARM-SMZJ2110-ARG3(COUNTER
      D                                 OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":ポジション = ["
      D             ERR-POS             OF PARM-SMZJ2110-ARG3(COUNTER
      D                                 OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード = ["
      D             RTN-CD              OF PARM-SMZJ2110-ARG3(COUNTER
      D                                 OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード = ["
      D             DETAIL-RTN-CD       OF PARM-SMZJ2110-ARG3(COUNTER
      D                                 OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ = ["
      D             DETAIL-RTN-CD-FLG   OF PARM-SMZJ2110-ARG3(COUNTER
      D                                 OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ = ["
      D             FREE-MSG            OF PARM-SMZJ2110-ARG3(COUNTER
      D                                 OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D           ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           GOBACK.
      ******************************************************************
      *     3.4.1   エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID
      *D    ":入金日以前の未収配当データカーソルオープン"
      *D             "フラグ= ["FLG-NYUKN-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":対象取引情報データカーソルオープン"
      D             "フラグ1= ["FLG-TKMZBW04-1-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":対象取引情報データカーソルオープン"
      D             "フラグ2= ["FLG-TKMZBW04-2-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":取引テーブルカーソルオープンフラグ2=["
      D             FLG-TKMXTR00-2-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":未収収益計算データカーソルオープン"
      D             "フラグ1= ["FLG-TKMZBW08-1-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":未収収益カーソルオープンフラグ1= ["
      D             FLG-TKMZMS00-1-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":(別紙1-13)フラグ= ["
      D             FLG-NK-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW08-S3-INSERT= ["
      D             FLG-TKMZBW08-S3-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW08-S10-UPDATE= ["
      D             FLG-TKMZBW08-S10-UPDATE"]"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                TO  FLG-TKMZBW08-S3-INSERT      @SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW08-S10-UPDATE     @SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW08-S3-INSERT= ["
      D             FLG-TKMZBW08-S3-INSERT"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW08-S10-UPDATE= ["
      D             FLG-TKMZBW08-S10-UPDATE"]"
      *-----------------------------------------------------------------
      *----------  (別紙1-13)フラグ
           IF  FLG-NK-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CUR13"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE CUR13
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-NK-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":(別紙1-13)フラグ= ["
      D             FLG-NK-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  入金日以前の未収配当データカーソルオープンフラグ
      *     IF  FLG-NYUKN-CR-OPEN = CNS-ON
      *     THEN
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE NYUKN_CUR"
      **-----------------------------------------------------------------
      *       EXEC  SQL
      *           CLOSE NYUKN_CUR
      *       END-EXEC
      *       MOVE  CNS-OFF              TO  FLG-NYUKN-CR-OPEN
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID
      *D    ":入金日以前の未収配当データカーソルオープン"
      *D             "フラグ1= ["FLG-NYUKN-CR-OPEN"]"
      **-----------------------------------------------------------------
      *     ELSE
      *       CONTINUE
      *     END-IF
      *----------  対象取引情報データカーソルオープンフラグ1
           IF  FLG-TKMZBW04-1-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW04_CUR1"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW04_CUR1
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZBW04-1-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報データカーソルオープン"
      D             "フラグ1= ["FLG-TKMZBW04-1-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  対象取引情報データカーソルオープンフラグ2
           IF  FLG-TKMZBW04-2-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW04_CUR2"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW04_CUR2
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZBW04-2-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象取引情報データカーソルオープン"
      D             "フラグ2= ["FLG-TKMZBW04-2-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  取引テーブルカーソルオープンフラグ2
           IF  FLG-TKMXTR00-2-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMXTR00_CUR2"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMXTR00_CUR2
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMXTR00-2-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引テーブルカーソルオープンフラグ2=["
      D             FLG-TKMXTR00-2-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  未収収益計算データカーソルオープンフラグ1
           IF  FLG-TKMZBW08-1-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW08_CUR"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZBW08_CUR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZBW08-1-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益計算データカーソルオープン"
      D             "フラグ1=["FLG-TKMZBW08-1-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  未収収益カーソルオープンフラグ1
           IF  FLG-TKMZMS00-1-CR-OPEN = CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZMS00_CUR"
      *-----------------------------------------------------------------
             EXEC  SQL
                 CLOSE TKMZMS00_CUR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZMS00-1-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益カーソルオープンフラグ1=["
      D             FLG-TKMZMS00-1-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  リターンパッケージの設定
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理2 START ***"
      *-----------------------------------------------------------------
           CALL   "SCZY1170"             USING  PARM-SCZY1170-IN
                                                PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG    TO     PARM-SMZJ2110-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":PARM-SCZY1170-RTNPKG=["
      D            PARM-SCZY1170-RTNPKG    "]"
      D    DISPLAY CNS-PGM-ID":PARM-SMZJ2110-ARG2=["
      D            PARM-SMZJ2110-ARG2    "]"
      D    DISPLAY CNS-PGM-ID":PARM-SMZJ2110-ARG3=["
      D            PARM-SMZJ2110-ARG3    "]"
      D    DISPLAY CNS-PGM-ID":  COUNTER  = ["
      D            COUNTER               OF PARM-SMZJ2110-ARG3"]"
      D    DISPLAY CNS-PGM-ID":  エラー検知プログラム名= ["
      D            ERR-PGM-ID            OF PARM-SMZJ2110-ARG3(COUNTER
      D                                  OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  ポジション = ["
      D            ERR-POS               OF PARM-SMZJ2110-ARG3(COUNTER
      D                                  OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  リターンコード = ["
      D            RTN-CD                OF PARM-SMZJ2110-ARG3(COUNTER
      D                                  OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコード = ["
      D            DETAIL-RTN-CD         OF PARM-SMZJ2110-ARG3(COUNTER
      D                                  OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D            DETAIL-RTN-CD-FLG     OF PARM-SMZJ2110-ARG3(COUNTER
      D                                  OF PARM-SMZJ2110-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  フリーメッセージ = ["
      D            FREE-MSG              OF PARM-SMZJ2110-ARG3(COUNTER
      D                                  OF PARM-SMZJ2110-ARG3)"]"
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***リターンパッケージの処理2  END  ***"
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
