      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ1810.pco
      * プログラム名称 : 対象取引決定と処理順決定(物)
      * 処理概要       : 取引テーブルからデータを抽出して、跨ぎ取引データを追加し、
      *                  そして、ソート処理を行って、対象取引に挿入する
      * 参照ＤＢ       : 取引（TKMXTR00）
      *                : 対象取引（TKMZBW04）
      * 更新ＤＢ       : 対象取引（TKMZBW04）
      *                : 処理資金取引（TKMZBW18）
      * 引数           : IN  基準日断面情報
      *                : IN  銘柄別断面情報
      *                : IN  異動計算パターン
      *                : IN  市場通貨コード
      *                : IN  基本会計ベースフラグ
      *                : OUT 取引SELECT件数
      *                : OUT 警告フラグ(1)
      *                : OUT 警告フラグ(2)
      *                : OUT 警告フラグ(3)
      *                : OUT 警告フラグ(4)
      *                : OUT RTNパッケージ
      * VERSION  1.00
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- ----  ---------  ------  ------------------------
      * 20080318  新規  SCS         王偉領  新規作成
      * 20080813  修正  SCS         趙迎慶  テーマMZ-009対応
      * 20080822  修正  SCS         趙迎慶  残タスク48
      * 20081015  修正  SCS         于  瓊  連結障害対応
      * 20081201  修正  SCS         顧建鋒  連結障害対応
      * 20081217  修正  SCS         張凌翔  残タスク171対応
      * 20081225  修正  SCS         張凌翔  連結障害0000981対応
      * 20090105  修正  SCS         張凌翔  残タスク172対応
      * 20090122  修正  SCS         徐曉俊  残タスク169、145対応
      * 20090206  修正  SCS         顧建鋒  残タスク146対応
      * 20090122  修正  SCS         徐曉俊  連結障害1312対応
      * 20090413  修正  SCS         徐曉俊  テーマ109対応,テーマ53対応
      * 20090422  修正  SCS         顧建鋒  テーマ24
      * 20090424  修正  SCS         徐曉俊  総合障害0000320
      * 20090512  修正  SCS         顧建鋒  連結障害1728
      * 20090623  修正  SCS         何傑文  総合障害1050
      * 20090629  修正  SCS         徐曉俊  総合障害768
      * 20090721  修正  SCS         王飛    総合障害1661
      * 20090731  修正  SCS         何傑文  総合障害1595
      * 20090805  修正  SCS         王飛    総合障害1595-02
      * 20091027  修正  SCS         惲旭来  テーマ1770
      * 20100125  修正  SCS         張香桃  GIPS2.0性能
      * 20100223  修正  SCS         陳曄    GIPS2.0性能改善
      * 20100415  修正  SCS         陳曄    GIPS2.0追いつき対応
      * 20100525  修正  SCS         陳幸縁  総合障害4256
      * 20100609  修正  SCS         陳幸縁  テーマ2748
      * 20100902  修正  SCS         高帥    テーマ3004
      * 20101015  修正  SCS         陳幸縁  テーマ3068
      * 20101227  修正  SCS         楊 超   テーマ3129
      * 20110421  修正  SCS         兪巧芳  テーマ3212-1性能改善対応
      * 20110615  修正  SCS         兪巧芳  テーマ3224
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ1810.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-03-18.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ1810".
         05  CNS-TBL-TKMXTR00      PIC  X(08)  VALUE  "TKMXTR00".
         05  CNS-TBL-TKMZBW04      PIC  X(08)  VALUE  "TKMZBW04".
         05  CNS-TBL-TKMZBW18      PIC  X(08)  VALUE  "TKMZBW18".
         05  CNS-TBL-TKMZZI00      PIC  X(08)  VALUE  "TKMZZI00".
      *----------  仕訳基準パターンコード約定の場合
         05  CNS-YKJ-T             PIC  X(01)  VALUE  "T".
      *----------  仕訳基準パターンコード受渡の場合
         05  CNS-UKE-S             PIC  X(01)  VALUE  "S".
      *----------  約定ベース
         05  CNS-YKJ-1             PIC  X(01)  VALUE  "1".
      *----------  受渡ベース
         05  CNS-UKE-2             PIC  X(01)  VALUE  "2".
      *----------  約定順
         05  CNS-YKJ-JUN           PIC  X(01)  VALUE  "1".
      *----------  受渡順
         05  CNS-UKE-JUN           PIC  X(01)  VALUE  "2".
      *----------  増加
         05  CNS-PLUS-1            PIC  X(01)  VALUE  "1".
      *----------  減少
         05  CNS-MINUS-2           PIC  X(01)  VALUE  "2".
      *----------  無効
         05  CNS-MUKOU-9           PIC  X(01)  VALUE  "9".
      *----------  処理順決定増
         05  CNS-PLUS-00           PIC  9(02)  VALUE  0.
      *----------  処理順決定増
         05  CNS-PLUS-01           PIC  9(02)  VALUE  1.
      *----------  処理順決定減
         05  CNS-MINUS-02          PIC  9(02)  VALUE  2.
      *----------  跨ぎ入れ子では無い
         05  CNS-IRE-0             PIC  X(01)  VALUE  "0".
      *----------  跨ぎ入れ子
         05  CNS-IRE-1             PIC  X(01)  VALUE  "1".
      *----------  赤
         05  CNS-AKA-1             PIC  X(01)  VALUE  "1".
      *----------  黒
         05  CNS-KURO-SPACE        PIC  X(01)  VALUE  " ".
         05  CNS-RTN-140           PIC  X(03)  VALUE  "140".
         05  CNS-1                 PIC  9(01)  VALUE  1.
         05  CNS-0                 PIC  9(01)  VALUE  0.
         05  CNS-5                 PIC  9(01)  VALUE  5.
      *----------  20100223(GIPS2.0)  START
         05  CNS-100               PIC  9(03)  VALUE  100.
      *----------  20100223(GIPS2.0)  END
         05  CNS-X-1               PIC  X(01)  VALUE  "1".
         05  CNS-X-S               PIC  X(01)  VALUE  "S".
      *----------  処理順決定摘要 1
         05  CNS-SRJUN-TEKIYO-01   PIC  9(02)  VALUE  1.
      *----------  処理順決定摘要 2
         05  CNS-SRJUN-TEKIYO-02   PIC  9(02)  VALUE  2.
      *----------  処理順決定摘要 3
         05  CNS-SRJUN-TEKIYO-03   PIC  9(02)  VALUE  3.
      *----------  処理順決定摘要 4
         05  CNS-SRJUN-TEKIYO-04   PIC  9(02)  VALUE  4.
      *----------  処理順決定摘要 5
         05  CNS-SRJUN-TEKIYO-05   PIC  9(02)  VALUE  5.
      *----------  処理順決定摘要 6
         05  CNS-SRJUN-TEKIYO-06   PIC  9(02)  VALUE  6.
      *----------  処理順決定摘要 7
         05  CNS-SRJUN-TEKIYO-07   PIC  9(02)  VALUE  7.
      *----------  処理順決定摘要 8
         05  CNS-SRJUN-TEKIYO-08   PIC  9(02)  VALUE  8.
      *----------  処理順決定摘要 9
         05  CNS-SRJUN-TEKIYO-09   PIC  9(02)  VALUE  9.
      *----------  処理順決定摘要 10
         05  CNS-SRJUN-TEKIYO-10   PIC  9(02)  VALUE  10.
      *----------  処理順決定摘要 11
         05  CNS-SRJUN-TEKIYO-11   PIC  9(02)  VALUE  11.
      *----------  処理順決定摘要 12
         05  CNS-SRJUN-TEKIYO-12   PIC  9(02)  VALUE  12.
      *----------  処理順決定摘要 13
         05  CNS-SRJUN-TEKIYO-13   PIC  9(02)  VALUE  13.
      *----------  処理順決定摘要 14
         05  CNS-SRJUN-TEKIYO-14   PIC  9(02)  VALUE  14.
      *----------  処理順決定摘要 15
         05  CNS-SRJUN-TEKIYO-15   PIC  9(02)  VALUE  15.
      *----------  処理順決定摘要 16
         05  CNS-SRJUN-TEKIYO-16   PIC  9(02)  VALUE  16.
      *----------  処理順決定摘要 17
         05  CNS-SRJUN-TEKIYO-17   PIC  9(02)  VALUE  17.
      *----------  処理順決定摘要 18
         05  CNS-SRJUN-TEKIYO-18   PIC  9(02)  VALUE  18.
      *----------  処理順決定摘要 19
         05  CNS-SRJUN-TEKIYO-19   PIC  9(02)  VALUE  19.
      *----------  処理順序 1
         05  CNS-SYRI-JUN-1        PIC  X(01)  VALUE  "1".
      *----------  処理順序 2
         05  CNS-SYRI-JUN-2        PIC  X(01)  VALUE  "2".
      *----------  処理順序 3
         05  CNS-SYRI-JUN-3        PIC  X(01)  VALUE  "3".
      *----------  処理順序 4
         05  CNS-SYRI-JUN-4        PIC  X(01)  VALUE  "4".
      *----------  処理順序 5
         05  CNS-SYRI-JUN-5        PIC  X(01)  VALUE  "5".
      *----------  処理順序 6
         05  CNS-SYRI-JUN-6        PIC  X(01)  VALUE  "6".
      *----------  処理順序 7
         05  CNS-SYRI-JUN-7        PIC  X(01)  VALUE  "7".
      *----------  処理順序 8
         05  CNS-SYRI-JUN-8        PIC  X(01)  VALUE  "8".
      *----------  処理順決定評価(評価損益戻入)
         05  CNS-KT-HYOKA-2        PIC  9(02)  VALUE  2.
      *----------  処理順決定評価(切り離し法評価損益計上)
         05  CNS-KT-HYOKA-7        PIC  9(02)  VALUE  7.
      *----------  処理順決定評価(評価損益計上)
         05  CNS-KT-HYOKA-8        PIC  9(02)  VALUE  8.
      *----------  判定対象区分 '1'(評価損益データフラグ)
         05  CNS-HANTEI-TARGET-KBN-1
                                   PIC  X(01)  VALUE  "1".
      *----------  判定対象区分 '2'(未収計算)
         05  CNS-HANTEI-TARGET-KBN-2
                                   PIC  X(01)  VALUE  "2".
      *----------  判定対象区分 'b'(取引属性逆転フラグ)
         05  CNS-HANTEI-TARGET-KBN-B
                                   PIC  X(01)  VALUE  "b".
      *----------  未収計算種類 '31'(その他入金)
         05  CNS-MSKS-SHRU-31      PIC  X(02)  VALUE  "31".
      *----------  未収計算種類 '32'(その他エンド)
         05  CNS-MSKS-SHRU-32      PIC  X(02)  VALUE  "32".
      *----------  証券種別コード
         05  CNS-SEC-SBT-CD-CASH   PIC  X(04)  VALUE  "CASH".
         05  CNS-SEC-SBT-CD-MAR    PIC  X(04)  VALUE  "MAR ".
         05  CNS-SEC-SBT-CD-MABF   PIC  X(04)  VALUE  "MABF".
         05  CNS-SEC-SBT-CD-MABO   PIC  X(04)  VALUE  "MABO".
         05  CNS-SEC-SBT-CD-MAB    PIC  X(04)  VALUE  "MAB ".
         05  CNS-SEC-SBT-CD-MAFB   PIC  X(04)  VALUE  "MAFB".
         05  CNS-SEC-SBT-CD-MASF   PIC  X(04)  VALUE  "MASF".
         05  CNS-SEC-SBT-CD-MASO   PIC  X(04)  VALUE  "MASO".
         05  CNS-SEC-SBT-CD-MAS    PIC  X(04)  VALUE  "MAS ".
         05  CNS-SEC-SBT-CD-MAFS   PIC  X(04)  VALUE  "MAFS".
         05  CNS-SEC-SBT-CD-CALL   PIC  X(04)  VALUE  "CALL".
         05  CNS-SEC-SBT-CD-DA     PIC  X(04)  VALUE  "DA  ".
         05  CNS-SEC-SBT-CD-NCD    PIC  X(04)  VALUE  "NCD ".
         05  CNS-SEC-SBT-CD-XMOC   PIC  X(04)  VALUE  "XMOC".
         05  CNS-SEC-SBT-CD-FDAL   PIC  X(04)  VALUE  "FDAL".
         05  CNS-SEC-SBT-CD-B      PIC  X(04)  VALUE  "B   ".
         05  CNS-SEC-SBT-CD-DBMS   PIC  X(04)  VALUE  "DBMS".
         05  CNS-SEC-SBT-CD-FBMS   PIC  X(04)  VALUE  "FBMS".
         05  CNS-SEC-SBT-CD-CB     PIC  X(04)  VALUE  "CB  ".
         05  CNS-SEC-SBT-CD-WB     PIC  X(04)  VALUE  "WB  ".
         05  CNS-SEC-SBT-CD-CBMS   PIC  X(04)  VALUE  "CBMS".
         05  CNS-SEC-SBT-CD-XMOB   PIC  X(04)  VALUE  "XMOB".
      *----------  取引事由
         05  CNS-TORI-JIYU-FTPU    PIC  X(04)  VALUE  "FTPU".
         05  CNS-TORI-JIYU-FTLU    PIC  X(04)  VALUE  "FTLU".
         05  CNS-TORI-JIYU-FTCU    PIC  X(04)  VALUE  "FTCU".
         05  CNS-TORI-JIYU-FTPR    PIC  X(04)  VALUE  "FTPR".
         05  CNS-TORI-JIYU-FTLR    PIC  X(04)  VALUE  "FTLR".
         05  CNS-TORI-JIYU-FTCR    PIC  X(04)  VALUE  "FTCR".
         05  CNS-TORI-JIYU-FTSG    PIC  X(04)  VALUE  "FTSG".
         05  CNS-TORI-JIYU-FTSL    PIC  X(04)  VALUE  "FTSL".
         05  CNS-TORI-JIYU-MATU    PIC  X(04)  VALUE  "MATU".
         05  CNS-TORI-JIYU-MATD    PIC  X(04)  VALUE  "MATD".
         05  CNS-TORI-JIYU-FTPS    PIC  X(04)  VALUE  "FTPS".
         05  CNS-TORI-JIYU-FTLS    PIC  X(04)  VALUE  "FTLS".
         05  CNS-TORI-JIYU-FTPB    PIC  X(04)  VALUE  "FTPB".
         05  CNS-TORI-JIYU-FTLB    PIC  X(04)  VALUE  "FTLB".
         05  CNS-TORI-JIYU-FTLT    PIC  X(04)  VALUE  "FTLT".
         05  CNS-TORI-JIYU-FTPT    PIC  X(04)  VALUE  "FTPT".
         05  CNS-TORI-JIYU-FTLC    PIC  X(04)  VALUE  "FTLC".
         05  CNS-TORI-JIYU-FTPC    PIC  X(04)  VALUE  "FTPC".
      *----------  資金種別
         05  CNS-SIKIN-SBT-A       PIC  X(01)  VALUE  "a".
         05  CNS-SIKIN-SBT-B       PIC  X(01)  VALUE  "b".
         05  CNS-SIKIN-SBT-C       PIC  X(01)  VALUE  "c".
         05  CNS-SIKIN-SBT-D       PIC  X(01)  VALUE  "d".
         05  CNS-SIKIN-SBT-E       PIC  X(01)  VALUE  "e".
         05  CNS-SIKIN-SBT-F       PIC  X(01)  VALUE  "f".
         05  CNS-SIKIN-SBT-G       PIC  X(01)  VALUE  "g".
         05  CNS-SIKIN-SBT-H       PIC  X(01)  VALUE  "h".
      *----------  増減区分
         05  CNS-ZG-KBN-1          PIC  X(01)  VALUE  "1".
         05  CNS-ZG-KBN-2          PIC  X(01)  VALUE  "2".
      *----------  計算フラグ
         05  CNS-CALC-FLG-1        PIC  X(01)  VALUE  "1".
      *----------  警告区分
         05  CNS-WARN-KBN-1        PIC  X(01)  VALUE  "1".
         05  CNS-WARN-KBN-2        PIC  X(01)  VALUE  "2".
      *----------  警告フラグ
         05  CNS-WARN-FLG-0        PIC  X(01)  VALUE  "0".
         05  CNS-WARN-FLG-1        PIC  X(01)  VALUE  "1".
      *----------  パラメータエラーメッセージ
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-SQL-MSG-INSERT    PIC  X(17)  VALUE
                                               " SQL-MSG(INSERT):".
         05  CNS-SQL-MSG-UPDATE    PIC  X(17)  VALUE
                                               " SQL-MSG(UPDATE):".
         05  CNS-SQL-MSG-DELETE    PIC  X(17)  VALUE
                                               " SQL-MSG(DELETE):".
         05  CNS-SQL-1405          PIC  S9(04) VALUE  -1405.
      *---------- ワーク約定ベース受渡順差分フラグ
         05  CNS-YUJ-NUM-FLG-1     PIC  9(01)  VALUE  1.
         05  CNS-YUJ-FLG-1         PIC  X(01)  VALUE  "1".
         05  CNS-YUJ-FLG-2         PIC  X(01)  VALUE  "2".
      ******************************************************************
      *    フラグエリア
      ******************************************************************
       01  FLG-AREA.
         05  FLG-TKMZZI00          PIC  9(01).
         05  FLG-TKMZZI00-2        PIC  9(01).
      *----------  取引_1循環フラグ-1
         05  FLG-TKMXTR00-FE-1-1   PIC  9(01).
      *----------  取引_2循環フラグ-2
         05  FLG-TKMXTR00-FE-1-2   PIC  9(01).
      *----------  取引_2循環フラグ
         05  FLG-TKMXTR00-FE-2     PIC  9(01).
      *----------  対象取引_1 循環フラグ
         05  FLG-TKMZBW04-FE-1     PIC  9(01).
      *----------  対象取引_2 循環フラグ
         05  FLG-TKMZBW04-FE-2     PIC  9(01).
      *----------  跨ぎ入れ子フラグ
         05  FLG-MATAGI-IRE        PIC  X(01).
      *----------  跨ぎ入れ子フラグ2
         05  FLG-MATAGI-IRE-2      PIC  X(01).
      *----------   取引_1.取引事由検索循環フラグ
         05  FLG-TORI-JIYU         PIC  9(01).
      *----------   次のカーソルフェッチ処理フラグ
         05  FLG-NEXT-FETCH        PIC  9(01).
       01  FLG-AREA-CR.
      *----------  取引カーソルオープンフラグ
         05  FLG-TKMXTR00-CR-13    PIC  9(01).
      *----------  取引_1カーソルオープンフラグ-1
         05  FLG-TKMXTR00-CR-1-1   PIC  9(01).
      *----------  取引_1カーソルオープンフラグ-2
         05  FLG-TKMXTR00-CR-1-2   PIC  9(01).
      *----------  取引_2カーソルオープンフラグ
         05  FLG-TKMXTR00-CR-2     PIC  9(01).
      *----------  対象取引_1 カーソルオープンフラグ
         05  FLG-TKMZBW04-CR       PIC  9(01).
      *----------  対象取引_1 カーソルオープンフラグ
         05  FLG-TKMZBW04-CR-1     PIC  9(01).
      *----------  対象取引_2 カーソルオープンフラグ
         05  FLG-TKMZBW04-CR-2-1   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW04-CR-2-2   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW04-CR-2-3   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW04-CR-2-4   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZZI00-CR       PIC  9(01).
         05  FLG-TKMZZI00-CR-2     PIC  9(01).
         05  FLG-TKMZBW04-S2-INSERT                                     @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW04-S14-INSERT                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW04-S15-INSERT                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW04-S16-INSERT                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW04-S7-DELETE                                     @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW04-S9-UPDATE                                     @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
         05  FLG-TKMZBW18-S10-INSERT                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  複数回起動チェック用スイッチ
       01  FIRST-SW                PIC  X(03)  VALUE  'YES'.            @3212SEINO@@
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
         05  WK-SMZJ1810.
           10  WK-PARM-SMZJ1810-ARG1.
      *----------  基準日断面情報
             15  WK-TKMZBW02.
      *----------  処理実行日
               20  WK-SYORI-YMD    PIC  S9(08).
      *----------  起動ID
               20  WK-KIDOU-ID     PIC  X(04).
      *----------  開始基準日の翌日
               20  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  基本会計ベースフラグ
               20  WK-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  銘柄別断面情報
             15  WK-TKMZBW03.
      *----------  処理実行日
               20  WK-SYORI-YMD    PIC  S9(08).
      *----------  起動ID
               20  WK-KIDOU-ID     PIC  X(04).
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  開始基準日
               20  WK-KAISI-KJN-YMD
                                   PIC  S9(08).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  差分更新From日
               20  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *----------  異動計算パターン
             15  WK-IDO-CALC-PATTERN.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  異動計算パターンコード
               20  WK-IDO-CALC-PATTERN-CD
                                   PIC  X(04).
      *----------  市場通貨コード
               20  WK-SIJO-TUKA-CD PIC  X(04).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  保有目的
               20  WK-POSSESSION-OBJECT
                                   PIC  X(01).
      *----------  払出簿価計算方法
               20  WK-DEBET-BOKA-CALC-HOU
                                   PIC  X(01).
      *----------  払出簿価端数（市場通貨）
               20  WK-DEBET-BOKA-HASU-BC
                                   PIC  X(01).
      *----------  払出単価桁数（市場通貨）
               20  WK-DEBET-TNK-KETASU-BC
                                   PIC  S9(02).
      *----------  払出単価端数（市場通貨）
               20  WK-DEBET-TNK-HASU-BC
                                   PIC  X(01).
      *----------  払出簿価端数（運用通貨）
               20  WK-DEBET-BOKA-HASU-LC
                                   PIC  X(01).
      *----------  払出単価桁数（運用通貨）
               20  WK-DEBET-TNK-KETASU-LC
                                   PIC  S9(02).
      *----------  払出単価端数（運用通貨）
               20  WK-DEBET-TNK-HASU-LC
                                   PIC  X(01).
      *----------  売り続く限り同一コスト
               20  WK-URI-TUDUKU-SAME-COST
                                   PIC  X(01).
      *----------  同一日は同一コスト
               20  WK-SAME-YMD-SAME-COST
                                   PIC  X(01).
      *----------  適用（先処理）１
               20  WK-TEKIYO-SAKI-SYRI1
                                   PIC  X(04).
      *----------  適用（先処理）２
               20  WK-TEKIYO-SAKI-SYRI2
                                   PIC  X(04).
      *----------  適用（先処理）３
               20  WK-TEKIYO-SAKI-SYRI3
                                   PIC  X(04).
      *----------  適用（先処理）４
               20  WK-TEKIYO-SAKI-SYRI4
                                   PIC  X(04).
      *----------  適用（先処理）５
               20  WK-TEKIYO-SAKI-SYRI5
                                   PIC  X(04).
      *----------  適用（先処理）６
               20  WK-TEKIYO-SAKI-SYRI6
                                   PIC  X(04).
      *----------  適用（先処理）７
               20  WK-TEKIYO-SAKI-SYRI7
                                   PIC  X(04).
      *----------  適用（先処理）８
               20  WK-TEKIYO-SAKI-SYRI8
                                   PIC  X(04).
      *----------  適用（先処理）９
               20  WK-TEKIYO-SAKI-SYRI9
                                   PIC  X(04).
      *----------  適用（後処理）１
               20  WK-TEKIYO-ATO-SYRI1
                                   PIC  X(04).
      *----------  適用（後処理）２
               20  WK-TEKIYO-ATO-SYRI2
                                   PIC  X(04).
      *----------  適用（後処理）３
               20  WK-TEKIYO-ATO-SYRI3
                                   PIC  X(04).
      *----------  適用（後処理）４
               20  WK-TEKIYO-ATO-SYRI4
                                   PIC  X(04).
      *----------  適用（後処理）５
               20  WK-TEKIYO-ATO-SYRI5
                                   PIC  X(04).
      *----------  適用（後処理）６
               20  WK-TEKIYO-ATO-SYRI6
                                   PIC  X(04).
      *----------  適用（後処理）７
               20  WK-TEKIYO-ATO-SYRI7
                                   PIC  X(04).
      *----------  適用（後処理）８
               20  WK-TEKIYO-ATO-SYRI8
                                   PIC  X(04).
      *----------  適用（後処理）９
               20  WK-TEKIYO-ATO-SYRI9
                                   PIC  X(04).
      *----------  簿価為替レート適用フラグ
               20  WK-BOKA-KWS-TEKIYO-FLG
                                   PIC  X(01).
      *----------  簿価為替レート端数
               20  WK-BOKA-KWS-HASU
                                   PIC  X(01).
      *----------  簿価為替レート桁数
               20  WK-BOKA-KWS-KETASU
                                   PIC  S9(02).
      *----------  新／旧株の区別
               20  WK-NEW-KYU-KABU-KBN
                                   PIC  X(01).
      *----------  新／旧簿価計算方法
               20  WK-NEW-KYU-BOKA-CALC
                                   PIC  X(01).
      *----------  按分簿価端数
               20  WK-ANB-BOKA-HASU
                                   PIC  X(01).
      *----------  按分単価端数
               20  WK-ANB-TNK-HASU PIC  X(01).
      *----------  按分単価桁数
               20  WK-ANB-TNK-KETASU
                                   PIC  S9(02).
      *----------  前払金償却方法
               20  WK-MAEKIN-SHOUKYK-HOU
                                   PIC  X(01).
      *----------  前払金償却分端数
               20  WK-MAEKIN-SHOUKYK-HASU
                                   PIC  X(01).
      *----------  増減取引順
               20  WK-ZOUGEN-TORI-JUN
                                   PIC  X(01).
      *----------  増加取引処理順序
               20  WK-GKYK-PLUS-SYRI-JUN
                                   PIC  X(01).
      *----------  減少取引処理順序
               20  WK-GKYK-MINUS-SYRI-JUN
                                   PIC  X(01).
      *----------  処理順序
               20  WK-SYRI-JUN     PIC  X(01).
      *----------  更新日時
               20  WK-UPD-DATE     PIC  X(14).
      *----------  更新ログインユーザ会社コード
               20  WK-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  更新ユーザＩＤ
               20  WK-UPD-SID      PIC  X(20).
      *----------  更新プログラムＩＤ
               20  WK-UPD-PGMID    PIC  X(16).
      *----------  市場
             15  WK-SIJO.
      *----------  市場通貨コード
               20  WK-SIJO-TUKA-CD PIC  X(04).
      *---------- 増減順相対物区分
             15  WK-ZOUGENJYUN-SOTAIBT-KBN
                                   PIC  X(01).
      *----------  TABLEＩＤ
         05  WK-TABLE-TKMXTR00     PIC  X(13).
         05  WK-TABLE-TKMZBW04     PIC  X(13).
         05  WK-TABLE-TKMZBW18     PIC  X(13).
         05  WK-TABLE-TKMZZI00     PIC  X(13).
         05  WK-TKMXTR00-2.
      *----------  原取引ＩＤ
           10  WK-TORI-ID          PIC  S9(10).
      *----------  約定日
           10  WK-YKJ-YMD          PIC  S9(08).
      *----------  受渡日
           10  WK-UKE-YMD          PIC  S9(08).
      *----------  ダミー区分
           10  WK-DUMMY-KBN        PIC  X(01).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  為替レート（現地／運用）１
           10  WK-G-U-KWS1         PIC  S9(08)V9(10).
      *----------  為替レート（現地／運用）２
           10  WK-G-U-KWS2         PIC  S9(08)V9(10).
      *----------  経過利息為替レート
           10  WK-KKRS-KWS         PIC  S9(08)V9(10).
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
         05  WK-TKMZBW04-1-5.
      *----------  計上基準日
           10  WK-KEIJOU-KIJUNBI   PIC  S9(08).
         05  WK-TKMZBW04-1-6.
      *----------  計上基準日
           10  WK-KEIJOU-KIJUNBI   PIC  S9(08).
         05  WK-TKMZBW04.
      *----------  約定日
           10  WK-YKJ-YMD          PIC  S9(08).
      *----------  処理順決定摘要
           10  WK-SRJUN-KT-TEKIYO  PIC  S9(02).
      *----------  処理順決定増減
           10  WK-SRJUN-KT-ZOUGEN  PIC  S9(02).
      *----------  処理順決定評価
           10  WK-SRJUN-KT-HYOKA   PIC  S9(02).
      *----------  原取引ＩＤ
           10  WK-TORI-ID          PIC  S9(10).
      *----------  増幅赤黒区分
           10  WK-ZOFKU-AKA-KBN    PIC  X(01).
      *----------  計上基準日
           10  WK-KEIJOU-KIJUNBI   PIC  S9(08).
      *----------  ダミー区分
           10  WK-DUMMY-KBN        PIC  X(01).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  期間内異動計算パターン
         05  WK-KKN-IDO-CALC-PATTERN.
           COPY  "TKPFPT01.cpy".
      *----------  期間内基本会計ベースフラグ
         05  WK-KKN-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  期間内処理順序
         05  WK-KKN-SYRI-JUN       PIC  X(01).
      *----------  開始基準日翌日
         05  WK-KJN-YMD-TOM        PIC  9(08).
      *----------  跨ぎ異動計算パターン
         05  WK-MATAGI-IDO-CALC-PATTERN.
           COPY  "TKPFPT01.cpy".
      *----------  跨ぎ基本会計ベースフラグ
         05  WK-MATAGI-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  跨ぎ処理順序
         05  WK-MATAGI-SYRI-JUN    PIC  X(01).
      *----------  期間内取引
         05  WK-KIKAN-TRHK.
      *----------  原取引ID
           10  WK-TORI-ID          PIC  S9(10).
      *----------  計上基準日
           10  WK-KEIJOU-KIJUNBI   PIC  S9(08).
      *----------  増幅赤黒区分
           10  WK-ZOFKU-AKA-KBN    PIC  X(01).
      *----------  増幅区分
           10  WK-ZOFKU-KBN        PIC  X(01).
      *----------  増幅元異動計上基準日
           10  WK-ZOFKUMT-KJ-KIJUNBI
                                   PIC  S9(08).
      *----------  処理順決定日付
           10  WK-SRJUN-KT-DATE    PIC  S9(08).
      *----------  処理順同日優先度日付
           10  WK-SRJUN-DJ-DATE    PIC  S9(08).
      *----------  処理順決定摘要
           10  WK-SRJUN-KT-TEKIYO  PIC  S9(02).
      *----------  処理順決定増減
           10  WK-SRJUN-KT-ZOUGEN  PIC  S9(02).
      *----------  処理順決定評価
           10  WK-SRJUN-KT-HYOKA   PIC  S9(02).
      *----------  未収計算対象フラグ
           10  WK-MSKS-TARGET-FLG  PIC  X(01).
      *----------  未収計算種類
           10  WK-MSKS-SHRU        PIC  X(02).
      *----------  処理順
           10  WK-SRJUN            PIC  S9(08).
      *----------  約定日
           10  WK-YKJ-YMD          PIC  S9(08).
      *----------  受渡日
           10  WK-UKE-YMD          PIC  S9(08).
      *----------  ダミー区分
           10  WK-DUMMY-KBN        PIC  X(01).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  権利数量
           10  WK-KENRI-SURYO      PIC  S9(12)V9(06).
      *----------  跨ぎ取引
         05  WK-MATAGI-TRHK.
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
      *----------  原取引ID
           10  WK-TORI-ID          PIC  S9(10).
      *----------  計上基準日
           10  WK-KEIJOU-KIJUNBI   PIC  S9(08).
      *----------  増幅赤黒区分
           10  WK-ZOFKU-AKA-KBN    PIC  X(01).
      *----------  増幅区分
           10  WK-ZOFKU-KBN        PIC  X(01).
      *----------  増幅元異動計上基準日
           10  WK-ZOFKUMT-KJ-KIJUNBI
                                   PIC  S9(08).
      *----------  処理順決定日付
           10  WK-SRJUN-KT-DATE    PIC  S9(08).
      *----------  処理順同日優先度日付
           10  WK-SRJUN-DJ-DATE    PIC  S9(08).
      *----------  処理順決定摘要
           10  WK-SRJUN-KT-TEKIYO  PIC  S9(02).
      *----------  処理順決定増減
           10  WK-SRJUN-KT-ZOUGEN  PIC  S9(02).
      *----------  処理順決定評価
           10  WK-SRJUN-KT-HYOKA   PIC  S9(02).
      *----------  未収計算対象フラグ
           10  WK-MSKS-TARGET-FLG  PIC  X(01).
      *----------  未収計算種類
           10  WK-MSKS-SHRU        PIC  X(02).
      *----------  処理順
           10  WK-SRJUN            PIC  S9(08).
      *----------  約定日
           10  WK-YKJ-YMD          PIC  S9(08).
      *----------  受渡日
           10  WK-UKE-YMD          PIC  S9(08).
      *----------  権利数量
           10  WK-KENRI-SURYO      PIC  S9(12)V9(06).
      *----------  ダミー区分
           10  WK-DUMMY-KBN        PIC  X(01).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  適用グループ
         05  WK-TKYU-GROUP         OCCURS  19.
      *----------  適用処理
           10  WK-TKYU-SYORI       PIC  X(04).
      *----------  処理順ORDERBY
         05  WK-SYRI-JUN-ORDERBY   PIC  X(200).
      *----------  ワーク処理順
         05  WK-WK-SRJUN           PIC  9(08).
      *----------  仕訳基準パターンコード
         05  WK-SWK-KJN-PTN-CD-M
                                   PIC  X(08).
      *----------  保有目的
         05  WK-POSSESSION-OBJECT-M
                                   PIC  X(01).
      *----------  異動計算パターンコード
         05  WK-IDO-CALC-PATTERN-CD-M
                                   PIC  X(04).
      *----------  ワーク取引属性エリア
         05  WK-TORI-ZOK-AREA-H.
           10  WK-TORI-ZOK-AREA    OCCURS  401.
      *----------  取引事由コード
             15  WK-TRHK-JIYU-CD   PIC  X(04).
      *----------  数量異動区分
             15  WK-SURYO-IDO-KBN  PIC  X(01).
      *----------  簿価異動区分
             15  WK-BOKA-IDO-KBN   PIC  X(01).
      *----------  数量異動区分
         05  WK-WK-SURYO-IDO-KBN   PIC  X(01).
      *----------  簿価異動区分
         05  WK-WK-BOKA-IDO-KBN    PIC  X(01).
      *----------  ワーク増減区分
         05  WK-WK-ZG-KBN          PIC  X(01).
      *----------  ワーク取引属性エリアグループ循環
         05  WK-TORI-ZOK-COUNT     PIC  9(03).
      *----------  ワーク取引
         05  WK-TRHK-GROUP.
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  原取引ＩＤ
           10  WK-TORI-ID          PIC  S9(10).
      *----------  約定日
           10  WK-YKJ-YMD          PIC  S9(08).
      *----------  受渡日
           10  WK-UKE-YMD          PIC  S9(08).
      *----------  ダミー区分
           10  WK-DUMMY-KBN        PIC  X(01).
      *----------  銘柄コード
           10  WK-MEG-CD           PIC  X(15).
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *----------  取引連関ＩＤ
           10  WK-THRK-ID          PIC  S9(10).
      *----------  入力管理ＩＤ
           10  WK-NRKR-ID          PIC  X(30).
      *----------  削除区分
           10  WK-SAKUJO-KBN       PIC  X(01).
      *----------  赤黒区分
           10  WK-AKA-KBN          PIC  X(01).
      *----------  取引内容
           10  WK-TORI-NAIY        PIC  X(04).
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
      *----------  約定金額（市場通貨換算額）
           10  WK-S-KSG-G-YJKG     PIC  S9(15)V9(03).
      *----------  約定金額（運用通貨換算額）
           10  WK-U-KSG-G-YJKG     PIC  S9(15)V9(03).
      *----------  異動確定区分
           10  WK-IDO-KBN          PIC  X(01).
      *----------  為替レート（現地／運用）１
           10  WK-G-U-KWS1         PIC  S9(08)V9(10).
      *----------  為替レート（現地／運用）２
           10  WK-G-U-KWS2         PIC  S9(08)V9(10).
      *----------  経過利息為替レート
           10  WK-KKRS-KWS         PIC  S9(08)V9(10).
      *----------  権利数量
           10  WK-KENRI-SURYO      PIC  S9(12)V9(06).
      *----------  受渡ベースエンド日
           10  WK-UKE-END-YMD      PIC  S9(08).
      *----------  取引SELECT件数
         05  WK-TRHK-SELECT-KENSU  PIC  9(10).
      *----------  WK-ERR-POS
         05  WK-ERR-POS-1          PIC  X(04).
         05  WK-ERR-POS-2          PIC  X(04).
         05  WK-ERR-POS-3          PIC  X(04).
      *----------  ワーク取引属性逆転フラグ
         05  WK-TRHK-ZKSE-GT-FLG   PIC  X(01).
      *----------  20100223(GIPS2.0)  START
      *----------  INSERT 件数
         05  WK-COUNT-TMP          PIC  9(03).
      *----------  INSERT 件数+1
         05  WK-ERR-KENSU          PIC  9(03).
      *---------- ワーク区間件数
         05  WK-KUKAN-KENSUU       PIC  9(08).
      *---------- ワーク合計件数
         05  WK-GOUKEI-KENSUU      PIC  9(08).
      *----------  20100223(GIPS2.0)  END
      *---------- ワーク約定ベース受渡順差分フラグ
         05  WK-YKJ-UKE-JUN-FLG    PIC  9(01).
      ******************************************************************
      *    ＯＲＡＣＬＥホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION   END-EXEC.
       01  HST-AREA.
      *----------  取引
         05  H-TKMXTR00.
          07  H-TKMXTR00-TBL       OCCURS  100.                         @3212SEINO@@
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  約定日
           10  H-YKJ-YMD           PIC  S9(08).
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  取引事由
           10  H-TORI-JIYU         PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  取引連関ＩＤ
           10  H-THRK-ID           PIC  S9(10).
      *----------  入力管理ＩＤ
           10  H-NRKR-ID           PIC  X(30).
      *----------  ダミー区分
           10  H-DUMMY-KBN         PIC  X(01).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *----------  赤黒区分
           10  H-AKA-KBN           PIC  X(01).
      *----------  取引内容
           10  H-TORI-NAIY         PIC  X(04).
      *---------- 異動確定区分
           10  H-IDO-KBN           PIC  X(01).
      *----------  約定金額（市場通貨換算額）
           10  H-S-KSG-G-YJKG      PIC  S9(15)V9(03).
      *----------  約定金額（運用通貨換算額）
           10  H-U-KSG-G-YJKG      PIC  S9(15)V9(03).
      *----------  為替レート（現地／運用）１
           10  H-G-U-KWS1          PIC  S9(08)V9(10).
      *----------  為替レート（現地／運用）２
           10  H-G-U-KWS2          PIC  S9(08)V9(10).
      *----------  経過利息為替レート
           10  H-KKRS-KWS          PIC  S9(08)V9(10).
      *----------  権利数量
           10  H-KENRI-SURYO       PIC  S9(12)V9(06).
      *----------  受渡ベースエンド日
           10  H-UKE-END-YMD       PIC  S9(08).
         05  H-TKMXTR00-3.
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  約定日
           10  H-YKJ-YMD           PIC  S9(08).
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  ダミー区分
           10  H-DUMMY-KBN         PIC  X(01).
      *----------  取引事由
           10  H-TORI-JIYU         PIC  X(04).
      *----------  為替レート（現地／運用）１
           10  H-G-U-KWS1          PIC  S9(08)V9(10).
      *----------  為替レート（現地／運用）２
           10  H-G-U-KWS2          PIC  S9(08)V9(10).
      *----------  経過利息為替レート
           10  H-KKRS-KWS          PIC  S9(08)V9(10).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
         05  H-TKMXTR00-13.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  開始基準日翌日
           10  H-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  取引WHERE条件
         05  H-TKMXTR00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  証券種別フラグ
           10  H-SEC-SBT-FLG       PIC  S9(01).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD     PIC  S9(08).
      *----------  対象取引
         05  H-TKMZBW04.
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *----------  受渡日
           10  H-UKE-YMD           PIC  S9(08).
      *----------  約定日
           10  H-YKJ-YMD           PIC  S9(08).
      *----------  権利数量
           10  H-KENRI-SURYO       PIC  S9(12)V9(06).
      *----------  処理順決定摘要
           10  H-SRJUN-KT-TEKIYO   PIC  S9(02).
      *----------  処理順決定増減
           10  H-SRJUN-KT-ZOUGEN   PIC  S9(02).
      *----------  処理順決定評価
           10  H-SRJUN-KT-HYOKA    PIC  S9(02).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD     PIC  S9(08).
      *----------  計上基準日
           10  H-KEIJOU-KIJUNBI    PIC  S9(08).
      *----------  ダミー区分
           10  H-DUMMY-KBN         PIC  X(01).
      *----------  取引事由
           10  H-TORI-JIYU         PIC  X(04).
      *----------  増幅赤黒区分
           10  H-ZOFKU-AKA-KBN     PIC  X(01).
      *----------  増幅区分
           10  H-ZOFKU-KBN         PIC  X(01).
      *----------  増幅元異動計上基準日
           10  H-ZOFKUMT-KJ-KIJUNBI
                                   PIC  S9(08).
      *----------  処理順決定日付
           10  H-SRJUN-KT-DATE     PIC  S9(08).
      *----------  処理順同日優先度日付
           10  H-SRJUN-DJ-DATE     PIC  S9(08).
      *----------  処理順
           10  H-SRJUN             PIC  S9(08).
      *----------  未収計算対象フラグ
           10  H-MSKS-TARGET-FLG   PIC  X(01).
      *----------  未収計算種類
           10  H-MSKS-SHRU         PIC  X(02).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新プログラムＩＤ
           10  H-UPD-PGMID         PIC  X(16).
      *----------  処理資金取引
         05  H-TKMZBW18.
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  決済口座番号
           10  H-KS-KOZA-NO        PIC  X(15).
      *----------  資金種別
           10  H-SIKIN-SBT         PIC  X(01).
      *----------  異動日
           10  H-IDO-YMD           PIC  S9(08).
      *----------  増減区分
           10  H-ZG-KBN            PIC  X(01).
      *----------  決済口座通貨コード
           10  H-KOZA-TUKA-CD      PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  取引連関ＩＤ
           10  H-THRK-ID           PIC  S9(10).
      *----------  入力管理ＩＤ
           10  H-NRKR-ID           PIC  X(30).
      *----------  削除区分
           10  H-SAKUJO-KBN        PIC  X(01).
      *----------  赤黒区分
           10  H-AKA-KBN           PIC  X(01).
      *----------  取引内容
           10  H-TORI-NAIY         PIC  X(04).
      *----------  取引事由
           10  H-TORI-JIYU         PIC  X(04).
      *----------  決済通貨異動額
           10  H-KSTK-IDOG         PIC  S9(15)V9(03).
      *----------  運用通貨異動額
           10  H-UYTK-IDOG         PIC  S9(15)V9(03).
      *---------- 異動確定区分
           10  H-IDO-KBN           PIC  X(01).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新プログラムＩＤ
           10  H-UPD-PGMID         PIC  X(16).
      *----------  20100223(GIPS2.0)  START
      *----------  対象取引
         05  H-TKMZBW04-BULK.
           10  H-TKMZBW04-TBL      OCCURS  100.
      *----------  処理実行日
             20  H-SYORI-YMD       PIC  S9(08).
      *----------  起動ID
             20  H-KIDOU-ID        PIC  X(04).
      *----------  利用会社コード
             20  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             20  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             20  H-PTF-CD          PIC  X(04).
      *----------  開始基準日
             20  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  基準日
             20  H-KJN-YMD         PIC  S9(08).
      *----------  銘柄コード
             20  H-MEG-CD          PIC  X(15).
      *----------  証券種別コード
             20  H-SEC-SBT-CD      PIC  X(04).
      *----------  資産負債・買建売建フラグ
             20  H-TATE-FLG        PIC  X(01).
      *----------  玉ＩＤ
             20  H-GYOKU-ID        PIC  X(10).
      *----------  原取引ＩＤ
             20  H-TORI-ID         PIC  S9(10).
      *----------  計上基準日
             20  H-KEIJOU-KIJUNBI  PIC  S9(08).
      *----------  増幅赤黒区分
             20  H-ZOFKU-AKA-KBN   PIC  X(01).
      *----------  増幅区分
             20  H-ZOFKU-KBN       PIC  X(01).
      *----------  増幅元異動計上基準日
             20  H-ZOFKUMT-KJ-KIJUNBI
                                   PIC  S9(08).
      *----------  ダミー区分
             20  H-DUMMY-KBN       PIC  X(01).
      *----------  取引事由
             20  H-TORI-JIYU       PIC  X(04).
      *----------  処理順決定日付
             20  H-SRJUN-KT-DATE   PIC  S9(08).
      *----------  処理順同日優先度日付
             20  H-SRJUN-DJ-DATE   PIC  S9(08).
      *----------  処理順決定摘要
             20  H-SRJUN-KT-TEKIYO PIC  S9(02).
      *----------  処理順決定増減
             20  H-SRJUN-KT-ZOUGEN PIC  S9(02).
      *----------  処理順決定評価
             20  H-SRJUN-KT-HYOKA  PIC  S9(02).
      *----------  未収計算対象フラグ
             20  H-MSKS-TARGET-FLG PIC  X(01).
      *----------  未収計算種類
             20  H-MSKS-SHRU       PIC  X(02).
      *----------  約定日
             20  H-YKJ-YMD         PIC  S9(08).
      *----------  受渡日
             20  H-UKE-YMD         PIC  S9(08).
      *----------  権利数量
             20  H-KENRI-SURYO     PIC  S9(12)V9(06).
      *----------  更新ログインユーザ会社コード
             20  H-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  更新プログラムＩＤ
             20  H-UPD-PGMID       PIC  X(16).
      *----------  処理資金取引
         05  H-TKMZBW18-BULK.
           10  H-TKMZBW18-TBL      OCCURS  100.
      *----------  処理実行日
             20  H-SYORI-YMD       PIC  S9(08).
      *----------  起動ID
             20  H-KIDOU-ID        PIC  X(04).
      *----------  利用会社コード
             20  H-RIYO-CMP-CD     PIC  X(04).
      *----------  原取引ＩＤ
             20  H-TORI-ID         PIC  S9(10).
      *----------  決済口座番号
             20  H-KS-KOZA-NO      PIC  X(15).
      *----------  資金種別
             20  H-SIKIN-SBT       PIC  X(01).
      *----------  異動日
             20  H-IDO-YMD         PIC  S9(08).
      *----------  増減区分
             20  H-ZG-KBN          PIC  X(01).
      *----------  決済口座通貨コード
             20  H-KOZA-TUKA-CD    PIC  X(04).
      *----------  ファンドコード
             20  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             20  H-PTF-CD          PIC  X(04).
      *----------  証券種別コード
             20  H-SEC-SBT-CD      PIC  X(04).
      *----------  銘柄コード
             20  H-MEG-CD          PIC  X(15).
      *----------  市場通貨コード
             20  H-SIJO-TUKA-CD    PIC  X(04).
      *----------  取引連関ＩＤ
             20  H-THRK-ID         PIC  S9(10).
      *----------  入力管理ＩＤ
             20  H-NRKR-ID         PIC  X(30).
      *----------  削除区分
             20  H-SAKUJO-KBN      PIC  X(01).
      *----------  赤黒区分
             20  H-AKA-KBN         PIC  X(01).
      *----------  取引内容
             20  H-TORI-NAIY       PIC  X(04).
      *----------  取引事由
             20  H-TORI-JIYU       PIC  X(04).
      *----------  決済通貨異動額
             20  H-KSTK-IDOG       PIC  S9(15)V9(03).
      *----------  運用通貨異動額
             20  H-UYTK-IDOG       PIC  S9(15)V9(03).
      *----------  異動確定区分
             20  H-IDO-KBN         PIC  X(01).
      *----------  更新ログインユーザ会社コード
             20  H-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  更新プログラムＩＤ
             20  H-UPD-PGMID       PIC  X(16).
         05  H-TORI-FETCH.
           10  H-TORI-OCCURS       OCCURS  100.
      *----------  原取引ＩＤ
             20  H-TORI-ID         PIC  S9(10).
      *----------  増幅赤黒区分
             20  H-ZOFKU-AKA-KBN   PIC  X(01).
         05  H-SRJUN-FETCH.
           10  H-SRJUN-OCCURS      OCCURS  100.
      *----------  処理順
             20  H-SRJUN           PIC  S9(08).
         05  H-TAISYO-UPDATE.
           10  H-TAISYO-OCCURS     OCCURS  100.
      *----------  処理実行日
             20  H-SYORI-YMD       PIC  S9(08).
      *----------  起動ID
             20  H-KIDOU-ID        PIC  X(04).
      *----------  利用会社コード
             20  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             20  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             20  H-PTF-CD          PIC  X(04).
      *----------  基準日
             20  H-KJN-YMD         PIC  S9(08).
      *----------  銘柄コード
             20  H-MEG-CD          PIC  X(15).
      *----------  証券種別コード
             20  H-SEC-SBT-CD      PIC  X(04).
      *----------  資産負債・買建売建フラグ
             20  H-TATE-FLG        PIC  X(01).
      *----------  玉ＩＤ
             20  H-GYOKU-ID        PIC  X(10).
      *----------  原取引ＩＤ
             20  H-TORI-ID         PIC  S9(10).
      *----------  増幅赤黒区分
             20  H-ZOFKU-AKA-KBN   PIC  X(01).
      *----------  20100223(GIPS2.0)  END
      *----------  HST-基準日
         05  H-HST-KJN-YMD         PIC  S9(08).
      *----------  HST-開始基準日翌日
         05  H-HST-KJN-YMD-TOM     PIC  S9(08).
         05  H-TKMZZI00.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  原取引ＩＤ
           10  H-TORI-ID           PIC  S9(10).
      *----------  計上基準日
           10  H-KEIJOU-KIJUNBI    PIC  S9(08).
         05  H-TKMZZI00-S.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  MAX(受渡日)
         05  H-MAX-UKE-YMD         PIC  S9(08).
      *----------  20100223(GIPS2.0)  START
      *----------  カウント件数
         05  H-CNT1                PIC  S9(03)  COMP.
      *----------  カウント件数2
         05  H-CNT2                PIC  S9(03)  COMP.
      *----------  カウント件数2
         05  H-CNT3                PIC  S9(03)  COMP.
      *----------  カウント件数4                                        @3212SEINO@@
         05  H-CNT4                PIC  S9(03)  COMP.                   @3212SEINO@@
      *----------  20100223(GIPS2.0)  END
      *----------  約定ベース受渡順特殊フラグ
         05  H-YKJ-UKE-JUN-FLG     PIC  S9(01).
      *  05  SQLSTMT               PIC  X(6000).                        @3212SEINO@@
         05  SQLSTMT01             PIC  X(1000).                        @3212SEINO@@
         05  SQLSTMT02             PIC  X(800).                         @3212SEINO@@
         05  SQLSTMT03             PIC  X(1000).                        @3212SEINO@@
         05  SQLSTMT04             PIC  X(600).                         @3212SEINO@@
         05  SQLSTMT05             PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT06             PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT07             PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT08-1           PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT08-2           PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT08-3           PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT08-4           PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT09             PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT10             PIC  X(800).                         @3212SEINO@@
         05  SQLSTMT11             PIC  X(300).                         @3212SEINO@@
         05  SQLSTMT12             PIC  X(200).                         @3212SEINO@@
         05  SQLSTMT13             PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT14             PIC  X(1000).                        @3212SEINO@@
         05  SQLSTMT15             PIC  X(1000).                        @3212SEINO@@
         05  SQLSTMT16             PIC  X(1000).                        @3212SEINO@@
           EXEC  SQL  END      DECLARE  SECTION  END-EXEC.
      ******************************************************************
      *            SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  取引SQL文(別紙1-1)
         05  SQL-SELECT-1-1.
           10  S-SELECT-1-1.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(08)  VALUE "TORI_ID,".
      *----------  約定日
             15  FILLER            PIC  X(08)  VALUE "YKJ_YMD,".
      *----------  受渡日
             15  FILLER            PIC  X(08)  VALUE "UKE_YMD,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE "TORI_JIYU,".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE "RIYO_CMP_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE "MEG_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE "SEC_SBT_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE "PTF_CD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE "SIJO_TUKA_CD,".
      *----------  取引連関ＩＤ
             15  FILLER            PIC  X(08)  VALUE "THRK_ID,".
      *----------  入力管理ＩＤ
             15  FILLER            PIC  X(08)  VALUE "NRKR_ID,".
      *----------  ダミー区分
             15  FILLER            PIC  X(10)  VALUE "DUMMY_KBN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE "SAKUJO_KBN,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE "AKA_KBN,".
      *----------  取引内容
             15  FILLER            PIC  X(10)  VALUE "TORI_NAIY,".
      *----------  異動確定区分
             15  FILLER            PIC  X(08)  VALUE "IDO_KBN,".
      *----------  約定金額（市場通貨換算額）
             15  FILLER            PIC  X(13)  VALUE "S_KSG_G_YJKG,".
      *----------  約定金額（運用通貨換算額）
             15  FILLER            PIC  X(13)  VALUE "U_KSG_G_YJKG,".
      *----------  為替レート（現地／運用）１
             15  FILLER            PIC  X(09)  VALUE "G_U_KWS1,".
      *----------  為替レート（現地／運用）２
             15  FILLER            PIC  X(09)  VALUE "G_U_KWS2,".
      *----------  経過利息為替レート
             15  FILLER            PIC  X(09)  VALUE "KKRS_KWS,".
      *----------  権利数量
             15  FILLER            PIC  X(12)  VALUE "KENRI_SURYO,".
      *----------  受渡ベースエンド日
             15  FILLER            PIC  X(11)  VALUE "UKE_END_YMD".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-1      PIC  X(13).
           10  S-WHERE-1-1.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE " AND (".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
                "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(19)  VALUE
               " PTF_CD=:P_PTF_CD )".
             15  FILLER            PIC  X(04)  VALUE " OR ".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(16)  VALUE " PTF_CD='    ' )".
             15  FILLER            PIC  X(06)  VALUE ") AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(25)  VALUE
               " SEC_SBT_CD=:P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(17)  VALUE
               " MEG_CD=:P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(23)  VALUE
               " ((TATE_FLG=:P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(21)  VALUE
               " GYOKU_ID=:P_GYOKU_ID".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  証券種別コードフラグ
             15  FILLER            PIC  X(18)  VALUE
               " :P_SEC_SBT_FLG=1)".
             15  FILLER            PIC  X(04)  VALUE " OR ".
             15  FILLER            PIC  X(18)  VALUE
               " :P_SEC_SBT_FLG=0)".
             15  FILLER            PIC  X(06)  VALUE " AND (".
      *----------  約定日
             15  FILLER            PIC  X(49)  VALUE
               "(( YKJ_YMD BETWEEN :P_HST_KJN_YMD AND :P_KJN_YMD)".
             15  FILLER            PIC  X(05)  VALUE " AND ".
             15  FILLER            PIC  X(25)  VALUE
               " :P_YKJ_UKE_JUN_FLG <> 1)".
             15  FILLER            PIC  X(04)  VALUE " OR ".
             15  FILLER            PIC  X(50)  VALUE
               "((( YKJ_YMD BETWEEN :P_HST_KJN_YMD AND :P_KJN_YMD)".
             15  FILLER            PIC  X(04)  VALUE " OR ".
             15  FILLER            PIC  X(27)  VALUE
               " (YKJ_YMD >:P_KAISI_KJN_YMD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
             15  FILLER            PIC  X(24)  VALUE
               " YKJ_YMD <:P_HST_KJN_YMD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
             15  FILLER            PIC  X(27)  VALUE
               " UKE_YMD >=:P_HST_KJN_YMD))".
             15  FILLER            PIC  X(05)  VALUE " AND ".
             15  FILLER            PIC  X(24)  VALUE
               " :P_YKJ_UKE_JUN_FLG =1))".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE " ORDER BY ".
      *----------  約定日
             15  FILLER            PIC  X(08)  VALUE " YKJ_YMD".
      *----------  取引SQL文(別紙1-2)
         05  SQL-SELECT-1-2.
           10  S-SELECT-1-2.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(08)  VALUE "TORI_ID,".
      *----------  約定日
             15  FILLER            PIC  X(08)  VALUE "YKJ_YMD,".
      *----------  受渡日
             15  FILLER            PIC  X(08)  VALUE "UKE_YMD,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE "TORI_JIYU,".
      *----------  利用会社コード
             15  FILLER            PIC  X(12)  VALUE "RIYO_CMP_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(07)  VALUE "MEG_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(11)  VALUE "SEC_SBT_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(08)  VALUE "FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(07)  VALUE "PTF_CD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(13)  VALUE "SIJO_TUKA_CD,".
      *----------  取引連関ＩＤ
             15  FILLER            PIC  X(08)  VALUE "THRK_ID,".
      *----------  入力管理ＩＤ
             15  FILLER            PIC  X(08)  VALUE "NRKR_ID,".
      *----------  ダミー区分
             15  FILLER            PIC  X(10)  VALUE "DUMMY_KBN,".
      *----------  削除区分
             15  FILLER            PIC  X(11)  VALUE "SAKUJO_KBN,".
      *----------  赤黒区分
             15  FILLER            PIC  X(08)  VALUE "AKA_KBN,".
      *----------  取引内容
             15  FILLER            PIC  X(10)  VALUE "TORI_NAIY,".
      *----------  異動確定区分
             15  FILLER            PIC  X(08)  VALUE "IDO_KBN,".
      *----------  約定金額（市場通貨換算額）
             15  FILLER            PIC  X(13)  VALUE "S_KSG_G_YJKG,".
      *----------  約定金額（運用通貨換算額）
             15  FILLER            PIC  X(13)  VALUE "U_KSG_G_YJKG,".
      *----------  為替レート（現地／運用）１
             15  FILLER            PIC  X(09)  VALUE "G_U_KWS1,".
      *----------  為替レート（現地／運用）２
             15  FILLER            PIC  X(09)  VALUE "G_U_KWS2,".
      *----------  経過利息為替レート
             15  FILLER            PIC  X(09)  VALUE "KKRS_KWS,".
      *----------  権利数量
             15  FILLER            PIC  X(12)  VALUE "KENRI_SURYO,".
      *----------  受渡ベースエンド日
             15  FILLER            PIC  X(11)  VALUE "UKE_END_YMD".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-2      PIC  X(13).
           10  S-WHERE-1-2.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE " AND (".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(19)  VALUE
               " PTF_CD=:P_PTF_CD )".
             15  FILLER            PIC  X(04)  VALUE " OR ".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(16)  VALUE
               " PTF_CD='    ' )".
             15  FILLER            PIC  X(06)  VALUE ") AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(25)  VALUE
               " SEC_SBT_CD=:P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(17)  VALUE
               " MEG_CD=:P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(23)  VALUE
               " ((TATE_FLG=:P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(21)  VALUE
               " GYOKU_ID=:P_GYOKU_ID".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  証券種別コードフラグ
             15  FILLER            PIC  X(18)  VALUE
               " :P_SEC_SBT_FLG=1)".
             15  FILLER            PIC  X(04)  VALUE " OR ".
             15  FILLER            PIC  X(18)  VALUE
               " :P_SEC_SBT_FLG=0)".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  受渡日
             15  FILLER            PIC  X(46)  VALUE
               " UKE_YMD BETWEEN :P_HST_KJN_YMD AND :P_KJN_YMD".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE " ORDER BY ".
      *----------  受渡日
             15  FILLER            PIC  X(08)  VALUE " UKE_YMD".
      *----------  対象取引にデータinsert処理（「別紙1-3 SQL説明」を参照）
         05  SQL-INSERT-1-3.
           10  S-INSERT-1-3.
             15  FILLER            PIC  X(12)  VALUE "INSERT INTO ".
             15  SQL-TBL-ID-3      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE " (".
      *----------  処理実行日
             15  FILLER            PIC  X(11)  VALUE " SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(10)  VALUE " KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE " RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE " FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE " PTF_CD,".
      *----------  開始基準日
             15  FILLER            PIC  X(15)  VALUE " KAISI_KJN_YMD,".
      *----------  基準日
             15  FILLER            PIC  X(09)  VALUE " KJN_YMD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE " MEG_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE " SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(10)  VALUE " TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(10)  VALUE " GYOKU_ID,".
      *----------  原取引ID
             15  FILLER            PIC  X(09)  VALUE " TORI_ID,".
      *----------  計上基準日
             15  FILLER            PIC  X(16)  VALUE " KEIJOU_KIJUNBI,".
      *----------  増幅赤黒区分
             15  FILLER            PIC  X(15)  VALUE " ZOFKU_AKA_KBN,".
      *----------  増幅区分
             15  FILLER            PIC  X(11)  VALUE " ZOFKU_KBN,".
      *----------  増幅元異動計上基準日
             15  FILLER            PIC  X(20)  VALUE
                 " ZOFKUMT_KJ_KIJUNBI,".
      *----------  ダミー区分
             15  FILLER            PIC  X(10)  VALUE "DUMMY_KBN,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE "TORI_JIYU,".
      *----------  処理順決定日付
             15  FILLER            PIC  X(15)  VALUE " SRJUN_KT_DATE,".
      *----------  処理順同日優先度日付
             15  FILLER            PIC  X(15)  VALUE " SRJUN_DJ_DATE,".
      *----------  処理順決定摘要
             15  FILLER            PIC  X(17)  VALUE
                 " SRJUN_KT_TEKIYO,".
      *----------  処理順決定増減
             15  FILLER            PIC  X(17)  VALUE
                 " SRJUN_KT_ZOUGEN,".
      *----------  処理順決定評価
             15  FILLER            PIC  X(16)  VALUE
                 " SRJUN_KT_HYOKA,".
      *----------  処理順
             15  FILLER            PIC  X(07)  VALUE " SRJUN,".
      *----------  未収計算対象フラグ
             15  FILLER            PIC  X(17)  VALUE
                 " MSKS_TARGET_FLG,".
      *----------  未収計算種類
             15  FILLER            PIC  X(11)  VALUE " MSKS_SHRU,".
      *----------  約定日
             15  FILLER            PIC  X(09)  VALUE " YKJ_YMD,".
      *----------  受渡日
             15  FILLER            PIC  X(09)  VALUE " UKE_YMD,".
      *----------  権利数量
             15  FILLER            PIC  X(13)  VALUE " KENRI_SURYO,".
      *----------  １口注文ＩＤ
             15  FILLER            PIC  X(11)  VALUE "ORDR_1K_ID,".
      *----------  市場通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE "SJTK_H_BOKA,".
      *----------  運用通貨払出簿価
             15  FILLER            PIC  X(12)  VALUE "UYTK_H_BOKA,".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(11)  VALUE "SJTK_H_TNK,".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(11)  VALUE "UYTK_H_TNK,".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE  " UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)  VALUE
                 " UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE " UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE " UPD_PGMID )".
           10  S-VALUES-1-3.
             15  FILLER            PIC  X(07)  VALUE " VALUES".
             15  FILLER            PIC  X(03)  VALUE " ( ".
      *----------  処理実行日
             15  FILLER            PIC  X(13)  VALUE ":P_SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(12)  VALUE ":P_KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE ":P_RIYO_CMP_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE ":P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE ":P_PTF_CD,".
      *----------  開始基準日
             15  FILLER            PIC  X(17)  VALUE
                 ":P_KAISI_KJN_YMD,".
      *----------  基準日
             15  FILLER            PIC  X(11)  VALUE ":P_KJN_YMD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(10)  VALUE ":P_MEG_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(14)  VALUE ":P_SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(12)  VALUE ":P_TATE_FLG,".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(12)  VALUE ":P_GYOKU_ID,".
      *----------  原取引ID
             15  FILLER            PIC  X(11)  VALUE ":P_TORI_ID,".
      *----------  計上基準日
             15  FILLER            PIC  X(18)  VALUE
                 ":P_KEIJOU_KIJUNBI,".
      *----------  増幅赤黒区分
             15  FILLER            PIC  X(17)  VALUE
                 ":P_ZOFKU_AKA_KBN,".
      *----------  増幅区分
             15  FILLER            PIC  X(13)  VALUE ":P_ZOFKU_KBN,".
      *----------  増幅元異動計上基準日
             15  FILLER            PIC  X(22)  VALUE
                 ":ZOFKUMT_KJ_KIJUNBI,".
      *----------  ダミー区分
             15  FILLER            PIC  X(11)  VALUE ":DUMMY_KBN,".
      *----------  取引事由
             15  FILLER            PIC  X(11)  VALUE ":TORI_JIYU,".
      *----------  処理順決定日付
             15  FILLER            PIC  X(17)  VALUE
                 ":P_SRJUN_KT_DATE,".
      *----------  処理順同日優先度日付
             15  FILLER            PIC  X(17)  VALUE
                 ":P_SRJUN_DJ_DATE,".
      *----------  処理順決定摘要
             15  FILLER            PIC  X(19)  VALUE
                 ":P_SRJUN_KT_TEKIYO,".
      *----------  処理順決定増減
             15  FILLER            PIC  X(19)  VALUE
                 ":P_SRJUN_KT_ZOUGEN,".
      *----------  処理順決定評価
             15  FILLER            PIC  X(18)  VALUE
                 ":P_SRJUN_KT_HYOKA,".
      *----------  処理順
             15  FILLER            PIC  X(02)  VALUE "0,".
      *----------  未収計算対象フラグ
             15  FILLER            PIC  X(19)  VALUE
                 ":P_MSKS_TARGET_FLG,".
      *----------  未収計算種類
             15  FILLER            PIC  X(13)  VALUE
                 ":P_MSKS_SHRU,".
      *----------  約定日
             15  FILLER            PIC  X(11)  VALUE ":P_YKJ_YMD,".
      *----------  受渡日
             15  FILLER            PIC  X(11)  VALUE ":P_UKE_YMD,".
      *----------  権利数量
             15  FILLER            PIC  X(15)  VALUE ":P_KENRI_SURYO,".
      *----------  １口注文ＩＤ
             15  FILLER            PIC  X(02)  VALUE "0,".
      *----------  市場通貨払出簿価
             15  FILLER            PIC  X(02)  VALUE "0,".
      *----------  運用通貨払出簿価
             15  FILLER            PIC  X(02)  VALUE "0,".
      *----------  市場通貨払出単価
             15  FILLER            PIC  X(02)  VALUE "0,".
      *----------  運用通貨払出単価
             15  FILLER            PIC  X(02)  VALUE "0,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE  "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
                 ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(04)  VALUE "' ',".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(14)  VALUE ":P_UPD_PGMID )".
      *----------  取引SQL文(別紙1-4)
         05  SQL-SELECT-1-4.
           10  S-SELECT-1-4.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(08)  VALUE "TORI_ID,".
      *----------  約定日
             15  FILLER            PIC  X(08)  VALUE "YKJ_YMD,".
      *----------  受渡日
             15  FILLER            PIC  X(08)  VALUE "UKE_YMD,".
      *----------  ダミー区分
             15  FILLER            PIC  X(10)  VALUE "DUMMY_KBN,".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE "TORI_JIYU,".
      *----------  為替レート（現地／運用）１
             15  FILLER            PIC  X(09)  VALUE "G_U_KWS1,".
      *----------  為替レート（現地／運用）２
             15  FILLER            PIC  X(09)  VALUE "G_U_KWS2,".
      *----------  経過利息為替レート
             15  FILLER            PIC  X(09)  VALUE "KKRS_KWS,".
      *----------  証券種別コード
             15  FILLER            PIC  X(10)  VALUE "SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-4      PIC  X(13).
           10  S-WHERE-1-4.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE " AND (".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(19)  VALUE
               " PTF_CD=:P_PTF_CD )".
             15  FILLER            PIC  X(04)  VALUE " OR ".
      *----------  ファンドコード
             15  FILLER            PIC  X(20)  VALUE
               "( FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(16)  VALUE " PTF_CD='    ' )".
             15  FILLER            PIC  X(06)  VALUE ") AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(25)  VALUE
               " SEC_SBT_CD=:P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(17)  VALUE
               " MEG_CD=:P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(23)  VALUE
               " ((TATE_FLG=:P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(21)  VALUE
               " GYOKU_ID=:P_GYOKU_ID".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  証券種別コードフラグ
             15  FILLER            PIC  X(18)  VALUE
               " :P_SEC_SBT_FLG=1)".
             15  FILLER            PIC  X(04)  VALUE " OR ".
             15  FILLER            PIC  X(18)  VALUE
               " :P_SEC_SBT_FLG=0)".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  約定日
             15  FILLER            PIC  X(25)  VALUE
               " YKJ_YMD < :P_KJN_YMD_TOM".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  受渡日
             15  FILLER            PIC  X(46)  VALUE
               " UKE_YMD >= :P_KJN_YMD_TOM".
      *----------  対象取引TBLSQL文「別紙1-5 SQL説明」を参照
         05  SQL-SELECT-1-5.
           10  S-SELECT-1-5.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  計上基準日
             15  FILLER            PIC  X(14)  VALUE "KEIJOU_KIJUNBI".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-5      PIC  X(13).
           10  S-WHERE-1-5.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(12)  VALUE "SYORI_YMD = ".
             15  FILLER            PIC  X(12)  VALUE ":P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(11)  VALUE "KIDOU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
               " PTF_CD=:P_PTF_CD ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  基準日
             15  FILLER            PIC  X(10)  VALUE "KJN_YMD = ".
             15  FILLER            PIC  X(10)  VALUE ":P_KJN_YMD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(09)  VALUE "MEG_CD = ".
             15  FILLER            PIC  X(09)  VALUE ":P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(13)  VALUE "SEC_SBT_CD = ".
             15  FILLER            PIC  X(13)  VALUE ":P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(11)  VALUE "TATE_FLG = ".
             15  FILLER            PIC  X(11)  VALUE ":P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(11)  VALUE "GYOKU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_GYOKU_ID".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  受渡日
             15  FILLER            PIC  X(21)  VALUE
               " UKE_YMD < :P_UKE_YMD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  ダミー区分
             15  FILLER            PIC  X(16)  VALUE
               " DUMMY_KBN = ' '".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
               " ORDER BY ".
      *----------  計上基準日
             15  FILLER            PIC  X(19)
                                   VALUE "KEIJOU_KIJUNBI DESC".
      *----------  対象取引TBLSQL文「別紙1-6 SQL説明」を参照
         05  SQL-SELECT-1-6.
           10  S-SELECT-1-6.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(09)  VALUE "TORI_ID ,".
      *----------  約定日
             15  FILLER            PIC  X(09)  VALUE "YKJ_YMD ,".
      *----------  処理順決定摘要
             15  FILLER            PIC  X(16)  VALUE "SRJUN_KT_TEKIYO ".
      *----------  処理順決定増減
             15  FILLER            PIC  X(16)  VALUE ",SRJUN_KT_ZOUGEN".
      *----------  処理順決定評価
             15  FILLER            PIC  X(15)  VALUE ",SRJUN_KT_HYOKA".
      *----------  計上基準日
             15  FILLER            PIC  X(15)  VALUE ",KEIJOU_KIJUNBI".
      *----------  ダミー区分
             15  FILLER            PIC  X(10)  VALUE ",DUMMY_KBN".
      *----------  取引事由
             15  FILLER            PIC  X(10)  VALUE ",TORI_JIYU".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-6      PIC  X(13).
           10  S-WHERE-1-6.
             15  FILLER            PIC  X(07)  VALUE
               " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(12)  VALUE "SYORI_YMD = ".
             15  FILLER            PIC  X(12)  VALUE ":P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(11)  VALUE "KIDOU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
               " PTF_CD=:P_PTF_CD ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  基準日
             15  FILLER            PIC  X(10)  VALUE "KJN_YMD = ".
             15  FILLER            PIC  X(10)  VALUE ":P_KJN_YMD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(09)  VALUE "MEG_CD = ".
             15  FILLER            PIC  X(09)  VALUE ":P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(13)  VALUE "SEC_SBT_CD = ".
             15  FILLER            PIC  X(13)  VALUE ":P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(11)  VALUE "TATE_FLG = ".
             15  FILLER            PIC  X(11)  VALUE ":P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(11)  VALUE "GYOKU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_GYOKU_ID".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  受渡日
             15  FILLER            PIC  X(21)  VALUE
               " UKE_YMD = :P_UKE_YMD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  ダミー区分
             15  FILLER            PIC  X(16)  VALUE
               " DUMMY_KBN = ' '".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE
               " ORDER BY ".
      *----------  計上基準日
             15  FILLER            PIC  X(14)  VALUE "KEIJOU_KIJUNBI".
      *---------- 対象取引TBLから該当レコードを物理削除（「別紙1-7 SQL説明」を参照）
         05  SQL-DELETE-1-7.
           10  S-DELETE-1-7.
             15  FILLER            PIC  X(07)  VALUE "DELETE ".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-7      PIC  X(13).
           10  S-WHERE-1-7.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
               " PTF_CD=:P_PTF_CD ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(13)  VALUE "SEC_SBT_CD = ".
             15  FILLER            PIC  X(13)  VALUE ":P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(09)  VALUE "MEG_CD = ".
             15  FILLER            PIC  X(09)  VALUE ":P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(11)  VALUE "TATE_FLG = ".
             15  FILLER            PIC  X(11)  VALUE ":P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(11)  VALUE "GYOKU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_GYOKU_ID".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  処理実行日
             15  FILLER            PIC  X(12)  VALUE "SYORI_YMD = ".
             15  FILLER            PIC  X(12)  VALUE ":P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(11)  VALUE "KIDOU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  基準日
             15  FILLER            PIC  X(10)  VALUE "KJN_YMD = ".
             15  FILLER            PIC  X(10)  VALUE ":P_KJN_YMD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  原取引ID
             15  FILLER            PIC  X(10)  VALUE "TORI_ID = ".
             15  FILLER            PIC  X(10)  VALUE ":P_TORI_ID".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  増幅赤黒区分
             15  FILLER            PIC  X(16)  VALUE "ZOFKU_AKA_KBN = ".
             15  FILLER            PIC  X(03)  VALUE "' '".
      *----------  対象取引情報テーブルから処理対象のレコードを取得する（「別紙1-8 SQL説明」を参照）
         05  SQL-SELECT-1-8.
           10  S-SELECT-1-8.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(09)  VALUE "TORI_ID ,".
      *----------  増幅赤黒区分
             15  FILLER            PIC  X(13)  VALUE "ZOFKU_AKA_KBN".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-8      PIC  X(13).
           10  S-WHERE-1-8.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(12)  VALUE "SYORI_YMD = ".
             15  FILLER            PIC  X(12)  VALUE ":P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(11)  VALUE "KIDOU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
               " PTF_CD=:P_PTF_CD ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  基準日
             15  FILLER            PIC  X(10)  VALUE "KJN_YMD = ".
             15  FILLER            PIC  X(10)  VALUE ":P_KJN_YMD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(09)  VALUE "MEG_CD = ".
             15  FILLER            PIC  X(09)  VALUE ":P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(13)  VALUE "SEC_SBT_CD = ".
             15  FILLER            PIC  X(13)  VALUE ":P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(11)  VALUE "TATE_FLG = ".
             15  FILLER            PIC  X(11)  VALUE ":P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(11)  VALUE "GYOKU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_GYOKU_ID".
      *----------  ORDER BY
             15  FILLER            PIC  X(10)  VALUE " ORDER BY ".
      *----------  対象取引テーブルにupdate処理（「別紙1-9 SQL説明」を参照）
         05  SQL-UPDATE-1-9.
           10  S-UPDATE-1-9.
             15  FILLER            PIC  X(07)  VALUE "UPDATE ".
             15  SQL-TBL-ID-9      PIC  X(13).
           10  WK-SQL-SET.
             15  FILLER            PIC  X(04)  VALUE " SET".
      *----------  処理順
             15  FILLER            PIC  X(08)  VALUE " SRJUN =".
             15  FILLER            PIC  X(09)  VALUE " :P_SRJUN".
           10  S-WHERE-1-9.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  処理実行日
             15  FILLER            PIC  X(12)  VALUE "SYORI_YMD = ".
             15  FILLER            PIC  X(12)  VALUE ":P_SYORI_YMD".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  起動ID
             15  FILLER            PIC  X(11)  VALUE "KIDOU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_KIDOU_ID".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
               " PTF_CD=:P_PTF_CD ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  基準日
             15  FILLER            PIC  X(10)  VALUE "KJN_YMD = ".
             15  FILLER            PIC  X(10)  VALUE ":P_KJN_YMD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(09)  VALUE "MEG_CD = ".
             15  FILLER            PIC  X(09)  VALUE ":P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(13)  VALUE "SEC_SBT_CD = ".
             15  FILLER            PIC  X(13)  VALUE ":P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  資産/負債・買建/売建フラグ
             15  FILLER            PIC  X(11)  VALUE "TATE_FLG = ".
             15  FILLER            PIC  X(11)  VALUE ":P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(11)  VALUE "GYOKU_ID = ".
             15  FILLER            PIC  X(11)  VALUE ":P_GYOKU_ID".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  原取引ID
             15  FILLER            PIC  X(10)  VALUE "TORI_ID = ".
             15  FILLER            PIC  X(10)  VALUE ":P_TORI_ID".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  増幅赤黒区分
             15  FILLER            PIC  X(16)  VALUE "ZOFKU_AKA_KBN = ".
             15  FILLER            PIC  X(16)  VALUE ":P_ZOFKU_AKA_KBN".
      *----------  処理資金取引（TKMZBW18）
         05  SQL-INSERT-1-10.
           10  S-INSERT-1-10.
             15  FILLER            PIC  X(12)  VALUE "INSERT INTO ".
             15  SQL-TBL-ID-10     PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE " (".
      *----------  処理実行日
             15  FILLER            PIC  X(11)  VALUE " SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(10)  VALUE " KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(13)  VALUE " RIYO_CMP_CD,".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(09)  VALUE " TORI_ID,".
      *----------  決済口座番号
             15  FILLER            PIC  X(12)  VALUE " KS_KOZA_NO,".
      *----------  資金種別
             15  FILLER            PIC  X(11)  VALUE " SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(09)  VALUE " IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(08)  VALUE " ZG_KBN,".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(14)  VALUE " KOZA_TUKA_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(09)  VALUE " FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(08)  VALUE " PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(12)  VALUE " SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(08)  VALUE " MEG_CD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(14)  VALUE " SIJO_TUKA_CD,".
      *----------  取引連関ＩＤ
             15  FILLER            PIC  X(09)  VALUE " THRK_ID,".
      *----------  入力管理ＩＤ
             15  FILLER            PIC  X(09)  VALUE " NRKR_ID,".
      *----------  削除区分
             15  FILLER            PIC  X(12)  VALUE " SAKUJO_KBN,".
      *----------  赤黒区分
             15  FILLER            PIC  X(09)  VALUE " AKA_KBN,".
      *----------  取引内容
             15  FILLER            PIC  X(11)  VALUE " TORI_NAIY,".
      *----------  取引事由
             15  FILLER            PIC  X(11)  VALUE " TORI_JIYU,".
      *----------  決済通貨異動額
             15  FILLER            PIC  X(11)  VALUE " KSTK_IDOG,".
      *----------  運用通貨異動額
             15  FILLER            PIC  X(11)  VALUE " UYTK_IDOG,".
      *----------  異動確定区分
             15  FILLER            PIC  X(09)  VALUE " IDO_KBN,".
      *----------  更新日時
             15  FILLER            PIC  X(10)  VALUE " UPD_DATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(18)  VALUE
                 " UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(09)  VALUE " UPD_SID,".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(12)  VALUE " UPD_PGMID )".
           10  S-VALUES-1-10.
             15  FILLER            PIC  X(07)  VALUE " VALUES".
             15  FILLER            PIC  X(03)  VALUE " ( ".
      *----------  処理実行日
             15  FILLER            PIC  X(13)  VALUE ":P_SYORI_YMD,".
      *----------  起動ID
             15  FILLER            PIC  X(12)  VALUE ":P_KIDOU_ID,".
      *----------  利用会社コード
             15  FILLER            PIC  X(15)  VALUE ":P_RIYO_CMP_CD,".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(11)  VALUE ":P_TORI_ID,".
      *----------  決済口座番号
             15  FILLER            PIC  X(14)  VALUE ":P_KS_KOZA_NO,".
      *----------  資金種別
             15  FILLER            PIC  X(13)  VALUE ":P_SIKIN_SBT,".
      *----------  異動日
             15  FILLER            PIC  X(11)  VALUE ":P_IDO_YMD,".
      *----------  増減区分
             15  FILLER            PIC  X(10)  VALUE ":P_ZG_KBN,".
      *----------  決済口座通貨コード
             15  FILLER            PIC  X(16)  VALUE ":P_KOZA_TUKA_CD,".
      *----------  ファンドコード
             15  FILLER            PIC  X(11)  VALUE ":P_FUND_CD,".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(10)  VALUE ":P_PTF_CD,".
      *----------  証券種別コード
             15  FILLER            PIC  X(14)  VALUE ":P_SEC_SBT_CD,".
      *----------  銘柄コード
             15  FILLER            PIC  X(10)  VALUE ":P_MEG_CD,".
      *----------  市場通貨コード
             15  FILLER            PIC  X(16)  VALUE ":P_SIJO_TUKA_CD,".
      *----------  取引連関ＩＤ
             15  FILLER            PIC  X(11)  VALUE ":P_THRK_ID,".
      *----------  入力管理ＩＤ
             15  FILLER            PIC  X(11)  VALUE ":P_NRKR_ID,".
      *----------  削除区分
             15  FILLER            PIC  X(14)  VALUE ":P_SAKUJO_KBN,".
      *----------  赤黒区分
             15  FILLER            PIC  X(11)  VALUE ":P_AKA_KBN,".
      *----------  取引内容
             15  FILLER            PIC  X(13)  VALUE ":P_TORI_NAIY,".
      *----------  取引事由
             15  FILLER            PIC  X(13)  VALUE ":P_TORI_JIYU,".
      *----------  決済通貨異動額
             15  FILLER            PIC  X(13)  VALUE ":P_KSTK_IDOG,".
      *----------  運用通貨異動額
             15  FILLER            PIC  X(13)  VALUE ":P_UYTK_IDOG,".
      *----------  異動確定区分
             15  FILLER            PIC  X(11)  VALUE ":P_IDO_KBN,".
      *----------  更新日時
             15  FILLER            PIC  X(08)  VALUE  "SYSDATE,".
      *----------  更新ログインユーザ会社コード
             15  FILLER            PIC  X(20)  VALUE
                 ":P_UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
             15  FILLER            PIC  X(04)  VALUE "' ',".
      *----------  更新プログラムＩＤ
             15  FILLER            PIC  X(14)  VALUE ":P_UPD_PGMID )".
      *----------  残高異動TBLSQL文「別紙1-11 SQL説明」を参照
         05  SQL-SELECT-1-11.
           10  S-SELECT-1-11.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  計上基準日
             15  FILLER            PIC  X(11)  VALUE "RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-11     PIC  X(13).
           10  S-WHERE-1-11.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
               " PTF_CD=:P_PTF_CD ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(19)  VALUE
               "TORI_ID=:P_TORI_ID ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  計上基準日
             15  FILLER            PIC  X(32)  VALUE
               "KEIJOU_KIJUNBI=:P_KEIJOU_KIJUNBI".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  赤黒区分
             15  FILLER            PIC  X(11)  VALUE
               "AKA_KBN=' '".
      *----------  残高異動TBLSQL文「別紙1-12 SQL説明」を参照
         05  SQL-SELECT-1-12.
           10  S-SELECT-1-12.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  利用会社コード
             15  FILLER            PIC  X(11)  VALUE "RIYO_CMP_CD".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-12     PIC  X(13).
           10  S-WHERE-1-12.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(26)  VALUE
               "RIYO_CMP_CD=:P_RIYO_CMP_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(18)  VALUE
               "FUND_CD=:P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
               " PTF_CD=:P_PTF_CD ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  原取引ＩＤ
             15  FILLER            PIC  X(19)  VALUE
               "TORI_ID=:P_TORI_ID ".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  赤黒区分
             15  FILLER            PIC  X(11)  VALUE
               "AKA_KBN=' '".
      *----------  別紙1-13 SQL
         05  SQL-SELECT-1-13.
           10  S-SELECT-1-13.
             15  FILLER            PIC  X(07)  VALUE "SELECT ".
      *----------  MAX(受渡日)
             15  FILLER            PIC  X(12)  VALUE "MAX(UKE_YMD)".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-ID-13     PIC  X(13).
           10  S-WHERE-1-13.
             15  FILLER            PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
             15  FILLER            PIC  X(28)  VALUE
                 "RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ファンドコード
             15  FILLER            PIC  X(22)  VALUE
                 "((FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(19)  VALUE
                 "PTF_CD = :P_PTF_CD)".
             15  FILLER            PIC  X(04)  VALUE " OR ".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
                 "(FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(17)  VALUE
                 "PTF_CD = '    '))".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
             15  FILLER            PIC  X(26)  VALUE
                 "SEC_SBT_CD = :P_SEC_SBT_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  銘柄コード
             15  FILLER            PIC  X(18)  VALUE
                 "MEG_CD = :P_MEG_CD".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(24)  VALUE
                 "((TATE_FLG = :P_TATE_FLG".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(23)  VALUE
                 "GYOKU_ID = :P_GYOKU_ID)".
             15  FILLER            PIC  X(04)  VALUE " OR ".
      *----------  証券種別コード
             15  FILLER            PIC  X(51)  VALUE
                 ":P_SEC_SBT_CD IN ('CASH','MAR','MABF','MABO','MAB',".
             15  FILLER            PIC  X(35)  VALUE
                 "'MAFB','MASF','MASO','MAS','MAFS'))".
             15  FILLER            PIC  X(05)  VALUE " AND ".
      *----------  約定日
             15  FILLER            PIC  X(17)  VALUE
                 "(YKJ_YMD BETWEEN ".
             15  FILLER            PIC  X(21)  VALUE
                 ":P_KAISI_KJN_YMD_NEXT".
             15  FILLER            PIC  X(05)  VALUE  " AND ".
             15  FILLER            PIC  X(11)  VALUE
                 ":P_KJN_YMD)".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *----------  別紙1-1
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE "' AND (".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE "( FUND_CD='".
           10  WK-FUND-CD-1        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE "' ) OR ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE "( FUND_CD='".
           10  WK-FUND-CD-2        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(16)  VALUE " PTF_CD='    ' )".
           10  FILLER              PIC  X(06)  VALUE ") AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE " SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE " MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(13)  VALUE " ((TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE " GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  証券種別コードフラグ
           10  WK-SEC-SBT-FLG-1    PIC  9(01).
           10  FILLER              PIC  X(04)  VALUE " = 1".
           10  FILLER              PIC  X(06)  VALUE " ) OR ".
           10  WK-SEC-SBT-FLG-0    PIC  9(01).
           10  FILLER              PIC  X(04)  VALUE " = 0".
           10  FILLER              PIC  X(08)  VALUE " ) AND (".
      *----------  約定日
           10  FILLER              PIC  X(19)  VALUE
               "((YKJ_YMD BETWEEN  ".
           10  H-KJN-YMD-1         PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE ") AND ".
           10  WK-YKJ-UKE-JUN-FLG-0
                                   PIC  9(01).
           10  FILLER              PIC  X(05)  VALUE " <> 1".
           10  FILLER              PIC  X(06)  VALUE " ) OR ".
           10  FILLER              PIC  X(20)  VALUE
               "(((YKJ_YMD BETWEEN  ".
           10  H-KJN-YMD-3         PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
           10  WK-KJN-YMD-2        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE " ) OR ".
           10  FILLER              PIC  X(11)  VALUE "(YKJ_YMD > ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
           10  FILLER              PIC  X(10)  VALUE  "YKJ_YMD < ".
           10  H-KJN-YMD-4         PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
           10  FILLER              PIC  X(11)  VALUE "UKE_YMD >= ".
           10  H-KJN-YMD-5         PIC  S9(08).
           10  FILLER              PIC  X(07)  VALUE ")) AND ".
           10  WK-YKJ-UKE-JUN-FLG-1
                                   PIC  9(01).
           10  FILLER              PIC  X(07)  VALUE " = 1 ))".
      *----------  ORDER BY
           10  FILLER              PIC  X(17)  VALUE
               " ORDER BY YKJ_YMD".
      *----------  別紙1-2
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE "' AND (".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE "( FUND_CD='".
           10  WK-FUND-CD-3        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE "' ) OR ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE "( FUND_CD='".
           10  WK-FUND-CD-4        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(16)  VALUE " PTF_CD='    ' )".
           10  FILLER              PIC  X(06)  VALUE ") AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE " SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE " MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(13)  VALUE " ((TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE " GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  証券種別コードフラグ
           10  WK-SEC-SBT-FLG-1    PIC  9(01).
           10  FILLER              PIC  X(04)  VALUE " = 1".
           10  FILLER              PIC  X(06)  VALUE " ) OR ".
           10  WK-SEC-SBT-FLG-0    PIC  9(01).
           10  FILLER              PIC  X(04)  VALUE " = 0".
           10  FILLER              PIC  X(07)  VALUE " ) AND ".
      *----------  受渡日
           10  FILLER              PIC  X(17)  VALUE
               "UKE_YMD BETWEEN  ".
           10  H-KJN-YMD-2         PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
           10  WK-KJN-YMD          PIC  S9(08).
      *----------  ORDER BY
           10  FILLER              PIC  X(17)  VALUE
               " ORDER BY UKE_YMD".
      *----------  別紙1-3
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(07)  VALUE " VALUES".
           10  FILLER              PIC  X(03)  VALUE " ( ".
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  開始基準日
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  基準日
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  銘柄コード
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  資産負債・買建売建フラグ
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  玉ＩＤ
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  原取引ID
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  計上基準日
           10  WK-KEIJOU-KIJUNBI   PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  増幅赤黒区分
           10  WK-ZOFKU-AKA-KBN    PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  増幅区分
           10  WK-ZOFKU-KBN        PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  増幅元異動計上基準日
           10  WK-ZOFKUMT-KJ-KIJUNBI
                                   PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  ダミー区分
           10  WK-DUMMY-KBN
                                   PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  取引事由
           10  WK-TORI-JIYU
                                   PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  処理順決定日付
           10  WK-SRJUN-KT-DATE    PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  処理順同日優先度日
           10  WK-SRJUN-DJ-DATE    PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  処理順決定摘要
           10  WK-SRJUN-KT-TEKIYO  PIC  S9(02).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  処理順決定増減
           10  WK-SRJUN-KT-ZOUGEN  PIC  S9(02).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  処理順決定評価
           10  WK-SRJUN-KT-HYOKA   PIC  S9(02).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  処理順
           10  FILLER              PIC  X(02)  VALUE "0,".
      *----------  未収計算対象フラグ
           10  WK-MSKS-TARGET-FLG  PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  未収計算種類
           10  WK-MSKS-SHRU        PIC  X(02).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  約定日
           10  WK-YKJ-YMD          PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  受渡日
           10  WK-UKE-YMD          PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  権利数量
           10  WK-KENRI-SURYO      PIC  S9(12)V9(06).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  １口注文ＩＤ
           10  FILLER              PIC  X(02)  VALUE "0,".
      *----------  市場通貨払出簿価
           10  FILLER              PIC  X(02)  VALUE "0,".
      *----------  運用通貨払出簿価
           10  FILLER              PIC  X(02)  VALUE "0,".
      *----------  市場通貨払出単価
           10  FILLER              PIC  X(02)  VALUE "0,".
      *----------  運用通貨払出単価
           10  FILLER              PIC  X(02)  VALUE "0,".
      *----------  更新日時
           10  FILLER              PIC  X(08)  VALUE  "SYSDATE,".
      *----------  更新ログインユーザ会社コード
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(04)  VALUE "' ',".
      *----------  更新プログラムＩＤ
           10  WK-UPD-PGMID        PIC  X(16).
           10  FILLER              PIC  X(02)  VALUE " )".
      *----------  別紙1-4
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE "' AND (".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE "( FUND_CD='".
           10  WK-FUND-CD-1        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(07)  VALUE "' ) OR ".
      *----------  ファンドコード
           10  FILLER              PIC  X(11)  VALUE "( FUND_CD='".
           10  WK-FUND-CD-2        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(16)  VALUE " PTF_CD='    ' )".
           10  FILLER              PIC  X(06)  VALUE ") AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE " SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE " MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(13)  VALUE " ((TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE " GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  証券種別コードフラグ
           10  WK-SEC-SBT-FLG-1    PIC  9(01).
           10  FILLER              PIC  X(04)  VALUE " = 1".
           10  FILLER              PIC  X(06)  VALUE " ) OR ".
           10  WK-SEC-SBT-FLG-0    PIC  9(01).
           10  FILLER              PIC  X(04)  VALUE " = 0".
           10  FILLER              PIC  X(07)  VALUE " ) AND ".
      *----------  約定日
           10  FILLER              PIC  X(10)  VALUE "YKJ_YMD < ".
           10  WK-TOM-1            PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  受渡日
           10  FILLER              PIC  X(11)  VALUE "UKE_YMD >= ".
           10  WK-TOM-2            PIC  S9(08).
      *----------  別紙1-5
         05  WK-MSG-1-5.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(11)  VALUE "SYORI_YMD='".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  基準日
           10  FILLER              PIC  X(09)  VALUE " KJN_YMD=".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE " SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE " MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(11)  VALUE " TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE " GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  受渡日
           10  FILLER              PIC  X(10)  VALUE "UKE_YMD < ".
           10  WK-UKE-YMD          PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE " AND ".
      *----------  ダミー区分
           10  FILLER              PIC  X(16)  VALUE "DUMMY_KBN = ' ' ".
      *----------  別紙1-6
         05  WK-MSG-1-6.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(11)  VALUE "SYORI_YMD='".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  基準日
           10  FILLER              PIC  X(09)  VALUE " KJN_YMD=".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE " SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE " MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(11)  VALUE " TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE " GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  受渡日
           10  FILLER              PIC  X(10)  VALUE "UKE_YMD = ".
           10  WK-UKE-YMD          PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE " AND ".
      *----------  ダミー区分
           10  FILLER              PIC  X(16)  VALUE "DUMMY_KBN = ' ' ".
      *----------  別紙1-7
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE " SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE " MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(11)  VALUE " TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE " GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  処理実行日
           10  FILLER              PIC  X(11)  VALUE "SYORI_YMD='".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  基準日
           10  FILLER              PIC  X(09)  VALUE " KJN_YMD=".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  原取引ID
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  増幅赤黒区分
           10  FILLER              PIC  X(16)  VALUE "ZOFKU_AKA_KBN = ".
           10  WK-ZOFKU-AKA-KBN    PIC  X(01).
      *----------  別紙1-8
         05  WK-MSG-1-8.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(11)  VALUE "SYORI_YMD='".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  基準日
           10  FILLER              PIC  X(09)  VALUE " KJN_YMD=".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE " SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE " MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(11)  VALUE " TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE " GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
      *----------  ORDER BY
           10  FILLER              PIC  X(11)  VALUE "' ORDER BY ".
      *----------  処理順ORDERBY
           10  WK-ORDERBY          PIC  X(200).
      *----------  別紙1-9
         05  WK-MSG-1-9.
           10  FILLER              PIC  X(04)  VALUE " SET".
      *----------  処理順
           10  FILLER              PIC  X(08)  VALUE " SRJUN =".
           10  WK-SRJUN            PIC  9(08).
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  処理実行日
           10  FILLER              PIC  X(11)  VALUE "SYORI_YMD='".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  起動ID
           10  FILLER              PIC  X(10)  VALUE "KIDOU_ID='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  基準日
           10  FILLER              PIC  X(09)  VALUE " KJN_YMD=".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(13)  VALUE " SEC_SBT_CD='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(09)  VALUE " MEG_CD='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(11)  VALUE " TATE_FLG='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(11)  VALUE " GYOKU_ID='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  原取引ID
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  増幅赤黒区分
           10  FILLER              PIC  X(16)  VALUE "ZOFKU_AKA_KBN = ".
           10  WK-ZOFKU-AKA-KBN    PIC  X(01).
      *----------  別紙1-10
         05  WK-MSG-1-10.
           10  FILLER              PIC  X(07)  VALUE " VALUES".
           10  FILLER              PIC  X(03)  VALUE " ( ".
      *----------  処理実行日
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  原取引ＩＤ
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  決済口座番号
           10  WK-KS-KOZA-NO       PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  資金種別
           10  WK-SIKIN-SBT        PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  異動日
           10  WK-IDO-YMD          PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  増減区分
           10  WK-ZG-KBN           PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  決済口座通貨コード
           10  WK-KOZA-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  ファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  ポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  銘柄コード
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  取引連関ＩＤ
           10  WK-THRK-ID          PIC  S9(10).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  入力管理ＩＤ
           10  WK-NRKR-ID          PIC  X(30).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  削除区分
           10  WK-SAKUJO-KBN       PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  赤黒区分
           10  WK-AKA-KBN          PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  取引内容
           10  WK-TORI-NAIY        PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  取引事由
           10  WK-TORI-JIYU        PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  決済通貨異動額
           10  WK-KSTK-IDOG        PIC  S9(18).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  運用通貨異動額
           10  WK-UYTK-IDOG        PIC  S9(18).
           10  FILLER              PIC  X(01)  VALUE ",".
      *---------- 異動確定区分
           10  WK-IDO-KBN          PIC  X(01).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  更新日時
           10  FILLER              PIC  X(08)  VALUE  "SYSDATE,".
      *----------  更新ログインユーザ会社コード
           10  WK-UPD-LOGIN-CMP-CD PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE ",".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(04)  VALUE "' ',".
      *----------  更新プログラムＩＤ
           10  WK-UPD-PGMID        PIC  X(16).
           10  FILLER              PIC  X(02)  VALUE " )".
      *----------  別紙1-11
         05  WK-MSG-1-11.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  原取引ID
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  計上基準日
           10  FILLER              PIC  X(17)
                                              VALUE "KEIJOU_KIJUNBI = ".
           10  WK-KEIJOU-KIJUNBI   PIC  S9(08).
      *----------  赤黒区分
           10  FILLER              PIC  X(16)  VALUE
               " AND AKA_KBN=' '".
      *----------  別紙1-12
         05  WK-MSG-1-12.
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)  VALUE "FUND_CD='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(09)  VALUE " PTF_CD='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  原取引ID
           10  FILLER              PIC  X(10)  VALUE "TORI_ID = ".
           10  WK-TORI-ID          PIC  S9(10).
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  赤黒区分
           10  FILLER              PIC  X(11)  VALUE
               "AKA_KBN=' '".
      *----------  別紙1-13
         05  WK-MSG-1-13.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMXTR00     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(07)  VALUE " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO_CMP_CD='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ファンドコード
           10  FILLER              PIC  X(13)  VALUE "((FUND_CD = '".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(10)  VALUE "PTF_CD = '".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE "')".
           10  FILLER              PIC  X(04)  VALUE " OR ".
      *----------  ファンドコード
           10  FILLER              PIC  X(12)  VALUE "(FUND_CD = '".
           10  WK-FUND-CD-1        PIC  X(12).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(17)  VALUE
               "PTF_CD = '    '))".
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  証券種別コード
           10  FILLER              PIC  X(14)  VALUE "SEC_SBT_CD = '".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  銘柄コード
           10  FILLER              PIC  X(10)  VALUE "MEG_CD = '".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(14)  VALUE "((TATE_FLG = '".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(06)  VALUE "' AND ".
      *----------  玉ＩＤ
           10  FILLER              PIC  X(12)  VALUE "GYOKU_ID = '".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(02)  VALUE "')".
           10  FILLER              PIC  X(05)  VALUE " OR '".
      *----------  証券種別コード
           10  WK-SEC-SBT-CD-1     PIC  X(04).
           10  FILLER              PIC  X(39)  VALUE
               "' IN ('CASH','MAR','MABF','MABO','MAB',".
           10  FILLER              PIC  X(35)  VALUE
               "'MAFB','MASF','MASO','MAS','MAFS'))".
           10  FILLER              PIC  X(05)  VALUE " AND ".
      *----------  約定日
           10  FILLER              PIC  X(17)
                                   VALUE "(YKJ_YMD BETWEEN ".
           10  WK-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE " AND ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE ")".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  取引事由判定ルーチン
       01  PARM-SMZJ4012-INOUT.
           COPY  "SMZJ4012.cpy".
      *----------  約定レート未入力判定ルーチン
       01  PARM-SMZJ4018-INOUT.
           COPY  "SMZJ4018.cpy".
      *----------  ポートフォリオ属性取得ルーチン
       01  PARM-SCZY4302-INOUT.
           COPY  "SCZY4302.cpy".
      *----------  異動計算パターン全項目取得ルーチン
       01  PARM-SCZY4304-INOUT.
           COPY  "SCZY4304.cpy".
      *---------- テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  ARG2リターンパッケージセットルーチン
       01  PARM-RTNPKG.
         05 PARM-RTNPKG-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ1810-INOUT.
           COPY  "SMZJ1810.cpy".
       01  PARM-SMZJ1810-RTNPKG.
         05  PARM-SMZJ1810-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ1810-INOUT
                  PARM-SMZJ1810-RTNPKG.
      ******************************************************************
      *                 対象取引決定と処理順決定(物)
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SMZJ1810処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SMZJ1810処理  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           EXIT.
      ******************************************************************
      *        3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 初期値処理
           PERFORM  INITIALIZE-VALUE-RTN
      *----------  3.1.3 テーブルID取得処理
           PERFORM  TBL-ID-INIT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     FLG-AREA                                      @3212SEINO@@
                          WORK-AREA
                          E-MSG-TBL
                          SQL-AREA
                          HST-AREA
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-SCZY4302-INOUT
                          PARM-SCZY4304-INOUT
                          PARM-SCZY1160-INOUT
                          PARM-RTNPKG
                          PARM-SMZJ1810-ARG2
                          PARM-SMZJ1810-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW = ["FIRST-SW"]"
      *-----------------------------------------------------------------
      *----初回コール時のみFLAG-AREAを初期化する                        @3212SEINO@@
           IF  FIRST-SW = 'YES'                                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
             INITIALIZE  FLG-AREA-CR                                    @3212SEINO@@
             MOVE  'NO '                TO  FIRST-SW                    @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW = ["FIRST-SW"]"
      D    DISPLAY  CNS-PGM-ID":FLG-AREA              = ["FLG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLG-AREA-CR          = ["FLG-AREA-CR"]"
      D    DISPLAY  CNS-PGM-ID":WORK-AREA             = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID": E-MSG-TBL            =["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID": SQL-AREA             =["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID": HST-AREA             =["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN      = ["
      D             PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG  = ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4302-INOUT   = ["
      D             PARM-SCZY4302-INOUT"]"
      *    DISPLAY  CNS-PGM-ID":PARM-SCZY4304-INOUT   = ["
      *             PARM-SCZY4304-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT   = ["
      D             PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG           = ["
      D             PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1810-ARG2    = ["
      D             PARM-SMZJ1810-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1810-ARG3    = ["
      D             PARM-SMZJ1810-ARG3"]"
      *-----------------------------------------------------------------
      *----------  警告フラグ(1)
           MOVE  CNS-WARN-FLG-0
             TO  WARN-FLG-1                  OF  PARM-SMZJ1810-ARG2
      *----------  警告フラグ(2)
           MOVE  CNS-WARN-FLG-0
             TO  WARN-FLG-2                  OF  PARM-SMZJ1810-ARG2
      *----------  警告フラグ(3)
           MOVE  CNS-WARN-FLG-0
             TO  WARN-FLG-3                  OF  PARM-SMZJ1810-ARG2
      *----------  警告フラグ(4)
           MOVE  CNS-WARN-FLG-0
             TO  WARN-FLG-4                  OF  PARM-SMZJ1810-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WARN-FLG-1   OF  PARM-SMZJ1810-ARG2=["
      D             WARN-FLG-1               OF  PARM-SMZJ1810-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":WARN-FLG-2   OF  PARM-SMZJ1810-ARG2=["
      D             WARN-FLG-2               OF  PARM-SMZJ1810-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":WARN-FLG-3   OF  PARM-SMZJ1810-ARG2=["
      D             WARN-FLG-3               OF  PARM-SMZJ1810-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":WARN-FLG-4   OF  PARM-SMZJ1810-ARG2=["
      D             WARN-FLG-4               OF  PARM-SMZJ1810-ARG2"]"
      *-----------------------------------------------------------------
           MOVE  PARM-SMZJ1810-ARG1          OF  PARM-SMZJ1810-INOUT
             TO  WK-PARM-SMZJ1810-ARG1       OF  WK-SMZJ1810
      *----------  SCZY1170 RTN-CD 初期化
           MOVE  CNS-RTN-000
             TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日断面情報"
      D    DISPLAY  CNS-PGM-ID":  処理実行日              "
      D       "=["  WK-SYORI-YMD             OF  WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":  起動ID                  "
      D       "=["  WK-KIDOU-ID              OF  WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":  開始基準日の翌日        "
      D       "=["  WK-KAISI-KJN-YMD-NEXT    OF  WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":  基本会計ベースフラグ    "
      D       "=["  WK-KH-KAIKEI-BASE-FLG    OF  WK-TKMZBW02 "]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報"
      D    DISPLAY  CNS-PGM-ID":  処理実行日              "
      D       "=["  WK-SYORI-YMD             OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  起動ID                  "
      D       "=["  WK-KIDOU-ID              OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  利用会社コード          "
      D       "=["  WK-RIYO-CMP-CD           OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  ファンドコード          "
      D       "=["  WK-FUND-CD               OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  ポートフォリオコード    "
      D       "=["  WK-PTF-CD                OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  開始基準日              "
      D       "=["  WK-KAISI-KJN-YMD         OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  基準日                  "
      D       "=["  WK-KJN-YMD               OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  銘柄コード              "
      D       "=["  WK-MEG-CD                OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  証券種別コード          "
      D       "=["  WK-SEC-SBT-CD            OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  資産負債・買建売建フラグ"
      D       "=["  WK-TATE-FLG              OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  玉ID                    "
      D       "=["  WK-GYOKU-ID              OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":  差分更新From日          "
      D       "=["  WK-SABON-UPDATE-FROM     OF  WK-TKMZBW03 "]"
      D    DISPLAY  CNS-PGM-ID":異動計算パターン          "
      D    DISPLAY  CNS-PGM-ID":  利用会社コード          "
      D       "=["  WK-RIYO-CMP-CD           OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  異動計算パターンコード  "
      D       "=["  WK-IDO-CALC-PATTERN-CD   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  市場通貨コード          "
      D       "=["  WK-SIJO-TUKA-CD          OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  証券種別コード          "
      D       "=["  WK-SEC-SBT-CD            OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  保有目的                "
      D       "=["  WK-POSSESSION-OBJECT     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  払出簿価計算方法        "
      D       "=["  WK-DEBET-BOKA-CALC-HOU   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  払出簿価端数（市場通貨）"
      D       "=["  WK-DEBET-BOKA-HASU-BC    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  払出単価桁数（市場通貨）"
      D       "=["  WK-DEBET-TNK-KETASU-BC   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  払出単価端数（市場通貨）"
      D       "=["  WK-DEBET-TNK-HASU-BC     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  払出簿価端数（運用通貨）"
      D       "=["  WK-DEBET-BOKA-HASU-LC    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  払出単価桁数（運用通貨）"
      D       "=["  WK-DEBET-TNK-KETASU-LC   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  払出単価端数（運用通貨）"
      D       "=["  WK-DEBET-TNK-HASU-LC     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  売り続く限り同一コスト  "
      D       "=["  WK-URI-TUDUKU-SAME-COST  OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  同一日は同一コスト      "
      D       "=["  WK-SAME-YMD-SAME-COST    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）１        "
      D       "=["  WK-TEKIYO-SAKI-SYRI1     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）２        "
      D       "=["  WK-TEKIYO-SAKI-SYRI2     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）３        "
      D       "=["  WK-TEKIYO-SAKI-SYRI3     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）４        "
      D       "=["  WK-TEKIYO-SAKI-SYRI4     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）５        "
      D       "=["  WK-TEKIYO-SAKI-SYRI5     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）６        "
      D       "=["  WK-TEKIYO-SAKI-SYRI6     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）７        "
      D       "=["  WK-TEKIYO-SAKI-SYRI7     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）８        "
      D       "=["  WK-TEKIYO-SAKI-SYRI8     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（先処理）９        "
      D       "=["  WK-TEKIYO-SAKI-SYRI9     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）１        "
      D       "=["  WK-TEKIYO-ATO-SYRI1      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）２        "
      D       "=["  WK-TEKIYO-ATO-SYRI2      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）３        "
      D       "=["  WK-TEKIYO-ATO-SYRI3      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）４        "
      D       "=["  WK-TEKIYO-ATO-SYRI4      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）５        "
      D       "=["  WK-TEKIYO-ATO-SYRI5      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）６        "
      D       "=["  WK-TEKIYO-ATO-SYRI6      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）７        "
      D       "=["  WK-TEKIYO-ATO-SYRI7      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）８        "
      D       "=["  WK-TEKIYO-ATO-SYRI8      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  適用（後処理）９        "
      D       "=["  WK-TEKIYO-ATO-SYRI9      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  簿価為替レート適用フラグ"
      D       "=["  WK-BOKA-KWS-TEKIYO-FLG   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  簿価為替レート端数      "
      D       "=["  WK-BOKA-KWS-HASU         OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  簿価為替レート桁数      "
      D       "=["  WK-BOKA-KWS-KETASU       OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  新／旧株の区別          "
      D       "=["  WK-NEW-KYU-KABU-KBN      OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  新／旧簿価計算方法      "
      D       "=["  WK-NEW-KYU-BOKA-CALC     OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  按分簿価端数            "
      D       "=["  WK-ANB-BOKA-HASU         OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  按分単価端数            "
      D       "=["  WK-ANB-TNK-HASU          OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  按分単価桁数            "
      D       "=["  WK-ANB-TNK-KETASU        OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  前払金償却方法          "
      D       "=["  WK-MAEKIN-SHOUKYK-HOU    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  前払金償却分端数        "
      D       "=["  WK-MAEKIN-SHOUKYK-HASU   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  増減取引順              "
      D       "=["  WK-ZOUGEN-TORI-JUN       OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  増加取引処理順序        "
      D       "=["  WK-GKYK-PLUS-SYRI-JUN    OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  減少取引処理順序        "
      D       "=["  WK-GKYK-MINUS-SYRI-JUN   OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  処理順序                "
      D       "=["  WK-SYRI-JUN              OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  更新日時                "
      D       "=["  WK-UPD-DATE              OF  WK-IDO-CALC-PATTERN "]"
      D    DISPLAY  CNS-PGM-ID":  更新ログインユーザ会社コード   "
      D       "=["  WK-UPD-LOGIN-CMP-CD      OF  WK-IDO-CALC-PATTERN "]"
      D    DISPLAY  CNS-PGM-ID":  更新ユーザＩＤ          "
      D       "=["  WK-UPD-SID               OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  更新プログラムＩＤ      "
      D       "=["  WK-UPD-PGMID             OF  WK-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  市場通貨コード          "
      D       "=["  WK-SIJO-TUKA-CD          OF  WK-SIJO"]"
      D    DISPLAY  CNS-PGM-ID":  増減順相対物区分          "
      D       "=["  WK-ZOUGENJYUN-SOTAIBT-KBN"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1170 RTN-CD           =["
      D             RTN-CD                   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *        3.1.2 初期値処理
      ******************************************************************
       INITIALIZE-VALUE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  初期値処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期値設定
      *----------  期間内異動計算パターン
           MOVE  WK-IDO-CALC-PATTERN         OF  WK-SMZJ1810
             TO  WK-KKN-IDO-CALC-PATTERN
      *----------  期間内基本会計ベースフラグ
           MOVE  WK-KH-KAIKEI-BASE-FLG       OF  WK-PARM-SMZJ1810-ARG1
                                             OF  WK-SMZJ1810
             TO  WK-KKN-KH-KAIKEI-BASE-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  期間内異動計算パターン   "
      D       "=["  WK-KKN-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":期間内基本会計ベースフラグ "
      D       "=["  WK-KKN-KH-KAIKEI-BASE-FLG"]"
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序"
      D       "=["  SYRI-JUN              OF  WK-KKN-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
      *----------  期間内異動計算パターン.処理順序
           EVALUATE  SYRI-JUN                OF  WK-KKN-IDO-CALC-PATTERN
             WHEN  CNS-SYRI-JUN-1
             WHEN  CNS-SYRI-JUN-2
             WHEN  CNS-SYRI-JUN-3
             WHEN  CNS-SYRI-JUN-4
      *---------- 期間内異動計算パターン.処理順序＝('1'or'2'or'3'or'4')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('1'or"
      D             "'2'or'3'or'4')の場合"
      *-----------------------------------------------------------------
      *----------  期間内処理順序
               MOVE  CNS-YKJ-JUN             TO  WK-KKN-SYRI-JUN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  期間内処理順序           "
      D       "=["  WK-KKN-SYRI-JUN"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SYRI-JUN-5
             WHEN  CNS-SYRI-JUN-6
             WHEN  CNS-SYRI-JUN-7
             WHEN  CNS-SYRI-JUN-8
      *---------- 期間内異動計算パターン.処理順序＝('5'or'6'or'7'or'8')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('5'or"
      D             "'6'or'7'or'8')の場合"
      *-----------------------------------------------------------------
      *----------  期間内処理順序
               MOVE  CNS-UKE-JUN             TO  WK-KKN-SYRI-JUN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  期間内処理順序           "
      D       "=["  WK-KKN-SYRI-JUN"]"
      *-----------------------------------------------------------------
             WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序は上記以"
      D             "外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-001
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *----------  適用グループ(1).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI1        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(1)
      *----------  適用グループ(2).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI2        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(2)
      *----------  適用グループ(3).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI3        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(3)
      *----------  適用グループ(4).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI4        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(4)
      *----------  適用グループ(5).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI5        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(5)
      *----------  適用グループ(6).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI6        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(6)
      *----------  適用グループ(7).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI7        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(7)
      *----------  適用グループ(8).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI8        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(8)
      *----------  適用グループ(9).適用処理
           MOVE  WK-TEKIYO-SAKI-SYRI9        OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(9)
      *----------  適用グループ(11).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI9         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(11)
      *----------  適用グループ(12).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI8         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(12)
      *----------  適用グループ(13).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI7         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(13)
      *----------  適用グループ(14).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI6         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(14)
      *----------  適用グループ(15).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI5         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(15)
      *----------  適用グループ(16).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI4         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(16)
      *----------  適用グループ(17).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI3         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(17)
      *----------  適用グループ(18).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI2         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(18)
      *----------  適用グループ(19).適用処理
           MOVE  WK-TEKIYO-ATO-SYRI1         OF  WK-IDO-CALC-PATTERN
             TO  WK-TKYU-SYORI               OF  WK-TKYU-GROUP(19)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(1).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(1)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(2).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(2)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(3).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(3)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(4).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(4)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(5).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(5)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(6).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(6)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(7).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(7)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(8).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(8)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(9).適用処理  =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(9)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(10).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(10)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(11).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(11)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(12).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(12)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(13).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(13)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(14).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(14)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(15).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(15)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(16).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(16)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(17).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(17)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(18).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(18)"]"
      D    DISPLAY  CNS-PGM-ID":適用グループ(19).適用処理 =["
      D             WK-TKYU-SYORI            OF  WK-TKYU-GROUP(19)"]"
      D    DISPLAY  CNS-PGM-ID":期間内基本会計ベースフラグ =["
      D             WK-KKN-KH-KAIKEI-BASE-FLG"]"
      D    DISPLAY  CNS-PGM-ID":期間内処理順序 =["
      D             WK-KKN-SYRI-JUN"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報．差分更新From日 =["
      D             WK-SABON-UPDATE-FROM"]"
      *-----------------------------------------------------------------
           IF  WK-KKN-KH-KAIKEI-BASE-FLG  =  CNS-YUJ-FLG-1  AND
               WK-KKN-SYRI-JUN            =  CNS-YUJ-FLG-2  AND
               WK-SABON-UPDATE-FROM   OF  WK-TKMZBW03  NOT  =  ZERO
           THEN
             MOVE  CNS-YUJ-NUM-FLG-1         TO  WK-YKJ-UKE-JUN-FLG
           ELSE
             CONTINUE
           END-IF
      *-----------------------------------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク約定ベース受渡順フラグ =["
      D             WK-YKJ-UKE-JUN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":***  初期値処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-VALUE-EXT.
           EXIT.
      ******************************************************************
      *        テーブルID取得処理
      ******************************************************************
       TBL-ID-INIT-RTN        SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  START  ****"
      *-----------------------------------------------------------------
      *---------- テーブルID取得処理
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *---------- テーブルID1
           MOVE  CNS-TBL-TKMXTR00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *---------- テーブルID2
           MOVE  CNS-TBL-TKMZBW04
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *---------- テーブルID3
           MOVE  CNS-TBL-TKMZBW18
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *---------- テーブルID4
           MOVE  CNS-TBL-TKMZZI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード             =["
      D              RIYO-CMP-CD        OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID1                =["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID2                =["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID3                =["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID4                =["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(4)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SCZY1160)           =["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *---------- テーブルID1
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TABLE-TKMXTR00
      *---------- テーブルID2
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TABLE-TKMZBW04
      *---------- テーブルID3
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TABLE-TKMZBW18
      *---------- テーブルID4
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TABLE-TKMZZI00
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID1  TKMXTR00=["
      D             WK-TABLE-TKMXTR00"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID2  TKMZBW04=["
      D             WK-TABLE-TKMZBW04"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID3  TKMZBW18=["
      D             WK-TABLE-TKMZBW18"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID4  TKMZZI00=["
      D             WK-TABLE-TKMZZI00"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブルID取得エラー"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  主処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.2.1 対象取引取得処理
           PERFORM  TSSK-TRHK-RTN
      *----------  3.2.2 跨ぎ取引処理
           PERFORM  MATAGI-TRHK-RTN
      *----------  3.2.3 対象取引処理順序決定処理
           PERFORM  TSSKTK-SJUN-RTN
      *----------  ARG.取引SELECT件数
           MOVE  WK-TRHK-SELECT-KENSU
             TO  TRHK-SELECT-KENSU           OF  PARM-SMZJ1810-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ARG.取引SELECT件数           =["
      D             TRHK-SELECT-KENSU        OF  PARM-SMZJ1810-ARG2"]"
      D    DISPLAY  CNS-PGM-ID": *****  主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *        3.2.1 対象取引取得処理
      ******************************************************************
       TSSK-TRHK-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  対象取引取得処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.2.1.1 開始基準日翌日取得処理
           MOVE  WK-KAISI-KJN-YMD-NEXT       OF  WK-TKMZBW02
             TO  WK-KJN-YMD-TOM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 開始基準日翌日取得           =["
      D             WK-KJN-YMD-TOM  "]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 取引属性データ有効件数 =["
      D            YUUKOU-KENSUU  OF TBL-TKCMTZ00-1 "]"
      *-----------------------------------------------------------------
      *----------  ワーク取引属性エリア←初期値
           INITIALIZE  WK-TORI-ZOK-AREA-H
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア["
      D            WK-TORI-ZOK-AREA-H "]"
      *-----------------------------------------------------------------
      *----------  ワーク取引属性エリア←取引属性エリア
           INITIALIZE  WK-TORI-ZOK-COUNT
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSSK-TRHK-RTN]"               GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  UNTIL  WK-TORI-ZOK-COUNT =
                           YUUKOU-KENSUU  OF  TBL-TKCMTZ00-1
             COMPUTE  WK-TORI-ZOK-COUNT = WK-TORI-ZOK-COUNT + CNS-1
      *----------  取引事由コード
             MOVE  TRHK-JIYU-CD           OF  TBL-TKCMTZ00-1
               OF  PARM-SMZJ1810-ARG1(WK-TORI-ZOK-COUNT)
               TO  WK-TRHK-JIYU-CD        OF  WK-TORI-ZOK-AREA-H
                                             (WK-TORI-ZOK-COUNT)
      *----------  数量異動区分
             MOVE  SURYO-IDO-KBN          OF  TBL-TKCMTZ00-1
               OF  PARM-SMZJ1810-ARG1(WK-TORI-ZOK-COUNT)
               TO  WK-SURYO-IDO-KBN       OF  WK-TORI-ZOK-AREA-H
                                             (WK-TORI-ZOK-COUNT)
      *----------  簿価異動区分
             MOVE  BOKA-IDO-KBN           OF  TBL-TKCMTZ00-1
               OF  PARM-SMZJ1810-ARG1(WK-TORI-ZOK-COUNT)
               TO  WK-BOKA-IDO-KBN        OF  WK-TORI-ZOK-AREA-H
                                             (WK-TORI-ZOK-COUNT)
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSSK-TRHK-RTN]"               GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア←取引属性エリア "
      D    INITIALIZE  WK-TORI-ZOK-COUNT
      D    PERFORM  UNTIL  WK-TORI-ZOK-COUNT =
      D                    YUUKOU-KENSUU  OF TBL-TKCMTZ00-1
      D      COMPUTE  WK-TORI-ZOK-COUNT = WK-TORI-ZOK-COUNT + CNS-1
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").取引事由コード =["
      D             WK-TRHK-JIYU-CD            OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").数量異動区分   =["
      D             WK-SURYO-IDO-KBN           OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").簿価異動区分   =["
      D             WK-BOKA-IDO-KBN            OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    END-PERFORM
      *-----------------------------------------------------------------
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ":開始基準日翌日=["WK-KJN-YMD-TOM"]"
      D    DISPLAY  CNS-PGM-ID ":銘柄別断面情報．差分更新From日=["
      D             WK-SABON-UPDATE-FROM     OF  WK-TKMZBW03"]"
      *-----------------------------------------------------------------
      *----------  3.2.1.2 銘柄別断面情報．差分更新From日の判斷
           IF  WK-SABON-UPDATE-FROM          OF  WK-TKMZBW03  = ZERO
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報．差分更新From日が初期値"
      D             "の場合"
      *-----------------------------------------------------------------
      *----------  HST-基準日
             MOVE  WK-KJN-YMD-TOM            TO  H-HST-KJN-YMD
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報．差分更新From日が初期値"
      D             "以外の場合"
      *-----------------------------------------------------------------
      *----------  HST-基準日
             MOVE  WK-SABON-UPDATE-FROM      OF  WK-TKMZBW03
               TO  H-HST-KJN-YMD
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":HST-基準日                  =["
      D             H-HST-KJN-YMD  "]"
      D    DISPLAY  CNS-PGM-ID":期間内基本会計ベースフラグ  =["
      D             WK-KKN-KH-KAIKEI-BASE-FLG  "]"
      *-----------------------------------------------------------------
      *----------  期間内基本会計ベースフラグ
           EVALUATE  WK-KKN-KH-KAIKEI-BASE-FLG
             WHEN  CNS-YKJ-1
      *----------  3.2.1.3 期間内基本会計ベースフラグ＝'1':約定ベースの場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内基本会計ベースフラグ＝'1':約定"
      D             "ベースの場合"
      *-----------------------------------------------------------------
      *----------  1)取引TBLから処理対象のレコードを取得する
               PERFORM  TKMXTR00-GET1-RTN
      *----------  2)『取引_1』カーソルフェッチする
               MOVE  CNS-ON                  TO  FLG-TKMXTR00-FE-1-1
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSSK-TRHK-RTN-1]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  TKMXTR00-FETCH1-RTN
                 UNTIL  FLG-TKMXTR00-FE-1-1  =  CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSSK-TRHK-RTN-1]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  3)『取引_1』カーソルクローズ処理
      ***      PERFORM  TKMXTR00-CLOSE1-RTN                             @3212SEINO@@
             WHEN  CNS-UKE-2
      *----------  3.2.1.4 期間内基本会計ベースフラグ＝'2':受渡ベースの場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内基本会計ベースフラグ＝'2':受渡"
      D             "ベースの場合"
      *-----------------------------------------------------------------
      *----------  1)取引TBLから処理対象のレコードを取得する
               PERFORM  TKMXTR00-GET2-RTN
      *----------  2)『取引_1』カーソルフェッチする
               MOVE  CNS-ON                  TO  FLG-TKMXTR00-FE-1-2
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSSK-TRHK-RTN-2]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  TKMXTR00-FETCH2-RTN
                 UNTIL  FLG-TKMXTR00-FE-1-2  =  CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSSK-TRHK-RTN-2]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  3)『取引_1』カーソルクローズ処理
      ***      PERFORM  TKMXTR00-CLOSE2-RTN                             @3212SEINO@@
      *----------  3.2.1.5 期間内基本会計ベースフラグは上記以外の場合
             WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":3.2.1.5 期間内基本会計ベースフラグは上"
      D             "記以外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-003
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  対象取引取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TSSK-TRHK-EXT.
           EXIT.
      ******************************************************************
      *        1)取引TBLから処理対象のレコードを取得する
      ******************************************************************
       TKMXTR00-GET1-RTN      SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  1)取引TBLから処理対象のレコード"
      D             "を取得する  START  ****"
      *-----------------------------------------------------------------
      *    INITIALIZE                   SQLSTMT                         @3212SEINO@@
           INITIALIZE                   SQLSTMT01                       @3212SEINO@@
           MOVE  WK-TABLE-TKMXTR00      TO  SQL-TBL-ID-1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMXTR00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-1
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMXTR00-S,
                 WK-FUND-CD-1           OF  WK-MSG-1-1,
                 WK-FUND-CD-2           OF  WK-MSG-1-1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMXTR00-S,
                 WK-PTF-CD              OF  WK-MSG-1-1
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD           OF  H-TKMXTR00-S,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-1
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-MEG-CD               OF  H-TKMXTR00-S,
                 WK-MEG-CD              OF  WK-MSG-1-1
           IF  WK-SEC-SBT-CD            OF  WK-TKMZBW03
             = CNS-SEC-SBT-CD-CASH OR
               CNS-SEC-SBT-CD-MAR OR
               CNS-SEC-SBT-CD-MABF OR
               CNS-SEC-SBT-CD-MABO OR
               CNS-SEC-SBT-CD-MAB OR
               CNS-SEC-SBT-CD-MAFB OR
               CNS-SEC-SBT-CD-MASF OR
               CNS-SEC-SBT-CD-MASO OR
               CNS-SEC-SBT-CD-MAS OR
               CNS-SEC-SBT-CD-MAFS
           THEN
      *----------  証券種別フラグ
             MOVE  CNS-0
               TO  H-SEC-SBT-FLG        OF  H-TKMXTR00-S,
                   WK-SEC-SBT-FLG-0     OF  WK-MSG-1-1,
                   WK-SEC-SBT-FLG-1     OF  WK-MSG-1-1
           ELSE
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-TKMZBW03
               TO  H-TATE-FLG           OF  H-TKMXTR00-S,
                   WK-TATE-FLG          OF  WK-MSG-1-1
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-TKMZBW03
               TO  H-GYOKU-ID           OF  H-TKMXTR00-S,
                   WK-GYOKU-ID          OF  WK-MSG-1-1
      *----------  証券種別フラグ
             MOVE  CNS-1
               TO  H-SEC-SBT-FLG        OF  H-TKMXTR00-S,
                   WK-SEC-SBT-FLG-0     OF  WK-MSG-1-1,
                   WK-SEC-SBT-FLG-1     OF  WK-MSG-1-1
           END-IF
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03
             TO  H-KJN-YMD              OF  H-TKMXTR00-S,
                 WK-KJN-YMD             OF  WK-MSG-1-1,
                 WK-KJN-YMD-2           OF  WK-MSG-1-1
      *----------  HST-基準日
           MOVE  H-HST-KJN-YMD
             TO  H-KJN-YMD-1,
                 H-KJN-YMD-3,
                 H-KJN-YMD-4,
                 H-KJN-YMD-5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク約定ベース受渡順フラグ =["
      D             WK-YKJ-UKE-JUN-FLG"]"
      *-----------------------------------------------------------------
      *----------  HST-約定ベース受渡順フラグ
           MOVE  WK-YKJ-UKE-JUN-FLG     TO  H-YKJ-UKE-JUN-FLG,
                                            WK-YKJ-UKE-JUN-FLG-1,
                                            WK-YKJ-UKE-JUN-FLG-0
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD       OF  WK-TKMZBW03
             TO  H-KAISI-KJN-YMD        OF  H-TKMXTR00-S,
                 WK-KAISI-KJN-YMD       OF  WK-MSG-1-1
      *----ＳＱＬ文
      *    MOVE  SQL-SELECT-1-1         TO  SQLSTMT                     @3212SEINO@@
           MOVE  SQL-SELECT-1-1         TO  SQLSTMT01                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["
      D            H-RIYO-CMP-CD        OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["
      D            H-FUND-CD            OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["
      D            H-PTF-CD             OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["
      D            H-SEC-SBT-CD         OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["
      D            H-MEG-CD             OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別フラグ=["
      D            H-SEC-SBT-FLG        OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":玉ID                    =["
      D            H-GYOKU-ID           OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":基準日                  =["
      D            H-KJN-YMD            OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":HST-基準日              =["
      D            H-KJN-YMD-1"]"
      D    DISPLAY CNS-PGM-ID":開始基準日              =["
      D            H-KAISI-KJN-YMD      OF  H-TKMXTR00-S"]"
      D    DISPLAY  CNS-PGM-ID":HST-約定ベース受渡順フラグ=["
      D            H-YKJ-UKE-JUN-FLG"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT01              =["SQLSTMT01"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-MSG-1-1              =["WK-MSG-1-1"]"
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-1-1=["                   @3212SEINO@@
      D                        FLG-TKMXTR00-CR-1-1"]"                   @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMXTR00-CR-1-1 = CNS-OFF                            @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC  SQL  PREPARE  S1  FROM :SQLSTMT  END-EXEC            @3212SEINO@@
             EXEC  SQL  PREPARE  S1  FROM :SQLSTMT01  END-EXEC          @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 CONTINUE
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-004
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1         DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
             EXEC
               SQL  DECLARE  TKMXTR00_CURSOR_1 CURSOR  FOR  S1
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMXTR00_CURSOR_1
                 USING :H-TKMXTR00-S.H-RIYO-CMP-CD,
                       :H-TKMXTR00-S.H-FUND-CD,
                       :H-TKMXTR00-S.H-PTF-CD,
                       :H-TKMXTR00-S.H-FUND-CD,
                       :H-TKMXTR00-S.H-SEC-SBT-CD,
                       :H-TKMXTR00-S.H-MEG-CD,
                       :H-TKMXTR00-S.H-TATE-FLG,
                       :H-TKMXTR00-S.H-GYOKU-ID,
                       :H-TKMXTR00-S.H-SEC-SBT-FLG,
                       :H-TKMXTR00-S.H-SEC-SBT-FLG,
                       :H-HST-KJN-YMD,
                       :H-TKMXTR00-S.H-KJN-YMD,
                       :H-YKJ-UKE-JUN-FLG,
                       :H-HST-KJN-YMD,
                       :H-TKMXTR00-S.H-KJN-YMD,
                       :H-TKMXTR00-S.H-KAISI-KJN-YMD,
                       :H-HST-KJN-YMD,
                       :H-HST-KJN-YMD,
                       :H-YKJ-UKE-JUN-FLG
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":取引_1カーソルオープンフラグ-1=["
      D             FLG-TKMXTR00-CR-1-1"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  初期化ワーク取引
               INITIALIZE  WK-TRHK-GROUP
      *----------  20100223(GIPS2.0)  START
                           H-CNT1
                           H-CNT2
      *----------  20100223(GIPS2.0)  END
               INITIALIZE  H-CNT4                                       @3212SEINO@@
                           WK-KUKAN-KENSUU                              @3212SEINO@@
                           WK-GOUKEI-KENSUU                             @3212SEINO@@
      *----------  取引_1カーソルオープンフラグ-1
               MOVE  CNS-ON             TO  FLG-TKMXTR00-CR-1-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引_1カーソルオープンフラグ-1=["
      D            FLG-TKMXTR00-CR-1-1 "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-005
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  1)取引TBLから処理対象のレコード"
      D             "を取得する  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-GET1-EXT.
           EXIT.
      ******************************************************************
      *        2)『取引_1』カーソルフェッチする
      ******************************************************************
       TKMXTR00-FETCH1-RTN    SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『取引_1』カーソルフェッチする"
      D             "  START  ****"
      *-----------------------------------------------------------------
      ***  INITIALIZE  H-TORI-ID        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-YKJ-YMD        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-UKE-YMD        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-TORI-JIYU      OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-RIYO-CMP-CD    OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-MEG-CD         OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-SEC-SBT-CD     OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-FUND-CD        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-PTF-CD         OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-SIJO-TUKA-CD   OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-THRK-ID        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-NRKR-ID        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-SAKUJO-KBN     OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-AKA-KBN        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-TORI-NAIY      OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-IDO-KBN        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-S-KSG-G-YJKG   OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-U-KSG-G-YJKG   OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-G-U-KWS1       OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-G-U-KWS2       OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-KKRS-KWS       OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-KENRI-SURYO    OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-UKE-END-YMD    OF  H-TKMXTR00                  @3212SEINO@@
      ***  EXEC  SQL                                                    @3212SEINO@@
      ***      FETCH                                                    @3212SEINO@@
      ***           TKMXTR00_CURSOR_1                                   @3212SEINO@@
      ***      INTO :H-TKMXTR00.H-TORI-ID,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-YKJ-YMD,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-UKE-YMD,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-TORI-JIYU,                            @3212SEINO@@
      ***           :H-TKMXTR00.H-RIYO-CMP-CD,                          @3212SEINO@@
      ***           :H-TKMXTR00.H-MEG-CD,                               @3212SEINO@@
      ***           :H-TKMXTR00.H-SEC-SBT-CD,                           @3212SEINO@@
      ***           :H-TKMXTR00.H-FUND-CD,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-PTF-CD,                               @3212SEINO@@
      ***           :H-TKMXTR00.H-SIJO-TUKA-CD,                         @3212SEINO@@
      ***           :H-TKMXTR00.H-THRK-ID,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-NRKR-ID,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-SAKUJO-KBN,                           @3212SEINO@@
      ***           :H-TKMXTR00.H-AKA-KBN,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-TORI-NAIY,                            @3212SEINO@@
      ***           :H-TKMXTR00.H-IDO-KBN,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-S-KSG-G-YJKG,                         @3212SEINO@@
      ***           :H-TKMXTR00.H-U-KSG-G-YJKG,                         @3212SEINO@@
      ***           :H-TKMXTR00.H-G-U-KWS1,                             @3212SEINO@@
      ***           :H-TKMXTR00.H-G-U-KWS2,                             @3212SEINO@@
      ***           :H-TKMXTR00.H-KKRS-KWS,                             @3212SEINO@@
      ***           :H-TKMXTR00.H-KENRI-SURYO,                          @3212SEINO@@
      ***           :H-TKMXTR00.H-UKE-END-YMD                           @3212SEINO@@
      ***  END-EXEC                                                     @3212SEINO@@
           INITIALIZE  H-TKMXTR00                                       @3212SEINO@@
           EXEC  SQL                                                    @3212SEINO@@
               FETCH                                                    @3212SEINO@@
                    TKMXTR00_CURSOR_1                                   @3212SEINO@@
               INTO :H-TKMXTR00-TBL                                     @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               PERFORM  TKMXTR00-FETCH1-M-RTN                           @3212SEINO@@
      **** 以下の処理をTKMXTR00-FETCH1-M-RTNに移動 *********************@3212SEINO@@
      ***      MOVE  CNS-OFF                   TO  FLG-NEXT-FETCH       @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["        @3212SEINO@@
      *D*          FLG-NEXT-FETCH"]"                                    @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  (一)ARG2.取引SELECT件数←ARG2.取引SELECT件数＋1
      ***      COMPUTE  WK-TRHK-SELECT-KENSU                            @3212SEINO@@
      ***            =  WK-TRHK-SELECT-KENSU + CNS-1                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":取引SELECT件数=["WK-TRHK-SELECT-KENSU"]" @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  原取引ID
      ***      MOVE  H-TORI-ID                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-TORI-ID                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  約定日
      ***      MOVE  H-YKJ-YMD                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-YKJ-YMD                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  受渡日
      ***      MOVE  H-UKE-YMD                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-UKE-YMD                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  取引事由
      ***      MOVE  H-TORI-JIYU               OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-TORI-JIYU              OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  利用会社コード
      ***      MOVE  H-RIYO-CMP-CD             OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-RIYO-CMP-CD            OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  銘柄コード
      ***      MOVE  H-MEG-CD                  OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-MEG-CD                 OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  証券種別コード
      ***      MOVE  H-SEC-SBT-CD              OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-SEC-SBT-CD             OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  ファンドコード
      ***      MOVE  H-FUND-CD                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-FUND-CD                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  ポートフォリオコード
      ***      MOVE  H-PTF-CD                  OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-PTF-CD                 OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  市場通貨コード
      ***      MOVE  H-SIJO-TUKA-CD            OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-SIJO-TUKA-CD           OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  取引連関ＩＤ
      ***      MOVE  H-THRK-ID                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-THRK-ID                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  入力管理ＩＤ
      ***      MOVE  H-NRKR-ID                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-NRKR-ID                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  削除区分
      ***      MOVE  H-SAKUJO-KBN              OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-SAKUJO-KBN             OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  赤黒区分
      ***      MOVE  H-AKA-KBN                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-AKA-KBN                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  取引内容
      ***      MOVE  H-TORI-NAIY               OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-TORI-NAIY              OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  異動確定区分
      ***      MOVE  H-IDO-KBN                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-IDO-KBN                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  約定金額（市場通貨換算額）
      ***      MOVE  H-S-KSG-G-YJKG            OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-S-KSG-G-YJKG           OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  約定金額（運用通貨換算額）
      ***      MOVE  H-U-KSG-G-YJKG            OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-U-KSG-G-YJKG           OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  為替レート（現地／運用）１
      ***      MOVE  H-G-U-KWS1                OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-G-U-KWS1               OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  為替レート（現地／運用）２
      ***      MOVE  H-G-U-KWS2                OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-G-U-KWS2               OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  経過利息為替レート
      ***      MOVE  H-KKRS-KWS                OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-KKRS-KWS               OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  権利数量
      ***      MOVE  H-KENRI-SURYO             OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-KENRI-SURYO            OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  受渡ベースエンド日
      ***      MOVE  H-UKE-END-YMD             OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-UKE-END-YMD            OF  WK-TRHK-GROUP        @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":原取引ID                =["              @3212SEINO@@
      *D*          WK-TORI-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":約定日                  =["              @3212SEINO@@
      *D*          WK-YKJ-YMD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":受渡日                  =["              @3212SEINO@@
      *D*          WK-UKE-YMD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":取引事由                =["              @3212SEINO@@
      *D*          WK-TORI-JIYU                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":利用会社コード          =["              @3212SEINO@@
      *D*          WK-RIYO-CMP-CD              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":銘柄コード              =["              @3212SEINO@@
      *D*          WK-MEG-CD                   OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":証券種別コード          =["              @3212SEINO@@
      *D*          WK-SEC-SBT-CD               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":ファンドコード          =["              @3212SEINO@@
      *D*          WK-FUND-CD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":ポートフォリオコード    =["              @3212SEINO@@
      *D*          WK-PTF-CD                   OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":市場通貨コード          =["              @3212SEINO@@
      *D*          WK-SIJO-TUKA-CD             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":取引連関ＩＤ            =["              @3212SEINO@@
      *D*          WK-THRK-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":入力管理ＩＤ            =["              @3212SEINO@@
      *D*          WK-NRKR-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":削除区分                 =["             @3212SEINO@@
      *D*          WK-SAKUJO-KBN               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":赤黒区分                =["              @3212SEINO@@
      *D*          WK-AKA-KBN                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":取引内容                =["              @3212SEINO@@
      *D*          WK-TORI-NAIY                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":異動確定区分            =["              @3212SEINO@@
      *D*          WK-IDO-KBN                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":約定金額（市場通貨換算額）=["            @3212SEINO@@
      *D*          WK-S-KSG-G-YJKG             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":約定金額（運用通貨換算額）=["            @3212SEINO@@
      *D*          WK-U-KSG-G-YJKG             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":為替レート（現地／運用）１=["            @3212SEINO@@
      *D*          WK-G-U-KWS1                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":為替レート（現地／運用）２=["            @3212SEINO@@
      *D*          WK-G-U-KWS2                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":経過利息為替レート        =["            @3212SEINO@@
      *D*          WK-KKRS-KWS                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":権利数量                  =["            @3212SEINO@@
      *D*          WK-KENRI-SURYO              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":受渡ベースエンド日        =["            @3212SEINO@@
      *D*          WK-UKE-END-YMD             OF  WK-TRHK-GROUP"]"      @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  (二)【SMZJ4018】約定レート未入力判定ルーチン
      *            をCALLして、計算フラグと警告区分を取得する
      ***      PERFORM  SMZJ4018-CALL1-RTN                              @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["        @3212SEINO@@
      *D*          FLG-NEXT-FETCH"]"                                    @3212SEINO@@
      *-----------------------------------------------------------------
      ***      IF  FLG-NEXT-FETCH = CNS-ON                              @3212SEINO@@
      ***      THEN                                                     @3212SEINO@@
      ***        CONTINUE                                               @3212SEINO@@
      ***      ELSE                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":ワーク取引.証券種別コード AND "          @3212SEINO@@
      *D*          "ワーク取引.取引事由 判断"                           @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":証券種別コード          =["              @3212SEINO@@
      *D*          WK-SEC-SBT-CD               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":取引事由                =["              @3212SEINO@@
      *D*          WK-TORI-JIYU                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  (四)ワーク取引.証券種別コードANDワーク取引.取引事由判断
      ***        IF ( WK-SEC-SBT-CD OF WK-TRHK-GROUP                    @3212SEINO@@
      ***        = CNS-SEC-SBT-CD-CASH                                  @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAR                                  @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MABF                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MABO                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAB                                  @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAFB                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MASF                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MASO                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAS                                  @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAFS )                               @3212SEINO@@
      ***        AND ( WK-TORI-JIYU OF WK-TRHK-GROUP                    @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPU                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLU                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTCU                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPR                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLR                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTCR                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTSG                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTSL                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLS                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLT                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPS                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPT                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLB                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLC                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPB                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPC )                                @3212SEINO@@
      ***        THEN                                                   @3212SEINO@@
      ***          MOVE  CNS-POS-006         TO  WK-ERR-POS-1           @3212SEINO@@
      ***          MOVE  CNS-POS-007         TO  WK-ERR-POS-2           @3212SEINO@@
      ***          MOVE  CNS-POS-008         TO  WK-ERR-POS-3           @3212SEINO@@
      *----------  20100223(GIPS2.0)  START
      ***          PERFORM  DATA-EDIT-RTN                               @3212SEINO@@
      *----------  件数達到１００件時插入ＤＢ
      ***          IF  H-CNT1 = CNS-100                                 @3212SEINO@@
      ***          THEN                                                 @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
      ***            PERFORM  INSERT-PREPARE-RTN                        @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する
      ***            PERFORM  DATA-INSERT-RTN                           @3212SEINO@@
      ***          ELSE                                                 @3212SEINO@@
      ***            CONTINUE                                           @3212SEINO@@
      ***          END-IF                                               @3212SEINO@@
      *----------  20100223(GIPS2.0)  END
      ***        ELSE                                                   @3212SEINO@@
      *----------  (五)対象取引項目編集処理
      ***          PERFORM  TARGET-TORI1-RTN                            @3212SEINO@@
      *----------  (六)対象取引にデータinsert処理
      *----------  ERR-POS                                              @3212SEINO@@
      ***          MOVE  CNS-POS-009         TO  WK-ERR-POS-1           @3212SEINO@@
      ***          MOVE  CNS-POS-010         TO  WK-ERR-POS-2           @3212SEINO@@
      ***          MOVE  CNS-POS-011         TO  WK-ERR-POS-3           @3212SEINO@@
      *----------  20100223(GIPS2.0)  START
      ***          PERFORM  DATA2-EDIT-RTN                              @3212SEINO@@
      *----------  件数達到１００件時插入ＤＢ
      ***          IF  H-CNT2 = CNS-100                                 @3212SEINO@@
      ***          THEN                                                 @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
      ***            PERFORM  INSERT2-PREPARE-RTN                       @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する
      ***            PERFORM  DATA2-INSERT-RTN                          @3212SEINO@@
      ***          ELSE                                                 @3212SEINO@@
      ***            CONTINUE                                           @3212SEINO@@
      ***          END-IF                                               @3212SEINO@@
      ***        END-IF                                                 @3212SEINO@@
      ***      END-IF                                                   @3212SEINO@@
      ******************************************************************@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
      *----------  取引_1カーソルオープンフラグ-1
               MOVE  CNS-OFF                   TO  FLG-TKMXTR00-FE-1-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-FE-1-1     =["
      D            FLG-TKMXTR00-FE-1-1 "]"
      *-----------------------------------------------------------------
               PERFORM  TKMXTR00-FETCH1-M-RTN                           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":H-CNT1=["H-CNT1 "]"                      @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ                               @3212SEINO@@
               IF H-CNT1 NOT = CNS-0                                    @3212SEINO@@
               THEN                                                     @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理        @3212SEINO@@
                 PERFORM  INSERT-PREPARE-RTN                            @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する       @3212SEINO@@
                 PERFORM  DATA-INSERT-RTN                               @3212SEINO@@
               ELSE                                                     @3212SEINO@@
                 CONTINUE                                               @3212SEINO@@
               END-IF                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":H-CNT2=["H-CNT2 "]"                      @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ                               @3212SEINO@@
               IF H-CNT2 NOT = CNS-0                                    @3212SEINO@@
               THEN                                                     @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理        @3212SEINO@@
                 PERFORM  INSERT2-PREPARE-RTN                           @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する       @3212SEINO@@
                 PERFORM  DATA2-INSERT-RTN                              @3212SEINO@@
               ELSE                                                     @3212SEINO@@
                 CONTINUE                                               @3212SEINO@@
               END-IF                                                   @3212SEINO@@
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-012
                 TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『取引_1』カーソルフェッチする"
      D             "  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-FETCH1-EXT.
           EXIT.
      ******************************************************************@3212SEINO@@
      *        2)『取引_1』カーソルフェッチ正常終了処理                 @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMXTR00-FETCH1-M-RTN  SECTION.                                  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLERRD(3)=["SQLERRD(3)"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-GOUKEI-KENSUU=[" WK-GOUKEI-KENSUU"]"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           COMPUTE  WK-KUKAN-KENSUU = SQLERRD(3) - WK-GOUKEI-KENSUU     @3212SEINO@@
           MOVE  SQLERRD(3)         TO  WK-GOUKEI-KENSUU                @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-KUKAN-KENSUU=["WK-KUKAN-KENSUU"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-GOUKEI-KENSUU=[" WK-GOUKEI-KENSUU"]"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMXTR00-FETCH1-M-RTN]"       GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  VARYING  H-CNT4  FROM CNS-1 BY CNS-1                @3212SEINO@@
             UNTIL  H-CNT4  > WK-KUKAN-KENSUU                           @3212SEINO@@
               MOVE  CNS-OFF                   TO  FLG-NEXT-FETCH       @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["        @3212SEINO@@
      D            FLG-NEXT-FETCH"]"                                    @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":H-CNT4=["H-CNT4"]"                       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  (一)ARG2.取引SELECT件数←ARG2.取引SELECT件数＋1      @3212SEINO@@
               COMPUTE  WK-TRHK-SELECT-KENSU                            @3212SEINO@@
                     =  WK-TRHK-SELECT-KENSU + CNS-1                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":取引SELECT件数=["WK-TRHK-SELECT-KENSU"]" @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  原取引ID                                             @3212SEINO@@
               MOVE  H-TORI-ID             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-TORI-ID            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  約定日                                               @3212SEINO@@
               MOVE  H-YKJ-YMD             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-YKJ-YMD            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  受渡日                                               @3212SEINO@@
               MOVE  H-UKE-YMD             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-UKE-YMD            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  ダミー区分
               MOVE  H-DUMMY-KBN           OF  H-TKMXTR00-TBL(H-CNT4)
                 TO  WK-DUMMY-KBN          OF  WK-TRHK-GROUP
      *----------  取引事由                                             @3212SEINO@@
               MOVE  H-TORI-JIYU           OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-TORI-JIYU          OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  利用会社コード                                       @3212SEINO@@
               MOVE  H-RIYO-CMP-CD         OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-RIYO-CMP-CD        OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  銘柄コード                                           @3212SEINO@@
               MOVE  H-MEG-CD              OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-MEG-CD             OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  証券種別コード                                       @3212SEINO@@
               MOVE  H-SEC-SBT-CD          OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-SEC-SBT-CD         OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  ファンドコード                                       @3212SEINO@@
               MOVE  H-FUND-CD             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-FUND-CD            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  ポートフォリオコード                                 @3212SEINO@@
               MOVE  H-PTF-CD              OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-PTF-CD             OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  市場通貨コード                                       @3212SEINO@@
               MOVE  H-SIJO-TUKA-CD        OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-SIJO-TUKA-CD       OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  取引連関ＩＤ                                         @3212SEINO@@
               MOVE  H-THRK-ID             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-THRK-ID            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  入力管理ＩＤ                                         @3212SEINO@@
               MOVE  H-NRKR-ID             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-NRKR-ID            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  削除区分                                             @3212SEINO@@
               MOVE  H-SAKUJO-KBN          OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-SAKUJO-KBN         OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  赤黒区分                                             @3212SEINO@@
               MOVE  H-AKA-KBN             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-AKA-KBN            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  取引内容                                             @3212SEINO@@
               MOVE  H-TORI-NAIY           OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-TORI-NAIY          OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  異動確定区分                                         @3212SEINO@@
               MOVE  H-IDO-KBN             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-IDO-KBN            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  約定金額（市場通貨換算額）                           @3212SEINO@@
               MOVE  H-S-KSG-G-YJKG        OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-S-KSG-G-YJKG       OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  約定金額（運用通貨換算額）                           @3212SEINO@@
               MOVE  H-U-KSG-G-YJKG        OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-U-KSG-G-YJKG       OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  為替レート（現地／運用）１                           @3212SEINO@@
               MOVE  H-G-U-KWS1            OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-G-U-KWS1           OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  為替レート（現地／運用）２                           @3212SEINO@@
               MOVE  H-G-U-KWS2            OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-G-U-KWS2           OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  経過利息為替レート                                   @3212SEINO@@
               MOVE  H-KKRS-KWS            OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-KKRS-KWS           OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  権利数量                                             @3212SEINO@@
               MOVE  H-KENRI-SURYO         OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-KENRI-SURYO        OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  受渡ベースエンド日                                   @3212SEINO@@
               MOVE  H-UKE-END-YMD         OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-UKE-END-YMD        OF  WK-TRHK-GROUP            @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":原取引ID                =["              @3212SEINO@@
      D            WK-TORI-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":約定日                  =["              @3212SEINO@@
      D            WK-YKJ-YMD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":受渡日                  =["              @3212SEINO@@
      D            WK-UKE-YMD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":ダミー区分             =["
      D            WK-DUMMY-KBN                OF  WK-TRHK-GROUP"]"
      D    DISPLAY CNS-PGM-ID":取引事由                =["              @3212SEINO@@
      D            WK-TORI-JIYU                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["              @3212SEINO@@
      D            WK-RIYO-CMP-CD              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["              @3212SEINO@@
      D            WK-MEG-CD                   OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["              @3212SEINO@@
      D            WK-SEC-SBT-CD               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["              @3212SEINO@@
      D            WK-FUND-CD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["              @3212SEINO@@
      D            WK-PTF-CD                   OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":市場通貨コード          =["              @3212SEINO@@
      D            WK-SIJO-TUKA-CD             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":取引連関ＩＤ            =["              @3212SEINO@@
      D            WK-THRK-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":入力管理ＩＤ            =["              @3212SEINO@@
      D            WK-NRKR-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":削除区分                 =["             @3212SEINO@@
      D            WK-SAKUJO-KBN               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":赤黒区分                =["              @3212SEINO@@
      D            WK-AKA-KBN                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":取引内容                =["              @3212SEINO@@
      D            WK-TORI-NAIY                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":異動確定区分            =["              @3212SEINO@@
      D            WK-IDO-KBN                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":約定金額（市場通貨換算額）=["            @3212SEINO@@
      D            WK-S-KSG-G-YJKG             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":約定金額（運用通貨換算額）=["            @3212SEINO@@
      D            WK-U-KSG-G-YJKG             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":為替レート（現地／運用）１=["            @3212SEINO@@
      D            WK-G-U-KWS1                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":為替レート（現地／運用）２=["            @3212SEINO@@
      D            WK-G-U-KWS2                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":経過利息為替レート        =["            @3212SEINO@@
      D            WK-KKRS-KWS                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":権利数量                  =["            @3212SEINO@@
      D            WK-KENRI-SURYO              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":受渡ベースエンド日        =["            @3212SEINO@@
      D            WK-UKE-END-YMD              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  (二)【SMZJ4018】約定レート未入力判定ルーチン         @3212SEINO@@
      *            をCALLして、計算フラグと警告区分を取得する           @3212SEINO@@
               PERFORM  SMZJ4018-CALL1-RTN                              @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["        @3212SEINO@@
      D            FLG-NEXT-FETCH"]"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               IF  FLG-NEXT-FETCH = CNS-ON                              @3212SEINO@@
               THEN                                                     @3212SEINO@@
                 CONTINUE                                               @3212SEINO@@
               ELSE                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":ワーク取引.証券種別コード AND "          @3212SEINO@@
      D            "ワーク取引.取引事由 判断"                           @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["              @3212SEINO@@
      D            WK-SEC-SBT-CD               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":取引事由                =["              @3212SEINO@@
      D            WK-TORI-JIYU                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  (四)ワーク取引.証券種別コードANDワーク取引.取引事由判断@3212SEINO@@
                 IF ( WK-SEC-SBT-CD OF WK-TRHK-GROUP                    @3212SEINO@@
                 = CNS-SEC-SBT-CD-CASH                                  @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAR                                  @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MABF                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MABO                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAB                                  @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAFB                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MASF                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MASO                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAS                                  @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAFS )                               @3212SEINO@@
                 AND ( WK-TORI-JIYU OF WK-TRHK-GROUP                    @3212SEINO@@
                  = CNS-TORI-JIYU-FTPU                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLU                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTCU                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPR                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLR                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTCR                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTSG                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTSL                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLS                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLT                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPS                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPT                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLB                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLC                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPB                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPC )                                @3212SEINO@@
                 THEN                                                   @3212SEINO@@
                   MOVE  CNS-POS-006         TO  WK-ERR-POS-1           @3212SEINO@@
                   MOVE  CNS-POS-007         TO  WK-ERR-POS-2           @3212SEINO@@
                   MOVE  CNS-POS-008         TO  WK-ERR-POS-3           @3212SEINO@@
                   PERFORM  DATA-EDIT-RTN                               @3212SEINO@@
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":H-CNT1=["H-CNT1"]"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  件数達到１００件時插入ＤＢ                           @3212SEINO@@
                   IF  H-CNT1 = CNS-100                                 @3212SEINO@@
                   THEN                                                 @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理        @3212SEINO@@
                     PERFORM  INSERT-PREPARE-RTN                        @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する       @3212SEINO@@
                     PERFORM  DATA-INSERT-RTN                           @3212SEINO@@
                   ELSE                                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   END-IF                                               @3212SEINO@@
                 ELSE                                                   @3212SEINO@@
      *----------  (五)対象取引項目編集処理                             @3212SEINO@@
                   PERFORM  TARGET-TORI1-RTN                            @3212SEINO@@
      *----------  (六)対象取引にデータinsert処理                       @3212SEINO@@
      *----------  ERR-POS                                              @3212SEINO@@
                   MOVE  CNS-POS-009         TO  WK-ERR-POS-1           @3212SEINO@@
                   MOVE  CNS-POS-010         TO  WK-ERR-POS-2           @3212SEINO@@
                   MOVE  CNS-POS-011         TO  WK-ERR-POS-3           @3212SEINO@@
                   PERFORM  DATA2-EDIT-RTN                              @3212SEINO@@
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":H-CNT2=["H-CNT2"]"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  件数達到１００件時插入ＤＢ                           @3212SEINO@@
                   IF  H-CNT2 = CNS-100                                 @3212SEINO@@
                   THEN                                                 @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理        @3212SEINO@@
                     PERFORM  INSERT2-PREPARE-RTN                       @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する       @3212SEINO@@
                     PERFORM  DATA2-INSERT-RTN                          @3212SEINO@@
                   ELSE                                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   END-IF                                               @3212SEINO@@
                 END-IF                                                 @3212SEINO@@
               END-IF                                                   @3212SEINO@@
           END-PERFORM                                                  @3212SEINO@@
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMXTR00-FETCH1-M-RTN]"       GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.                                                    @3212SEINO@@
       TKMXTR00-FETCH1-M-EXT.                                           @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *      (二)【SMZJ4018】約定レート未入力判定ルーチンをCALLして、
      *      計算フラグと警告区分を取得する
      ******************************************************************
       SMZJ4018-CALL1-RTN     SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (二)【SMZJ4018】約定レート未入"
      D    "力判定ルーチンをCALLして、計算フラグと警告区分を取得"
      D    "  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ4018-INOUT
                       PARM-RTNPKG
      *---------- 約定レート
           MOVE  WK-G-U-KWS1            OF  WK-TRHK-GROUP
             TO  YKJ-RT                 OF  PARM-SMZJ4018-ARG1
      *---------- 決済レート
           MOVE  WK-G-U-KWS2            OF  WK-TRHK-GROUP
             TO  KESSAI-RETO            OF  PARM-SMZJ4018-ARG1
      *----------  取引.利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TRHK-GROUP
             TO  RIYO-CMP-CD            OF  PARM-SMZJ4018-ARG1
      *----------  取引.取引事由
           MOVE  WK-TORI-JIYU           OF  WK-TRHK-GROUP
             TO  TORI-JIYU              OF  PARM-SMZJ4018-ARG1
      *----------  取引.取引連関ＩＤ
           MOVE  WK-THRK-ID             OF  WK-TRHK-GROUP
             TO  THRK-ID                OF  PARM-SMZJ4018-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":約定レート                 =["
      D             YKJ-RT              OF  PARM-SMZJ4018-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":決済レート                 =["
      D             KESSAI-RETO         OF  PARM-SMZJ4018-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":取引.利用会社コード        =["
      D             RIYO-CMP-CD         OF  PARM-SMZJ4018-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":取引.取引事由              =["
      D             TORI-JIYU           OF  PARM-SMZJ4018-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":取引.取引連関ＩＤ          =["
      D             THRK-ID             OF  PARM-SMZJ4018-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ4018"             USING  PARM-SMZJ4018-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ4018)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG          =["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":計算フラグ           =["
      D             CALC-FLG            OF  PARM-SMZJ4018-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ":警告区分             =["
      D             WARN-KBN            OF  PARM-SMZJ4018-ARG2"]"
      *-----------------------------------------------------------------
             IF  CALC-FLG OF PARM-SMZJ4018-ARG2 = CNS-CALC-FLG-1
             THEN
               IF  WARN-KBN OF PARM-SMZJ4018-ARG2 = CNS-WARN-KBN-1
               THEN
      *----------  警告フラグ(1)
                 MOVE  CNS-WARN-FLG-1
                   TO  WARN-FLG-1         OF  PARM-SMZJ1810-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":警告フラグ(1)           =["
      D             WARN-FLG-1          OF  PARM-SMZJ1810-ARG2"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             ELSE
      *----------  ARG2.取引SELECT件数←ARG2.取引SELECT件数-1
               COMPUTE  WK-TRHK-SELECT-KENSU
                     =  WK-TRHK-SELECT-KENSU - CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引SELECT件数=["WK-TRHK-SELECT-KENSU"]"
      *-----------------------------------------------------------------
               IF  WARN-KBN OF PARM-SMZJ4018-ARG2 = CNS-WARN-KBN-2
               THEN
      *----------  警告フラグ(2)
                 MOVE  CNS-WARN-FLG-1
                   TO  WARN-FLG-2         OF  PARM-SMZJ1810-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":警告フラグ(2)           =["
      D             WARN-FLG-2          OF  PARM-SMZJ1810-ARG2"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  警告フラグ(3)
                 MOVE  CNS-WARN-FLG-1
                   TO  WARN-FLG-3         OF  PARM-SMZJ1810-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":警告フラグ(3)           =["
      D             WARN-FLG-3          OF  PARM-SMZJ1810-ARG2"]"
      *-----------------------------------------------------------------
               END-IF
               MOVE  CNS-ON               TO  FLG-NEXT-FETCH
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["
      D            FLG-NEXT-FETCH"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-013
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (二)【SMZJ4018】約定レート未入"
      D    "力判定ルーチンをCALLして、計算フラグと警告区分を取得"
      D    "   END   ****"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ4018-CALL1-EXT.
           EXIT.
      ******************************************************************
      *        (五)対象取引項目編集処理
      ******************************************************************
       TARGET-TORI1-RTN       SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (五)対象取引項目編集処理"
      D             "  START  ****"
      *-----------------------------------------------------------------
      *----------  期間内取引
           INITIALIZE                      WK-KIKAN-TRHK
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":期間内取引                 =["
      D             WK-KIKAN-TRHK "]"
      *-----------------------------------------------------------------
      *----------  期間内取引.原取引ID
           MOVE  WK-TORI-ID                  OF  WK-TRHK-GROUP
             TO  WK-TORI-ID                  OF  WK-KIKAN-TRHK
      *----------  期間内取引.計上基準日
           MOVE  WK-YKJ-YMD                  OF  WK-TRHK-GROUP
             TO  WK-KEIJOU-KIJUNBI           OF  WK-KIKAN-TRHK
      *----------  期間内取引.約定日
           MOVE  WK-YKJ-YMD                  OF  WK-TRHK-GROUP
             TO  WK-YKJ-YMD                  OF  WK-KIKAN-TRHK
      *----------  期間内取引.受渡日
           MOVE  WK-UKE-YMD                  OF  WK-TRHK-GROUP
             TO  WK-UKE-YMD                  OF  WK-KIKAN-TRHK
      *----------  期間内取引.増幅赤黒区分
           MOVE  SPACE
             TO  WK-ZOFKU-AKA-KBN            OF  WK-KIKAN-TRHK
      *----------  期間内取引.ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-TRHK-GROUP
             TO  WK-DUMMY-KBN                OF  WK-KIKAN-TRHK
      *----------  期間内取引.取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TRHK-GROUP
             TO  WK-TORI-JIYU                OF  WK-KIKAN-TRHK
      *----------  期間内取引.権利数量
           MOVE  WK-KENRI-SURYO              OF  WK-TRHK-GROUP
             TO  WK-KENRI-SURYO              OF  WK-KIKAN-TRHK
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":期間内取引.原取引ID        =["
      D             WK-TORI-ID               OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.計上基準日      =["
      D             WK-KEIJOU-KIJUNBI        OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.約定日          =["
      D             WK-YKJ-YMD               OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.受渡日          =["
      D             WK-UKE-YMD               OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.増幅赤黒区分    =["
      D             WK-ZOFKU-AKA-KBN         OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.増幅区分        =["
      D             WK-ZOFKU-KBN             OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.増幅元異動計上基準日 =["
      D             WK-ZOFKUMT-KJ-KIJUNBI    OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.ダミー区分        =["
      D             WK-DUMMY-KBN             OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.取引事由          =["
      D             WK-TORI-JIYU             OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.権利数量        =["
      D             WK-KENRI-SURYO           OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":②【SMZJ4012】取引事由判定ルーチン"
      D             "をCALLして、取引属性逆転フラグを取得する"
      *-----------------------------------------------------------------
      *----------  ②【SMZJ4012】取引事由判定ルーチンをCALLして、取引属性逆転フラグを取得する
           INITIALIZE  WK-TRHK-ZKSE-GT-FLG
                       PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TRHK-GROUP
             TO  TORI-JIYU                   OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-B
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4012-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性逆転フラグ=["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":取引事由 =["
      D             TORI-JIYU                OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4012"               USING  PARM-SMZJ4012-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4012)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             MOVE  TRHK-ZKSE-GT-FLG  OF  PARM-SMZJ4012-ARG2
               TO  WK-TRHK-ZKSE-GT-FLG
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  正常 "
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性逆転フラグ=["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  異常"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-014
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引_1.取引事由をキーで、ワーク"
      D             "取引属性エリアから検索"
      D    DISPLAY  CNS-PGM-ID ":取引_1.取引事由 =["
      D             WK-TORI-JIYU             OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
      *----------  取引_1.取引事由をキーで、ワーク取引属性エリアから検索
           INITIALIZE  WK-TORI-ZOK-COUNT
                       FLG-TORI-JIYU
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TARGET-TORI1-RTN]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  UNTIL WK-TORI-ZOK-COUNT
                        = YUUKOU-KENSUU  OF TBL-TKCMTZ00-1 OR
                          FLG-TORI-JIYU = CNS-1
             COMPUTE  WK-TORI-ZOK-COUNT
                   =  WK-TORI-ZOK-COUNT + 1
             IF  WK-TORI-JIYU  OF  WK-TRHK-GROUP
              =  WK-TRHK-JIYU-CD
                               OF WK-TORI-ZOK-AREA-H(WK-TORI-ZOK-COUNT)
             THEN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").取引事由コード =["
      D             WK-TRHK-JIYU-CD          OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").数量異動区分   =["
      D             WK-SURYO-IDO-KBN         OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").簿価異動区分   =["
      D             WK-BOKA-IDO-KBN          OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      *-----------------------------------------------------------------
      *----------  数量異動区分
               MOVE  WK-SURYO-IDO-KBN        OF  WK-TORI-ZOK-AREA-H
                                                 (WK-TORI-ZOK-COUNT)
                 TO  WK-WK-SURYO-IDO-KBN
      *----------  簿価異動区分
               MOVE  WK-BOKA-IDO-KBN         OF  WK-TORI-ZOK-AREA-H
                                                 (WK-TORI-ZOK-COUNT)
                 TO  WK-WK-BOKA-IDO-KBN
               MOVE  CNS-1                   TO  FLG-TORI-JIYU
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TARGET-TORI1-RTN]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.銘柄別断面情報."
      D             "資産負債・買建売建フラグ =["
      D             WK-TATE-FLG  OF  WK-TKMZBW03
      D                          OF  WK-PARM-SMZJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク取引属性逆転フラグ =["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      *-----------------------------------------------------------------
      *----------  ④ ARG1.銘柄別断面情報.資産負債・買建売建フラグ＝'S'
      *----------  AND ワーク取引属性逆転フラグ＝'1'の場合
           IF  (WK-TATE-FLG  OF  WK-TKMZBW03
                             OF  WK-PARM-SMZJ1810-ARG1
            =  CNS-X-S       )  AND
               WK-TRHK-ZKSE-GT-FLG
            =  CNS-X-1
           THEN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":④ ARG1.銘柄別断面情報."
      D    "資産負債・買建売建フラグ＝'S' AND"
      D     "ワーク取引属性逆転フラグ＝'1'の場合"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      *-----------------------------------------------------------------
             IF  WK-WK-BOKA-IDO-KBN  =  CNS-PLUS-1
             THEN
               MOVE  CNS-MINUS-2  TO  WK-WK-BOKA-IDO-KBN
             ELSE
               IF  WK-WK-BOKA-IDO-KBN  =  CNS-MINUS-2
               THEN
                 MOVE  CNS-PLUS-1  TO  WK-WK-BOKA-IDO-KBN
               ELSE
                 CONTINUE
               END-IF
             END-IF
             IF  WK-WK-SURYO-IDO-KBN  =  CNS-PLUS-1
             THEN
               MOVE  CNS-MINUS-2  TO  WK-WK-SURYO-IDO-KBN
             ELSE
               IF  WK-WK-SURYO-IDO-KBN  =  CNS-MINUS-2
               THEN
                 MOVE  CNS-PLUS-1  TO  WK-WK-SURYO-IDO-KBN
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-WK-BOKA-IDO-KBN  =  CNS-PLUS-1
           THEN
             MOVE  CNS-PLUS-1                TO  WK-WK-ZG-KBN
           ELSE
             IF  WK-WK-BOKA-IDO-KBN  =  CNS-MINUS-2
             THEN
               MOVE  CNS-MINUS-2             TO  WK-WK-ZG-KBN
             ELSE
               IF  WK-WK-SURYO-IDO-KBN  =  CNS-PLUS-1
               THEN
                 MOVE  CNS-PLUS-1            TO  WK-WK-ZG-KBN
               ELSE
                 IF  WK-WK-SURYO-IDO-KBN  =  CNS-MINUS-2
                 THEN
                   MOVE  CNS-MINUS-2         TO  WK-WK-ZG-KBN
                 ELSE
                   MOVE  CNS-MUKOU-9         TO  WK-WK-ZG-KBN
                 END-IF
               END-IF
             END-IF
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク増減区分 =["
      D             WK-WK-ZG-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":【SMZJ4012】取引事由判定ルーチンを"
      D             "CALLして、ワーク取引属性エリアを取得する。"
      *-----------------------------------------------------------------
      *---------- 【SMZJ4012】取引事由判定ルーチンをCALLして、ワーク取引属性エリアを取得する。
           INITIALIZE  PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TRHK-GROUP
             TO  TORI-JIYU                   OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-1
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4012-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引事由 =["
      D             TORI-JIYU                OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4012"               USING  PARM-SMZJ4012-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4012)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  正常 "
      *-----------------------------------------------------------------
      *----------  期間内取引.処理順決定評価←評価損益データフラグ
             MOVE  HYK-SNEKI-DATA-FLG        OF  PARM-SMZJ4012-ARG2
               TO  WK-SRJUN-KT-HYOKA         OF  WK-KIKAN-TRHK
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 評価損益データフラグ     =["
      D             HYK-SNEKI-DATA-FLG       OF  PARM-SMZJ4012-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.処理順決定評価=["
      D             WK-SRJUN-KT-HYOKA        OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  異常"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-015
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":期間内異動計算パターン.処理順序 =["
      D             SYRI-JUN              OF  WK-KKN-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
      *----------  期間内異動計算パターン.処理順序
           EVALUATE  SYRI-JUN                OF  WK-KKN-IDO-CALC-PATTERN
             WHEN  CNS-SYRI-JUN-1
             WHEN  CNS-SYRI-JUN-2
             WHEN  CNS-SYRI-JUN-5
             WHEN  CNS-SYRI-JUN-6
      *---------- 期間内異動計算パターン.処理順序＝('1'or'2'or'5'or'6')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('1'or"
      D             "'2'or'5'or'6')の場合"
      D    DISPLAY  CNS-PGM-ID ":取引_1.取引事由            =["
      D             WK-TORI-JIYU             OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
      *----------  取引_1.取引事由
               EVALUATE  WK-TORI-JIYU        OF  WK-TRHK-GROUP
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(1)
      *----------  適用グループ(1).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(1).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-01
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(2)
      *----------  適用グループ(2).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(2).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-02
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(3)
      *----------  適用グループ(3).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(3).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-03
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(4)
      *----------  適用グループ(4).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(4).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-04
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(5)
      *----------  適用グループ(5).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(5).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-05
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(6)
      *----------  適用グループ(6).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(6).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-06
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(7)
      *----------  適用グループ(7).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(7).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-07
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(8)
      *----------  適用グループ(8).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(8).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-08
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(9)
      *----------  適用グループ(9).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(9).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-09
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(11)
      *----------  適用グループ(11).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(11).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-11
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(12)
      *----------  適用グループ(12).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(12).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-12
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(13)
      *----------  適用グループ(13).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(13).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-13
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(14)
      *----------  適用グループ(14).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(14).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-14
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(15)
      *----------  適用グループ(15).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(15).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-15
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(16)
      *----------  適用グループ(16).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(16).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-16
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(17)
      *----------  適用グループ(17).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(17).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-17
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(18)
      *----------  適用グループ(18).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(18).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-18
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(19)
      *----------  適用グループ(19).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(19).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-19
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  OTHER
      *----------  上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上記以外の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-10
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
               END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引_1.証券種別コード=["
      D             WK-SEC-SBT-CD            OF  WK-TRHK-GROUP"]"
      D    DISPLAY  CNS-PGM-ID":取引_1.取引事由            =["
      D             WK-TORI-JIYU             OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
               IF (WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-B     OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-DBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-FBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-CB    OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-WB    OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-CBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-XMOB)
             AND  (WK-TORI-JIYU              OF  WK-TRHK-GROUP
                =  CNS-TORI-JIYU-MATU   OR
                   WK-TORI-JIYU              OF  WK-TRHK-GROUP
                =  CNS-TORI-JIYU-MATD)
               THEN
                 MOVE  ZERO
                   TO  WK-SRJUN-KT-TEKIYO    OF  WK-KIKAN-TRHK
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定摘要   =["
      D             WK-SRJUN-KT-TEKIYO       OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SYRI-JUN-3
             WHEN  CNS-SYRI-JUN-4
             WHEN  CNS-SYRI-JUN-7
             WHEN  CNS-SYRI-JUN-8
      *---------- 期間内異動計算パターン.処理順序＝('3'or'4'or'7'or'8')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('3'or"
      D             "'4'or'7'or'8')の場合"
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順=["
      D             ZOUGEN-TORI-JUN       OF  WK-KKN-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  増減順相対物区分          "
      D       "=["  WK-ZOUGENJYUN-SOTAIBT-KBN"]"
      *-----------------------------------------------------------------
               IF  WK-ZOUGENJYUN-SOTAIBT-KBN  =  CNS-X-1
               THEN
                 MOVE  CNS-PLUS-00
                   TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定増減   =["
      D                WK-SRJUN-KT-ZOUGEN    OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  期間内異動計算パターン.増減取引順
                 EVALUATE  ZOUGEN-TORI-JUN   OF  WK-KKN-IDO-CALC-PATTERN
                   WHEN  CNS-PLUS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "'1':増加を先の場合"
      D    DISPLAY  CNS-PGM-ID":ワーク増減区分             =["
      D             WK-WK-ZG-KBN"]"
      *-----------------------------------------------------------------
      *----------  ワーク増減区分
                     IF  WK-WK-ZG-KBN  =  CNS-PLUS-1
                     THEN
      *----------  a)ワーク増減区分＝'1':増加の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク増減区分＝'1':増加の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-PLUS-01
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                     ELSE
      *----------  b)ワーク増減区分 上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":b)ワーク増減区分 上記以外の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-MINUS-02
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                     END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定増減   =["
      D             WK-SRJUN-KT-ZOUGEN       OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
                   WHEN  CNS-MINUS-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "'2':減少を先の場合"
      D    DISPLAY  CNS-PGM-ID":ワーク増減区分             =["
      D             WK-WK-ZG-KBN"]"
      *-----------------------------------------------------------------
      *----------  ワーク増減区分
                     IF  WK-WK-ZG-KBN  =  CNS-MINUS-2
                     THEN
      *----------  a)ワーク増減区分＝'2':減少の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク増減区分＝'2':減少の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-PLUS-01
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                     ELSE
      *----------  b)ワーク増減区分上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":b)ワーク増減区分上記以外の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-MINUS-02
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                     END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定増減   =["
      D                WK-SRJUN-KT-ZOUGEN    OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
                   WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "上記以外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                     MOVE  CNS-PGM-ID
                       TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                     MOVE  CNS-POS-016
                       TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                     MOVE  CNS-RTN-800
                       TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                     MOVE  ZERO
                       TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                     MOVE  CNS-DETAIL-0
                       TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                     MOVE  SPACE
                       TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                     PERFORM  ERR-RTN
                 END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引_1.証券種別コード=["
      D             WK-SEC-SBT-CD            OF  WK-TRHK-GROUP"]"
      D    DISPLAY  CNS-PGM-ID":取引_1.取引事由            =["
      D             WK-TORI-JIYU             OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
                 IF (WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-B     OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-DBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-FBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-CB    OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-WB    OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-CBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-XMOB)
               AND  (WK-TORI-JIYU            OF  WK-TRHK-GROUP
                  =  CNS-TORI-JIYU-MATU   OR
                     WK-TORI-JIYU            OF  WK-TRHK-GROUP
                  =  CNS-TORI-JIYU-MATD)
                 THEN
                   MOVE  ZERO
                     TO  WK-SRJUN-KT-ZOUGEN  OF  WK-KIKAN-TRHK
                 ELSE
                   CONTINUE
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定増減   =["
      D             WK-SRJUN-KT-ZOUGEN       OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序は上記以"
      D             "外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-017
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序  =["
      D                    SYRI-JUN       OF  WK-KKN-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
      *----------  期間内異動計算パターン.処理順序
           EVALUATE  SYRI-JUN                OF  WK-KKN-IDO-CALC-PATTERN
             WHEN  CNS-SYRI-JUN-1
             WHEN  CNS-SYRI-JUN-2
             WHEN  CNS-SYRI-JUN-3
             WHEN  CNS-SYRI-JUN-4
      *---------- 期間内異動計算パターン.処理順序＝('1'or'2'or'3'or'4')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('1'or"
      D             "'2'or'3'or'4')の場合"
      *-----------------------------------------------------------------
      *----------  期間内取引.処理順決定日付
               MOVE  WK-YKJ-YMD              OF  WK-TRHK-GROUP
                 TO  WK-SRJUN-KT-DATE        OF  WK-KIKAN-TRHK
      *----------  期間内取引.処理順同日優先度日付
               MOVE  WK-UKE-YMD              OF  WK-TRHK-GROUP
                 TO  WK-SRJUN-DJ-DATE        OF  WK-KIKAN-TRHK
             WHEN  CNS-SYRI-JUN-5
             WHEN  CNS-SYRI-JUN-6
             WHEN  CNS-SYRI-JUN-7
             WHEN  CNS-SYRI-JUN-8
      *---------- 期間内異動計算パターン.処理順序＝('5'or'6'or'7'or'8')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('5'or"
      D             "'6'or'7'or'8')の場合"
      D    DISPLAY  CNS-PGM-ID":期間内基本会計ベースフラグ  =["
      D             WK-KKN-KH-KAIKEI-BASE-FLG"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.処理順決定評価=["
      D             WK-SRJUN-KT-HYOKA        OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
               IF  WK-KKN-KH-KAIKEI-BASE-FLG = CNS-YKJ-1 AND
                   (WK-SRJUN-KT-HYOKA  OF  WK-KIKAN-TRHK
                    = CNS-KT-HYOKA-8                     OR
                    WK-SRJUN-KT-HYOKA  OF  WK-KIKAN-TRHK
                    = CNS-KT-HYOKA-7)
               THEN
                 PERFORM  TKMXTR00-RTN
               ELSE
      *----------  期間内取引.処理順決定日付←取引_1.受渡日
                 MOVE  WK-UKE-YMD              OF  WK-TRHK-GROUP
                   TO  WK-SRJUN-KT-DATE        OF  WK-KIKAN-TRHK
               END-IF
      *----------  期間内取引.処理順同日優先度日付
               MOVE  WK-YKJ-YMD              OF  WK-TRHK-GROUP
                 TO  WK-SRJUN-DJ-DATE        OF  WK-KIKAN-TRHK
             WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序は上記以"
      D             "外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-018
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定日付        =["
      D             WK-SRJUN-KT-DATE         OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順同日優先度日付  =["
      D             WK-SRJUN-DJ-DATE         OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":【SMZJ4012】取引事由判定ルーチンを"
      D             "CALLして、ワーク取引属性エリアを取得する。"
      *-----------------------------------------------------------------
      *---------- 【SMZJ4012】取引事由判定ルーチンをCALLして、ワーク取引属性エリアを取得する。
           INITIALIZE  PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TRHK-GROUP
             TO  TORI-JIYU                   OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-2
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4012-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引事由 =["
      D             TORI-JIYU                OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4012"               USING  PARM-SMZJ4012-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4012)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  正常 top"
      *-----------------------------------------------------------------
      *----------  期間内取引.未収計算対象フラグ←未収計算対象フラグ
             MOVE  MSKS-TARGET-FLG           OF  PARM-SMZJ4012-ARG2
               TO  WK-MSKS-TARGET-FLG        OF  WK-KIKAN-TRHK
      *----------  期間内取引.未収計算種類←未収計算種類
             MOVE  MSKS-SHRU                 OF  PARM-SMZJ4012-ARG2
               TO  WK-MSKS-SHRU              OF  WK-KIKAN-TRHK
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 評価損益データフラグ         =["
      D             MSKS-TARGET-FLG          OF  PARM-SMZJ4012-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.未収計算対象フラグ=["
      D             WK-MSKS-TARGET-FLG       OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ": 未収計算種類                 =["
      D             MSKS-SHRU                OF  PARM-SMZJ4012-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.未収計算種類      =["
      D             WK-MSKS-SHRU             OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
             IF  MSKS-SHRU                   OF  PARM-SMZJ4012-ARG2
              =  CNS-MSKS-SHRU-31
             THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID":  証券種別コード          "
      D       "=["  WK-SEC-SBT-CD            OF  WK-TKMZBW03 "]"
      *-----------------------------------------------------------------
               IF  WK-SEC-SBT-CD             OF  WK-TKMZBW03
                =  CNS-SEC-SBT-CD-CALL OR
                   CNS-SEC-SBT-CD-DA   OR
                   CNS-SEC-SBT-CD-NCD  OR
                   CNS-SEC-SBT-CD-XMOC OR
                   CNS-SEC-SBT-CD-FDAL OR
                   CNS-SEC-SBT-CD-CASH
               THEN
                 CONTINUE
               ELSE
      *----------  期間内取引.未収計算対象フラグ←未収計算対象フラグ
                 MOVE  SPACE
                   TO  WK-MSKS-TARGET-FLG    OF  WK-KIKAN-TRHK
      *----------  期間内取引.未収計算種類←未収計算種類
                 MOVE  SPACE
                   TO  WK-MSKS-SHRU          OF  WK-KIKAN-TRHK
               END-IF
             ELSE
               CONTINUE
             END-IF
             IF  MSKS-SHRU                   OF  PARM-SMZJ4012-ARG2
              =  CNS-MSKS-SHRU-32
             THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID":  証券種別コード          "
      D       "=["  WK-SEC-SBT-CD            OF  WK-TKMZBW03 "]"
      *-----------------------------------------------------------------
               IF  (WK-SEC-SBT-CD            OF  WK-TKMZBW03
                =   CNS-SEC-SBT-CD-CALL OR
                    CNS-SEC-SBT-CD-DA      ) AND
                    WK-UKE-END-YMD           OF  WK-TRHK-GROUP  NOT
                =  ZERO
               THEN
                 CONTINUE
               ELSE
      *----------  期間内取引.未収計算対象フラグ←未収計算対象フラグ
                 MOVE  SPACE
                   TO  WK-MSKS-TARGET-FLG    OF  WK-KIKAN-TRHK
      *----------  期間内取引.未収計算種類←未収計算種類
                 MOVE  SPACE
                   TO  WK-MSKS-SHRU          OF  WK-KIKAN-TRHK
               END-IF
             ELSE
               CONTINUE
             END-IF
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.未収計算対象フラグ=["
      D             WK-MSKS-TARGET-FLG       OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.未収計算種類      =["
      D             WK-MSKS-SHRU             OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  異常"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-019
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (五)対象取引項目編集処理"
      D             "  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TARGET-TORI1-EXT.
           EXIT.
      ******************************************************************
      *    DATA2-EDIT-RTN
      ******************************************************************
       DATA2-EDIT-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DATA2-EDIT-RTN  START ***"
      *-----------------------------------------------------------------
           COMPUTE  H-CNT2 = H-CNT2 + CNS-1
           INITIALIZE  H-TKMZBW04-TBL(H-CNT2)
      *----------  処理実行日
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03
             TO  H-SYORI-YMD                 OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  起動ID
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03
             TO  H-KIDOU-ID                  OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD            OF  WK-TKMZBW03
             TO  H-KAISI-KJN-YMD             OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  基準日
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  銘柄コード
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-MEG-CD                    OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD                OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG                 OF  WK-TKMZBW03
             TO  H-TATE-FLG                  OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  玉ID
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03
             TO  H-GYOKU-ID                  OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-KIKAN-TRHK
             TO  H-TORI-ID                   OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  計上基準日
           MOVE  WK-KEIJOU-KIJUNBI           OF  WK-KIKAN-TRHK
             TO  H-KEIJOU-KIJUNBI            OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  増幅赤黒区分
           MOVE  WK-ZOFKU-AKA-KBN            OF  WK-KIKAN-TRHK
             TO  H-ZOFKU-AKA-KBN             OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  増幅区分
           MOVE  WK-ZOFKU-KBN                OF  WK-KIKAN-TRHK
             TO  H-ZOFKU-KBN                 OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  増幅元異動計上基準日
           MOVE  WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-KIKAN-TRHK
             TO  H-ZOFKUMT-KJ-KIJUNBI        OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-KIKAN-TRHK
             TO  H-DUMMY-KBN                 OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-KIKAN-TRHK
             TO  H-TORI-JIYU                 OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  処理順決定日付
           MOVE  WK-SRJUN-KT-DATE            OF  WK-KIKAN-TRHK
             TO  H-SRJUN-KT-DATE             OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  処理順同日優先度日付
           MOVE  WK-SRJUN-DJ-DATE            OF  WK-KIKAN-TRHK
             TO  H-SRJUN-DJ-DATE             OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  処理順決定摘要
           MOVE  WK-SRJUN-KT-TEKIYO          OF  WK-KIKAN-TRHK
             TO  H-SRJUN-KT-TEKIYO           OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  処理順決定増減
           MOVE  WK-SRJUN-KT-ZOUGEN          OF  WK-KIKAN-TRHK
             TO  H-SRJUN-KT-ZOUGEN           OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  処理順決定評価
           MOVE  WK-SRJUN-KT-HYOKA           OF  WK-KIKAN-TRHK
             TO  H-SRJUN-KT-HYOKA            OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  未収計算対象フラグ
           MOVE  WK-MSKS-TARGET-FLG          OF  WK-KIKAN-TRHK
             TO  H-MSKS-TARGET-FLG           OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  未収計算種類
           MOVE  WK-MSKS-SHRU                OF  WK-KIKAN-TRHK
             TO  H-MSKS-SHRU                 OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  約定日
           MOVE  WK-YKJ-YMD                  OF  WK-KIKAN-TRHK
             TO  H-YKJ-YMD                   OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  受渡日
           MOVE  WK-UKE-YMD                  OF  WK-KIKAN-TRHK
             TO  H-UKE-YMD                   OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  権利数量
           MOVE  WK-KENRI-SURYO              OF  WK-KIKAN-TRHK
             TO  H-KENRI-SURYO               OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-UPD-LOGIN-CMP-CD          OF  H-TKMZBW04-TBL(H-CNT2)
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  H-UPD-PGMID                 OF  H-TKMZBW04-TBL(H-CNT2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日                   =["
      D            H-SYORI-YMD             OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":起動ID                       =["
      D            H-KIDOU-ID              OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD           OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD               OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD                OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":開始基準日                   =["
      D            H-KAISI-KJN-YMD         OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":基準日                       =["
      D            H-KJN-YMD               OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード                   =["
      D            H-MEG-CD                OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            H-SEC-SBT-CD            OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ     =["
      D            H-TATE-FLG              OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":玉ID                         =["
      D            H-GYOKU-ID              OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            H-TORI-ID               OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":計上基準日                   =["
      D            H-KEIJOU-KIJUNBI        OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":増幅赤黒区分                 =["
      D            H-ZOFKU-AKA-KBN         OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":増幅区分                     =["
      D            H-ZOFKU-KBN             OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":増幅元異動計上基準日         =["
      D            H-ZOFKUMT-KJ-KIJUNBI    OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY  CNS-PGM-ID ":ダミー区分                 =["
      D            H-DUMMY-KBN             OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY  CNS-PGM-ID ":取引事由                   =["
      D            H-TORI-JIYU             OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":処理順決定日付               =["
      D            H-SRJUN-KT-DATE         OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":処理順同日優先度日付         =["
      D            H-SRJUN-DJ-DATE         OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":処理順決定摘要               =["
      D            H-SRJUN-KT-TEKIYO       OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":処理順決定増減               =["
      D            H-SRJUN-KT-ZOUGEN       OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":処理順決定評価               =["
      D            H-SRJUN-KT-HYOKA        OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":未収計算対象フラグ           =["
      D            H-MSKS-TARGET-FLG       OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":未収計算種類                 =["
      D            H-MSKS-SHRU             OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":約定日                       =["
      D            H-YKJ-YMD               OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":受渡日                       =["
      D            H-UKE-YMD               OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":権利数量                     =["
      D            H-KENRI-SURYO           OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード =["
      D            H-UPD-LOGIN-CMP-CD      OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY CNS-PGM-ID":更新プログラムＩＤ           =["
      D            H-UPD-PGMID             OF  H-TKMZBW04-TBL(H-CNT2)"]"
      D    DISPLAY  CNS-PGM-ID":***  DATA2-EDIT-RTN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA2-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    INSERT-SQL作成PREPARE処理
      ******************************************************************
       INSERT2-PREPARE-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT2-PREPARE-RTN  START  *****"
      *-----------------------------------------------------------------
      *    INITIALIZE  SQLSTMT                                          @3212SEINO@@
           INITIALIZE  SQLSTMT03                                        @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW04           TO  SQL-TBL-ID-3
      *----ＳＱＬ文
      *    MOVE  SQL-INSERT-1-3              TO  SQLSTMT                @3212SEINO@@
           MOVE  SQL-INSERT-1-3              TO  SQLSTMT03              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT03=["SQLSTMT03"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-S2-INSERT=["               @3212SEINO@@
      D                         FLG-TKMZBW04-S2-INSERT"]"               @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW04-S2-INSERT = CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC SQL PREPARE S2 FROM :SQLSTMT END-EXEC                 @3212SEINO@@
             EXEC SQL PREPARE S2 FROM :SQLSTMT03 END-EXEC               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                       NOT = CNS-SQL-NORMAL
             THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS-1
                 TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       S-INSERT-1-3,
                       WK-MSG-1-3              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT2-PREPARE-RTN  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       INSERT2-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    DATA2-INSERT-RTN
      ******************************************************************
       DATA2-INSERT-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA2-INSERT-RTN  START "
      *-----------------------------------------------------------------
           EXEC SQL FOR :H-CNT2
           EXECUTE S2
                 USING :H-TKMZBW04-TBL
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(EXECUTE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW04-S2-INSERT      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "FLG-TKMZBW04-S2-INSERT=["FLG-TKMZBW04-S2-INSERT"]" @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  件数清零
               INITIALIZE  H-CNT2
                           H-TKMZBW04-BULK
             WHEN  CNS-SQL-UNIQUE
               MOVE  SQLERRD(3)      TO  WK-COUNT-TMP
               COMPUTE  WK-ERR-KENSU  =  WK-COUNT-TMP + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-ERR-KENSU=["WK-ERR-KENSU"]"
      *-----------------------------------------------------------------
               INITIALIZE   WK-MSG-1-3
      *----------  処理実行日
               MOVE  H-SYORI-YMD        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SYORI-YMD       OF  WK-MSG-1-3
      *----------  起動ID
               MOVE  H-KIDOU-ID         OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KIDOU-ID        OF  WK-MSG-1-3
      *----------  利用会社コード
               MOVE  H-RIYO-CMP-CD      OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-RIYO-CMP-CD     OF  WK-MSG-1-3
      *----------  ファンドコード
               MOVE  H-FUND-CD          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-FUND-CD         OF  WK-MSG-1-3
      *----------  ポートフォリオコード
               MOVE  H-PTF-CD           OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-PTF-CD          OF  WK-MSG-1-3
      *----------  開始基準日
               MOVE  H-KAISI-KJN-YMD    OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KAISI-KJN-YMD   OF  WK-MSG-1-3
      *----------  基準日
               MOVE  H-KJN-YMD          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KJN-YMD         OF  WK-MSG-1-3
      *----------  銘柄コード
               MOVE  H-MEG-CD           OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-MEG-CD          OF  WK-MSG-1-3
      *----------  証券種別コード
               MOVE  H-SEC-SBT-CD       OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SEC-SBT-CD      OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
               MOVE  H-TATE-FLG         OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-TATE-FLG        OF  WK-MSG-1-3
      *----------  玉ID
               MOVE  H-GYOKU-ID         OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-GYOKU-ID        OF  WK-MSG-1-3
      *----------  原取引ID
               MOVE  H-TORI-ID          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-ID         OF  WK-MSG-1-3
      *----------  計上基準日
               MOVE  H-KEIJOU-KIJUNBI   OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KEIJOU-KIJUNBI  OF  WK-MSG-1-3
      *----------  増幅赤黒区分
               MOVE  H-ZOFKU-AKA-KBN    OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-ZOFKU-AKA-KBN   OF  WK-MSG-1-3
      *----------  増幅区分
               MOVE  H-ZOFKU-KBN        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-ZOFKU-KBN       OF  WK-MSG-1-3
      *----------  増幅元異動計上基準日
               MOVE  H-ZOFKUMT-KJ-KIJUNBI
                                        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-ZOFKUMT-KJ-KIJUNBI  OF  WK-MSG-1-3
      *----------  ダミー区分
               MOVE  H-DUMMY-KBN        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-DUMMY-KBN       OF  WK-MSG-1-3
      *----------  取引事由
               MOVE  H-TORI-JIYU        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-JIYU       OF  WK-MSG-1-3
      *----------  処理順決定日付
               MOVE  H-SRJUN-KT-DATE    OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-KT-DATE   OF  WK-MSG-1-3
      *----------  処理順同日優先度日付
               MOVE  H-SRJUN-DJ-DATE    OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-DJ-DATE   OF  WK-MSG-1-3
      *----------  処理順決定摘要
               MOVE  H-SRJUN-KT-TEKIYO  OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-KT-TEKIYO OF  WK-MSG-1-3
      *----------  処理順決定増減
               MOVE  H-SRJUN-KT-ZOUGEN  OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-KT-ZOUGEN OF  WK-MSG-1-3
      *----------  処理順決定評価
               MOVE  H-SRJUN-KT-HYOKA   OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-KT-HYOKA  OF  WK-MSG-1-3
      *----------  未収計算対象フラグ
               MOVE  H-MSKS-TARGET-FLG  OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-MSKS-TARGET-FLG OF  WK-MSG-1-3
      *----------  未収計算種類
               MOVE  H-MSKS-SHRU        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-MSKS-SHRU       OF  WK-MSG-1-3
      *----------  約定日
               MOVE  H-YKJ-YMD          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-YKJ-YMD         OF  WK-MSG-1-3
      *----------  受渡日
               MOVE  H-UKE-YMD          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-UKE-YMD         OF  WK-MSG-1-3
      *----------  権利数量
               MOVE  H-KENRI-SURYO      OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KENRI-SURYO     OF  WK-MSG-1-3
      *----------  更新ログインユーザ会社コード
               MOVE  H-UPD-LOGIN-CMP-CD OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-UPD-LOGIN-CMP-CD OF  WK-MSG-1-3
      *----------  更新プログラムＩＤ
               MOVE  H-UPD-PGMID        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-UPD-PGMID       OF  WK-MSG-1-3
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS-2
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     S-INSERT-1-3,
                     WK-MSG-1-3              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
               MOVE  SQLERRD(3)      TO  WK-COUNT-TMP
               COMPUTE  WK-ERR-KENSU  =  WK-COUNT-TMP + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-ERR-KENSU=["WK-ERR-KENSU"]"
      *-----------------------------------------------------------------
               INITIALIZE   WK-MSG-1-3
      *----------  処理実行日
               MOVE  H-SYORI-YMD        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SYORI-YMD       OF  WK-MSG-1-3
      *----------  起動ID
               MOVE  H-KIDOU-ID         OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KIDOU-ID        OF  WK-MSG-1-3
      *----------  利用会社コード
               MOVE  H-RIYO-CMP-CD      OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-RIYO-CMP-CD     OF  WK-MSG-1-3
      *----------  ファンドコード
               MOVE  H-FUND-CD          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-FUND-CD         OF  WK-MSG-1-3
      *----------  ポートフォリオコード
               MOVE  H-PTF-CD           OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-PTF-CD          OF  WK-MSG-1-3
      *----------  開始基準日
               MOVE  H-KAISI-KJN-YMD    OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KAISI-KJN-YMD   OF  WK-MSG-1-3
      *----------  基準日
               MOVE  H-KJN-YMD          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KJN-YMD         OF  WK-MSG-1-3
      *----------  銘柄コード
               MOVE  H-MEG-CD           OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-MEG-CD          OF  WK-MSG-1-3
      *----------  証券種別コード
               MOVE  H-SEC-SBT-CD       OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SEC-SBT-CD      OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
               MOVE  H-TATE-FLG         OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-TATE-FLG        OF  WK-MSG-1-3
      *----------  玉ID
               MOVE  H-GYOKU-ID         OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-GYOKU-ID        OF  WK-MSG-1-3
      *----------  原取引ID
               MOVE  H-TORI-ID          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-ID         OF  WK-MSG-1-3
      *----------  計上基準日
               MOVE  H-KEIJOU-KIJUNBI   OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KEIJOU-KIJUNBI  OF  WK-MSG-1-3
      *----------  増幅赤黒区分
               MOVE  H-ZOFKU-AKA-KBN    OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-ZOFKU-AKA-KBN   OF  WK-MSG-1-3
      *----------  増幅区分
               MOVE  H-ZOFKU-KBN        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-ZOFKU-KBN       OF  WK-MSG-1-3
      *----------  増幅元異動計上基準日
               MOVE  H-ZOFKUMT-KJ-KIJUNBI
                                        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-ZOFKUMT-KJ-KIJUNBI  OF  WK-MSG-1-3
      *----------  処理順決定日付
               MOVE  H-SRJUN-KT-DATE    OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-KT-DATE   OF  WK-MSG-1-3
      *----------  処理順同日優先度日付
               MOVE  H-SRJUN-DJ-DATE    OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-DJ-DATE   OF  WK-MSG-1-3
      *----------  処理順決定摘要
               MOVE  H-SRJUN-KT-TEKIYO  OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-KT-TEKIYO OF  WK-MSG-1-3
      *----------  処理順決定増減
               MOVE  H-SRJUN-KT-ZOUGEN  OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-KT-ZOUGEN OF  WK-MSG-1-3
      *----------  処理順決定評価
               MOVE  H-SRJUN-KT-HYOKA   OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-SRJUN-KT-HYOKA  OF  WK-MSG-1-3
      *----------  未収計算対象フラグ
               MOVE  H-MSKS-TARGET-FLG  OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-MSKS-TARGET-FLG OF  WK-MSG-1-3
      *----------  未収計算種類
               MOVE  H-MSKS-SHRU        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-MSKS-SHRU       OF  WK-MSG-1-3
      *----------  約定日
               MOVE  H-YKJ-YMD          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-YKJ-YMD         OF  WK-MSG-1-3
      *----------  受渡日
               MOVE  H-UKE-YMD          OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-UKE-YMD         OF  WK-MSG-1-3
      *----------  権利数量
               MOVE  H-KENRI-SURYO      OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-KENRI-SURYO     OF  WK-MSG-1-3
      *----------  更新ログインユーザ会社コード
               MOVE  H-UPD-LOGIN-CMP-CD OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-UPD-LOGIN-CMP-CD OF  WK-MSG-1-3
      *----------  更新プログラムＩＤ
               MOVE  H-UPD-PGMID        OF  H-TKMZBW04-TBL(WK-ERR-KENSU)
                 TO  WK-UPD-PGMID       OF  WK-MSG-1-3
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS-3
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     S-INSERT-1-3,
                     WK-MSG-1-3              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA2-INSERT-RTN  END "
      *-----------------------------------------------------------------
           CONTINUE.
       DATA2-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3)『取引_1』カーソルクローズ処理
      ******************************************************************
      * TKMXTR00-CLOSE1-RTN    SECTION.
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID ":****  3)『取引_1』カーソルクローズ処理"
      *D             "  START  ****"
      **-----------------------------------------------------------------
      *     EXEC  SQL
      *       CLOSE TKMXTR00_CURSOR_1
      *     END-EXEC
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY CNS-PGM-ID":CLOSE SQLCODE               =["SQLCODE"]"
      **-------------------<DEBUG>---------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      **----------  取引_1カーソルオープンフラグ-1
      *       MOVE  CNS-OFF              TO  FLG-TKMXTR00-CR-1-1
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-1-1         =["
      *D            FLG-TKMXTR00-CR-1-1 "]"
      **-----------------------------------------------------------------
      **----------  取到最後一件時插入ＤＢ
      *       IF H-CNT1 NOT = CNS-0
      *       THEN
      **----------  データを運用成果残高テーブルに挿入PREPARE処理
      *         PERFORM  INSERT-PREPARE-RTN
      **----------  編集したデータを運用成果残高テーブルに挿入する
      *         PERFORM  DATA-INSERT-RTN
      *       ELSE
      *         CONTINUE
      *       END-IF
      **----------  取到最後一件時插入ＤＢ
      *       IF H-CNT2 NOT = CNS-0
      *       THEN
      **----------  データを運用成果残高テーブルに挿入PREPARE処理
      *         PERFORM  INSERT2-PREPARE-RTN
      **----------  編集したデータを運用成果残高テーブルに挿入する
      *         PERFORM  DATA2-INSERT-RTN
      *       ELSE
      *         CONTINUE
      *       END-IF
      *     ELSE
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"
      **-------------------<DEBUG>---------------------------------------
      **----------  エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *       MOVE  CNS-POS-020
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      **---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-1         DELIMITED  BY  SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID ":****  3)『取引_1』カーソルクローズ処理"
      *D             "  END  ****"
      **-----------------------------------------------------------------
      *     CONTINUE.
      * TKMXTR00-CLOSE1-EXT.
      *     EXIT.
      ******************************************************************
      *        1)取引TBLから処理対象のレコードを取得する
      ******************************************************************
       TKMXTR00-GET2-RTN      SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  1)取引TBLから処理対象のレコード"
      D             "を取得する  START  ****"
      *-----------------------------------------------------------------
      *    INITIALIZE                   SQLSTMT                         @3212SEINO@@
           INITIALIZE                   SQLSTMT02                       @3212SEINO@@
           MOVE  WK-TABLE-TKMXTR00      TO  SQL-TBL-ID-2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMXTR00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-2
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMXTR00-S,
                 WK-FUND-CD-3           OF  WK-MSG-1-2,
                 WK-FUND-CD-4           OF  WK-MSG-1-2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMXTR00-S,
                 WK-PTF-CD              OF  WK-MSG-1-2
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD           OF  H-TKMXTR00-S,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-2
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-MEG-CD               OF  H-TKMXTR00-S,
                 WK-MEG-CD              OF  WK-MSG-1-2
           IF  WK-SEC-SBT-CD            OF  WK-TKMZBW03
             = CNS-SEC-SBT-CD-CASH OR
               CNS-SEC-SBT-CD-MAR OR
               CNS-SEC-SBT-CD-MABF OR
               CNS-SEC-SBT-CD-MABO OR
               CNS-SEC-SBT-CD-MAB OR
               CNS-SEC-SBT-CD-MAFB OR
               CNS-SEC-SBT-CD-MASF OR
               CNS-SEC-SBT-CD-MASO OR
               CNS-SEC-SBT-CD-MAS OR
               CNS-SEC-SBT-CD-MAFS
           THEN
      *----------  証券種別フラグ
             MOVE  CNS-0
               TO  H-SEC-SBT-FLG        OF  H-TKMXTR00-S,
                   WK-SEC-SBT-FLG-0     OF  WK-MSG-1-2,
                   WK-SEC-SBT-FLG-1     OF  WK-MSG-1-2
           ELSE
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-TKMZBW03
               TO  H-TATE-FLG           OF  H-TKMXTR00-S,
                   WK-TATE-FLG          OF  WK-MSG-1-2
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-TKMZBW03
               TO  H-GYOKU-ID           OF  H-TKMXTR00-S,
                   WK-GYOKU-ID          OF  WK-MSG-1-2
      *----------  証券種別フラグ
             MOVE  CNS-1
               TO  H-SEC-SBT-FLG        OF  H-TKMXTR00-S,
                   WK-SEC-SBT-FLG-0     OF  WK-MSG-1-2,
                   WK-SEC-SBT-FLG-1     OF  WK-MSG-1-2
           END-IF
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03
             TO  H-KJN-YMD              OF  H-TKMXTR00-S,
                 WK-KJN-YMD             OF  WK-MSG-1-2
      *----------  HST-基準日
           MOVE  H-HST-KJN-YMD
             TO  H-KJN-YMD-2
      *----ＳＱＬ文
      *    MOVE  SQL-SELECT-1-2         TO  SQLSTMT                     @3212SEINO@@
           MOVE  SQL-SELECT-1-2         TO  SQLSTMT02                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["
      D            H-RIYO-CMP-CD        OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["
      D            H-FUND-CD            OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["
      D            H-PTF-CD             OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["
      D            H-SEC-SBT-CD         OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["
      D            H-MEG-CD             OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":玉ID                    =["
      D            H-GYOKU-ID           OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別フラグ=["
      D            H-SEC-SBT-FLG        OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":基準日                  =["
      D            H-KJN-YMD            OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":HST-基準日              =["
      D            H-HST-KJN-YMD"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT02              =["SQLSTMT02"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-2  =["WK-MSG-1-2"]"
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-1-2=["                   @3212SEINO@@
      D                                        FLG-TKMXTR00-CR-1-2"]"   @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMXTR00-CR-1-2 = CNS-OFF                            @3212SEINO@@
           THEN                                                         @3212SEINO@@
      ***  EXEC  SQL  PREPARE  S1  FROM :SQLSTMT  END-EXEC              @3212SEINO@@
             EXEC  SQL  PREPARE  S4  FROM :SQLSTMT02  END-EXEC          @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 CONTINUE
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-021
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-2       DELIMITED  BY SIZE
                   INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
      ***  EXEC  SQL  DECLARE  TKMXTR00_CURSOR_2 CURSOR FOR  S1 END-EXEC@3212SEINO@@
             EXEC                                                       @3212SEINO@@
               SQL  DECLARE  TKMXTR00_CURSOR_2 CURSOR FOR  S4           @3212SEINO@@
             END-EXEC                                                   @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMXTR00_CURSOR_2
                 USING :H-TKMXTR00-S.H-RIYO-CMP-CD,
                       :H-TKMXTR00-S.H-FUND-CD,
                       :H-TKMXTR00-S.H-PTF-CD,
                       :H-TKMXTR00-S.H-FUND-CD,
                       :H-TKMXTR00-S.H-SEC-SBT-CD,
                       :H-TKMXTR00-S.H-MEG-CD,
                       :H-TKMXTR00-S.H-TATE-FLG,
                       :H-TKMXTR00-S.H-GYOKU-ID,
                       :H-TKMXTR00-S.H-SEC-SBT-FLG,
                       :H-TKMXTR00-S.H-SEC-SBT-FLG,
                       :H-HST-KJN-YMD,
                       :H-TKMXTR00-S.H-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  初期化ワーク取引
               INITIALIZE  WK-TRHK-GROUP
      *----------  20100223(GIPS2.0)  START
                           H-CNT1
                           H-CNT2
      *----------  20100223(GIPS2.0)  END
      *----------  取引_1カーソルオープンフラグ-2
               MOVE  CNS-ON             TO  FLG-TKMXTR00-CR-1-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-1-2        =["
      D            FLG-TKMXTR00-CR-1-2 "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-022
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-2       DELIMITED  BY SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  1)取引TBLから処理対象のレコード"
      D             "を取得する  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-GET2-EXT.
           EXIT.
      ******************************************************************
      *        2)『取引_1』カーソルフェッチする
      ******************************************************************
       TKMXTR00-FETCH2-RTN    SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『取引_1』カーソルフェッチする"
      D             "  START  ****"
      *-----------------------------------------------------------------
      ***  INITIALIZE  H-TORI-ID        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-YKJ-YMD        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-UKE-YMD        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-TORI-JIYU      OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-RIYO-CMP-CD    OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-MEG-CD         OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-SEC-SBT-CD     OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-FUND-CD        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-PTF-CD         OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-SIJO-TUKA-CD   OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-THRK-ID        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-NRKR-ID        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-SAKUJO-KBN     OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-AKA-KBN        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-TORI-NAIY      OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-IDO-KBN        OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-S-KSG-G-YJKG   OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-U-KSG-G-YJKG   OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-G-U-KWS1       OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-G-U-KWS2       OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-KKRS-KWS       OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-KENRI-SURYO    OF  H-TKMXTR00                  @3212SEINO@@
      ***              H-UKE-END-YMD    OF  H-TKMXTR00                  @3212SEINO@@
      ***  EXEC  SQL                                                    @3212SEINO@@
      ***      FETCH                                                    @3212SEINO@@
      ***           TKMXTR00_CURSOR_2                                   @3212SEINO@@
      ***      INTO :H-TKMXTR00.H-TORI-ID,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-YKJ-YMD,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-UKE-YMD,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-TORI-JIYU,                            @3212SEINO@@
      ***           :H-TKMXTR00.H-RIYO-CMP-CD,                          @3212SEINO@@
      ***           :H-TKMXTR00.H-MEG-CD,                               @3212SEINO@@
      ***           :H-TKMXTR00.H-SEC-SBT-CD,                           @3212SEINO@@
      ***           :H-TKMXTR00.H-FUND-CD,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-PTF-CD,                               @3212SEINO@@
      ***           :H-TKMXTR00.H-SIJO-TUKA-CD,                         @3212SEINO@@
      ***           :H-TKMXTR00.H-THRK-ID,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-NRKR-ID,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-SAKUJO-KBN,                           @3212SEINO@@
      ***           :H-TKMXTR00.H-AKA-KBN,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-TORI-NAIY,                            @3212SEINO@@
      ***           :H-TKMXTR00.H-IDO-KBN,                              @3212SEINO@@
      ***           :H-TKMXTR00.H-S-KSG-G-YJKG,                         @3212SEINO@@
      ***           :H-TKMXTR00.H-U-KSG-G-YJKG,                         @3212SEINO@@
      ***           :H-TKMXTR00.H-G-U-KWS1,                             @3212SEINO@@
      ***           :H-TKMXTR00.H-G-U-KWS2,                             @3212SEINO@@
      ***           :H-TKMXTR00.H-KKRS-KWS,                             @3212SEINO@@
      ***           :H-TKMXTR00.H-KENRI-SURYO,                          @3212SEINO@@
      ***           :H-TKMXTR00.H-UKE-END-YMD                           @3212SEINO@@
      ***  END-EXEC                                                     @3212SEINO@@
           INITIALIZE  H-TKMXTR00                                       @3212SEINO@@
           EXEC  SQL                                                    @3212SEINO@@
               FETCH                                                    @3212SEINO@@
                    TKMXTR00_CURSOR_2                                   @3212SEINO@@
               INTO :H-TKMXTR00-TBL                                     @3212SEINO@@
           END-EXEC                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  取引_1カーソルオープンフラグ-2
               PERFORM  TKMXTR00-FETCH2-M-RTN                           @3212SEINO@@
      **** 以下の処理をTKMXTR00-FETCH2-M-RTNに移動 *********************@3212SEINO@@
      ***      MOVE  CNS-OFF                   TO  FLG-NEXT-FETCH       @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["        @3212SEINO@@
      *D*          FLG-NEXT-FETCH"]"                                    @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  ARG2.取引SELECT件数←ARG2.取引SELECT件数＋1
      ***      COMPUTE  WK-TRHK-SELECT-KENSU                            @3212SEINO@@
      ***            =  WK-TRHK-SELECT-KENSU + CNS-1                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":取引SELECT件数=["WK-TRHK-SELECT-KENSU"]" @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  原取引ID
      ***      MOVE  H-TORI-ID                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-TORI-ID                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  約定日
      ***      MOVE  H-YKJ-YMD                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-YKJ-YMD                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  受渡日
      ***      MOVE  H-UKE-YMD                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-UKE-YMD                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  取引事由
      ***      MOVE  H-TORI-JIYU               OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-TORI-JIYU              OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  利用会社コード
      ***      MOVE  H-RIYO-CMP-CD             OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-RIYO-CMP-CD            OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  銘柄コード
      ***      MOVE  H-MEG-CD                  OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-MEG-CD                 OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  証券種別コード
      ***      MOVE  H-SEC-SBT-CD              OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-SEC-SBT-CD             OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  ファンドコード
      ***      MOVE  H-FUND-CD                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-FUND-CD                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  ポートフォリオコード
      ***      MOVE  H-PTF-CD                  OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-PTF-CD                 OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  市場通貨コード
      ***      MOVE  H-SIJO-TUKA-CD            OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-SIJO-TUKA-CD           OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  取引連関ＩＤ
      ***      MOVE  H-THRK-ID                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-THRK-ID                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  入力管理ＩＤ
      ***      MOVE  H-NRKR-ID                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-NRKR-ID                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  削除区分
      ***      MOVE  H-SAKUJO-KBN              OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-SAKUJO-KBN             OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  赤黒区分
      ***      MOVE  H-AKA-KBN                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-AKA-KBN                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  取引内容
      ***      MOVE  H-TORI-NAIY               OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-TORI-NAIY              OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  異動確定区分
      ***      MOVE  H-IDO-KBN                 OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-IDO-KBN                OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  約定金額（市場通貨換算額）
      ***      MOVE  H-S-KSG-G-YJKG            OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-S-KSG-G-YJKG           OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  約定金額（運用通貨換算額）
      ***      MOVE  H-U-KSG-G-YJKG            OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-U-KSG-G-YJKG           OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  為替レート（現地／運用）１
      ***      MOVE  H-G-U-KWS1                OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-G-U-KWS1               OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  為替レート（現地／運用）２
      ***      MOVE  H-G-U-KWS2                OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-G-U-KWS2               OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  経過利息為替レート
      ***      MOVE  H-KKRS-KWS                OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-KKRS-KWS               OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  権利数量
      ***      MOVE  H-KENRI-SURYO             OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-KENRI-SURYO            OF  WK-TRHK-GROUP        @3212SEINO@@
      *----------  受渡ベースエンド日
      ***      MOVE  H-UKE-END-YMD             OF  H-TKMXTR00           @3212SEINO@@
      ***        TO  WK-UKE-END-YMD            OF  WK-TRHK-GROUP        @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":原取引ID                =["              @3212SEINO@@
      *D*          WK-TORI-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":約定日                  =["              @3212SEINO@@
      *D*          WK-YKJ-YMD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":受渡日                  =["              @3212SEINO@@
      *D*          WK-UKE-YMD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":取引事由                =["              @3212SEINO@@
      *D*          WK-TORI-JIYU                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":利用会社コード          =["              @3212SEINO@@
      *D*          WK-RIYO-CMP-CD              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":銘柄コード              =["              @3212SEINO@@
      *D*          WK-MEG-CD                   OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":証券種別コード          =["              @3212SEINO@@
      *D*          WK-SEC-SBT-CD               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":ファンドコード          =["              @3212SEINO@@
      *D*          WK-FUND-CD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":ポートフォリオコード    =["              @3212SEINO@@
      *D*          WK-PTF-CD                   OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":市場通貨コード          =["              @3212SEINO@@
      *D*          WK-SIJO-TUKA-CD             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":取引連関ＩＤ            =["              @3212SEINO@@
      *D*          WK-THRK-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":入力管理ＩＤ            =["              @3212SEINO@@
      *D*          WK-NRKR-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":削除区分                 =["             @3212SEINO@@
      *D*          WK-SAKUJO-KBN               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":赤黒区分                =["              @3212SEINO@@
      *D*          WK-AKA-KBN                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":取引内容                =["              @3212SEINO@@
      *D*          WK-TORI-NAIY                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":異動確定区分            =["              @3212SEINO@@
      *D*          WK-IDO-KBN                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":約定金額（市場通貨換算額）=["            @3212SEINO@@
      *D*          WK-S-KSG-G-YJKG             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":約定金額（運用通貨換算額）=["            @3212SEINO@@
      *D*          WK-U-KSG-G-YJKG             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":為替レート（現地／運用）１=["            @3212SEINO@@
      *D*          WK-G-U-KWS1                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":為替レート（現地／運用）２=["            @3212SEINO@@
      *D*          WK-G-U-KWS2                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":経過利息為替レート        =["            @3212SEINO@@
      *D*          WK-KKRS-KWS                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":権利数量                  =["            @3212SEINO@@
      *D*          WK-KENRI-SURYO              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":受渡ベースエンド日        =["            @3212SEINO@@
      *D*          WK-UKE-END-YMD              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  (二)【SMZJ4018】約定レート未入力判定ルーチン
      *            をCALLして、計算フラグと警告区分を取得する
      ***      PERFORM  SMZJ4018-CALL1-RTN                              @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["        @3212SEINO@@
      *D*          FLG-NEXT-FETCH"]"                                    @3212SEINO@@
      *-----------------------------------------------------------------
      ***      IF  FLG-NEXT-FETCH = CNS-ON                              @3212SEINO@@
      ***      THEN                                                     @3212SEINO@@
      ***        CONTINUE                                               @3212SEINO@@
      ***      ELSE                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":ワーク取引.証券種別コード AND "          @3212SEINO@@
      *D*          "ワーク取引.取引事由 判断"                           @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":証券種別コード          =["              @3212SEINO@@
      *D*          WK-SEC-SBT-CD               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *D*  DISPLAY CNS-PGM-ID":取引事由                =["              @3212SEINO@@
      *D*          WK-TORI-JIYU                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  (四)ワーク取引.証券種別コードANDワーク取引.取引事由判断
      ***        IF ( WK-SEC-SBT-CD OF WK-TRHK-GROUP                    @3212SEINO@@
      ***        = CNS-SEC-SBT-CD-CASH                                  @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAR                                  @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MABF                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MABO                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAB                                  @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAFB                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MASF                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MASO                                 @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAS                                  @3212SEINO@@
      ***        OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
      ***         = CNS-SEC-SBT-CD-MAFS )                               @3212SEINO@@
      ***        AND ( WK-TORI-JIYU OF WK-TRHK-GROUP                    @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPU                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLU                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTCU                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPR                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLR                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTCR                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTSG                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTSL                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLS                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLT                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPS                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPT                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLB                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTLC                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPB                                  @3212SEINO@@
      ***        OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
      ***         = CNS-TORI-JIYU-FTPC )                                @3212SEINO@@
      ***        THEN                                                   @3212SEINO@@
      ***          MOVE  CNS-POS-023             TO  WK-ERR-POS-1       @3212SEINO@@
      ***          MOVE  CNS-POS-024             TO  WK-ERR-POS-2       @3212SEINO@@
      ***          MOVE  CNS-POS-025             TO  WK-ERR-POS-3       @3212SEINO@@
      *----------  20100223(GIPS2.0)  START
      ***          PERFORM  DATA-EDIT-RTN                               @3212SEINO@@
      *----------  件数達到１００件時插入ＤＢ
      ***          IF  H-CNT1 = CNS-100                                 @3212SEINO@@
      ***          THEN                                                 @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
      ***            PERFORM  INSERT-PREPARE-RTN                        @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する
      ***            PERFORM  DATA-INSERT-RTN                           @3212SEINO@@
      ***          ELSE                                                 @3212SEINO@@
      ***            CONTINUE                                           @3212SEINO@@
      ***          END-IF                                               @3212SEINO@@
      *----------  20100223(GIPS2.0)  END
      ***        ELSE                                                   @3212SEINO@@
      *----------  (五)対象取引項目編集処理
      ***          PERFORM  TARGET-TORI2-RTN                            @3212SEINO@@
      *----------  (六)対象取引にデータinsert処理
      *----------  ERR-POS
      ***          MOVE  CNS-POS-026             TO  WK-ERR-POS-1       @3212SEINO@@
      ***          MOVE  CNS-POS-027             TO  WK-ERR-POS-2       @3212SEINO@@
      ***          MOVE  CNS-POS-028             TO  WK-ERR-POS-3       @3212SEINO@@
      *----------  20100223(GIPS2.0)  START
      ***          PERFORM  DATA2-EDIT-RTN                              @3212SEINO@@
      *----------  件数達到１００件時插入ＤＢ
      ***          IF  H-CNT2 = CNS-100                                 @3212SEINO@@
      ***          THEN                                                 @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
      ***            PERFORM  INSERT2-PREPARE-RTN                       @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する
      ***            PERFORM  DATA2-INSERT-RTN                          @3212SEINO@@
      ***          ELSE                                                 @3212SEINO@@
      ***            CONTINUE                                           @3212SEINO@@
      ***          END-IF                                               @3212SEINO@@
      *----------  20100223(GIPS2.0)  END
      ***        END-IF                                                 @3212SEINO@@
      ***      END-IF                                                   @3212SEINO@@
      ******************************************************************@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
      *----------  取引_1カーソルオープンフラグ-2
               MOVE  CNS-OFF                   TO  FLG-TKMXTR00-FE-1-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-FE-1-2          =["
      D            FLG-TKMXTR00-FE-1-2 "]"
      D    DISPLAY CNS-PGM-ID":H-CNT1=["H-CNT1"]"
      *-----------------------------------------------------------------
               PERFORM  TKMXTR00-FETCH2-M-RTN                           @3212SEINO@@
      *----------  取到最後一件時插入ＤＢ
               IF H-CNT1 NOT = CNS-0
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":H-CNT2=["H-CNT2"]"
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ
               IF H-CNT2 NOT = CNS-0
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT2-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA2-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-029
                 TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-2       DELIMITED  BY SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『取引_1』カーソルフェッチする"
      D             "  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-FETCH2-EXT.
           EXIT.
      ******************************************************************@3212SEINO@@
      *        2)『取引_1』カーソルフェッチ正常終了処理                 @3212SEINO@@
      ******************************************************************@3212SEINO@@
       TKMXTR00-FETCH2-M-RTN  SECTION.                                  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLERRD(3)=["SQLERRD(3)"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-GOUKEI-KENSUU=[" WK-GOUKEI-KENSUU"]"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           COMPUTE  WK-KUKAN-KENSUU = SQLERRD(3) - WK-GOUKEI-KENSUU     @3212SEINO@@
           MOVE  SQLERRD(3)         TO  WK-GOUKEI-KENSUU                @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-KUKAN-KENSUU=["WK-KUKAN-KENSUU"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-GOUKEI-KENSUU=[" WK-GOUKEI-KENSUU"]"  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMXTR00-FETCH2-M-RTN]"       GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  VARYING  H-CNT4  FROM CNS-1 BY CNS-1                @3212SEINO@@
             UNTIL  H-CNT4  > WK-KUKAN-KENSUU                           @3212SEINO@@
               MOVE  CNS-OFF                   TO  FLG-NEXT-FETCH       @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["        @3212SEINO@@
      D            FLG-NEXT-FETCH"]"                                    @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":H-CNT4=["H-CNT4"]"                       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  ARG2.取引SELECT件数←ARG2.取引SELECT件数＋1          @3212SEINO@@
               COMPUTE  WK-TRHK-SELECT-KENSU                            @3212SEINO@@
                     =  WK-TRHK-SELECT-KENSU + CNS-1                    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":取引SELECT件数=["WK-TRHK-SELECT-KENSU"]" @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  原取引ID                                             @3212SEINO@@
               MOVE  H-TORI-ID             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-TORI-ID            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  約定日                                               @3212SEINO@@
               MOVE  H-YKJ-YMD             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-YKJ-YMD            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  受渡日                                               @3212SEINO@@
               MOVE  H-UKE-YMD             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-UKE-YMD            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  ダミー区分
               MOVE  H-DUMMY-KBN           OF  H-TKMXTR00-TBL(H-CNT4)
                 TO  WK-DUMMY-KBN          OF  WK-TRHK-GROUP
      *----------  取引事由                                             @3212SEINO@@
               MOVE  H-TORI-JIYU           OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-TORI-JIYU          OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  利用会社コード                                       @3212SEINO@@
               MOVE  H-RIYO-CMP-CD         OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-RIYO-CMP-CD        OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  銘柄コード                                           @3212SEINO@@
               MOVE  H-MEG-CD              OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-MEG-CD             OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  証券種別コード                                       @3212SEINO@@
               MOVE  H-SEC-SBT-CD          OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-SEC-SBT-CD         OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  ファンドコード                                       @3212SEINO@@
               MOVE  H-FUND-CD             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-FUND-CD            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  ポートフォリオコード                                 @3212SEINO@@
               MOVE  H-PTF-CD              OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-PTF-CD             OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  市場通貨コード                                       @3212SEINO@@
               MOVE  H-SIJO-TUKA-CD        OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-SIJO-TUKA-CD       OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  取引連関ＩＤ                                         @3212SEINO@@
               MOVE  H-THRK-ID             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-THRK-ID            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  入力管理ＩＤ                                         @3212SEINO@@
               MOVE  H-NRKR-ID             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-NRKR-ID            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  削除区分                                             @3212SEINO@@
               MOVE  H-SAKUJO-KBN          OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-SAKUJO-KBN         OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  赤黒区分                                             @3212SEINO@@
               MOVE  H-AKA-KBN             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-AKA-KBN            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  取引内容                                             @3212SEINO@@
               MOVE  H-TORI-NAIY           OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-TORI-NAIY          OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  異動確定区分                                         @3212SEINO@@
               MOVE  H-IDO-KBN             OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-IDO-KBN            OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  約定金額（市場通貨換算額）                           @3212SEINO@@
               MOVE  H-S-KSG-G-YJKG        OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-S-KSG-G-YJKG       OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  約定金額（運用通貨換算額）                           @3212SEINO@@
               MOVE  H-U-KSG-G-YJKG        OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-U-KSG-G-YJKG       OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  為替レート（現地／運用）１                           @3212SEINO@@
               MOVE  H-G-U-KWS1            OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-G-U-KWS1           OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  為替レート（現地／運用）２                           @3212SEINO@@
               MOVE  H-G-U-KWS2            OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-G-U-KWS2           OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  経過利息為替レート                                   @3212SEINO@@
               MOVE  H-KKRS-KWS            OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-KKRS-KWS           OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  権利数量                                             @3212SEINO@@
               MOVE  H-KENRI-SURYO         OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-KENRI-SURYO        OF  WK-TRHK-GROUP            @3212SEINO@@
      *----------  受渡ベースエンド日                                   @3212SEINO@@
               MOVE  H-UKE-END-YMD         OF  H-TKMXTR00-TBL(H-CNT4)   @3212SEINO@@
                 TO  WK-UKE-END-YMD        OF  WK-TRHK-GROUP            @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":原取引ID                =["              @3212SEINO@@
      D            WK-TORI-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":約定日                  =["              @3212SEINO@@
      D            WK-YKJ-YMD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":受渡日                  =["              @3212SEINO@@
      D            WK-UKE-YMD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":ダミー区分              =["
      D            WK-DUMMY-KBN                OF  WK-TRHK-GROUP"]"
      D    DISPLAY CNS-PGM-ID":取引事由                =["              @3212SEINO@@
      D            WK-TORI-JIYU                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["              @3212SEINO@@
      D            WK-RIYO-CMP-CD              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["              @3212SEINO@@
      D            WK-MEG-CD                   OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["              @3212SEINO@@
      D            WK-SEC-SBT-CD               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["              @3212SEINO@@
      D            WK-FUND-CD                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["              @3212SEINO@@
      D            WK-PTF-CD                   OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":市場通貨コード          =["              @3212SEINO@@
      D            WK-SIJO-TUKA-CD             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":取引連関ＩＤ            =["              @3212SEINO@@
      D            WK-THRK-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":入力管理ＩＤ            =["              @3212SEINO@@
      D            WK-NRKR-ID                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":削除区分                 =["             @3212SEINO@@
      D            WK-SAKUJO-KBN               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":赤黒区分                =["              @3212SEINO@@
      D            WK-AKA-KBN                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":取引内容                =["              @3212SEINO@@
      D            WK-TORI-NAIY                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":異動確定区分            =["              @3212SEINO@@
      D            WK-IDO-KBN                  OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":約定金額（市場通貨換算額）=["            @3212SEINO@@
      D            WK-S-KSG-G-YJKG             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":約定金額（運用通貨換算額）=["            @3212SEINO@@
      D            WK-U-KSG-G-YJKG             OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":為替レート（現地／運用）１=["            @3212SEINO@@
      D            WK-G-U-KWS1                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":為替レート（現地／運用）２=["            @3212SEINO@@
      D            WK-G-U-KWS2                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":経過利息為替レート        =["            @3212SEINO@@
      D            WK-KKRS-KWS                 OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":権利数量                  =["            @3212SEINO@@
      D            WK-KENRI-SURYO              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":受渡ベースエンド日        =["            @3212SEINO@@
      D            WK-UKE-END-YMD              OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  (二)【SMZJ4018】約定レート未入力判定ルーチン         @3212SEINO@@
      *            をCALLして、計算フラグと警告区分を取得する           @3212SEINO@@
               PERFORM  SMZJ4018-CALL1-RTN                              @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["        @3212SEINO@@
      D            FLG-NEXT-FETCH"]"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               IF  FLG-NEXT-FETCH = CNS-ON                              @3212SEINO@@
               THEN                                                     @3212SEINO@@
                 CONTINUE                                               @3212SEINO@@
               ELSE                                                     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":ワーク取引.証券種別コード AND "          @3212SEINO@@
      D            "ワーク取引.取引事由 判断"                           @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["              @3212SEINO@@
      D            WK-SEC-SBT-CD               OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":取引事由                =["              @3212SEINO@@
      D            WK-TORI-JIYU                OF  WK-TRHK-GROUP"]"     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  (四)ワーク取引.証券種別コードANDワーク取引.取引事由判断@3212SEINO@@
                 IF ( WK-SEC-SBT-CD OF WK-TRHK-GROUP                    @3212SEINO@@
                 = CNS-SEC-SBT-CD-CASH                                  @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAR                                  @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MABF                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MABO                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAB                                  @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAFB                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MASF                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MASO                                 @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAS                                  @3212SEINO@@
                 OR WK-SEC-SBT-CD OF WK-TRHK-GROUP                      @3212SEINO@@
                  = CNS-SEC-SBT-CD-MAFS )                               @3212SEINO@@
                 AND ( WK-TORI-JIYU OF WK-TRHK-GROUP                    @3212SEINO@@
                  = CNS-TORI-JIYU-FTPU                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLU                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTCU                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPR                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLR                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTCR                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTSG                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTSL                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLS                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLT                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPS                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPT                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLB                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTLC                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPB                                  @3212SEINO@@
                 OR WK-TORI-JIYU OF WK-TRHK-GROUP                       @3212SEINO@@
                  = CNS-TORI-JIYU-FTPC )                                @3212SEINO@@
                 THEN                                                   @3212SEINO@@
                   MOVE  CNS-POS-023             TO  WK-ERR-POS-1       @3212SEINO@@
                   MOVE  CNS-POS-024             TO  WK-ERR-POS-2       @3212SEINO@@
                   MOVE  CNS-POS-025             TO  WK-ERR-POS-3       @3212SEINO@@
      *----------  20100223(GIPS2.0)  START                             @3212SEINO@@
                   PERFORM  DATA-EDIT-RTN                               @3212SEINO@@
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":H-CNT1=["H-CNT1"]"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  件数達到１００件時插入ＤＢ                           @3212SEINO@@
                   IF  H-CNT1 = CNS-100                                 @3212SEINO@@
                   THEN                                                 @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理        @3212SEINO@@
                     PERFORM  INSERT-PREPARE-RTN                        @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する       @3212SEINO@@
                     PERFORM  DATA-INSERT-RTN                           @3212SEINO@@
                   ELSE                                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   END-IF                                               @3212SEINO@@
      *----------  20100223(GIPS2.0)  END                               @3212SEINO@@
                 ELSE                                                   @3212SEINO@@
      *----------  (五)対象取引項目編集処理                             @3212SEINO@@
                   PERFORM  TARGET-TORI2-RTN                            @3212SEINO@@
      *----------  (六)対象取引にデータinsert処理                       @3212SEINO@@
      *----------  ERR-POS                                              @3212SEINO@@
                   MOVE  CNS-POS-026             TO  WK-ERR-POS-1       @3212SEINO@@
                   MOVE  CNS-POS-027             TO  WK-ERR-POS-2       @3212SEINO@@
                   MOVE  CNS-POS-028             TO  WK-ERR-POS-3       @3212SEINO@@
      *----------  20100223(GIPS2.0)  START                             @3212SEINO@@
                   PERFORM  DATA2-EDIT-RTN                              @3212SEINO@@
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":H-CNT2=["H-CNT2"]"                     @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  件数達到１００件時插入ＤＢ                           @3212SEINO@@
                   IF  H-CNT2 = CNS-100                                 @3212SEINO@@
                   THEN                                                 @3212SEINO@@
      *----------  データを運用成果残高テーブルに挿入PREPARE処理        @3212SEINO@@
                     PERFORM  INSERT2-PREPARE-RTN                       @3212SEINO@@
      *----------  編集したデータを運用成果残高テーブルに挿入する       @3212SEINO@@
                     PERFORM  DATA2-INSERT-RTN                          @3212SEINO@@
                   ELSE                                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   END-IF                                               @3212SEINO@@
      *----------  20100223(GIPS2.0)  END                               @3212SEINO@@
                 END-IF                                                 @3212SEINO@@
               END-IF                                                   @3212SEINO@@
           END-PERFORM                                                  @3212SEINO@@
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMXTR00-FETCH2-M-RTN]"       GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.                                                    @3212SEINO@@
       TKMXTR00-FETCH2-M-EXT.                                           @3212SEINO@@
           EXIT.                                                        @3212SEINO@@
      ******************************************************************
      *        (五)対象取引項目編集処理
      ******************************************************************
       TARGET-TORI2-RTN       SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (五)対象取引項目編集処理"
      D             "  START  ****"
      *-----------------------------------------------------------------
      *----------  期間内取引
           INITIALIZE                      WK-KIKAN-TRHK
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":期間内取引                 =["
      D             WK-KIKAN-TRHK "]"
      *-----------------------------------------------------------------
      *----------  期間内取引.原取引ID
           MOVE  WK-TORI-ID                  OF  WK-TRHK-GROUP
             TO  WK-TORI-ID                  OF  WK-KIKAN-TRHK
      *----------  期間内取引.計上基準日
           MOVE  WK-UKE-YMD                  OF  WK-TRHK-GROUP
             TO  WK-KEIJOU-KIJUNBI           OF  WK-KIKAN-TRHK
      *----------  期間内取引.約定日
           MOVE  WK-YKJ-YMD                  OF  WK-TRHK-GROUP
             TO  WK-YKJ-YMD                  OF  WK-KIKAN-TRHK
      *----------  期間内取引.受渡日
           MOVE  WK-UKE-YMD                  OF  WK-TRHK-GROUP
             TO  WK-UKE-YMD                  OF  WK-KIKAN-TRHK
      *----------  期間内取引.処理順決定日付
           MOVE  WK-UKE-YMD                  OF  WK-TRHK-GROUP
             TO  WK-SRJUN-KT-DATE            OF  WK-KIKAN-TRHK
      *----------  期間内取引.処理順同日優先度日付
           MOVE  WK-YKJ-YMD                  OF  WK-TRHK-GROUP
             TO  WK-SRJUN-DJ-DATE            OF  WK-KIKAN-TRHK
      *----------  期間内取引.増幅赤黒区分
           MOVE  SPACE
             TO  WK-ZOFKU-AKA-KBN            OF  WK-KIKAN-TRHK
      *----------  期間内取引.ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-TRHK-GROUP
             TO  WK-DUMMY-KBN                OF  WK-KIKAN-TRHK
      *----------  期間内取引.取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TRHK-GROUP
             TO  WK-TORI-JIYU                OF  WK-KIKAN-TRHK
      *----------  期間内取引.権利数量
           MOVE  WK-KENRI-SURYO              OF  WK-TRHK-GROUP
             TO  WK-KENRI-SURYO              OF  WK-KIKAN-TRHK
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":期間内取引.原取引ID        =["
      D             WK-TORI-ID               OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.計上基準日      =["
      D             WK-KEIJOU-KIJUNBI        OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.約定日          =["
      D             WK-YKJ-YMD               OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.受渡日          =["
      D             WK-UKE-YMD               OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.処理順決定日付  =["
      D             WK-SRJUN-KT-DATE         OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.処理順同日優先度日付=["
      D             WK-SRJUN-DJ-DATE         OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.増幅赤黒区分    =["
      D             WK-ZOFKU-AKA-KBN         OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.増幅区分        =["
      D             WK-ZOFKU-KBN             OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.増幅元異動計上基準日 =["
      D             WK-ZOFKUMT-KJ-KIJUNBI    OF  WK-KIKAN-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.ダミー区分        =["
      D             WK-DUMMY-KBN             OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.取引事由          =["
      D             WK-TORI-JIYU             OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":期間内取引.権利数量        =["
      D             WK-KENRI-SURYO           OF  WK-KIKAN-TRHK "]"
      *-----------------------------------------------------------------
      *----------  ②【SMZJ4012】取引事由判定ルーチンをCALLして、取引属性逆転フラグを取得する
           INITIALIZE  WK-TRHK-ZKSE-GT-FLG
                       PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TRHK-GROUP
             TO  TORI-JIYU                   OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-B
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4012-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性逆転フラグ=["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":取引事由 =["
      D             TORI-JIYU                OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4012"               USING  PARM-SMZJ4012-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4012)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             MOVE  TRHK-ZKSE-GT-FLG  OF  PARM-SMZJ4012-ARG2
               TO  WK-TRHK-ZKSE-GT-FLG
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  正常 "
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性逆転フラグ=["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  異常"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-030
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引_1.取引事由をキーで、ワーク"
      D             "取引属性エリアから検索"
      D    DISPLAY  CNS-PGM-ID ":取引_1.取引事由 =["
      D             WK-TORI-JIYU             OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
      *----------  取引_1.取引事由をキーで、ワーク取引属性エリアから検索
           INITIALIZE  WK-TORI-ZOK-COUNT
                       FLG-TORI-JIYU
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TARGET-TORI2-RTN]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  UNTIL WK-TORI-ZOK-COUNT
                        = YUUKOU-KENSUU  OF TBL-TKCMTZ00-1 OR
                          FLG-TORI-JIYU = CNS-1
             COMPUTE  WK-TORI-ZOK-COUNT
                   =  WK-TORI-ZOK-COUNT + 1
             IF  WK-TORI-JIYU  OF  WK-TRHK-GROUP
              =  WK-TRHK-JIYU-CD
                               OF WK-TORI-ZOK-AREA-H(WK-TORI-ZOK-COUNT)
             THEN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").取引事由コード =["
      D             WK-TRHK-JIYU-CD          OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").数量異動区分   =["
      D             WK-SURYO-IDO-KBN         OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").簿価異動区分   =["
      D             WK-BOKA-IDO-KBN          OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      *-----------------------------------------------------------------
      *----------  数量異動区分
               MOVE  WK-SURYO-IDO-KBN        OF  WK-TORI-ZOK-AREA-H
                                                 (WK-TORI-ZOK-COUNT)
                 TO  WK-WK-SURYO-IDO-KBN
      *----------  簿価異動区分
               MOVE  WK-BOKA-IDO-KBN         OF  WK-TORI-ZOK-AREA-H
                                                 (WK-TORI-ZOK-COUNT)
                 TO  WK-WK-BOKA-IDO-KBN
               MOVE  CNS-1                   TO  FLG-TORI-JIYU
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TARGET-TORI2-RTN]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.銘柄別断面情報."
      D             "資産負債・買建売建フラグ =["
      D             WK-TATE-FLG  OF  WK-TKMZBW03
      D                          OF  WK-PARM-SMZJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク取引属性逆転フラグ =["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      *-----------------------------------------------------------------
      *----------  ③  B)ARG1.銘柄別断面情報.資産負債・買建売建フラグ＝'S'
      *----------  AND ワーク取引属性逆転フラグ＝'1'の場合
           IF  (WK-TATE-FLG  OF  WK-TKMZBW03
                             OF  WK-PARM-SMZJ1810-ARG1
            =  CNS-X-S       )  AND
               WK-TRHK-ZKSE-GT-FLG
            =  CNS-X-1
           THEN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":③  B)ARG1.銘柄別断面情報."
      D    "資産負債・買建売建フラグ＝'S' AND"
      D     "ワーク取引属性逆転フラグ＝'1'の場合"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      *-----------------------------------------------------------------
             IF  WK-WK-BOKA-IDO-KBN  =  CNS-PLUS-1
             THEN
               MOVE  CNS-MINUS-2  TO  WK-WK-BOKA-IDO-KBN
             ELSE
               IF  WK-WK-BOKA-IDO-KBN  =  CNS-MINUS-2
               THEN
                 MOVE  CNS-PLUS-1  TO  WK-WK-BOKA-IDO-KBN
               ELSE
                 CONTINUE
               END-IF
             END-IF
             IF  WK-WK-SURYO-IDO-KBN  =  CNS-PLUS-1
             THEN
               MOVE  CNS-MINUS-2  TO  WK-WK-SURYO-IDO-KBN
             ELSE
               IF  WK-WK-SURYO-IDO-KBN  =  CNS-MINUS-2
               THEN
                 MOVE  CNS-PLUS-1  TO  WK-WK-SURYO-IDO-KBN
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-WK-BOKA-IDO-KBN  =  CNS-PLUS-1
           THEN
             MOVE  CNS-PLUS-1                TO  WK-WK-ZG-KBN
           ELSE
             IF  WK-WK-BOKA-IDO-KBN  =  CNS-MINUS-2
             THEN
               MOVE  CNS-MINUS-2             TO  WK-WK-ZG-KBN
             ELSE
               IF  WK-WK-SURYO-IDO-KBN  =  CNS-PLUS-1
               THEN
                 MOVE  CNS-PLUS-1            TO  WK-WK-ZG-KBN
               ELSE
                 IF  WK-WK-SURYO-IDO-KBN  =  CNS-MINUS-2
                 THEN
                   MOVE  CNS-MINUS-2         TO  WK-WK-ZG-KBN
                 ELSE
                   MOVE  CNS-MUKOU-9         TO  WK-WK-ZG-KBN
                 END-IF
               END-IF
             END-IF
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク増減区分 =["
      D             WK-WK-ZG-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":【SMZJ4012】取引事由判定ルーチンを"
      D             "CALLして、ワーク取引属性エリアを取得する。"
      *-----------------------------------------------------------------
      *---------- 【SMZJ4012】取引事由判定ルーチンをCALLして、ワーク取引属性エリアを取得する。
           INITIALIZE  PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TRHK-GROUP
             TO  TORI-JIYU                   OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-1
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4012-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引事由 =["
      D             TORI-JIYU                OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4012"               USING  PARM-SMZJ4012-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4012)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  正常 "
      *-----------------------------------------------------------------
      *----------  期間内取引.処理順決定評価←評価損益データフラグ
             MOVE  HYK-SNEKI-DATA-FLG        OF  PARM-SMZJ4012-ARG2
               TO  WK-SRJUN-KT-HYOKA         OF  WK-KIKAN-TRHK
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 評価損益データフラグ     =["
      D             HYK-SNEKI-DATA-FLG       OF  PARM-SMZJ4012-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.処理順決定評価=["
      D             WK-SRJUN-KT-HYOKA        OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  異常"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-031
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":期間内異動計算パターン.処理順序 =["
      D             SYRI-JUN              OF  WK-KKN-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
      *----------  期間内異動計算パターン.処理順序
           EVALUATE  SYRI-JUN                OF  WK-KKN-IDO-CALC-PATTERN
             WHEN  CNS-SYRI-JUN-1
             WHEN  CNS-SYRI-JUN-2
             WHEN  CNS-SYRI-JUN-5
             WHEN  CNS-SYRI-JUN-6
      *----------  期間内異動計算パターン.処理順序＝('1'or'2'or'5'or'6')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('1'or"
      D             "'2'or'5'or'6')の場合"
      D    DISPLAY  CNS-PGM-ID ":取引_1.取引事由            =["
      D             WK-TORI-JIYU             OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
      *----------  取引_1.取引事由
               EVALUATE  WK-TORI-JIYU        OF  WK-TRHK-GROUP
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(1)
      *----------  適用グループ(1).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(1).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-01
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(2)
      *----------  適用グループ(2).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(2).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-02
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(3)
      *----------  適用グループ(3).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(3).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-03
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(4)
      *----------  適用グループ(4).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(4).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-04
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(5)
      *----------  適用グループ(5).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(5).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-05
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(6)
      *----------  適用グループ(6).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(6).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-06
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(7)
      *----------  適用グループ(7).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(7).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-07
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(8)
      *----------  適用グループ(8).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(8).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-08
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(9)
      *----------  適用グループ(9).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(9).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-09
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(11)
      *----------  適用グループ(11).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(11).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-11
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(12)
      *----------  適用グループ(11).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(12).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-12
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(13)
      *----------  適用グループ(13).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(13).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-13
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(14)
      *----------  適用グループ(14).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(14).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-14
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(15)
      *----------  適用グループ(15).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(15).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-15
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(16)
      *----------  適用グループ(16).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(16).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-16
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(17)
      *----------  適用グループ(17).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(17).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-17
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(18)
      *----------  適用グループ(18).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(18).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-18
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(19)
      *----------  適用グループ(19).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(19).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-19
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
                 WHEN  OTHER
      *----------  上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上記以外の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-10
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-KIKAN-TRHK
               END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引_1.証券種別コード=["
      D             WK-SEC-SBT-CD            OF  WK-TRHK-GROUP"]"
      D    DISPLAY  CNS-PGM-ID":取引_1.取引事由            =["
      D             WK-TORI-JIYU             OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
               IF (WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-B     OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-DBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-FBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-CB    OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-WB    OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-CBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TRHK-GROUP
                =  CNS-SEC-SBT-CD-XMOB)
             AND  (WK-TORI-JIYU              OF  WK-TRHK-GROUP
                =  CNS-TORI-JIYU-MATU   OR
                   WK-TORI-JIYU              OF  WK-TRHK-GROUP
                =  CNS-TORI-JIYU-MATD)
               THEN
                 MOVE  ZERO
                   TO  WK-SRJUN-KT-TEKIYO    OF  WK-KIKAN-TRHK
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定摘要   =["
      D             WK-SRJUN-KT-TEKIYO       OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SYRI-JUN-3
             WHEN  CNS-SYRI-JUN-4
             WHEN  CNS-SYRI-JUN-7
             WHEN  CNS-SYRI-JUN-8
      *---------- 期間内異動計算パターン.処理順序＝('3'or'4'or'7'or'8')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('3'or"
      D             "'4'or'7'or'8')の場合"
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順=["
      D             ZOUGEN-TORI-JUN       OF  WK-KKN-IDO-CALC-PATTERN"]"
      D    DISPLAY  CNS-PGM-ID":  増減順相対物区分          "
      D       "=["  WK-ZOUGENJYUN-SOTAIBT-KBN"]"
      *-----------------------------------------------------------------
               IF  WK-ZOUGENJYUN-SOTAIBT-KBN  =  CNS-X-1
               THEN
                 MOVE  CNS-PLUS-00
                   TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定増減   =["
      D                WK-SRJUN-KT-ZOUGEN    OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  期間内異動計算パターン.増減取引順
                 EVALUATE  ZOUGEN-TORI-JUN   OF  WK-KKN-IDO-CALC-PATTERN
                   WHEN  CNS-PLUS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "'1':増加を先の場合"
      D    DISPLAY  CNS-PGM-ID":ワーク増減区分             =["
      D             WK-WK-ZG-KBN"]"
      *-----------------------------------------------------------------
      *----------  ワーク増減区分
                     IF  WK-WK-ZG-KBN  =  CNS-PLUS-1
                     THEN
      *----------  a)ワーク増減区分＝'1':増加の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク増減区分＝'1':増加の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-PLUS-01
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                     ELSE
      *----------  b)ワーク増減区分 上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":b)ワーク増減区分 上記以外の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-MINUS-02
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                     END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定増減   =["
      D             WK-SRJUN-KT-ZOUGEN       OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
                   WHEN  CNS-MINUS-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "'2':減少を先の場合"
      D    DISPLAY  CNS-PGM-ID":ワーク増減区分             =["
      D             WK-WK-ZG-KBN"]"
      *-----------------------------------------------------------------
      *----------  ワーク増減区分
                     IF  WK-WK-ZG-KBN  =  CNS-MINUS-2
                     THEN
      *----------  a)ワーク増減区分＝'2':減少の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク増減区分＝'2':減少の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-PLUS-01
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                     ELSE
      *----------  b)ワーク増減区分上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":b)ワーク増減区分上記以外の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-MINUS-02
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                     END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定増減   =["
      D                WK-SRJUN-KT-ZOUGEN    OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
                   WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "上記以外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                     MOVE  CNS-PGM-ID
                       TO  ERR-PGM-ID        OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                     MOVE  CNS-POS-032
                       TO  ERR-POS           OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                     MOVE  CNS-RTN-800
                       TO  RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                     MOVE  ZERO
                       TO  DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                     MOVE  CNS-DETAIL-0
                       TO  DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                     MOVE  SPACE
                       TO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                   PERFORM  ERR-RTN
                 END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引_1.証券種別コード=["
      D             WK-SEC-SBT-CD            OF  WK-TRHK-GROUP"]"
      D    DISPLAY  CNS-PGM-ID":取引_1.取引事由            =["
      D             WK-TORI-JIYU             OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
                 IF (WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-B     OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-DBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-FBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-CB    OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-WB    OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-CBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TRHK-GROUP
                  =  CNS-SEC-SBT-CD-XMOB)
               AND  (WK-TORI-JIYU            OF  WK-TRHK-GROUP
                  =  CNS-TORI-JIYU-MATU   OR
                     WK-TORI-JIYU            OF  WK-TRHK-GROUP
                  =  CNS-TORI-JIYU-MATD)
                 THEN
                   MOVE  ZERO
                     TO  WK-SRJUN-KT-ZOUGEN  OF  WK-KIKAN-TRHK
                 ELSE
                   CONTINUE
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内取引.処理順決定増減   =["
      D             WK-SRJUN-KT-ZOUGEN       OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序は上記以"
      D             "外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-033
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":【SMZJ4012】取引事由判定ルーチンを"
      D             "CALLして、ワーク取引属性エリアを取得する。"
      *-----------------------------------------------------------------
      *---------- 【SMZJ4012】取引事由判定ルーチンをCALLして、ワーク取引属性エリアを取得する。
           INITIALIZE  PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TRHK-GROUP
             TO  TORI-JIYU                   OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-2
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4012-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":取引事由 =["
      D             TORI-JIYU                OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4012"               USING  PARM-SMZJ4012-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4012)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  正常 "
      *-----------------------------------------------------------------
      *----------  期間内取引.未収計算対象フラグ←未収計算対象フラグ
             MOVE  MSKS-TARGET-FLG           OF  PARM-SMZJ4012-ARG2
               TO  WK-MSKS-TARGET-FLG        OF  WK-KIKAN-TRHK
      *----------  期間内取引.未収計算種類←未収計算種類
             MOVE  MSKS-SHRU                 OF  PARM-SMZJ4012-ARG2
               TO  WK-MSKS-SHRU              OF  WK-KIKAN-TRHK
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 評価損益データフラグ         =["
      D             MSKS-TARGET-FLG          OF  PARM-SMZJ4012-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.未収計算対象フラグ=["
      D             WK-MSKS-TARGET-FLG       OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ": 未収計算種類                 =["
      D             MSKS-SHRU                OF  PARM-SMZJ4012-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.未収計算種類      =["
      D             WK-MSKS-SHRU             OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
             IF  MSKS-SHRU                   OF  PARM-SMZJ4012-ARG2
              =  CNS-MSKS-SHRU-31
             THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID":  証券種別コード          "
      D       "=["  WK-SEC-SBT-CD            OF  WK-TKMZBW03 "]"
      *-----------------------------------------------------------------
               IF  WK-SEC-SBT-CD             OF  WK-TKMZBW03
                =  CNS-SEC-SBT-CD-CALL OR
                   CNS-SEC-SBT-CD-DA   OR
                   CNS-SEC-SBT-CD-NCD  OR
                   CNS-SEC-SBT-CD-XMOC OR
                   CNS-SEC-SBT-CD-FDAL OR
                   CNS-SEC-SBT-CD-CASH
               THEN
                 CONTINUE
               ELSE
      *----------  期間内取引.未収計算対象フラグ←未収計算対象フラグ
                 MOVE  SPACE
                   TO  WK-MSKS-TARGET-FLG    OF  WK-KIKAN-TRHK
      *----------  期間内取引.未収計算種類←未収計算種類
                 MOVE  SPACE
                   TO  WK-MSKS-SHRU          OF  WK-KIKAN-TRHK
               END-IF
             ELSE
               CONTINUE
             END-IF
             IF  MSKS-SHRU                   OF  PARM-SMZJ4012-ARG2
              =  CNS-MSKS-SHRU-32
             THEN
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID":  証券種別コード          "
      D       "=["  WK-SEC-SBT-CD            OF  WK-TKMZBW03 "]"
      *-----------------------------------------------------------------
               IF  (WK-SEC-SBT-CD            OF  WK-TKMZBW03
                =   CNS-SEC-SBT-CD-CALL OR
                    WK-SEC-SBT-CD            OF  WK-TKMZBW03
                =   CNS-SEC-SBT-CD-DA)  AND
                    WK-UKE-END-YMD           OF  WK-TRHK-GROUP  NOT
                =   ZERO
               THEN
                 CONTINUE
               ELSE
      *----------  期間内取引.未収計算対象フラグ←未収計算対象フラグ
                 MOVE  SPACE
                   TO  WK-MSKS-TARGET-FLG    OF  WK-KIKAN-TRHK
      *----------  期間内取引.未収計算種類←未収計算種類
                 MOVE  SPACE
                   TO  WK-MSKS-SHRU          OF  WK-KIKAN-TRHK
               END-IF
             ELSE
               CONTINUE
             END-IF
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.未収計算対象フラグ=["
      D             WK-MSKS-TARGET-FLG       OF  WK-KIKAN-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ": 期間内取引.未収計算種類      =["
      D             WK-MSKS-SHRU             OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  異常"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-034
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (五)対象取引項目編集処理"
      D             "  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TARGET-TORI2-EXT.
           EXIT.
      ******************************************************************
      *        3)『取引_1』カーソルクローズ処理
      ******************************************************************
      * TKMXTR00-CLOSE2-RTN    SECTION.
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID ":****  3)『取引_1』カーソルクローズ処理"
      *D             "  START  ****"
      **-----------------------------------------------------------------
      *     EXEC  SQL
      *       CLOSE TKMXTR00_CURSOR_2
      *     END-EXEC
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY CNS-PGM-ID":CLOSE SQLCODE               =["SQLCODE"]"
      **-------------------<DEBUG>---------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      **----------  取引_1カーソルオープンフラグ-2
      *       MOVE  CNS-OFF              TO  FLG-TKMXTR00-CR-1-2
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-1-2         =["
      *D            FLG-TKMXTR00-CR-1-2 "]"
      **-----------------------------------------------------------------
      *     ELSE
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"
      **-------------------<DEBUG>---------------------------------------
      **----------  エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *       MOVE  CNS-POS-035
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      **---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *                 WK-MSG-1-2       DELIMITED  BY SIZE
      *         INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID ":****  3)『取引_1』カーソルクローズ処理"
      *D             "  END  ****"
      **-----------------------------------------------------------------
      *     CONTINUE.
      * TKMXTR00-CLOSE2-EXT.
      *     EXIT.
      ******************************************************************
      *    DATA-EDIT-RTN
      ******************************************************************
       DATA-EDIT-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DATA-EDIT-RTN  START ***"
      *-----------------------------------------------------------------
           COMPUTE  H-CNT1 = H-CNT1 + CNS-1
      *----ＳＱＬ文
           INITIALIZE         H-TKMZBW18-TBL(H-CNT1)
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-TKMZBW02
             TO  H-SYORI-YMD            OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-TKMZBW02
             TO  H-KIDOU-ID             OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TRHK-GROUP
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  原取引ID
           MOVE  WK-TORI-ID             OF  WK-TRHK-GROUP
             TO  H-TORI-ID              OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  決済口座番号
           MOVE  WK-MEG-CD              OF  WK-TRHK-GROUP
             TO  H-KS-KOZA-NO           OF  H-TKMZBW18-TBL(H-CNT1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":ワーク取引.取引事由   =["
      D            WK-TORI-JIYU         OF  WK-TRHK-GROUP"]"
      *-----------------------------------------------------------------
      *----------  資金種別
           EVALUATE  WK-TORI-JIYU       OF  WK-TRHK-GROUP
           WHEN  CNS-TORI-JIYU-FTPU
           WHEN  CNS-TORI-JIYU-FTLR
           WHEN  CNS-TORI-JIYU-FTSG
             MOVE  CNS-SIKIN-SBT-A
               TO  H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  CNS-TORI-JIYU-FTLU
           WHEN  CNS-TORI-JIYU-FTPR
           WHEN  CNS-TORI-JIYU-FTSL
             MOVE  CNS-SIKIN-SBT-B
               TO  H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  CNS-TORI-JIYU-FTCU
             MOVE  CNS-SIKIN-SBT-C
               TO  H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  CNS-TORI-JIYU-FTCR
             MOVE  CNS-SIKIN-SBT-D
               TO  H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  CNS-TORI-JIYU-FTPS
           WHEN  CNS-TORI-JIYU-FTLT
             MOVE  CNS-SIKIN-SBT-E
               TO  H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  CNS-TORI-JIYU-FTLS
           WHEN  CNS-TORI-JIYU-FTPT
             MOVE  CNS-SIKIN-SBT-F
               TO  H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  CNS-TORI-JIYU-FTPB
           WHEN  CNS-TORI-JIYU-FTLC
             MOVE  CNS-SIKIN-SBT-G
               TO  H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  CNS-TORI-JIYU-FTLB
           WHEN  CNS-TORI-JIYU-FTPC
             MOVE  CNS-SIKIN-SBT-H
               TO  H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  OTHER
             CONTINUE
           END-EVALUATE
      *----------  異動日
           MOVE  WK-UKE-YMD             OF  WK-TRHK-GROUP
             TO  H-IDO-YMD              OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  増減区分
           EVALUATE  WK-TORI-JIYU       OF  WK-TRHK-GROUP
           WHEN  CNS-TORI-JIYU-FTPU
           WHEN  CNS-TORI-JIYU-FTLR
           WHEN  CNS-TORI-JIYU-FTCU
           WHEN  CNS-TORI-JIYU-FTSG
           WHEN  CNS-TORI-JIYU-FTPS
           WHEN  CNS-TORI-JIYU-FTLT
           WHEN  CNS-TORI-JIYU-FTLB
           WHEN  CNS-TORI-JIYU-FTPC
             MOVE  CNS-ZG-KBN-1
               TO  H-ZG-KBN             OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  CNS-TORI-JIYU-FTLU
           WHEN  CNS-TORI-JIYU-FTPR
           WHEN  CNS-TORI-JIYU-FTCR
           WHEN  CNS-TORI-JIYU-FTSL
           WHEN  CNS-TORI-JIYU-FTLS
           WHEN  CNS-TORI-JIYU-FTPT
           WHEN  CNS-TORI-JIYU-FTPB
           WHEN  CNS-TORI-JIYU-FTLC
             MOVE  CNS-ZG-KBN-2
               TO  H-ZG-KBN             OF  H-TKMZBW18-TBL(H-CNT1)
           WHEN  OTHER
             CONTINUE
           END-EVALUATE
      *----------  決済口座通貨コード
           MOVE  WK-SIJO-TUKA-CD        OF  WK-TRHK-GROUP
             TO  H-KOZA-TUKA-CD         OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TRHK-GROUP
             TO  H-FUND-CD              OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TRHK-GROUP
             TO  H-PTF-CD               OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TRHK-GROUP
             TO  H-SEC-SBT-CD           OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TRHK-GROUP
             TO  H-MEG-CD               OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD        OF  WK-TRHK-GROUP
             TO  H-SIJO-TUKA-CD         OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  取引連関ＩＤ
           MOVE  WK-THRK-ID             OF  WK-TRHK-GROUP
             TO  H-THRK-ID              OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  入力管理ＩＤ
           MOVE  WK-NRKR-ID             OF  WK-TRHK-GROUP
             TO  H-NRKR-ID              OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  削除区分
           MOVE  WK-SAKUJO-KBN          OF  WK-TRHK-GROUP
             TO  H-SAKUJO-KBN           OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  赤黒区分
           MOVE  WK-AKA-KBN             OF  WK-TRHK-GROUP
             TO  H-AKA-KBN              OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  取引内容
           MOVE  WK-TORI-NAIY           OF  WK-TRHK-GROUP
             TO  H-TORI-NAIY            OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  取引事由
           MOVE  WK-TORI-JIYU           OF  WK-TRHK-GROUP
             TO  H-TORI-JIYU            OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  決済通貨異動額
           MOVE  WK-S-KSG-G-YJKG        OF  WK-TRHK-GROUP
             TO  H-KSTK-IDOG            OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  運用通貨異動額
           MOVE  WK-U-KSG-G-YJKG        OF  WK-TRHK-GROUP
             TO  H-UYTK-IDOG            OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  異動確定区分
           MOVE  WK-IDO-KBN             OF  WK-TRHK-GROUP
             TO  H-IDO-KBN              OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW18-TBL(H-CNT1)
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  H-UPD-PGMID            OF  H-TKMZBW18-TBL(H-CNT1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日                   =["
      D            H-SYORI-YMD          OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":起動ID                       =["
      D            H-KIDOU-ID           OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            H-TORI-ID            OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":決済口座番号                 =["
      D            H-KS-KOZA-NO         OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":資金種別                     =["
      D            H-SIKIN-SBT          OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":異動日                       =["
      D            H-IDO-YMD            OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":増減区分                     =["
      D            H-ZG-KBN             OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":決済口座通貨コード           =["
      D            H-KOZA-TUKA-CD       OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD            OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD             OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            H-SEC-SBT-CD         OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード                   =["
      D            H-MEG-CD             OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":市場通貨コード               =["
      D            H-SIJO-TUKA-CD       OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":取引連関ＩＤ                 =["
      D            H-THRK-ID            OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":入力管理ＩＤ                 =["
      D            H-NRKR-ID            OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":削除区分                     =["
      D            H-SAKUJO-KBN         OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":赤黒区分                     =["
      D            H-AKA-KBN            OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":取引内容                     =["
      D            H-TORI-NAIY          OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":取引事由                     =["
      D            H-TORI-JIYU          OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":決済通貨異動額               =["
      D            H-KSTK-IDOG          OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":運用通貨異動額               =["
      D            H-UYTK-IDOG          OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":異動確定区分                 =["
      D            H-IDO-KBN            OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード =["
      D            H-UPD-LOGIN-CMP-CD   OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":更新プログラムＩＤ           =["
      D            H-UPD-PGMID          OF  H-TKMZBW18-TBL(H-CNT1)"]"
      D    DISPLAY  CNS-PGM-ID":***  DATA-EDIT-RTN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    INSERT-SQL作成PREPARE処理
      ******************************************************************
       INSERT-PREPARE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT-PREPARE-RTN  START  *****"
      *-----------------------------------------------------------------
      *    INITIALIZE         SQLSTMT                                   @3212SEINO@@
           INITIALIZE         SQLSTMT10                                 @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW18      TO  SQL-TBL-ID-10
      *----ＳＱＬ文
      *    MOVE  SQL-INSERT-1-10        TO  SQLSTMT                     @3212SEINO@@
           MOVE  SQL-INSERT-1-10        TO  SQLSTMT10                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"                   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT10=["SQLSTMT10"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW18-S10-INSERT=["              @3212SEINO@@
      D                         FLG-TKMZBW18-S10-INSERT"]"              @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW18-S10-INSERT = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC SQL PREPARE S10 FROM :SQLSTMT END-EXEC                @3212SEINO@@
             EXEC SQL PREPARE S10 FROM :SQLSTMT10 END-EXEC              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  NOT = CNS-SQL-NORMAL
             THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS-1
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       S-INSERT-1-10,
                       WK-MSG-1-10        DELIMITED  BY SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT-PREPARE-RTN  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       INSERT-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    DATA-INSERT-RTN
      ******************************************************************
       DATA-INSERT-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA-INSERT-RTN  START "
      *-----------------------------------------------------------------
           EXEC SQL FOR :H-CNT1
           EXECUTE S10
                 USING :H-TKMZBW18-TBL
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(EXECUTE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW18-S10-INSERT     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID"FLG-TKMZBW18-S10-INSERT=["
      D                        FLG-TKMZBW18-S10-INSERT"]"
      *-----------------------------------------------------------------
      *----------  件数清零
               INITIALIZE  H-CNT1
                           H-TKMZBW18-BULK
             WHEN  CNS-SQL-UNIQUE
               MOVE  SQLERRD(3)      TO  WK-COUNT-TMP
               COMPUTE  WK-ERR-KENSU  =  WK-COUNT-TMP + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-ERR-KENSU=["WK-ERR-KENSU"]"
      *-----------------------------------------------------------------
               INITIALIZE   WK-MSG-1-10
      *----------  処理実行日
               MOVE  H-SYORI-YMD        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SYORI-YMD       OF  WK-MSG-1-10
      *----------  起動ID
               MOVE  H-KIDOU-ID         OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-KIDOU-ID        OF  WK-MSG-1-10
      *----------  利用会社コード
               MOVE  H-RIYO-CMP-CD      OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-RIYO-CMP-CD     OF  WK-MSG-1-10
      *----------  原取引ID
               MOVE  H-TORI-ID          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-ID         OF  WK-MSG-1-10
      *----------  決済口座番号
               MOVE  H-KS-KOZA-NO       OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-KS-KOZA-NO      OF  WK-MSG-1-10
      *----------  資金種別
               MOVE  H-SIKIN-SBT        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SIKIN-SBT       OF  WK-MSG-1-10
      *----------  異動日
               MOVE  H-IDO-YMD          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-IDO-YMD         OF  WK-MSG-1-10
      *----------  増減区分
               MOVE  H-ZG-KBN           OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-ZG-KBN          OF  WK-MSG-1-10
      *----------  決済口座通貨コード
               MOVE  H-KOZA-TUKA-CD     OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-KOZA-TUKA-CD    OF  WK-MSG-1-10
      *----------  ファンドコード
               MOVE  H-FUND-CD          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-FUND-CD         OF  WK-MSG-1-10
      *----------  ポートフォリオコード
               MOVE  H-PTF-CD           OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-PTF-CD          OF  WK-MSG-1-10
      *----------  証券種別コード
               MOVE  H-SEC-SBT-CD       OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SEC-SBT-CD      OF  WK-MSG-1-10
      *----------  銘柄コード
               MOVE  H-MEG-CD           OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-MEG-CD          OF  WK-MSG-1-10
      *----------  市場通貨コード
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SIJO-TUKA-CD    OF  WK-MSG-1-10
      *----------  取引連関ＩＤ
               MOVE  H-THRK-ID          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-THRK-ID         OF  WK-MSG-1-10
      *----------  入力管理ＩＤ
               MOVE  H-NRKR-ID          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-NRKR-ID         OF  WK-MSG-1-10
      *----------  削除区分
               MOVE  H-SAKUJO-KBN       OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SAKUJO-KBN      OF  WK-MSG-1-10
      *----------  赤黒区分
               MOVE  H-AKA-KBN          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-AKA-KBN         OF  WK-MSG-1-10
      *----------  取引内容
               MOVE  H-TORI-NAIY        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-NAIY       OF  WK-MSG-1-10
      *----------  取引事由
               MOVE  H-TORI-JIYU        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-JIYU       OF  WK-MSG-1-10
      *----------  決済通貨異動額
               MOVE  H-KSTK-IDOG        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-KSTK-IDOG       OF  WK-MSG-1-10
      *----------  運用通貨異動額
               MOVE  H-UYTK-IDOG        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-UYTK-IDOG       OF  WK-MSG-1-10
      *----------  異動確定区分
               MOVE  H-IDO-KBN          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-IDO-KBN         OF  WK-MSG-1-10
      *----------  更新ログインユーザ会社コード
               MOVE  H-UPD-LOGIN-CMP-CD OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-10
      *----------  更新プログラムＩＤ
               MOVE  H-UPD-PGMID        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-UPD-PGMID       OF  WK-MSG-1-10
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS-2
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     S-INSERT-1-10,
                     WK-MSG-1-10             DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
               MOVE  SQLERRD(3)      TO  WK-COUNT-TMP
               COMPUTE   WK-ERR-KENSU = WK-COUNT-TMP + CNS-1
               INITIALIZE   WK-MSG-1-10
      *----------  処理実行日
               MOVE  H-SYORI-YMD        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SYORI-YMD       OF  WK-MSG-1-10
      *----------  起動ID
               MOVE  H-KIDOU-ID         OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-KIDOU-ID        OF  WK-MSG-1-10
      *----------  利用会社コード
               MOVE  H-RIYO-CMP-CD      OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-RIYO-CMP-CD     OF  WK-MSG-1-10
      *----------  原取引ID
               MOVE  H-TORI-ID          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-ID         OF  WK-MSG-1-10
      *----------  決済口座番号
               MOVE  H-KS-KOZA-NO       OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-KS-KOZA-NO      OF  WK-MSG-1-10
      *----------  資金種別
               MOVE  H-SIKIN-SBT        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SIKIN-SBT       OF  WK-MSG-1-10
      *----------  異動日
               MOVE  H-IDO-YMD          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-IDO-YMD         OF  WK-MSG-1-10
      *----------  増減区分
               MOVE  H-ZG-KBN           OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-ZG-KBN          OF  WK-MSG-1-10
      *----------  決済口座通貨コード
               MOVE  H-KOZA-TUKA-CD     OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-KOZA-TUKA-CD    OF  WK-MSG-1-10
      *----------  ファンドコード
               MOVE  H-FUND-CD          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-FUND-CD         OF  WK-MSG-1-10
      *----------  ポートフォリオコード
               MOVE  H-PTF-CD           OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-PTF-CD          OF  WK-MSG-1-10
      *----------  証券種別コード
               MOVE  H-SEC-SBT-CD       OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SEC-SBT-CD      OF  WK-MSG-1-10
      *----------  銘柄コード
               MOVE  H-MEG-CD           OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-MEG-CD          OF  WK-MSG-1-10
      *----------  市場通貨コード
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SIJO-TUKA-CD    OF  WK-MSG-1-10
      *----------  取引連関ＩＤ
               MOVE  H-THRK-ID          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-THRK-ID         OF  WK-MSG-1-10
      *----------  入力管理ＩＤ
               MOVE  H-NRKR-ID          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-NRKR-ID         OF  WK-MSG-1-10
      *----------  削除区分
               MOVE  H-SAKUJO-KBN       OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-SAKUJO-KBN      OF  WK-MSG-1-10
      *----------  赤黒区分
               MOVE  H-AKA-KBN          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-AKA-KBN         OF  WK-MSG-1-10
      *----------  取引内容
               MOVE  H-TORI-NAIY        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-NAIY       OF  WK-MSG-1-10
      *----------  取引事由
               MOVE  H-TORI-JIYU        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-TORI-JIYU       OF  WK-MSG-1-10
      *----------  決済通貨異動額
               MOVE  H-KSTK-IDOG        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-KSTK-IDOG       OF  WK-MSG-1-10
      *----------  運用通貨異動額
               MOVE  H-UYTK-IDOG        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-UYTK-IDOG       OF  WK-MSG-1-10
      *----------  異動確定区分
               MOVE  H-IDO-KBN          OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-IDO-KBN         OF  WK-MSG-1-10
      *----------  更新ログインユーザ会社コード
               MOVE  H-UPD-LOGIN-CMP-CD OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-UPD-LOGIN-CMP-CD    OF  WK-MSG-1-10
      *----------  更新プログラムＩＤ
               MOVE  H-UPD-PGMID        OF  H-TKMZBW18-TBL(WK-ERR-KENSU)
                 TO  WK-UPD-PGMID       OF  WK-MSG-1-10
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS-3
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     S-INSERT-1-10,
                     WK-MSG-1-10             DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA-INSERT-RTN  END "
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-INSERT-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2 跨ぎ取引処理
      ******************************************************************
       MATAGI-TRHK-RTN        SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  3.2.2跨ぎ取引処理  START  ****"
      *-----------------------------------------------------------------
      *----------  3.2.2.1 跨ぎ取引を取得する
      *----------  1)取引TBLから処理対象のレコードを取得する
           PERFORM  TKMXTR00-GET3-RTN
      *----------  2)『取引_2』カーソルフェッチする
           MOVE  CNS-ON                      TO  FLG-TKMXTR00-FE-2
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MATAGI-TRHK-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMXTR00-FETCH3-RTN
             UNTIL  FLG-TKMXTR00-FE-2   =  CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MATAGI-TRHK-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  3)『取引_2』カーソルクローズ処理
      ***  PERFORM  TKMXTR00-CLOSE3-RTN                                 @3212SEINO@@
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  3.2.2跨ぎ取引処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       MATAGI-TRHK-EXT.
           EXIT.
      ******************************************************************
      *        1)取引TBLから処理対象のレコードを取得する
      ******************************************************************
       TKMXTR00-GET3-RTN      SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  1)取引TBLから処理対象のレコード"
      D             "を取得する  START  ****"
      *-----------------------------------------------------------------
      *    INITIALIZE                   SQLSTMT                         @3212SEINO@@
           INITIALIZE                   SQLSTMT04                       @3212SEINO@@
           MOVE  WK-TABLE-TKMXTR00      TO  SQL-TBL-ID-4
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMXTR00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-4
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMXTR00-S,
                 WK-FUND-CD-1           OF  WK-MSG-1-4,
                 WK-FUND-CD-2           OF  WK-MSG-1-4
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMXTR00-S,
                 WK-PTF-CD              OF  WK-MSG-1-4
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD           OF  H-TKMXTR00-S,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-4
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-MEG-CD               OF  H-TKMXTR00-S,
                 WK-MEG-CD              OF  WK-MSG-1-4
           IF  WK-SEC-SBT-CD            OF  WK-TKMZBW03
             = CNS-SEC-SBT-CD-CASH OR
               CNS-SEC-SBT-CD-MAR OR
               CNS-SEC-SBT-CD-MABF OR
               CNS-SEC-SBT-CD-MABO OR
               CNS-SEC-SBT-CD-MAB OR
               CNS-SEC-SBT-CD-MAFB OR
               CNS-SEC-SBT-CD-MASF OR
               CNS-SEC-SBT-CD-MASO OR
               CNS-SEC-SBT-CD-MAS OR
               CNS-SEC-SBT-CD-MAFS
           THEN
      *----------  証券種別フラグ
             MOVE  CNS-0
               TO  H-SEC-SBT-FLG        OF  H-TKMXTR00-S,
                   WK-SEC-SBT-FLG-0     OF  WK-MSG-1-4,
                   WK-SEC-SBT-FLG-1     OF  WK-MSG-1-4
           ELSE
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-TKMZBW03
               TO  H-TATE-FLG           OF  H-TKMXTR00-S,
                   WK-TATE-FLG          OF  WK-MSG-1-4
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-TKMZBW03
               TO  H-GYOKU-ID           OF  H-TKMXTR00-S,
                   WK-GYOKU-ID          OF  WK-MSG-1-4
      *----------  証券種別フラグ
             MOVE  CNS-1
               TO  H-SEC-SBT-FLG        OF  H-TKMXTR00-S,
                   WK-SEC-SBT-FLG-0     OF  WK-MSG-1-4,
                   WK-SEC-SBT-FLG-1     OF  WK-MSG-1-4
           END-IF
      *----------  開始基準日翌日
           MOVE  WK-KJN-YMD-TOM
             TO  H-HST-KJN-YMD-TOM,
                 WK-TOM-1               OF  WK-MSG-1-4,
                 WK-TOM-2               OF  WK-MSG-1-4
      *----ＳＱＬ文
      *    MOVE  SQL-SELECT-1-4         TO  SQLSTMT                     @3212SEINO@@
           MOVE  SQL-SELECT-1-4         TO  SQLSTMT04                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD        OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD            OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD             OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            H-SEC-SBT-CD         OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード                   =["
      D            H-MEG-CD             OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ     =["
      D            H-TATE-FLG           OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":玉ID                         =["
      D            H-GYOKU-ID           OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":証券種別フラグ=["
      D            H-SEC-SBT-FLG       OF  H-TKMXTR00-S"]"
      D    DISPLAY CNS-PGM-ID":開始基準日翌日               =["
      D            H-HST-KJN-YMD-TOM"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT            =["SQLSTMT"]"        @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT04           =["SQLSTMT04"]"      @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-MSG-1-4         =["WK-MSG-1-4"]"
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-2 =["FLG-TKMXTR00-CR-2"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMXTR00-CR-2 = CNS-OFF                              @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC  SQL  PREPARE  S3  FROM :SQLSTMT  END-EXEC            @3212SEINO@@
             EXEC  SQL  PREPARE  S3  FROM :SQLSTMT04  END-EXEC          @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE    =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 CONTINUE
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-036
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-4              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
             EXEC
               SQL  DECLARE  TKMXTR00_CURSOR_3 CURSOR FOR  S3
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE    =["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMXTR00_CURSOR_3
                 USING :H-TKMXTR00-S.H-RIYO-CMP-CD,
                       :H-TKMXTR00-S.H-FUND-CD,
                       :H-TKMXTR00-S.H-PTF-CD,
                       :H-TKMXTR00-S.H-FUND-CD,
                       :H-TKMXTR00-S.H-SEC-SBT-CD,
                       :H-TKMXTR00-S.H-MEG-CD,
                       :H-TKMXTR00-S.H-TATE-FLG,
                       :H-TKMXTR00-S.H-GYOKU-ID,
                       :H-TKMXTR00-S.H-SEC-SBT-FLG,
                       :H-TKMXTR00-S.H-SEC-SBT-FLG,
                       :H-HST-KJN-YMD-TOM,
                       :H-HST-KJN-YMD-TOM
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN      =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  取引_1カーソルオープンフラグ
               MOVE  CNS-ON             TO  FLG-TKMXTR00-CR-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-2  =["
      D            FLG-TKMXTR00-CR-2 "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-037
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  1)取引TBLから処理対象のレコード"
      D             "を取得する  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-GET3-EXT.
           EXIT.
      ******************************************************************
      *        2)『取引_2』カーソルフェッチする
      ******************************************************************
       TKMXTR00-FETCH3-RTN    SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『取引_2』カーソルフェッチする"
      D             "  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  H-TORI-ID        OF  H-TKMXTR00-3
                       H-YKJ-YMD        OF  H-TKMXTR00-3
                       H-UKE-YMD        OF  H-TKMXTR00-3
                       H-DUMMY-KBN      OF  H-TKMXTR00-3
                       H-TORI-JIYU      OF  H-TKMXTR00-3
                       H-G-U-KWS1       OF  H-TKMXTR00-3
                       H-G-U-KWS2       OF  H-TKMXTR00-3
                       H-KKRS-KWS       OF  H-TKMXTR00-3
                       H-SEC-SBT-CD     OF  H-TKMXTR00-3
           EXEC  SQL
               FETCH
                    TKMXTR00_CURSOR_3
               INTO :H-TKMXTR00-3.H-TORI-ID,
                    :H-TKMXTR00-3.H-YKJ-YMD,
                    :H-TKMXTR00-3.H-UKE-YMD,
                    :H-TKMXTR00-3.H-DUMMY-KBN,
                    :H-TKMXTR00-3.H-TORI-JIYU,
                    :H-TKMXTR00-3.H-G-U-KWS1,
                    :H-TKMXTR00-3.H-G-U-KWS2,
                    :H-TKMXTR00-3.H-KKRS-KWS,
                    :H-TKMXTR00-3.H-SEC-SBT-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-OFF                   TO  FLG-NEXT-FETCH
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["
      D            FLG-NEXT-FETCH"]"
      *-----------------------------------------------------------------
      *----------  原取引ID
               MOVE  H-TORI-ID                 OF  H-TKMXTR00-3
                 TO  WK-TORI-ID                OF  WK-TKMXTR00-2
      *----------  約定日
               MOVE  H-YKJ-YMD                 OF  H-TKMXTR00-3
                 TO  WK-YKJ-YMD                OF  WK-TKMXTR00-2
      *----------  受渡日
               MOVE  H-UKE-YMD                 OF  H-TKMXTR00-3
                 TO  WK-UKE-YMD                OF  WK-TKMXTR00-2
      *----------  ダミー区分
               MOVE  H-DUMMY-KBN               OF  H-TKMXTR00-3
                 TO  WK-DUMMY-KBN              OF  WK-TKMXTR00-2
      *----------  取引事由
               MOVE  H-TORI-JIYU               OF  H-TKMXTR00-3
                 TO  WK-TORI-JIYU              OF  WK-TKMXTR00-2
      *----------  為替レート（現地／運用）１
               MOVE  H-G-U-KWS1                OF  H-TKMXTR00-3
                 TO  WK-G-U-KWS1               OF  WK-TKMXTR00-2
      *----------  為替レート（現地／運用）２
               MOVE  H-G-U-KWS2                OF  H-TKMXTR00-3
                 TO  WK-G-U-KWS2               OF  WK-TKMXTR00-2
      *----------  経過利息為替レート
               MOVE  H-KKRS-KWS                OF  H-TKMXTR00-3
                 TO  WK-KKRS-KWS               OF  WK-TKMXTR00-2
      *----------  証券種別コード
               MOVE  H-SEC-SBT-CD              OF  H-TKMXTR00-3
                 TO  WK-SEC-SBT-CD             OF  WK-TKMXTR00-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            WK-TORI-ID                  OF  WK-TKMXTR00-2"]"
      D    DISPLAY CNS-PGM-ID":約定日                       =["
      D            WK-YKJ-YMD                  OF  WK-TKMXTR00-2"]"
      D    DISPLAY CNS-PGM-ID":受渡日                       =["
      D            WK-UKE-YMD                  OF  WK-TKMXTR00-2"]"
      D    DISPLAY CNS-PGM-ID":ダミー区分                   =["
      D            WK-DUMMY-KBN                OF  WK-TKMXTR00-2"]"
      D    DISPLAY CNS-PGM-ID":取引事由                     =["
      D            WK-TORI-JIYU                OF  WK-TKMXTR00-2"]"
      D    DISPLAY CNS-PGM-ID":為替レート（現地／運用）１   =["
      D            WK-G-U-KWS1                 OF  WK-TKMXTR00-2"]"
      D    DISPLAY CNS-PGM-ID":為替レート（現地／運用）２   =["
      D            WK-G-U-KWS2                 OF  WK-TKMXTR00-2"]"
      D    DISPLAY CNS-PGM-ID":経過利息為替レート           =["
      D            WK-KKRS-KWS                 OF  WK-TKMXTR00-2"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            WK-SEC-SBT-CD               OF  WK-TKMXTR00-2"]"
      *-----------------------------------------------------------------
      *----------  (一)【SMZJ4018】約定レート未入力判定ルーチンをCALL
      *            して、計算フラグと警告区分を取得する
               PERFORM  SMZJ4018-CALL2-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["
      D            FLG-NEXT-FETCH"]"
      *-----------------------------------------------------------------
               IF  FLG-NEXT-FETCH = CNS-ON
               THEN
                 CONTINUE
               ELSE
      *----------  (三)跨ぎ取引的設定
                 PERFORM  MATAGI-TRHK-SET-RTN
               END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["
      D            FLG-NEXT-FETCH"]"
      *-----------------------------------------------------------------
               IF  FLG-NEXT-FETCH = CNS-ON
               THEN
                 CONTINUE
               ELSE
      *----------  (四) 跨ぎ基本会計ベースフラグを取得する
                 PERFORM  MATAGI-KH-FLG-RTN
      *----------  (五) 跨ぎ異動計算パターンを取得する
                 PERFORM  MATAGI-IDO-CALC-RTN
      *----------  (六) 処理順決定を設定する
                 PERFORM  SRJUN-KT-SET-RTN
      *----------  (七) 跨ぎ取引処理パターンを決定する
                 PERFORM  MATAGI-KT-RTN
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *----------  取引_2カーソルオープンフラグ
               MOVE  CNS-OFF                   TO  FLG-TKMXTR00-FE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-FE-2          =["
      D            FLG-TKMXTR00-FE-2 "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-038
                 TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『取引_2』カーソルフェッチする"
      D             "  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-FETCH3-EXT.
           EXIT.
      ******************************************************************
      *        3)『取引_2』カーソルクローズ処理
      ******************************************************************
      * TKMXTR00-CLOSE3-RTN    SECTION.
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID ":****  3)『取引_2』カーソルクローズ処理"
      *D             "  START  ****"
      **-----------------------------------------------------------------
      *     EXEC  SQL
      *       CLOSE TKMXTR00_CURSOR_3
      *     END-EXEC
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY CNS-PGM-ID":CLOSE SQLCODE               =["SQLCODE"]"
      **-------------------<DEBUG>---------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      **----------  取引_2カーソルオープンフラグ
      *       MOVE  CNS-OFF              TO  FLG-TKMXTR00-CR-2
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-2           =["
      *D            FLG-TKMXTR00-CR-2 "]"
      **-----------------------------------------------------------------
      *       CONTINUE
      *     ELSE
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"
      **-------------------<DEBUG>---------------------------------------
      **----------  エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *       MOVE  CNS-POS-039
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      **---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-4              DELIMITED  BY SIZE
      *         INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID ":****  3)『取引_2』カーソルクローズ処理"
      *D             "  END  ****"
      **-----------------------------------------------------------------
      *     CONTINUE.
      * TKMXTR00-CLOSE3-EXT.
      *     EXIT.
      ******************************************************************
      *      (一)【SMZJ4018】約定レート未入力判定ルーチンをCALLして、
      *      計算フラグと警告区分を取得する
      ******************************************************************
       SMZJ4018-CALL2-RTN     SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (一)【SMZJ4018】約定レート未入"
      D    "力判定ルーチンをCALLして、計算フラグと警告区分を取得"
      D    "  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ4018-INOUT
      *---------- 約定レート
           MOVE  WK-G-U-KWS1            OF  WK-TKMXTR00-2
             TO  YKJ-RT                 OF  PARM-SMZJ4018-ARG1
      *---------- 決済レート
           MOVE  WK-G-U-KWS2            OF  WK-TKMXTR00-2
             TO  KESSAI-RETO            OF  PARM-SMZJ4018-ARG1
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  RIYO-CMP-CD            OF  PARM-SMZJ4018-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":約定レート                 =["
      D             YKJ-RT              OF  PARM-SMZJ4018-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":決済レート                 =["
      D             KESSAI-RETO         OF  PARM-SMZJ4018-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":取引.利用会社コード        =["
      D             RIYO-CMP-CD         OF  PARM-SMZJ4018-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":取引.取引事由              =["
      D             TORI-JIYU           OF  PARM-SMZJ4018-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":取引.取引連関ＩＤ          =["
      D             THRK-ID             OF  PARM-SMZJ4018-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SMZJ4018"             USING  PARM-SMZJ4018-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SMZJ4018)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG          =["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":計算フラグ           =["
      D             CALC-FLG            OF  PARM-SMZJ4018-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ":警告区分             =["
      D             WARN-KBN            OF  PARM-SMZJ4018-ARG2"]"
      *-----------------------------------------------------------------
             IF  CALC-FLG OF PARM-SMZJ4018-ARG2 = CNS-CALC-FLG-1
             THEN
               IF  WARN-KBN OF PARM-SMZJ4018-ARG2 = CNS-WARN-KBN-1
               THEN
      *----------  警告フラグ(1)
                 MOVE  CNS-WARN-FLG-1
                   TO  WARN-FLG-1         OF  PARM-SMZJ1810-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":警告フラグ(1)           =["
      D             WARN-FLG-1          OF  PARM-SMZJ1810-ARG2"]"
      *-----------------------------------------------------------------
               ELSE
                 CONTINUE
               END-IF
             ELSE
               IF  WARN-KBN OF PARM-SMZJ4018-ARG2 = CNS-WARN-KBN-2
               THEN
      *----------  警告フラグ(2)
                 MOVE  CNS-WARN-FLG-1
                   TO  WARN-FLG-2         OF  PARM-SMZJ1810-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":警告フラグ(2)           =["
      D             WARN-FLG-2          OF  PARM-SMZJ1810-ARG2"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  警告フラグ(3)
                 MOVE  CNS-WARN-FLG-1
                   TO  WARN-FLG-3         OF  PARM-SMZJ1810-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":警告フラグ(3)           =["
      D             WARN-FLG-3          OF  PARM-SMZJ1810-ARG2"]"
      *-----------------------------------------------------------------
               END-IF
               MOVE  CNS-ON               TO  FLG-NEXT-FETCH
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":次のカーソルフェッチ処理フラグ=["
      D            FLG-NEXT-FETCH"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-040
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (一)【SMZJ4018】約定レート未入"
      D    "力判定ルーチンをCALLして、計算フラグと警告区分を取得"
      D    "   END   ****"
      *-----------------------------------------------------------------
           CONTINUE.
       SMZJ4018-CALL2-EXT.
           EXIT.
      ******************************************************************
      *        (三)跨ぎ取引的設定
      ******************************************************************
       MATAGI-TRHK-SET-RTN    SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (三)跨ぎ取引的設定  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE                   WK-MATAGI-TRHK
                                        WK-MATAGI-IDO-CALC-PATTERN
                                        WK-MATAGI-KH-KAIKEI-BASE-FLG
                                        WK-MATAGI-SYRI-JUN
      *----------  跨ぎ取引.原取引ID
           MOVE  WK-TORI-ID                  OF  WK-TKMXTR00-2
             TO  WK-TORI-ID                  OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.約定日
           MOVE  WK-YKJ-YMD                  OF  WK-TKMXTR00-2
             TO  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.受渡日
           MOVE  WK-UKE-YMD                  OF  WK-TKMXTR00-2
             TO  WK-UKE-YMD                  OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-TKMXTR00-2
             TO  WK-DUMMY-KBN                OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TKMXTR00-2
             TO  WK-TORI-JIYU                OF  WK-MATAGI-TRHK
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ取引                     =["
      D            WK-MATAGI-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ異動計算パターン         =["
      D            WK-MATAGI-IDO-CALC-PATTERN"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ基本会計ベースフラグ     =["
      D            WK-MATAGI-KH-KAIKEI-BASE-FLG"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ処理順序                 =["
      D            WK-MATAGI-SYRI-JUN"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.原取引ID            =["
      D            WK-TORI-ID                OF  WK-MATAGI-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.約定日              =["
      D            WK-YKJ-YMD                OF  WK-MATAGI-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.受渡日              =["
      D            WK-UKE-YMD                OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.ダミー区分        =["
      D            WK-DUMMY-KBN              OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.取引事由          =["
      D            WK-TORI-JIYU              OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":②【SMZJ4012】取引事由判定ルーチン"
      D             "をCALLして、取引属性逆転フラグを取得する"
      *-----------------------------------------------------------------
      *----------  ②【SMZJ4012】取引事由判定ルーチンをCALLして、取引属性逆転フラグを取得する
           INITIALIZE  WK-TRHK-ZKSE-GT-FLG
                       PARM-SMZJ4012-INOUT
                       PARM-RTNPKG
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-TKMXTR00-2
             TO  TORI-JIYU                   OF  PARM-SMZJ4012-ARG1
      *----------  判定対象区分
           MOVE  CNS-HANTEI-TARGET-KBN-B
             TO  HANTEI-TARGET-KBN           OF  PARM-SMZJ4012-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性逆転フラグ=["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":取引事由 =["
      D             TORI-JIYU                OF  PARM-SMZJ4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":判定対象区分 =["
      D             HANTEI-TARGET-KBN        OF  PARM-SMZJ4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL "SMZJ4012"               USING  PARM-SMZJ4012-INOUT
                                                PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SMZJ4012)=["RTN-CD
      D                                 OF  PARM-RTNPKG(COUNTER
      D                                 OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             MOVE  TRHK-ZKSE-GT-FLG  OF  PARM-SMZJ4012-ARG2
               TO  WK-TRHK-ZKSE-GT-FLG
      *--------------------------------<DEBUG>--------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  正常 "
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性逆転フラグ=["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ": 取引事由判定  異常"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-041
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID ":取引_2.取引事由をキーで、ワーク"
      D            "取引属性エリアから検索"
      D    DISPLAY CNS-PGM-ID ":取引_2.取引事由 =["
      D            WK-TORI-JIYU              OF  WK-TKMXTR00-2"]"
      *-----------------------------------------------------------------
      *----------  取引_2.取引事由をキーで、ワーク取引属性エリアから検索
           INITIALIZE  WK-TORI-ZOK-COUNT
                       FLG-TORI-JIYU
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MATAGI-TRHK-SET-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  UNTIL WK-TORI-ZOK-COUNT
                        = YUUKOU-KENSUU  OF TBL-TKCMTZ00-1 OR
                          FLG-TORI-JIYU = CNS-1
             COMPUTE  WK-TORI-ZOK-COUNT = WK-TORI-ZOK-COUNT + CNS-1
             IF  WK-TRHK-JIYU-CD OF WK-TORI-ZOK-AREA-H
                                   (WK-TORI-ZOK-COUNT)
               =  WK-TORI-JIYU  OF  WK-TKMXTR00-2
             THEN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").取引事由コード =["
      D             WK-TRHK-JIYU-CD          OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").数量異動区分   =["
      D             WK-SURYO-IDO-KBN         OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      D    DISPLAY  CNS-PGM-ID ": ワーク取引属性エリア("
      D             WK-TORI-ZOK-COUNT").簿価異動区分   =["
      D             WK-BOKA-IDO-KBN          OF  WK-TORI-ZOK-AREA-H
      D                                         (WK-TORI-ZOK-COUNT)"]"
      *-----------------------------------------------------------------
      *----------  数量異動区分
               MOVE  WK-SURYO-IDO-KBN        OF  WK-TORI-ZOK-AREA-H
                                                 (WK-TORI-ZOK-COUNT)
                 TO  WK-WK-SURYO-IDO-KBN
      *----------  簿価異動区分
               MOVE  WK-BOKA-IDO-KBN         OF  WK-TORI-ZOK-AREA-H
                                                 (WK-TORI-ZOK-COUNT)
                 TO  WK-WK-BOKA-IDO-KBN
               MOVE  CNS-1                   TO  FLG-TORI-JIYU
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MATAGI-TRHK-SET-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ARG1.銘柄別断面情報"
      D             ".資産負債・買建売建フラグ =["
      D             WK-TATE-FLG  OF  WK-TKMZBW03
      D                          OF  WK-PARM-SMZJ1810-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク取引属性逆転フラグ =["
      D             WK-TRHK-ZKSE-GT-FLG"]"
      *-----------------------------------------------------------------
           IF  (WK-TATE-FLG  OF  WK-TKMZBW03
                             OF  WK-PARM-SMZJ1810-ARG1
            =  CNS-X-S   )AND
               WK-TRHK-ZKSE-GT-FLG
            =  CNS-X-1
           THEN
      *----------  B) ARG1.銘柄別断面情報.資産負債・買建売建フラグ＝'S'
      *----------  AND ワーク取引属性逆転フラグ＝'1'の場合
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":B) ARG1.銘柄別断面情報."
      D    "資産負債・買建売建フラグ＝'S' AND"
      D     "ワーク取引属性逆転フラグ＝'1'の場合"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      *-----------------------------------------------------------------
             IF  WK-WK-BOKA-IDO-KBN  =  CNS-PLUS-1
             THEN
               MOVE  CNS-MINUS-2  TO  WK-WK-BOKA-IDO-KBN
             ELSE
               IF  WK-WK-BOKA-IDO-KBN  =  CNS-MINUS-2
               THEN
                 MOVE  CNS-PLUS-1  TO  WK-WK-BOKA-IDO-KBN
               ELSE
                 CONTINUE
               END-IF
             END-IF
             IF  WK-WK-SURYO-IDO-KBN  =  CNS-PLUS-1
             THEN
               MOVE  CNS-MINUS-2  TO  WK-WK-SURYO-IDO-KBN
             ELSE
               IF  WK-WK-SURYO-IDO-KBN  =  CNS-MINUS-2
               THEN
                 MOVE  CNS-PLUS-1  TO  WK-WK-SURYO-IDO-KBN
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク数量異動区分 =["
      D             WK-WK-SURYO-IDO-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク簿価異動区分 =["
      D             WK-WK-BOKA-IDO-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-WK-BOKA-IDO-KBN  =  CNS-PLUS-1
           THEN
             MOVE  CNS-PLUS-1                TO  WK-WK-ZG-KBN
           ELSE
             IF  WK-WK-BOKA-IDO-KBN  =  CNS-MINUS-2
             THEN
               MOVE  CNS-MINUS-2             TO  WK-WK-ZG-KBN
             ELSE
               IF  WK-WK-SURYO-IDO-KBN  =  CNS-PLUS-1
               THEN
                 MOVE  CNS-PLUS-1            TO  WK-WK-ZG-KBN
               ELSE
                 IF  WK-WK-SURYO-IDO-KBN  =  CNS-MINUS-2
                 THEN
                   MOVE  CNS-MINUS-2         TO  WK-WK-ZG-KBN
                 ELSE
                   MOVE  CNS-MUKOU-9         TO  WK-WK-ZG-KBN
                 END-IF
               END-IF
             END-IF
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク増減区分 =["
      D             WK-WK-ZG-KBN"]"
      D    DISPLAY  CNS-PGM-ID ":****  (三)跨ぎ取引的設定   END   ****"
      *-----------------------------------------------------------------
           CONTINUE.
       MATAGI-TRHK-SET-EXT.
           EXIT.
      ******************************************************************
      *        (四)跨ぎ基本会計ベースフラグを取得する
      ******************************************************************
       MATAGI-KH-FLG-RTN      SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (四)跨ぎ基本会計ベースフラグを取"
      D             "得する  START  ****"
      D    DISPLAY  CNS-PGM-ID ":CALL  SCZY4302   START"
      D    DISPLAY CNS-PGM-ID":有効件数1   =["
      D            YUUKOU-KENSUU             OF TBL-TKPFZK01-1
      D                                      OF  PARM-SMZJ1810-ARG1"]"
      *-----------------------------------------------------------------
      *----------  ポートフォリオ属性取得ルーチン初期値処理
      *----------  ポートフォリオ属性データエリア
           MOVE  TBL-TKPFZK01-1              OF  PARM-SMZJ1810-ARG1
             TO  PARM-SCZY4302-ARG2
      *----------  適用開始日
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  TEKIYO-FROM                 OF  PARM-SCZY4302-ARG1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":有効件数1   =["
      D            YUUKOU-KENSUU             OF TBL-TKPFZK01-1
      D                                      OF  PARM-SMZJ1810-ARG1"]"
      D    DISPLAY CNS-PGM-ID":有効件数2   =["
      D            YUUKOU-KENSUU             OF  PARM-SCZY4302-ARG2"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオ属性データエリア1   =["
      D            TBL-TKPFZK01-1            OF  PARM-SMZJ1810-ARG1"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオ属性データエリア   =["
      D            PARM-SCZY4302-ARG2"]"
      D    DISPLAY CNS-PGM-ID":適用開始日                   =["
      D            TEKIYO-FROM               OF  PARM-SCZY4302-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY4302"             USING  PARM-SCZY4302-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SCZY4302)           =["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER           OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD  OF PARM-RTNPKG   =["RTN-CD
      D    OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *----------  仕訳基準パターンコード
               MOVE  SWK-KJN-PTN-CD          OF  PARM-SCZY4302-ARG3
                 TO  WK-SWK-KJN-PTN-CD-M
      *----------  異動計算パターンコード
               MOVE  IDO-CALC-PATTERN-CD     OF  PARM-SCZY4302-ARG3
                 TO  WK-IDO-CALC-PATTERN-CD-M
      *----------  保有目的
               MOVE  POSSESSION-OBJECT       OF  PARM-SCZY4302-ARG3
                 TO  WK-POSSESSION-OBJECT-M
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":仕訳基準パターンコード     =["
      D             WK-SWK-KJN-PTN-CD-M"]"
      D    DISPLAY  CNS-PGM-ID ":異動計算パターンコード     =["
      D             WK-IDO-CALC-PATTERN-CD-M"]"
      D    DISPLAY  CNS-PGM-ID ":保有目的                   =["
      D             WK-POSSESSION-OBJECT-M"]"
      D    DISPLAY  CNS-PGM-ID ":仕訳基準パターンコードの１桁目=["
      D             WK-SWK-KJN-PTN-CD-M(1:1)"]"
      *-----------------------------------------------------------------
               EVALUATE  WK-SWK-KJN-PTN-CD-M(1:1)
                 WHEN  CNS-YKJ-T
      *----------  SCZY4302.仕訳基準パターンコードの１桁目＝T:約定の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY4302.仕訳基準パターンコードの１桁"
      D             "目＝T:約定の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ基本会計ベースフラグ
                   MOVE  CNS-YKJ-1
                     TO  WK-MATAGI-KH-KAIKEI-BASE-FLG
                 WHEN  CNS-UKE-S
      *----------  SCZY4302.仕訳基準パターンコードの１桁目＝S:受渡の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY4302.仕訳基準パターンコードの１桁"
      D             "目＝S:受渡の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ基本会計ベースフラグ
                   MOVE  CNS-UKE-2
                     TO  WK-MATAGI-KH-KAIKEI-BASE-FLG
                 WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":SCZY4302.仕訳基準パターンコードの１桁"
      D             "目＝上記以外の場合"
      *-----------------------------------------------------------------
      *----------  エラー
                   MOVE  PARM-RTNPKG         TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
                   MOVE  CNS-PGM-ID
                     TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-042
                     TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-140
                     TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                     TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-0
                     TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  SPACE
                     TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                   PERFORM  ERR-RTN
               END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":跨ぎ基本会計ベースフラグ=  ["
      D             WK-MATAGI-KH-KAIKEI-BASE-FLG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":跨ぎ基本会計ベースフラグを取得なし"
      *-----------------------------------------------------------------
      *----------  エラー
               MOVE  PARM-RTNPKG
                 TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-091
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS                  OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD                   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG                 OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":跨ぎ基本会計ベースフラグを取得エラー"
      *-----------------------------------------------------------------
      *----------  エラー
               MOVE  PARM-RTNPKG
                 TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-043
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS                  OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD                   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG                 OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (四)跨ぎ基本会計ベースフラグを取"
      D             "得する   END   ****"
      D    DISPLAY  CNS-PGM-ID ":CALL  SCZY4302   END"
      *-----------------------------------------------------------------
           CONTINUE.
       MATAGI-KH-FLG-EXT.
           EXIT.
      ******************************************************************
      *        (五)  跨ぎ異動計算パターンを取得する
      ******************************************************************
       MATAGI-IDO-CALC-RTN    SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (五)  跨ぎ異動計算パターンを取得"
      D             "する  START  ****"
      D    DISPLAY  CNS-PGM-ID ":CALL  SCZY4304   START"
      *-----------------------------------------------------------------
      *----------  異動計算パターン取得ルーチン初期値処理
      *----------  異動計算パターンコード
           MOVE  WK-IDO-CALC-PATTERN-CD-M
             TO  IDO-CALC-PATTERN-CD         OF  PARM-SCZY4304-ARG1
      *----------  市場通貨コード
           MOVE  WK-SIJO-TUKA-CD             OF  WK-SIJO
             TO  SIJO-TUKA-CD                OF  PARM-SCZY4304-ARG1
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  SEC-SBT-CD                  OF  PARM-SCZY4304-ARG1
      *----------  保有目的
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03(1:1)
             TO  POSSESSION-OBJECT           OF  PARM-SCZY4304-ARG1
      *----------  異動計算パターンデータエリア
           MOVE  TBL-TKPFPT01-1              OF  PARM-SMZJ1810-ARG1
             TO  PARM-SCZY4304-ARG2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":異動計算パターンコード       =["
      D            IDO-CALC-PATTERN-CD       OF  PARM-SCZY4304-ARG1"]"
      D    DISPLAY CNS-PGM-ID":市場通貨コード               =["
      D            SIJO-TUKA-CD              OF  PARM-SCZY4304-ARG1"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            SEC-SBT-CD                OF  PARM-SCZY4304-ARG1"]"
      D    DISPLAY CNS-PGM-ID":保有目的                     =["
      D            POSSESSION-OBJECT         OF  PARM-SCZY4304-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY4304"             USING  PARM-SCZY4304-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SCZY4304)           =["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER           OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
      *----------  異動計算パターンのコピー句を取得する
             MOVE  TBL-TKPFPT01               OF  PARM-SCZY4304-ARG3
               TO  WK-MATAGI-IDO-CALC-PATTERN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":異動計算パターン             =["
      D            WK-MATAGI-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":跨ぎ異動計算パターンを取得エラー"
      *-----------------------------------------------------------------
      *----------  エラー
             MOVE  PARM-RTNPKG               TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-044
               TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG                  OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS                  OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD                   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG                 OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (五) 跨ぎ異動計算パターンを取得"
      D             "する   END   ****"
      D    DISPLAY  CNS-PGM-ID ":CALL  SCZY4304   END"
      *-----------------------------------------------------------------
           CONTINUE.
       MATAGI-IDO-CALC-EXT.
           EXIT.
      ******************************************************************
      *        (六)処理順決定を設定する
      ******************************************************************
       SRJUN-KT-SET-RTN       SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (六)処理順決定を設定する"
      D             "  START  ****"
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序=["
      D             SYRI-JUN              OF  WK-KKN-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
      *----------  期間内異動計算パターン.処理順序
           EVALUATE  SYRI-JUN                OF  WK-KKN-IDO-CALC-PATTERN
             WHEN  CNS-SYRI-JUN-1
             WHEN  CNS-SYRI-JUN-2
             WHEN  CNS-SYRI-JUN-5
             WHEN  CNS-SYRI-JUN-6
      *---------- 期間内異動計算パターン.処理順序＝('1'or'2'or'5'or'6')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('1'or"
      D             "'2'or'5'or'6')の場合"
      D    DISPLAY  CNS-PGM-ID":取引_2.取引事由             =["
      D            WK-TORI-JIYU              OF  WK-TKMXTR00-2"]"
      *-----------------------------------------------------------------
               EVALUATE  WK-TORI-JIYU        OF  WK-TKMXTR00-2
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(1)
      *----------  適用グループ(1).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(1).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-01
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(2)
      *----------  適用グループ(2).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(2).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-02
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(3)
      *----------  適用グループ(3).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(3).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-03
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(4)
      *----------  適用グループ(4).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(4).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-04
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(5)
      *----------  適用グループ(5).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(5).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-05
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(6)
      *----------  適用グループ(6).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(6).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-06
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(7)
      *----------  適用グループ(7).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(7).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-07
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(8)
      *----------  適用グループ(8).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(8).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-08
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(9)
      *----------  適用グループ(9).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(9).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-09
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(11)
      *----------  適用グループ(11).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(11).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-11
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(12)
      *----------  適用グループ(12).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(12).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-12
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(13)
      *----------  適用グループ(13).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(13).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-13
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(14)
      *----------  適用グループ(14).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(14).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-14
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(15)
      *----------  適用グループ(15).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(15).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-15
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(16)
      *----------  適用グループ(16).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(16).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-16
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(17)
      *----------  適用グループ(17).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(17).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-17
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(18)
      *----------  適用グループ(18).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(18).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-18
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  WK-TKYU-SYORI         OF  WK-TKYU-GROUP(19)
      *----------  適用グループ(19).適用処理の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":適用グループ(19).適用処理の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-19
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
                 WHEN  OTHER
      *----------  上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上記以外の場合"
      *-----------------------------------------------------------------
                   MOVE  CNS-SRJUN-TEKIYO-10
                     TO  WK-SRJUN-KT-TEKIYO  OF  WK-MATAGI-TRHK
               END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引_2.証券種別コード=["
      D             WK-SEC-SBT-CD            OF  WK-TKMXTR00-2"]"
      D    DISPLAY  CNS-PGM-ID":取引_2.取引事由            =["
      D             WK-TORI-JIYU             OF  WK-TKMXTR00-2"]"
      *-----------------------------------------------------------------
               IF (WK-SEC-SBT-CD             OF  WK-TKMXTR00-2
                =  CNS-SEC-SBT-CD-B     OR
                   WK-SEC-SBT-CD             OF  WK-TKMXTR00-2
                =  CNS-SEC-SBT-CD-DBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TKMXTR00-2
                =  CNS-SEC-SBT-CD-FBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TKMXTR00-2
                =  CNS-SEC-SBT-CD-CB    OR
                   WK-SEC-SBT-CD             OF  WK-TKMXTR00-2
                =  CNS-SEC-SBT-CD-WB    OR
                   WK-SEC-SBT-CD             OF  WK-TKMXTR00-2
                =  CNS-SEC-SBT-CD-CBMS  OR
                   WK-SEC-SBT-CD             OF  WK-TKMXTR00-2
                =  CNS-SEC-SBT-CD-XMOB)
             AND  (WK-TORI-JIYU              OF  WK-TKMXTR00-2
                =  CNS-TORI-JIYU-MATU   OR
                   WK-TORI-JIYU              OF  WK-TKMXTR00-2
                =  CNS-TORI-JIYU-MATD)
               THEN
                 MOVE  ZERO
                   TO  WK-SRJUN-KT-TEKIYO    OF  WK-MATAGI-TRHK
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ取引.処理順決定摘要     =["
      D             WK-SRJUN-KT-TEKIYO       OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SYRI-JUN-3
             WHEN  CNS-SYRI-JUN-4
             WHEN  CNS-SYRI-JUN-7
             WHEN  CNS-SYRI-JUN-8
      *---------- 期間内異動計算パターン.処理順序＝('3'or'4'or'7'or'8')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝('3'or"
      D             "'4'or'7'or'8')の場合"
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順=["
      D             ZOUGEN-TORI-JUN       OF  WK-KKN-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  増減順相対物区分          "
      D       "=["  WK-ZOUGENJYUN-SOTAIBT-KBN"]"
      *-----------------------------------------------------------------
               IF  WK-ZOUGENJYUN-SOTAIBT-KBN = CNS-X-1
               THEN
                 MOVE  CNS-PLUS-00
                   TO  WK-SRJUN-KT-ZOUGEN   OF  WK-MATAGI-TRHK
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ取引.処理順決定増減   =["
      D             WK-SRJUN-KT-ZOUGEN       OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
               ELSE
      *----------  期間内異動計算パターン.増減取引順
                 EVALUATE  ZOUGEN-TORI-JUN   OF  WK-KKN-IDO-CALC-PATTERN
                   WHEN  CNS-PLUS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "'1':増加を先の場合"
      D    DISPLAY  CNS-PGM-ID":ワーク増減区分             =["
      D             WK-WK-ZG-KBN"]"
      *-----------------------------------------------------------------
      *----------  ワーク増減区分
                     IF  WK-WK-ZG-KBN  =  CNS-PLUS-1
                     THEN
      *----------  a)ワーク増減区分＝'1':増加の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク増減区分＝'1':増加の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-PLUS-01
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-MATAGI-TRHK
                     ELSE
      *----------  b)ワーク増減区分 上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":b)ワーク増減区分 上記以外の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-MINUS-02
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-MATAGI-TRHK
                     END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ取引.処理順決定増減   =["
      D             WK-SRJUN-KT-ZOUGEN       OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                   WHEN  CNS-MINUS-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "'2':減少を先の場合"
      D    DISPLAY  CNS-PGM-ID":ワーク増減区分             =["
      D             WK-WK-ZG-KBN"]"
      *-----------------------------------------------------------------
      *----------  ワーク増減区分
                     IF  WK-WK-ZG-KBN  =  CNS-MINUS-2
                     THEN
      *----------  a)ワーク増減区分＝'2':減少の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":a)ワーク増減区分＝'2':減少の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-PLUS-01
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-MATAGI-TRHK
                     ELSE
      *----------  b)ワーク増減区分上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":b)ワーク増減区分上記以外の場合"
      *-----------------------------------------------------------------
                       MOVE  CNS-MINUS-02
                         TO  WK-SRJUN-KT-ZOUGEN   OF  WK-MATAGI-TRHK
                     END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ取引.処理順決定増減   =["
      D                WK-SRJUN-KT-ZOUGEN    OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                   WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.増減取引順＝"
      D             "上記以外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                     MOVE  CNS-PGM-ID
                       TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                     MOVE  CNS-POS-045
                       TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                     MOVE  CNS-RTN-800
                       TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                     MOVE  ZERO
                       TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                     MOVE  CNS-DETAIL-0
                       TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                     MOVE  SPACE
                       TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                     PERFORM  ERR-RTN
                 END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引_2.証券種別コード=["
      D             WK-SEC-SBT-CD            OF  WK-TKMXTR00-2"]"
      D    DISPLAY  CNS-PGM-ID":取引_2.取引事由            =["
      D             WK-TORI-JIYU             OF  WK-TKMXTR00-2"]"
      *-----------------------------------------------------------------
                 IF (WK-SEC-SBT-CD           OF  WK-TKMXTR00-2
                  =  CNS-SEC-SBT-CD-B     OR
                     WK-SEC-SBT-CD           OF  WK-TKMXTR00-2
                  =  CNS-SEC-SBT-CD-DBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TKMXTR00-2
                  =  CNS-SEC-SBT-CD-FBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TKMXTR00-2
                  =  CNS-SEC-SBT-CD-CB    OR
                     WK-SEC-SBT-CD           OF  WK-TKMXTR00-2
                  =  CNS-SEC-SBT-CD-WB    OR
                     WK-SEC-SBT-CD           OF  WK-TKMXTR00-2
                  =  CNS-SEC-SBT-CD-CBMS  OR
                     WK-SEC-SBT-CD           OF  WK-TKMXTR00-2
                  =  CNS-SEC-SBT-CD-XMOB)
               AND  (WK-TORI-JIYU            OF  WK-TKMXTR00-2
                  =  CNS-TORI-JIYU-MATU   OR
                     WK-TORI-JIYU            OF  WK-TKMXTR00-2
                  =  CNS-TORI-JIYU-MATD)
                 THEN
                   MOVE  ZERO
                     TO  WK-SRJUN-KT-ZOUGEN  OF  WK-MATAGI-TRHK
                 ELSE
                   CONTINUE
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ取引.処理順決定増減   =["
      D             WK-SRJUN-KT-ZOUGEN       OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序は上記以"
      D             "外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-046
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": 跨ぎ基本会計ベースフラグ   =["
      D             WK-MATAGI-KH-KAIKEI-BASE-FLG"]"
      *-----------------------------------------------------------------
      *----------  跨ぎ基本会計ベースフラグ＝'1':約定ベースの場合
           IF  WK-MATAGI-KH-KAIKEI-BASE-FLG     =  CNS-YKJ-1
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ基本会計ベースフラグ＝'1':約定"
      D             "ベースの場合"
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動計算パターン.処理順序=["
      D             SYRI-JUN           OF  WK-MATAGI-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
             EVALUATE  SYRI-JUN           OF  WK-MATAGI-IDO-CALC-PATTERN
               WHEN  CNS-SYRI-JUN-1
               WHEN  CNS-SYRI-JUN-2
               WHEN  CNS-SYRI-JUN-3
               WHEN  CNS-SYRI-JUN-4
      *----------  跨ぎ異動計算パターン.処理順序＝('1'or'2'or'3'or'4')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動計算パターン.処理順序＝('1'or"
      D             "'2'or'3'or'4')の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ処理順序
                 MOVE  CNS-YKJ-JUN
                   TO  WK-MATAGI-SYRI-JUN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ処理順序                =["
      D             WK-MATAGI-SYRI-JUN"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SYRI-JUN-5
               WHEN  CNS-SYRI-JUN-6
               WHEN  CNS-SYRI-JUN-7
               WHEN  CNS-SYRI-JUN-8
      *----------  跨ぎ異動計算パターン.処理順序＝('5'or'6'or'7'or'8')の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動計算パターン.処理順序＝('5'or"
      D             "'6'or'7'or'8')の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ処理順序
                 MOVE  CNS-UKE-JUN
                   TO  WK-MATAGI-SYRI-JUN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ処理順序                =["
      D             WK-MATAGI-SYRI-JUN"]"
      *-----------------------------------------------------------------
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ異動計算パターン.処理順序は上記以"
      D             "外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-047
                   TO  ERR-POS               OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-140
                   TO  RTN-CD                OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  ZERO
                   TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-0
                   TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                 MOVE  SPACE
                   TO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
           ELSE
             CONTINUE
           END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (六)処理順決定を設定する"
      D             "   END   ****"
      *-----------------------------------------------------------------
           CONTINUE.
       SRJUN-KT-SET-EXT.
           EXIT.
      ******************************************************************
      *        (七) 跨ぎ取引処理パターンを決定する
      ******************************************************************
       MATAGI-KT-RTN          SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (七)跨ぎ取引処理パターンを決定"
      D             "する  START  ****"
      D    DISPLAY  CNS-PGM-ID": 跨ぎ基本会計ベースフラグ   =["
      D             WK-MATAGI-KH-KAIKEI-BASE-FLG"]"
      D    DISPLAY  CNS-PGM-ID": 跨ぎ処理順序               =["
      D             WK-MATAGI-SYRI-JUN"]"
      D    DISPLAY  CNS-PGM-ID": 期間内基本会計ベースフラグ =["
      D             WK-KKN-KH-KAIKEI-BASE-FLG"]"
      D    DISPLAY  CNS-PGM-ID": 期間内処理順序             =["
      D             WK-KKN-SYRI-JUN"]"
      *-----------------------------------------------------------------
           IF ((WK-MATAGI-KH-KAIKEI-BASE-FLG =  CNS-YKJ-1
           AND WK-KKN-KH-KAIKEI-BASE-FLG     =  CNS-YKJ-1
           AND WK-KKN-SYRI-JUN               =  CNS-YKJ-JUN)
           OR (WK-MATAGI-KH-KAIKEI-BASE-FLG  =  CNS-YKJ-1
           AND WK-MATAGI-SYRI-JUN            =  CNS-YKJ-JUN
           AND WK-KKN-KH-KAIKEI-BASE-FLG     =  CNS-YKJ-1
           AND WK-KKN-SYRI-JUN               =  CNS-UKE-JUN)
           OR (WK-MATAGI-KH-KAIKEI-BASE-FLG  =  CNS-UKE-2
           AND WK-KKN-KH-KAIKEI-BASE-FLG     =  CNS-UKE-2))
           THEN
      *----------  (壱)処理しない,取引_2のレコードをフェッチする
             CONTINUE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY CNS-PGM-ID"処理しない,取引_2のレコードをフェッチする"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF (WK-MATAGI-KH-KAIKEI-BASE-FLG  =  CNS-UKE-2
           AND WK-KKN-KH-KAIKEI-BASE-FLG     =  CNS-YKJ-1)
           THEN
      *----------  (弐)受→約後ろ移動処理
             INITIALIZE  FLG-TKMZZI00-2
             PERFORM  TKMZZI00-2-RTN
             IF  FLG-TKMZZI00-2 = CNS-1
             THEN
               PERFORM  WUSILO-IDO-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF (WK-MATAGI-KH-KAIKEI-BASE-FLG  =  CNS-YKJ-1
           AND WK-MATAGI-SYRI-JUN            =  CNS-UKE-JUN
           AND WK-KKN-KH-KAIKEI-BASE-FLG     =  CNS-YKJ-1
           AND WK-KKN-SYRI-JUN               =  CNS-UKE-JUN)
           THEN
      *----------  (参)入れ子処理
             INITIALIZE  FLG-TKMZZI00
             PERFORM  TKMZZI00-RTN
             IF  FLG-TKMZZI00 = CNS-1
             THEN
               PERFORM  IRE-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF (WK-MATAGI-KH-KAIKEI-BASE-FLG  =  CNS-YKJ-1
           AND WK-KKN-KH-KAIKEI-BASE-FLG     =  CNS-UKE-2)
           THEN
      *----------  (四)約→受前移動処理
             PERFORM  MAE-IDO-RTN
           ELSE
             CONTINUE
           END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (七)跨ぎ取引処理パターンを決定"
      D             "する  END   ****"
      *-----------------------------------------------------------------
           CONTINUE.
       MATAGI-KT-EXT.
           EXIT.
      ******************************************************************
      *        (弐)受→約後ろ移動処理
      ******************************************************************
       WUSILO-IDO-RTN         SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":**** (弐)受→約後ろ移動処理 START ****"
      *-----------------------------------------------------------------
      *----------  跨ぎ取引.計上基準日
           MOVE  WK-KJN-YMD-TOM
             TO  WK-KEIJOU-KIJUNBI           OF  WK-MATAGI-TRHK
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":期間内処理順序             =["
      D             WK-KKN-SYRI-JUN"]"
      *-----------------------------------------------------------------
      *----------  期間内処理順序
           IF  WK-KKN-SYRI-JUN                  =  CNS-YKJ-JUN
           THEN
      *----------  跨ぎ取引.処理順決定日付
             MOVE  WK-YKJ-YMD                OF  WK-TKMXTR00-2
               TO  WK-SRJUN-KT-DATE          OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.処理順同日優先度日付
             MOVE  WK-UKE-YMD                OF  WK-TKMXTR00-2
               TO  WK-SRJUN-DJ-DATE          OF  WK-MATAGI-TRHK
           ELSE
      *----------  跨ぎ取引.処理順決定日付
             MOVE  WK-UKE-YMD                OF  WK-TKMXTR00-2
               TO  WK-SRJUN-KT-DATE          OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.処理順同日優先度日付
             MOVE  WK-YKJ-YMD                OF  WK-TKMXTR00-2
               TO  WK-SRJUN-DJ-DATE          OF  WK-MATAGI-TRHK
           END-IF
      *----------  期間内取引.増幅赤黒区分
           MOVE  SPACE
             TO  WK-ZOFKU-AKA-KBN            OF  WK-MATAGI-TRHK
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.計上基準日        =["
      D             WK-KEIJOU-KIJUNBI        OF  WK-MATAGI-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.処理順決定日付    =["
      D             WK-SRJUN-KT-DATE         OF  WK-MATAGI-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.処理順同日優先度日付=["
      D             WK-SRJUN-DJ-DATE         OF  WK-MATAGI-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅赤黒区分      =["
      D             WK-ZOFKU-AKA-KBN         OF  WK-MATAGI-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅区分          =["
      D             WK-ZOFKU-KBN             OF  WK-MATAGI-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅元異動計上基準日 =["
      D             WK-ZOFKUMT-KJ-KIJUNBI    OF  WK-MATAGI-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.ダミー区分           =["
      D             WK-DUMMY-KBN             OF  WK-MATAGI-TRHK "]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.取引事由             =["
      D             WK-TORI-JIYU             OF  WK-MATAGI-TRHK "]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文
      *    INITIALIZE                        SQLSTMT                    @3212SEINO@@
           INITIALIZE                        SQLSTMT14                  @3212SEINO@@
                                             H-TKMZBW04
                                             WK-MSG-1-3
           MOVE  WK-TABLE-TKMZBW04           TO  SQL-TBL-ID-3
      *----------  処理実行日
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03
             TO  H-SYORI-YMD                 OF  H-TKMZBW04,
                 WK-SYORI-YMD                OF  WK-MSG-1-3
      *----------  起動ID
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03
             TO  H-KIDOU-ID                  OF  H-TKMZBW04,
                 WK-KIDOU-ID                 OF  WK-MSG-1-3
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW04,
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZBW04,
                 WK-FUND-CD                  OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZBW04,
                 WK-PTF-CD                   OF  WK-MSG-1-3
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD            OF  WK-TKMZBW03
             TO  H-KAISI-KJN-YMD             OF  H-TKMZBW04,
                 WK-KAISI-KJN-YMD            OF  WK-MSG-1-3
      *----------  基準日
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMZBW04,
                 WK-KJN-YMD                  OF  WK-MSG-1-3
      *----------  銘柄コード
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-MEG-CD                    OF  H-TKMZBW04,
                 WK-MEG-CD                   OF  WK-MSG-1-3
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD                OF  H-TKMZBW04,
                 WK-SEC-SBT-CD               OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG                 OF  WK-TKMZBW03
             TO  H-TATE-FLG                  OF  H-TKMZBW04,
                 WK-TATE-FLG                 OF  WK-MSG-1-3
      *----------  玉ID
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03
             TO  H-GYOKU-ID                  OF  H-TKMZBW04,
                 WK-GYOKU-ID                 OF  WK-MSG-1-3
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-MATAGI-TRHK
             TO  H-TORI-ID                   OF  H-TKMZBW04,
                 WK-TORI-ID                  OF  WK-MSG-1-3
      *----------  計上基準日
           MOVE  WK-KEIJOU-KIJUNBI           OF  WK-MATAGI-TRHK
             TO  H-KEIJOU-KIJUNBI            OF  H-TKMZBW04,
                 WK-KEIJOU-KIJUNBI           OF  WK-MSG-1-3
      *----------  増幅赤黒区分
           MOVE  WK-ZOFKU-AKA-KBN            OF  WK-MATAGI-TRHK
             TO  H-ZOFKU-AKA-KBN             OF  H-TKMZBW04,
                 WK-ZOFKU-AKA-KBN            OF  WK-MSG-1-3
      *----------  増幅区分
           MOVE  WK-ZOFKU-KBN                OF  WK-MATAGI-TRHK
             TO  H-ZOFKU-KBN                 OF  H-TKMZBW04,
                 WK-ZOFKU-KBN                OF  WK-MSG-1-3
      *----------  増幅元異動計上基準日
           MOVE  WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-MATAGI-TRHK
             TO  H-ZOFKUMT-KJ-KIJUNBI        OF  H-TKMZBW04,
                 WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-MSG-1-3
      *----------  ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-MATAGI-TRHK
             TO  H-DUMMY-KBN                 OF  H-TKMZBW04,
                 WK-DUMMY-KBN                OF  WK-MSG-1-3
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-MATAGI-TRHK
             TO  H-TORI-JIYU                 OF  H-TKMZBW04,
                 WK-TORI-JIYU                OF  WK-MSG-1-3
      *----------  処理順決定日付
           MOVE  WK-SRJUN-KT-DATE            OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-DATE             OF  H-TKMZBW04,
                 WK-SRJUN-KT-DATE            OF  WK-MSG-1-3
      *----------  処理順同日優先度日付
           MOVE  WK-SRJUN-DJ-DATE            OF  WK-MATAGI-TRHK
             TO  H-SRJUN-DJ-DATE             OF  H-TKMZBW04,
                 WK-SRJUN-DJ-DATE            OF  WK-MSG-1-3
      *----------  処理順決定摘要
           MOVE  WK-SRJUN-KT-TEKIYO          OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-TEKIYO           OF  H-TKMZBW04,
                 WK-SRJUN-KT-TEKIYO          OF  WK-MSG-1-3
      *----------  処理順決定増減
           MOVE  WK-SRJUN-KT-ZOUGEN          OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-ZOUGEN           OF  H-TKMZBW04,
                 WK-SRJUN-KT-ZOUGEN          OF  WK-MSG-1-3
      *----------  処理順決定評価
           MOVE  WK-SRJUN-KT-HYOKA           OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-HYOKA            OF  H-TKMZBW04,
                 WK-SRJUN-KT-HYOKA           OF  WK-MSG-1-3
      *----------  未収計算対象フラグ
           MOVE  WK-MSKS-TARGET-FLG          OF  WK-MATAGI-TRHK
             TO  H-MSKS-TARGET-FLG           OF  H-TKMZBW04,
                 WK-MSKS-TARGET-FLG          OF  WK-MSG-1-3
      *----------  未収計算種類
           MOVE  WK-MSKS-SHRU                OF  WK-MATAGI-TRHK
             TO  H-MSKS-SHRU                 OF  H-TKMZBW04,
                 WK-MSKS-SHRU                OF  WK-MSG-1-3
      *----------  約定日
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  H-YKJ-YMD                   OF  H-TKMZBW04,
                 WK-YKJ-YMD                  OF  WK-MSG-1-3
      *----------  受渡日
           MOVE  WK-UKE-YMD                  OF  WK-MATAGI-TRHK
             TO  H-UKE-YMD                   OF  H-TKMZBW04,
                 WK-UKE-YMD                  OF  WK-MSG-1-3
      *----------  権利数量
           MOVE  WK-KENRI-SURYO              OF  WK-MATAGI-TRHK
             TO  H-KENRI-SURYO               OF  H-TKMZBW04,
                 WK-KENRI-SURYO              OF  WK-MSG-1-3
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-UPD-LOGIN-CMP-CD          OF  H-TKMZBW04,
                 WK-UPD-LOGIN-CMP-CD         OF  WK-MSG-1-3
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  H-UPD-PGMID                 OF  H-TKMZBW04,
                 WK-UPD-PGMID                OF  WK-MSG-1-3
      *    MOVE  SQL-INSERT-1-3              TO  SQLSTMT                @3212SEINO@@
           MOVE  SQL-INSERT-1-3              TO  SQLSTMT14              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日                   =["
      D            H-SYORI-YMD               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":起動ID                       =["
      D            H-KIDOU-ID                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD                  OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":開始基準日                   =["
      D            H-KAISI-KJN-YMD           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":基準日                       =["
      D            H-KJN-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード                   =["
      D            H-MEG-CD                  OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            H-SEC-SBT-CD              OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ     =["
      D            H-TATE-FLG                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":玉ID                         =["
      D            H-GYOKU-ID                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            H-TORI-ID                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":計上基準日                   =["
      D            H-KEIJOU-KIJUNBI          OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅赤黒区分                 =["
      D            H-ZOFKU-AKA-KBN           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅区分                     =["
      D            H-ZOFKU-KBN               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅元異動計上基準日         =["
      D            H-ZOFKUMT-KJ-KIJUNBI      OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ダミー区分                   =["
      D            H-DUMMY-KBN               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":取引事由                     =["
      D            H-TORI-JIYU               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定日付               =["
      D            H-SRJUN-KT-DATE           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順同日優先度日付         =["
      D            H-SRJUN-DJ-DATE           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定摘要               =["
      D            H-SRJUN-KT-TEKIYO         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定増減               =["
      D            H-SRJUN-KT-ZOUGEN         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順                       =["
      D            H-SRJUN                   OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":未収計算対象フラグ           =["
      D            H-MSKS-TARGET-FLG         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":未収計算種類                 =["
      D            H-MSKS-SHRU               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":約定日                       =["
      D            H-YKJ-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":受渡日                       =["
      D            H-UKE-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":権利数量                     =["
      D            H-KENRI-SURYO             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード =["
      D            H-UPD-LOGIN-CMP-CD        OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":更新プログラムＩＤ           =["
      D            H-UPD-PGMID               OF  H-TKMZBW04"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT  =["SQLSTMT "]"                 @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT14  =["SQLSTMT14 "]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-3  =["WK-MSG-1-3 "]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-S14-INSERT  =["            @3212SEINO@@
      D                         FLG-TKMZBW04-S14-INSERT "]"             @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW04-S14-INSERT = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC SQL PREPARE S2 FROM :SQLSTMT END-EXEC                 @3212SEINO@@
             EXEC SQL PREPARE S14 FROM :SQLSTMT14 END-EXEC              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                       NOT = CNS-SQL-NORMAL
             THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-048
                 TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       S-INSERT-1-3,
                       WK-MSG-1-3              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
      *        EXECUTE S2                                               @3212SEINO@@
               EXECUTE S14
                 USING :H-TKMZBW04.H-SYORI-YMD,
                       :H-TKMZBW04.H-KIDOU-ID,
                       :H-TKMZBW04.H-RIYO-CMP-CD,
                       :H-TKMZBW04.H-FUND-CD,
                       :H-TKMZBW04.H-PTF-CD,
                       :H-TKMZBW04.H-KAISI-KJN-YMD,
                       :H-TKMZBW04.H-KJN-YMD,
                       :H-TKMZBW04.H-MEG-CD,
                       :H-TKMZBW04.H-SEC-SBT-CD,
                       :H-TKMZBW04.H-TATE-FLG,
                       :H-TKMZBW04.H-GYOKU-ID,
                       :H-TKMZBW04.H-TORI-ID,
                       :H-TKMZBW04.H-KEIJOU-KIJUNBI,
                       :H-TKMZBW04.H-ZOFKU-AKA-KBN,
                       :H-TKMZBW04.H-ZOFKU-KBN,
                       :H-TKMZBW04.H-ZOFKUMT-KJ-KIJUNBI,
                       :H-TKMZBW04.H-DUMMY-KBN,
                       :H-TKMZBW04.H-TORI-JIYU,
                       :H-TKMZBW04.H-SRJUN-KT-DATE,
                       :H-TKMZBW04.H-SRJUN-DJ-DATE,
                       :H-TKMZBW04.H-SRJUN-KT-TEKIYO,
                       :H-TKMZBW04.H-SRJUN-KT-ZOUGEN,
                       :H-TKMZBW04.H-SRJUN-KT-HYOKA,
                       :H-TKMZBW04.H-MSKS-TARGET-FLG,
                       :H-TKMZBW04.H-MSKS-SHRU,
                       :H-TKMZBW04.H-YKJ-YMD,
                       :H-TKMZBW04.H-UKE-YMD,
                       :H-TKMZBW04.H-KENRI-SURYO,
                       :H-TKMZBW04.H-UPD-LOGIN-CMP-CD,
                       :H-TKMZBW04.H-UPD-PGMID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW04-S14-INSERT     @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S14-INSERT=["
      D                        FLG-TKMZBW04-S14-INSERT"]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-UNIQUE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-049
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     S-INSERT-1-3,
                     WK-MSG-1-3              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-050
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     S-INSERT-1-3,
                     WK-MSG-1-3              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *----------  ARG2.取引SELECT件数←ARG2.取引SELECT件数＋1
           COMPUTE  WK-TRHK-SELECT-KENSU
                 =  WK-TRHK-SELECT-KENSU + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引SELECT件数=["WK-TRHK-SELECT-KENSU"]"
      D    DISPLAY  CNS-PGM-ID ":**** (弐)受→約後ろ移動処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       WUSILO-IDO-EXT.
           EXIT.
      ******************************************************************
      *        別紙1-11
      ******************************************************************
       TKMZZI00-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":別紙1-11 SQL START"
      *-----------------------------------------------------------------
      *    INITIALIZE                        SQLSTMT                    @3212SEINO@@
           INITIALIZE                        SQLSTMT11                  @3212SEINO@@
                                             H-TKMZZI00
           MOVE  WK-TABLE-TKMZZI00           TO  SQL-TBL-ID-11
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZZI00,
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-11
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZZI00,
                 WK-FUND-CD                  OF  WK-MSG-1-11
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZZI00,
                 WK-PTF-CD                   OF  WK-MSG-1-11
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-MATAGI-TRHK
             TO  H-TORI-ID                   OF  H-TKMZZI00,
                 WK-TORI-ID                  OF  WK-MSG-1-11
      *----------  計上基準日
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  H-KEIJOU-KIJUNBI            OF  H-TKMZZI00,
                 WK-KEIJOU-KIJUNBI           OF  WK-MSG-1-11
      *    MOVE  SQL-SELECT-1-11             TO  SQLSTMT                @3212SEINO@@
           MOVE  SQL-SELECT-1-11             TO  SQLSTMT11              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD             OF  H-TKMZZI00"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD                 OF  H-TKMZZI00"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD                  OF  H-TKMZZI00"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            H-TORI-ID                 OF  H-TKMZZI00"]"
      D    DISPLAY CNS-PGM-ID":計上基準日                   =["
      D            H-KEIJOU-KIJUNBI          OF  H-TKMZZI00"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT11              =["SQLSTMT11"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-11            =["WK-MSG-1-11"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR    =["FLG-TKMZZI00-CR"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMZZI00-CR = CNS-OFF                                @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC  SQL  PREPARE  S11  FROM :SQLSTMT  END-EXEC           @3212SEINO@@
             EXEC  SQL  PREPARE  S11  FROM :SQLSTMT11  END-EXEC         @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 CONTINUE
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-051
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-11              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
             EXEC
               SQL  DECLARE  TKMZZI00_CURSOR  CURSOR FOR  S11
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZZI00_CURSOR
                 USING :H-TKMZZI00.H-RIYO-CMP-CD,
                       :H-TKMZZI00.H-FUND-CD,
                       :H-TKMZZI00.H-PTF-CD,
                       :H-TKMZZI00.H-TORI-ID,
                       :H-TKMZZI00.H-KEIJOU-KIJUNBI
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  残高異動カーソルオープンフラグ
               MOVE  CNS-ON             TO  FLG-TKMZZI00-CR
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZZI00-CR           =["
      D            FLG-TKMZZI00-CR "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-052
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
           INITIALIZE H-TKMZZI00-S
           EXEC  SQL
               FETCH
                    TKMZZI00_CURSOR
               INTO :H-TKMZZI00-S.H-RIYO-CMP-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-1  TO  FLG-TKMZZI00
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZZI00 =["FLG-TKMZZI00"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  ZERO  TO  FLG-TKMZZI00
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZZI00 =["FLG-TKMZZI00"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-053
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      ***  EXEC  SQL                                                    @3212SEINO@@
      ***    CLOSE TKMZZI00_CURSOR                                      @3212SEINO@@
      ***  END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY CNS-PGM-ID                                           @3212SEINO@@
      *D*          ":SQL-SELECT-1-11 CLOSE SQLCODE=["SQLCODE"]"         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      ***  IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEINO@@
      ***  THEN                                                         @3212SEINO@@
      *----------  残高異動カーソルオープンフラグ
      ***    MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":FLG-TKMZZI00-CR       =["                @3212SEINO@@
      *D*          FLG-TKMZZI00-CR "]"                                  @3212SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @3212SEINO@@
      ***      TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-054                                          @3212SEINO@@
      ***      TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @3212SEINO@@
      ***      TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @3212SEINO@@
      ***      TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      ***            WK-MSG-1-11              DELIMITED  BY SIZE        @3212SEINO@@
      ***      INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1     @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      *D*           ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      *D*           ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      *D*           RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      *D*           DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      *D*           DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      *D*           FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @3212SEINO@@
      ***  END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":別紙1-11 SQL END"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-EXT.
           EXIT.
      ******************************************************************
      *        別紙1-12
      ******************************************************************
       TKMZZI00-2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":別紙1-12 SQL START"
      *-----------------------------------------------------------------
      *    INITIALIZE                        SQLSTMT                    @3212SEINO@@
           INITIALIZE                        SQLSTMT12                  @3212SEINO@@
                                             H-TKMZZI00
           MOVE  WK-TABLE-TKMZZI00           TO  SQL-TBL-ID-12
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZZI00,
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-12
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZZI00,
                 WK-FUND-CD                  OF  WK-MSG-1-12
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZZI00,
                 WK-PTF-CD                   OF  WK-MSG-1-12
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-MATAGI-TRHK
             TO  H-TORI-ID                   OF  H-TKMZZI00,
                 WK-TORI-ID                  OF  WK-MSG-1-12
      *    MOVE  SQL-SELECT-1-12             TO  SQLSTMT                @3212SEINO@@
           MOVE  SQL-SELECT-1-12             TO  SQLSTMT12              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD             OF  H-TKMZZI00"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD                 OF  H-TKMZZI00"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD                  OF  H-TKMZZI00"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            H-TORI-ID                 OF  H-TKMZZI00"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT12             =["SQLSTMT12"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-12            =["WK-MSG-1-12"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZZI00-CR-2=["FLG-TKMZZI00-CR-2"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMZZI00-CR-2 = CNS-OFF                              @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC  SQL  PREPARE  S12  FROM :SQLSTMT  END-EXEC           @3212SEINO@@
             EXEC  SQL  PREPARE  S12  FROM :SQLSTMT12  END-EXEC         @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 CONTINUE
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-055
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-12              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
             EXEC
               SQL  DECLARE  TKMZZI00_CURSOR_2 CURSOR FOR S12
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZZI00_CURSOR_2
                 USING :H-TKMZZI00.H-RIYO-CMP-CD,
                       :H-TKMZZI00.H-FUND-CD,
                       :H-TKMZZI00.H-PTF-CD,
                       :H-TKMZZI00.H-TORI-ID
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  残高異動カーソルオープンフラグ
               MOVE  CNS-ON             TO  FLG-TKMZZI00-CR-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZZI00-CR-2           =["
      D            FLG-TKMZZI00-CR-2 "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-056
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-12              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
           INITIALIZE H-TKMZZI00-S
           EXEC  SQL
               FETCH
                    TKMZZI00_CURSOR_2
               INTO :H-TKMZZI00-S.H-RIYO-CMP-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  ZERO  TO  FLG-TKMZZI00-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZZI00-2 =["FLG-TKMZZI00-2"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-1 TO  FLG-TKMZZI00-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZZI00-2 =["FLG-TKMZZI00-2"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-057
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-12              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      ***  EXEC  SQL                                                    @3212SEINO@@
      ***    CLOSE TKMZZI00_CURSOR_2                                    @3212SEINO@@
      ***  END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY CNS-PGM-ID                                           @3212SEINO@@
      *D*          ":SQL-SELECT-1-12 CLOSE SQLCODE=["SQLCODE"]"         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      ***  IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEINO@@
      ***  THEN                                                         @3212SEINO@@
      *----------  残高異動カーソルオープンフラグ
      ***    MOVE  CNS-OFF              TO  FLG-TKMZZI00-CR-2           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":FLG-TKMZZI00-CR-2       =["              @3212SEINO@@
      *D*          FLG-TKMZZI00-CR-2 "]"                                @3212SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @3212SEINO@@
      ***      TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-058                                          @3212SEINO@@
      ***      TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @3212SEINO@@
      ***      TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @3212SEINO@@
      ***      TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      ***            WK-MSG-1-12             DELIMITED  BY SIZE         @3212SEINO@@
      ***      INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1     @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      *D*           ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      *D*           ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      *D*           RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      *D*           DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      *D*           DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      *D*           FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @3212SEINO@@
      ***  END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":別紙1-12 SQL END"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZI00-2-EXT.
           EXIT.
      ******************************************************************
      *        別紙1-13
      ******************************************************************
       TKMXTR00-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":別紙1-13 SQL START"
      *-----------------------------------------------------------------
      *    INITIALIZE                        SQLSTMT                    @3212SEINO@@
           INITIALIZE                        SQLSTMT13                  @3212SEINO@@
                                             H-TKMXTR00-13
           MOVE  WK-TABLE-TKMXTR00           TO  SQL-TBL-ID-13,
                                                 WK-TBL-TKMXTR00
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMXTR00-13,
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-13
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMXTR00-13,
                 WK-FUND-CD                  OF  WK-MSG-1-13,
                 WK-FUND-CD-1                OF  WK-MSG-1-13
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMXTR00-13,
                 WK-PTF-CD                   OF  WK-MSG-1-13
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD                OF  H-TKMXTR00-13,
                 WK-SEC-SBT-CD               OF  WK-MSG-1-13,
                 WK-SEC-SBT-CD-1             OF  WK-MSG-1-13
      *----------  銘柄コード
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-MEG-CD                    OF  H-TKMXTR00-13,
                 WK-MEG-CD                   OF  WK-MSG-1-13
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG                 OF  WK-TKMZBW03
             TO  H-TATE-FLG                  OF  H-TKMXTR00-13,
                 WK-TATE-FLG                 OF  WK-MSG-1-13
      *----------  玉ＩＤ
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03
             TO  H-GYOKU-ID                  OF  H-TKMXTR00-13,
                 WK-GYOKU-ID                 OF  WK-MSG-1-13
      *----------  開始基準日翌日
           MOVE  WK-KJN-YMD-TOM
             TO  H-KAISI-KJN-YMD-NEXT        OF  H-TKMXTR00-13,
                 WK-KAISI-KJN-YMD-NEXT       OF  WK-MSG-1-13
      *----------  基準日
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMXTR00-13,
                 WK-KJN-YMD                  OF  WK-MSG-1-13
      *    MOVE  SQL-SELECT-1-13             TO  SQLSTMT                @3212SEINO@@
           MOVE  SQL-SELECT-1-13             TO  SQLSTMT13              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード        = ["
      D             H-RIYO-CMP-CD            OF  H-TKMXTR00-13"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード        = ["
      D             H-FUND-CD                OF  H-TKMXTR00-13"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード  = ["
      D             H-PTF-CD                 OF  H-TKMXTR00-13"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード        = ["
      D             H-SEC-SBT-CD             OF  H-TKMXTR00-13"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード            = ["
      D             H-MEG-CD                 OF  H-TKMXTR00-13"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ= ["
      D             H-TATE-FLG               OF  H-TKMXTR00-13"]"
      D    DISPLAY CNS-PGM-ID":玉ＩＤ                = ["
      D             H-GYOKU-ID               OF  H-TKMXTR00-13"]"
      D    DISPLAY CNS-PGM-ID":開始基準日翌日        = ["
      D             H-KAISI-KJN-YMD-NEXT     OF  H-TKMXTR00-13"]"
      D    DISPLAY CNS-PGM-ID":基準日                = ["
      D             H-KJN-YMD                OF  H-TKMXTR00-13"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT               =["SQLSTMT"]"      @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT13          =["SQLSTMT13"]"       @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":WK-MSG-1-13           =["WK-MSG-1-13"]"
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-13=["
      D                        FLG-TKMXTR00-CR-13"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMXTR00-CR-13 = CNS-OFF                             @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC  SQL  PREPARE  S13  FROM :SQLSTMT  END-EXEC           @3212SEINO@@
             EXEC  SQL  PREPARE  S13  FROM :SQLSTMT13  END-EXEC         @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 CONTINUE
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-059
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-13        DELIMITED  BY SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
             EXEC
               SQL  DECLARE  TKMXTR00_CUR13  CURSOR FOR  S13
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMXTR00_CUR13
                 USING :H-TKMXTR00-13.H-RIYO-CMP-CD,
                       :H-TKMXTR00-13.H-FUND-CD,
                       :H-TKMXTR00-13.H-PTF-CD,
                       :H-TKMXTR00-13.H-FUND-CD,
                       :H-TKMXTR00-13.H-SEC-SBT-CD,
                       :H-TKMXTR00-13.H-MEG-CD,
                       :H-TKMXTR00-13.H-TATE-FLG,
                       :H-TKMXTR00-13.H-GYOKU-ID,
                       :H-TKMXTR00-13.H-SEC-SBT-CD,
                       :H-TKMXTR00-13.H-KAISI-KJN-YMD-NEXT,
                       :H-TKMXTR00-13.H-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  取引カーソルオープンフラグ
               MOVE  CNS-ON             TO  FLG-TKMXTR00-CR-13
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-13           =["
      D            FLG-TKMXTR00-CR-13 "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-060
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-13        DELIMITED  BY SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
           INITIALIZE H-MAX-UKE-YMD
           EXEC  SQL
               FETCH
                    TKMXTR00_CUR13
               INTO :H-MAX-UKE-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH        = ["SQLCODE"]"
      D    DISPLAY CNS-PGM-ID":H-MAX-UKE-YMD        = ["H-MAX-UKE-YMD"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  期間内取引.処理順決定日付
               MOVE  H-MAX-UKE-YMD
                 TO  WK-SRJUN-KT-DATE   OF  WK-KIKAN-TRHK
      *----------  期間内取引.受渡日
               MOVE  H-MAX-UKE-YMD
                 TO  WK-UKE-YMD         OF  WK-KIKAN-TRHK
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":期間内取引.処理順決定日付 = ["
      D            WK-SRJUN-KT-DATE     OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":期間内取引.受渡日 = ["
      D            WK-UKE-YMD           OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
             WHEN  CNS-SQL-1405
      *----------  期間内取引.処理順決定日付
               MOVE  WK-UKE-YMD         OF  WK-TRHK-GROUP
                 TO  WK-SRJUN-KT-DATE   OF  WK-KIKAN-TRHK
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":期間内取引.処理順決定日付 = ["
      D            WK-SRJUN-KT-DATE     OF  WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-061
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-13              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      ***  EXEC  SQL                                                    @3212SEINO@@
      ***    CLOSE TKMXTR00_CUR13                                       @3212SEINO@@
      ***  END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY CNS-PGM-ID                                           @3212SEINO@@
      *D*          ":SQL-SELECT-1-13 CLOSE SQLCODE=["SQLCODE"]"         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      ***  IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEINO@@
      ***  THEN                                                         @3212SEINO@@
      *----------  残高異動カーソルオープンフラグ
      ***    MOVE  CNS-OFF              TO  FLG-TKMXTR00-CR-13          @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":FLG-TKMXTR00-CR-13       =["             @3212SEINO@@
      *D*          FLG-TKMXTR00-CR-13 "]"                               @3212SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @3212SEINO@@
      ***      TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-062                                          @3212SEINO@@
      ***      TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @3212SEINO@@
      ***      TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @3212SEINO@@
      ***      TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      ***            WK-MSG-1-13        DELIMITED  BY SIZE              @3212SEINO@@
      ***      INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      *D*           ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      *D*           ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      *D*           RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      *D*           DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      *D*           DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      *D*           FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @3212SEINO@@
      ***  END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":別紙1-13 SQL END"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-EXT.
           EXIT.
      ******************************************************************
      *        (参)入れ子処理
      ******************************************************************
       IRE-RTN                SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (参)入れ子処理  START  ****"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
           MOVE  CNS-IRE-0              TO  FLG-MATAGI-IRE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-MATAGI-IRE   =["FLG-MATAGI-IRE"]"
      *-----------------------------------------------------------------
      *    INITIALIZE                   SQLSTMT                         @3212SEINO@@
           INITIALIZE                   SQLSTMT05                       @3212SEINO@@
                                        H-TKMZBW04
           MOVE  WK-TABLE-TKMZBW04      TO  SQL-TBL-ID-5
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-TKMZBW03
             TO  H-SYORI-YMD            OF  H-TKMZBW04,
                 WK-SYORI-YMD           OF  WK-MSG-1-5
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-TKMZBW03
             TO  H-KIDOU-ID             OF  H-TKMZBW04,
                 WK-KIDOU-ID            OF  WK-MSG-1-5
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW04,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-5
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMZBW04,
                 WK-FUND-CD             OF  WK-MSG-1-5
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMZBW04,
                 WK-PTF-CD              OF  WK-MSG-1-5
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03
             TO  H-KJN-YMD              OF  H-TKMZBW04,
                 WK-KJN-YMD             OF  WK-MSG-1-5
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD           OF  H-TKMZBW04,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-5
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-MEG-CD               OF  H-TKMZBW04,
                 WK-MEG-CD              OF  WK-MSG-1-5
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG            OF  WK-TKMZBW03
             TO  H-TATE-FLG             OF  H-TKMZBW04,
                 WK-TATE-FLG            OF  WK-MSG-1-5
      *----------  玉ID
           MOVE  WK-GYOKU-ID            OF  WK-TKMZBW03
             TO  H-GYOKU-ID             OF  H-TKMZBW04,
                 WK-GYOKU-ID            OF  WK-MSG-1-5
      *----------  受渡日
           MOVE  WK-UKE-YMD             OF  WK-MATAGI-TRHK
             TO  H-UKE-YMD              OF  H-TKMZBW04,
                 WK-UKE-YMD             OF  WK-MSG-1-5
      *----ＳＱＬ文
      *    MOVE  SQL-SELECT-1-5         TO  SQLSTMT                     @3212SEINO@@
           MOVE  SQL-SELECT-1-5         TO  SQLSTMT05                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日              =["
      D            H-SYORI-YMD          OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":起動ID                  =["
      D            H-KIDOU-ID           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["
      D            H-FUND-CD            OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["
      D            H-PTF-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":基準日                  =["
      D            H-KJN-YMD            OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["
      D            H-SEC-SBT-CD         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["
      D            H-MEG-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":玉ID                    =["
      D            H-GYOKU-ID           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":受渡日                  =["
      D            H-UKE-YMD            OF  H-TKMZBW04"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT05              =["SQLSTMT05"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-5             =["WK-MSG-1-5"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-CR=["FLG-TKMZBW04-CR"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMZBW04-CR = CNS-OFF                                @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC  SQL  PREPARE  S5  FROM :SQLSTMT  END-EXEC            @3212SEINO@@
             EXEC  SQL  PREPARE  S5  FROM :SQLSTMT05  END-EXEC          @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 CONTINUE
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-063
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-5              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
             EXEC
               SQL  DECLARE  TKMZBW04_CURSOR  CURSOR FOR  S5
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZBW04_CURSOR
                 USING :H-TKMZBW04.H-SYORI-YMD,
                       :H-TKMZBW04.H-KIDOU-ID,
                       :H-TKMZBW04.H-RIYO-CMP-CD,
                       :H-TKMZBW04.H-FUND-CD,
                       :H-TKMZBW04.H-PTF-CD,
                       :H-TKMZBW04.H-KJN-YMD,
                       :H-TKMZBW04.H-MEG-CD,
                       :H-TKMZBW04.H-SEC-SBT-CD,
                       :H-TKMZBW04.H-TATE-FLG,
                       :H-TKMZBW04.H-GYOKU-ID,
                       :H-TKMZBW04.H-UKE-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  対象取引カーソルオープンフラグ
               MOVE  CNS-ON             TO  FLG-TKMZBW04-CR
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR           =["
      D            FLG-TKMZBW04-CR "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-064
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
           EXEC  SQL
               FETCH
                    TKMZBW04_CURSOR
               INTO :H-TKMZBW04.H-KEIJOU-KIJUNBI
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  計上基準日
               MOVE  H-KEIJOU-KIJUNBI   OF  H-TKMZBW04
                 TO  WK-KEIJOU-KIJUNBI  OF  WK-TKMZBW04-1-5
               MOVE  H-KEIJOU-KIJUNBI   OF  H-TKMZBW04
                 TO  WK-KEIJOU-KIJUNBI  OF  WK-TKMZBW04
      *----------  跨ぎ入れ子フラグ
               MOVE  CNS-IRE-1          TO  FLG-MATAGI-IRE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":計上基準日              =["
      D            WK-KEIJOU-KIJUNBI    OF  WK-TKMZBW04-1-5"]"
      D    DISPLAY CNS-PGM-ID":ワーク計上基準日=["
      D            WK-KEIJOU-KIJUNBI  OF  WK-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ  =["FLG-MATAGI-IRE"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理 (NOTFOUND)"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-065
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-5              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      ***  EXEC  SQL                                                    @3212SEINO@@
      ***    CLOSE TKMZBW04_CURSOR                                      @3212SEINO@@
      ***  END-EXEC                                                     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY CNS-PGM-ID":SQL-SELECT-1-5 CLOSE SQLCODE=["SQLCODE"]"@3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      ***  IF  SQLCODE                  = CNS-SQL-NORMAL                @3212SEINO@@
      ***  THEN                                                         @3212SEINO@@
      *----------  対象取引カーソルオープンフラグ
      ***    MOVE  CNS-OFF              TO  FLG-TKMZBW04-CR             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      *D*  DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR       =["                @3212SEINO@@
      *D*          FLG-TKMZBW04-CR "]"                                  @3212SEINO@@
      *-----------------------------------------------------------------
      ***  ELSE                                                         @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *----------  エラー検知プログラム名
      ***    MOVE  CNS-PGM-ID                                           @3212SEINO@@
      ***      TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  ポジション
      ***    MOVE  CNS-POS-066                                          @3212SEINO@@
      ***      TO  ERR-POS              OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  リターンコード
      ***    MOVE  CNS-RTN-900                                          @3212SEINO@@
      ***      TO  RTN-CD               OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコード
      ***    MOVE  SQLCODE                                              @3212SEINO@@
      ***      TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ
      ***    MOVE  CNS-DETAIL-1                                         @3212SEINO@@
      ***      TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1          @3212SEINO@@
      *---------- フリーメッセージ
      ***    STRING  CNS-SQL-MSG-SELECT,                                @3212SEINO@@
      ***            WK-MSG-1-5              DELIMITED  BY SIZE         @3212SEINO@@
      ***      INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1     @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------
      *D*  DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      *D*           ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      *D*           ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      *D*           RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      *D*           DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      *D*           DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *D*  DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      *D*           FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  エラー処理
      ***    PERFORM  ERR-RTN                                           @3212SEINO@@
      ***  END-IF                                                       @3212SEINO@@
      *----------  1)対象取引TBLより跨ぎ入れ子を探す（受渡日がダブった場合）
           PERFORM  UKE-YMD-DOUBLE-RTN
      *----------  2)『対象取引_1』カーソルフェッチする
           MOVE  CNS-ON                 TO  FLG-TKMZBW04-FE-1
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IRE-RTN]"                     GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW04-1-FETCH-RTN
             UNTIL  FLG-TKMZBW04-FE-1    =  CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [IRE-RTN]"                     GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  3)『対象取引_1』カーソルクローズ処理
      ***  PERFORM  TKMZBW04-1-CLOSE-RTN                                @3212SEINO@@
      *----------  跨ぎ入れ子フラグ＝1:跨ぎ入れ子又は（跨ぎ入れ子フラグ＝0且つ跨ぎ入れ子フラグ2＝1）の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-MATAGI-IRE=["FLG-MATAGI-IRE"]"
      D    DISPLAY CNS-PGM-ID":FLG-MATAGI-IRE-2=["FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
           IF  ( FLG-MATAGI-IRE = CNS-IRE-1 )
            OR ( FLG-MATAGI-IRE = CNS-IRE-0 AND
                 FLG-MATAGI-IRE-2 = CNS-IRE-1 )
           THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ＝1:跨ぎ入れ子又は（跨"
      D    "ぎ入れ子フラグ＝0且つ跨ぎ入れ子フラグ2＝1）の場合"
      *-----------------------------------------------------------------
             COMPUTE  WK-TRHK-SELECT-KENSU
                   =  WK-TRHK-SELECT-KENSU + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引SELECT件数=["WK-TRHK-SELECT-KENSU"]"
      *-----------------------------------------------------------------
             PERFORM  MATAGI-IRE-BAAI-RTN
           ELSE
             CONTINUE
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  (参)入れ子処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       IRE-EXT.
           EXIT.
      ******************************************************************
      *     1)対象取引TBLより跨ぎ入れ子を探す（受渡日がダブった場合）
      ******************************************************************
       UKE-YMD-DOUBLE-RTN     SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  1)対象取引TBLより跨ぎ入れ子を探"
      D             "す(受渡日がダブった場合) START  ****"
      *-----------------------------------------------------------------
      *    INITIALIZE                   SQLSTMT                         @3212SEINO@@
           INITIALIZE                   SQLSTMT06                       @3212SEINO@@
                                        H-TKMZBW04
                                        WK-MSG-1-6
           MOVE  WK-TABLE-TKMZBW04      TO  SQL-TBL-ID-6
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-TKMZBW03
             TO  H-SYORI-YMD            OF  H-TKMZBW04,
                 WK-SYORI-YMD           OF  WK-MSG-1-6
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-TKMZBW03
             TO  H-KIDOU-ID             OF  H-TKMZBW04,
                 WK-KIDOU-ID            OF  WK-MSG-1-6
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW04,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-6
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMZBW04,
                 WK-FUND-CD             OF  WK-MSG-1-6
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMZBW04,
                 WK-PTF-CD              OF  WK-MSG-1-6
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03
             TO  H-KJN-YMD              OF  H-TKMZBW04,
                 WK-KJN-YMD             OF  WK-MSG-1-6
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD           OF  H-TKMZBW04,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-6
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-MEG-CD               OF  H-TKMZBW04,
                 WK-MEG-CD              OF  WK-MSG-1-6
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG            OF  WK-TKMZBW03
             TO  H-TATE-FLG             OF  H-TKMZBW04,
                 WK-TATE-FLG            OF  WK-MSG-1-6
      *----------  玉ID
           MOVE  WK-GYOKU-ID            OF  WK-TKMZBW03
             TO  H-GYOKU-ID             OF  H-TKMZBW04,
                 WK-GYOKU-ID            OF  WK-MSG-1-6
      *----------  受渡日
           MOVE  WK-UKE-YMD             OF  WK-MATAGI-TRHK
             TO  H-UKE-YMD              OF  H-TKMZBW04,
                 WK-UKE-YMD             OF  WK-MSG-1-6
      *----ＳＱＬ文
      *    MOVE  SQL-SELECT-1-6         TO  SQLSTMT                     @3212SEINO@@
           MOVE  SQL-SELECT-1-6         TO  SQLSTMT06                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日              =["
      D            H-SYORI-YMD          OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":起動ID                  =["
      D            H-KIDOU-ID           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["
      D            H-FUND-CD            OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["
      D            H-PTF-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":基準日                  =["
      D            H-KJN-YMD            OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["
      D            H-SEC-SBT-CD         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["
      D            H-MEG-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":玉ID                    =["
      D            H-GYOKU-ID           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":受渡日                  =["
      D            H-UKE-YMD            OF  H-TKMZBW04"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT06             =["SQLSTMT06"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-6             =["WK-MSG-1-6"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-CR-1=["FLG-TKMZBW04-CR-1"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-TKMZBW04-CR-1 = CNS-OFF                              @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC  SQL  PREPARE  S6  FROM :SQLSTMT  END-EXEC            @3212SEINO@@
             EXEC  SQL  PREPARE  S6  FROM :SQLSTMT06  END-EXEC          @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                 CONTINUE
               WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-067
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-6              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
             EXEC
               SQL  DECLARE  TKMZBW04_CURSOR_1 CURSOR FOR  S6
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
               OPEN TKMZBW04_CURSOR_1
                 USING :H-TKMZBW04.H-SYORI-YMD,
                       :H-TKMZBW04.H-KIDOU-ID,
                       :H-TKMZBW04.H-RIYO-CMP-CD,
                       :H-TKMZBW04.H-FUND-CD,
                       :H-TKMZBW04.H-PTF-CD,
                       :H-TKMZBW04.H-KJN-YMD,
                       :H-TKMZBW04.H-MEG-CD,
                       :H-TKMZBW04.H-SEC-SBT-CD,
                       :H-TKMZBW04.H-TATE-FLG,
                       :H-TKMZBW04.H-GYOKU-ID,
                       :H-TKMZBW04.H-UKE-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  取引_1カーソルオープンフラグ
               MOVE  CNS-ON             TO  FLG-TKMZBW04-CR-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-1       =["
      D            FLG-TKMZBW04-CR-1 "]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-068
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  1)対象取引TBLより跨ぎ入れ子を探"
      D             "す(受渡日がダブった場合) END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       UKE-YMD-DOUBLE-EXT.
           EXIT.
      ******************************************************************
      *       2)『対象取引_1』カーソルフェッチする
      ******************************************************************
       TKMZBW04-1-FETCH-RTN   SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『対象取引_1』カーソルフェッチ"
      D             "する START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  H-TORI-ID        OF  H-TKMZBW04
                       H-YKJ-YMD        OF  H-TKMZBW04
                       H-SRJUN-KT-TEKIYO
                                        OF  H-TKMZBW04
                       H-SRJUN-KT-ZOUGEN
                                        OF  H-TKMZBW04
                       H-SRJUN-KT-HYOKA OF  H-TKMZBW04
                       H-KEIJOU-KIJUNBI OF  H-TKMZBW04
                       H-DUMMY-KBN      OF  H-TKMZBW04
                       H-TORI-JIYU      OF  H-TKMZBW04
           EXEC  SQL
               FETCH
                    TKMZBW04_CURSOR_1
               INTO :H-TKMZBW04.H-TORI-ID,
                    :H-TKMZBW04.H-YKJ-YMD,
                    :H-TKMZBW04.H-SRJUN-KT-TEKIYO,
                    :H-TKMZBW04.H-SRJUN-KT-ZOUGEN,
                    :H-TKMZBW04.H-SRJUN-KT-HYOKA,
                    :H-TKMZBW04.H-KEIJOU-KIJUNBI,
                    :H-TKMZBW04.H-DUMMY-KBN,
                    :H-TKMZBW04.H-TORI-JIYU
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH           =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  原取引ID
               MOVE  H-TORI-ID               OF  H-TKMZBW04
                 TO  WK-TORI-ID              OF  WK-TKMZBW04
      *----------  約定日
               MOVE  H-YKJ-YMD               OF  H-TKMZBW04
                 TO  WK-YKJ-YMD              OF  WK-TKMZBW04
      *----------  処理順決定摘要
               MOVE  H-SRJUN-KT-TEKIYO       OF  H-TKMZBW04
                 TO  WK-SRJUN-KT-TEKIYO      OF  WK-TKMZBW04
      *----------  処理順決定増減
               MOVE  H-SRJUN-KT-ZOUGEN       OF  H-TKMZBW04
                 TO  WK-SRJUN-KT-ZOUGEN      OF  WK-TKMZBW04
      *----------  処理順決定評価
               MOVE  H-SRJUN-KT-HYOKA        OF  H-TKMZBW04
                 TO  WK-SRJUN-KT-HYOKA       OF  WK-TKMZBW04
      *----------  計上基準日
               MOVE  H-KEIJOU-KIJUNBI        OF  H-TKMZBW04
                 TO  WK-KEIJOU-KIJUNBI       OF  WK-TKMZBW04-1-6
      *----------  ダミー区分
               MOVE  H-DUMMY-KBN             OF  H-TKMZBW04
                 TO  WK-DUMMY-KBN            OF  WK-TKMZBW04
      *----------  取引事由
               MOVE  H-TORI-JIYU             OF  H-TKMZBW04
                 TO  WK-TORI-JIYU            OF  WK-TKMZBW04
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            WK-TORI-ID                OF  WK-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":約定日                       =["
      D            WK-YKJ-YMD                OF  WK-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定摘要               =["
      D            WK-SRJUN-KT-TEKIYO        OF  WK-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定増減               =["
      D            WK-SRJUN-KT-ZOUGEN        OF  WK-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定評価               =["
      D            WK-SRJUN-KT-HYOKA         OF  WK-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":計上基準日                   =["
      D            WK-KEIJOU-KIJUNBI         OF  WK-TKMZBW04-1-6"]"
      D    DISPLAY CNS-PGM-ID":ダミー区分                   =["
      D            WK-DUMMY-KBN              OF  WK-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":取引事由                     =["
      D            WK-TORI-JIYU              OF  WK-TKMZBW04"]"
      *-----------------------------------------------------------------
      *----------  ア）期間内取引
               INITIALIZE               WK-KIKAN-TRHK
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":期間内取引                   =["
      D            WK-KIKAN-TRHK"]"
      *-----------------------------------------------------------------
      *----------  期間内取引.処理順決定摘要
               MOVE  WK-SRJUN-KT-TEKIYO      OF  WK-TKMZBW04
                 TO  WK-SRJUN-KT-TEKIYO      OF  WK-KIKAN-TRHK
      *----------  期間内取引.処理順決定増減
               MOVE  WK-SRJUN-KT-ZOUGEN      OF  WK-TKMZBW04
                 TO  WK-SRJUN-KT-ZOUGEN      OF  WK-KIKAN-TRHK
      *----------  期間内取引.約定日
               MOVE  WK-YKJ-YMD              OF  WK-TKMZBW04
                 TO  WK-YKJ-YMD              OF  WK-KIKAN-TRHK
      *----------  期間内取引.原取引ID
               MOVE  WK-TORI-ID              OF  WK-TKMZBW04
                 TO  WK-TORI-ID              OF  WK-KIKAN-TRHK
      *----------  期間内取引.ダミー区分
               MOVE  WK-DUMMY-KBN            OF  WK-TKMZBW04
                 TO  WK-DUMMY-KBN            OF  WK-KIKAN-TRHK
      *----------  期間内取引.取引事由
               MOVE  WK-TORI-JIYU            OF  WK-TKMZBW04
                 TO  WK-TORI-JIYU            OF  WK-KIKAN-TRHK
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":期間内取引.処理順決定摘要    =["
      D            WK-SRJUN-KT-TEKIYO        OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":期間内取引.処理順決定増減    =["
      D            WK-SRJUN-KT-ZOUGEN        OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":期間内取引.約定日            =["
      D            WK-YKJ-YMD                OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":期間内取引.原取引ID          =["
      D            WK-TORI-ID                OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":期間内取引.ダミー区分        =["
      D            WK-DUMMY-KBN              OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":期間内取引.取引事由          =["
      D            WK-TORI-JIYU              OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":期間内異動計算パターン.処理順序=["
      D            SYRI-JUN               OF  WK-KKN-IDO-CALC-PATTERN"]"
      *-----------------------------------------------------------------
      *----------  期間内異動計算パターン.処理順序
               EVALUATE  SYRI-JUN            OF  WK-KKN-IDO-CALC-PATTERN
      *----------  イ）期間内異動計算パターン.処理順序＝'5'の場合
                 WHEN  CNS-SYRI-JUN-5
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":期間内異動計算パターン.処理順序＝'5'"
      D            "の場合 "
      D    DISPLAY CNS-PGM-ID":期間内取引.処理順決定摘要    =["
      D            WK-SRJUN-KT-TEKIYO        OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.処理順決定摘要      =["
      D            WK-SRJUN-KT-TEKIYO        OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                   IF  (WK-SRJUN-KT-TEKIYO   OF  WK-KIKAN-TRHK
                   <   WK-SRJUN-KT-TEKIYO    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  a)期間内取引.処理順決定摘要 < 跨ぎ取引.処理順決定摘要の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":a)期間内取引.処理順決定摘要 < 跨ぎ取引."
      D            "処理順決定摘要の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                     MOVE  CNS-IRE-1         TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                   IF  (WK-SRJUN-KT-TEKIYO   OF  WK-KIKAN-TRHK
                   >   WK-SRJUN-KT-TEKIYO    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  b)期間内取引.処理順決定摘要 > 跨ぎ取引.処理順決定摘要の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":b)期間内取引.処理順決定摘要 > 跨ぎ取引."
      D            "処理順決定摘要の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                     MOVE  CNS-IRE-0         TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                   IF  (WK-SRJUN-KT-TEKIYO   OF  WK-KIKAN-TRHK
                   =   WK-SRJUN-KT-TEKIYO    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  c)期間内取引.処理順決定摘要 = 跨ぎ取引.処理順決定摘要の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":c)期間内取引.処理順決定摘要 = 跨ぎ取引."
      D            "処理順決定摘要の場合"
      D    DISPLAY CNS-PGM-ID":期間内取引.原取引ID          =["
      D            WK-TORI-ID                OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.原取引ID            =["
      D            WK-TORI-ID                OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                     IF  (WK-TORI-ID         OF  WK-KIKAN-TRHK
                     <   WK-TORI-ID          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  あ）期間内取引.原取引ID < 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":あ）期間内取引.原取引ID < 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-1       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                     ELSE
                       CONTINUE
                     END-IF
                     IF  (WK-TORI-ID         OF  WK-KIKAN-TRHK
                     >   WK-TORI-ID          OF  WK-MATAGI-TRHK)
                     THEN
      *----------   い）期間内取引.原取引ID > 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":い）期間内取引.原取引ID > 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-0       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                     ELSE
                       CONTINUE
                     END-IF
                     IF  (WK-TORI-ID         OF  WK-KIKAN-TRHK
                     =   WK-TORI-ID          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  う）期間内取引.原取引ID ＝ 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":う）期間内取引.原取引ID = 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                       MOVE  CNS-PGM-ID
                         TO  ERR-PGM-ID      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                       MOVE  CNS-POS-069
                         TO  ERR-POS         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                       MOVE  CNS-RTN-140
                         TO  RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                       MOVE  ZERO            TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                       MOVE  CNS-DETAIL-0
                         TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                       MOVE  SPACE
                         TO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                       PERFORM  ERR-RTN
                     ELSE
                       CONTINUE
                     END-IF
                   ELSE
                     CONTINUE
                   END-IF
      *----------  ウ）期間内異動計算パターン.処理順序＝'6'の場合
                 WHEN  CNS-SYRI-JUN-6
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":期間内異動計算パターン.処理順序＝'6'"
      D            "の場合 "
      D    DISPLAY CNS-PGM-ID":期間内取引.処理順決定摘要    =["
      D            WK-SRJUN-KT-TEKIYO        OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.処理順決定摘要      =["
      D            WK-SRJUN-KT-TEKIYO        OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                   IF  (WK-SRJUN-KT-TEKIYO   OF  WK-KIKAN-TRHK
                   <   WK-SRJUN-KT-TEKIYO    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  a)期間内取引.処理順決定摘要 < 跨ぎ取引.処理順決定摘要の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":a)期間内取引.処理順決定摘要 < 跨ぎ取引."
      D            "処理順決定摘要の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                     MOVE  CNS-IRE-1         TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                   IF  (WK-SRJUN-KT-TEKIYO   OF  WK-KIKAN-TRHK
                   >   WK-SRJUN-KT-TEKIYO    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  b)期間内取引.処理順決定摘要 > 跨ぎ取引.処理順決定摘要の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":b)期間内取引.処理順決定摘要 > 跨ぎ取引."
      D            "処理順決定摘要の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                     MOVE  CNS-IRE-0         TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                   IF  (WK-SRJUN-KT-TEKIYO   OF  WK-KIKAN-TRHK
                   =   WK-SRJUN-KT-TEKIYO    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  c)期間内取引.処理順決定摘要 = 跨ぎ取引.処理順決定摘要の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":c)期間内取引.処理順決定摘要 = 跨ぎ取引."
      D            "処理順決定摘要の場合"
      D    DISPLAY CNS-PGM-ID":期間内取引.約定日            =["
      D            WK-YKJ-YMD                OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.約定日              =["
      D            WK-YKJ-YMD                OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                     IF  (WK-YKJ-YMD         OF  WK-KIKAN-TRHK
                     <    WK-YKJ-YMD         OF  WK-MATAGI-TRHK)
                     THEN
      *----------  A)期間内取引.約定日 < 跨ぎ取引.約定日の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":A)期間内取引.約定日 < 跨ぎ取引.約定日"
      D            "の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-1       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                     ELSE
                       CONTINUE
                     END-IF
                     IF  (WK-YKJ-YMD         OF  WK-KIKAN-TRHK
                     >   WK-YKJ-YMD          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  B)期間内取引.約定日 > 跨ぎ取引.約定日の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":B)期間内取引.約定日 > 跨ぎ取引.約定日"
      D            "の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-0       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                     ELSE
                       CONTINUE
                     END-IF
                     IF  (WK-YKJ-YMD         OF  WK-KIKAN-TRHK
                     =   WK-YKJ-YMD          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  C)期間内取引.約定日 ＝ 跨ぎ取引.約定日の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":C)期間内取引.約定日=跨ぎ取引.約定日"
      D            "の場合"
      D    DISPLAY CNS-PGM-ID":期間内取引.原取引ID          =["
      D            WK-TORI-ID                OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.原取引ID            =["
      D            WK-TORI-ID                OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                       IF  (WK-TORI-ID       OF  WK-KIKAN-TRHK
                       <   WK-TORI-ID        OF  WK-MATAGI-TRHK)
                       THEN
      *----------  あ）期間内取引.原取引ID < 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":あ）期間内取引.原取引ID < 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                         MOVE  CNS-IRE-1     TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                       ELSE
                         CONTINUE
                       END-IF
                       IF  (WK-TORI-ID       OF  WK-KIKAN-TRHK
                       >   WK-TORI-ID        OF  WK-MATAGI-TRHK)
                       THEN
      *----------   い）期間内取引.原取引ID > 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":い）期間内取引.原取引ID > 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                         MOVE  CNS-IRE-0     TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                       ELSE
                         CONTINUE
                       END-IF
                       IF  (WK-TORI-ID       OF  WK-KIKAN-TRHK
                       =   WK-TORI-ID        OF  WK-MATAGI-TRHK)
                       THEN
      *----------  う）期間内取引.原取引ID ＝ 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":う）期間内取引.原取引ID = 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                         MOVE  CNS-PGM-ID
                           TO  ERR-PGM-ID    OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                         MOVE  CNS-POS-070
                           TO  ERR-POS       OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                         MOVE  CNS-RTN-140
                           TO  RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                         MOVE  ZERO          TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                         MOVE  CNS-DETAIL-0
                           TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                         MOVE  SPACE
                           TO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                         PERFORM  ERR-RTN
                       ELSE
                         CONTINUE
                       END-IF
                     ELSE
                       CONTINUE
                     END-IF
                   ELSE
                     CONTINUE
                   END-IF
      *----------  エ）期間内異動計算パターン.処理順序＝'7'の場合
                 WHEN  CNS-SYRI-JUN-7
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":期間内異動計算パターン.処理順序＝'7'"
      D            "の場合 "
      D    DISPLAY CNS-PGM-ID":期間内取引.処理順決定増減    =["
      D            WK-SRJUN-KT-ZOUGEN        OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.処理順決定増減      =["
      D            WK-SRJUN-KT-ZOUGEN        OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                   IF ( WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                   <   WK-SRJUN-KT-ZOUGEN    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  a)期間内取引.処理順決定増減 < 跨ぎ取引.処理順決定増減の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":a)期間内取引.処理順決定増減 < 跨ぎ取引."
      D            "処理順決定増減の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                     MOVE  CNS-IRE-1
                       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                   IF  (WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                   >   WK-SRJUN-KT-ZOUGEN    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  b)期間内取引.処理順決定増減 > 跨ぎ取引.処理順決定増減の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":b)期間内取引.処理順決定増減 > 跨ぎ取引."
      D            "処理順決定増減の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                     MOVE  CNS-IRE-0         TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                   IF  (WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                   =   WK-SRJUN-KT-ZOUGEN    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  c)期間内取引.処理順決定増減 = 跨ぎ取引.処理順決定増減の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":c)期間内取引.処理順決定増減 = 跨ぎ取引."
      D            "処理順決定増減の場合"
      D    DISPLAY CNS-PGM-ID":期間内取引.原取引ID          =["
      D            WK-TORI-ID                OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.原取引ID            =["
      D            WK-TORI-ID                OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                     IF  (WK-TORI-ID         OF  WK-KIKAN-TRHK
                     <   WK-TORI-ID          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  あ）期間内取引.原取引ID < 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":あ）期間内取引.原取引ID < 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-1       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                     ELSE
                       CONTINUE
                     END-IF
                     IF  (WK-TORI-ID         OF  WK-KIKAN-TRHK
                     >   WK-TORI-ID          OF  WK-MATAGI-TRHK)
                     THEN
      *----------   い）期間内取引.原取引ID > 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":い）期間内取引.原取引ID > 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-0       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                     ELSE
                       CONTINUE
                     END-IF
                     IF  (WK-TORI-ID         OF  WK-KIKAN-TRHK
                     =   WK-TORI-ID          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  う）期間内取引.原取引ID ＝ 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":う）期間内取引.原取引ID = 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                       MOVE  CNS-PGM-ID
                         TO  ERR-PGM-ID      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                       MOVE  CNS-POS-071
                         TO  ERR-POS         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                       MOVE  CNS-RTN-140
                         TO  RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                       MOVE  ZERO            TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                       MOVE  CNS-DETAIL-0
                         TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                       MOVE  SPACE
                         TO  FREE-MSG        OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                       PERFORM  ERR-RTN
                     ELSE
                       CONTINUE
                     END-IF
                   ELSE
                     CONTINUE
                   END-IF
      *----------  オ）期間内異動計算パターン.処理順序＝'8'の場合
                 WHEN  CNS-SYRI-JUN-8
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":期間内異動計算パターン.処理順序＝'8'"
      D            "の場合 "
      D    DISPLAY CNS-PGM-ID":期間内取引.処理順決定増減    =["
      D            WK-SRJUN-KT-ZOUGEN        OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.処理順決定増減      =["
      D            WK-SRJUN-KT-ZOUGEN        OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                   IF  (WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                   <   WK-SRJUN-KT-ZOUGEN    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  a)期間内取引.処理順決定増減 < 跨ぎ取引.処理順決定増減の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":a)期間内取引.処理順決定増減 < 跨ぎ取引."
      D            "処理順決定増減の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                     MOVE  CNS-IRE-1         TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                   IF  (WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                   >   WK-SRJUN-KT-ZOUGEN    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  b)期間内取引.処理順決定増減 > 跨ぎ取引.処理順決定増減の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":b)期間内取引.処理順決定増減 > 跨ぎ取引."
      D            "処理順決定増減の場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                     MOVE  CNS-IRE-0         TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                   ELSE
                     CONTINUE
                   END-IF
                   IF  (WK-SRJUN-KT-ZOUGEN   OF  WK-KIKAN-TRHK
                   =   WK-SRJUN-KT-ZOUGEN    OF  WK-MATAGI-TRHK)
                   THEN
      *----------  c)期間内取引.処理順決定増減 = 跨ぎ取引.処理順決定増減の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":c)期間内取引.処理順決定増減 = 跨ぎ取引."
      D            "処理順決定増減の場合"
      D    DISPLAY CNS-PGM-ID":期間内取引.約定日            =["
      D            WK-YKJ-YMD                OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.約定日              =["
      D            WK-YKJ-YMD                OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                     IF  (WK-YKJ-YMD         OF  WK-KIKAN-TRHK
                     <   WK-YKJ-YMD          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  A)期間内取引.約定日 < 跨ぎ取引.約定日の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":A)期間内取引.約定日 < 跨ぎ取引.約定日の"
      D            "場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-1       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                     ELSE
                       CONTINUE
                     END-IF
                     IF ( WK-YKJ-YMD         OF  WK-KIKAN-TRHK
                     >   WK-YKJ-YMD          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  B)期間内取引.約定日 > 跨ぎ取引.約定日の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID": B)期間内取引.約定日 > 跨ぎ取引.約定日の"
      D            "場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-0       TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                     ELSE
                       CONTINUE
                     END-IF
                     IF  ( WK-YKJ-YMD        OF  WK-KIKAN-TRHK
                     =   WK-YKJ-YMD          OF  WK-MATAGI-TRHK)
                     THEN
      *----------  C)期間内取引.約定日 ＝ 跨ぎ取引.約定日の場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID": C)期間内取引.約定日 = 跨ぎ取引.約定日の"
      D            "場合"
      D    DISPLAY CNS-PGM-ID":期間内取引.原取引ID          =["
      D            WK-TORI-ID                OF  WK-KIKAN-TRHK"]"
      D    DISPLAY CNS-PGM-ID":跨ぎ取引.原取引ID            =["
      D            WK-TORI-ID                OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
                       IF ( WK-TORI-ID       OF  WK-KIKAN-TRHK
                       <   WK-TORI-ID        OF  WK-MATAGI-TRHK)
                       THEN
      *----------  あ）期間内取引.原取引ID < 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":あ）期間内取引.原取引ID < 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                       MOVE  CNS-IRE-1       TO  FLG-MATAGI-IRE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                       ELSE
                         CONTINUE
                       END-IF
                       IF  (WK-TORI-ID     OF  WK-KIKAN-TRHK
                       >   WK-TORI-ID      OF  WK-MATAGI-TRHK)
                       THEN
      *----------   い）期間内取引.原取引ID > 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":い）期間内取引.原取引ID > 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  跨ぎ入れ子フラグ
                         MOVE  CNS-IRE-0     TO  FLG-MATAGI-IRE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":跨ぎ入れ子フラグ2             =["
      D            FLG-MATAGI-IRE-2"]"
      *-----------------------------------------------------------------
                       ELSE
                         CONTINUE
                       END-IF
                       IF  (WK-TORI-ID     OF  WK-KIKAN-TRHK
                       =   WK-TORI-ID      OF  WK-MATAGI-TRHK)
                       THEN
      *----------  う）期間内取引.原取引ID ＝ 跨ぎ取引.原取引IDの場合
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":う）期間内取引.原取引ID = 跨ぎ取引.原取"
      D            "引IDの場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                         MOVE  CNS-PGM-ID
                           TO  ERR-PGM-ID    OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                         MOVE  CNS-POS-072
                           TO  ERR-POS       OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                         MOVE  CNS-RTN-140
                           TO  RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                         MOVE  ZERO          TO  DETAIL-RTN-CD
                                             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                         MOVE  CNS-DETAIL-0
                           TO  DETAIL-RTN-CD-FLG OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                         MOVE  SPACE
                           TO  FREE-MSG      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                         PERFORM  ERR-RTN
                       ELSE
                         CONTINUE
                       END-IF
                     ELSE
                       CONTINUE
                     END-IF
                   ELSE
                     CONTINUE
                   END-IF
      *----------  カ）期間内異動計算パターン.処理順序＝上記以外の場合
                 WHEN  OTHER
      *----------  エラー検知プログラム名
                   MOVE  CNS-PGM-ID
                     TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-073
                     TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-140
                     TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  ZERO
                     TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-0
                     TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  SPACE
                     TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                   PERFORM  ERR-RTN
               END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":跨ぎ入れ子フラグ2           =["
      D             FLG-MATAGI-IRE-2"]"
      D    DISPLAY  CNS-PGM-ID":「別紙1-5」.計上基準日      =["
      D             WK-KEIJOU-KIJUNBI   OF  WK-TKMZBW04-1-5"]"
      D    DISPLAY  CNS-PGM-ID":「別紙1-6」.計上基準日      =["
      D             WK-KEIJOU-KIJUNBI   OF  WK-TKMZBW04-1-6"]"
      *-----------------------------------------------------------------
      *----------  キ）跨ぎ入れ子フラグ2＝1の場合
               IF  FLG-MATAGI-IRE-2  =  CNS-IRE-1
               THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":キ）跨ぎ入れ子フラグ2＝1の場合"
      *-----------------------------------------------------------------
                 IF  WK-KEIJOU-KIJUNBI OF WK-TKMZBW04-1-5
                   <=  WK-KEIJOU-KIJUNBI OF WK-TKMZBW04-1-6
                 THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":ワーク計上基準日<＝"
      D    "「別紙1-6」.計上基準日の場合"
      *-----------------------------------------------------------------
                   MOVE  WK-KEIJOU-KIJUNBI  OF  WK-TKMZBW04-1-6
                     TO  WK-KEIJOU-KIJUNBI  OF  WK-TKMZBW04
                 ELSE
                   CONTINUE
                 END-IF
                 MOVE  CNS-OFF  TO  FLG-TKMZBW04-FE-1
               ELSE
                 CONTINUE
               END-IF
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":ワーク計上基準日=["
      D             WK-KEIJOU-KIJUNBI   OF  WK-TKMZBW04    "]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *----------  対象取引_1カーソルオープンフラグ
               MOVE  CNS-OFF            TO  FLG-TKMZBW04-FE-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-FE-1            =["
      D            FLG-TKMZBW04-FE-1 "]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-074
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『対象取引_1』カーソルフェッチ"
      D             "する  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-1-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    跨ぎ入れ子フラグ＝1:跨ぎ入れ子又は（跨ぎ入れ子フラグ＝0
      *    且つ跨ぎ入れ子フラグ2＝1）の場合
      ******************************************************************
       MATAGI-IRE-BAAI-RTN    SECTION.
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  跨ぎ入れ子フラグ＝1:跨ぎ入れ"
      D             "子又は（跨ぎ入れ子フラグ＝0"
      D             "且つ跨ぎ入れ子フラグ2＝1）の場合  STRAT  ****"
      D    DISPLAY  CNS-PGM-ID ":赤の増幅取引を追加する"
      *-----------------------------------------------------------------
      *----------  ①赤の増幅取引を追加する
      *----------  跨ぎ取引.計上基準日
           MOVE  WK-KEIJOU-KIJUNBI           OF  WK-TKMZBW04
             TO  WK-KEIJOU-KIJUNBI           OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.増幅赤黒区分
           MOVE  CNS-AKA-1
             TO  WK-ZOFKU-AKA-KBN            OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.増幅区分
           MOVE  CNS-PLUS-1
             TO  WK-ZOFKU-KBN                OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.増幅元異動計上基準日
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.処理順決定日付
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  WK-SRJUN-KT-DATE            OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.処理順同日優先度日付
           MOVE  WK-UKE-YMD                  OF  WK-MATAGI-TRHK
             TO  WK-SRJUN-DJ-DATE            OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-MATAGI-TRHK
             TO  WK-DUMMY-KBN                OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.取引事由
           MOVE  WK-TORI-JIYU                OF  WK-MATAGI-TRHK
             TO  WK-TORI-JIYU                OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.処理順決定評価
           MOVE  CNS-5
             TO  WK-SRJUN-KT-HYOKA           OF  WK-MATAGI-TRHK
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.計上基準日        =["
      D             WK-KEIJOU-KIJUNBI        OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅赤黒区分      =["
      D             WK-ZOFKU-AKA-KBN         OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅区分          =["
      D             WK-ZOFKU-KBN             OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅元異動計上基準日=["
      D             WK-ZOFKUMT-KJ-KIJUNBI    OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.処理順決定日付    =["
      D             WK-SRJUN-KT-DATE         OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.処理順同日優先度日付=["
      D             WK-SRJUN-DJ-DATE         OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.ダミー区分        =["
      D             WK-DUMMY-KBN             OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.取引事由          =["
      D             WK-TORI-JIYU             OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.処理順決定評価    =["
      D             WK-SRJUN-KT-HYOKA        OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
      *----------  ②対象取引にデータinsert処理
      *----------  ＳＱＬ文
      *    INITIALIZE                        SQLSTMT                    @3212SEINO@@
           INITIALIZE                        SQLSTMT15                  @3212SEINO@@
                                             H-TKMZBW04
                                             WK-MSG-1-3
           MOVE  WK-TABLE-TKMZBW04           TO  SQL-TBL-ID-3
      *----------  処理実行日
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03
             TO  H-SYORI-YMD                 OF  H-TKMZBW04,
                 WK-SYORI-YMD                OF  WK-MSG-1-3
      *----------  起動ID
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03
             TO  H-KIDOU-ID                  OF  H-TKMZBW04,
                 WK-KIDOU-ID                 OF  WK-MSG-1-3
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW04,
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZBW04,
                 WK-FUND-CD                  OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZBW04,
                 WK-PTF-CD                   OF  WK-MSG-1-3
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD            OF  WK-TKMZBW03
             TO  H-KAISI-KJN-YMD             OF  H-TKMZBW04,
                 WK-KAISI-KJN-YMD            OF  WK-MSG-1-3
      *----------  基準日
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMZBW04,
                 WK-KJN-YMD                  OF  WK-MSG-1-3
      *----------  銘柄コード
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-MEG-CD                    OF  H-TKMZBW04,
                 WK-MEG-CD                   OF  WK-MSG-1-3
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD                OF  H-TKMZBW04,
                 WK-SEC-SBT-CD               OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG                 OF  WK-TKMZBW03
             TO  H-TATE-FLG                  OF  H-TKMZBW04,
                 WK-TATE-FLG                 OF  WK-MSG-1-3
      *----------  玉ID
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03
             TO  H-GYOKU-ID                  OF  H-TKMZBW04,
                 WK-GYOKU-ID                 OF  WK-MSG-1-3
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-MATAGI-TRHK
             TO  H-TORI-ID                   OF  H-TKMZBW04,
                 WK-TORI-ID                  OF  WK-MSG-1-3
      *----------  計上基準日
           MOVE  WK-KEIJOU-KIJUNBI           OF  WK-MATAGI-TRHK
             TO  H-KEIJOU-KIJUNBI            OF  H-TKMZBW04,
                 WK-KEIJOU-KIJUNBI           OF  WK-MSG-1-3
      *----------  増幅赤黒区分
           MOVE  WK-ZOFKU-AKA-KBN            OF  WK-MATAGI-TRHK
             TO  H-ZOFKU-AKA-KBN             OF  H-TKMZBW04,
                 WK-ZOFKU-AKA-KBN            OF  WK-MSG-1-3
      *----------  増幅区分
           MOVE  WK-ZOFKU-KBN                OF  WK-MATAGI-TRHK
             TO  H-ZOFKU-KBN                 OF  H-TKMZBW04,
                 WK-ZOFKU-KBN                OF  WK-MSG-1-3
      *----------  増幅元異動計上基準日
           MOVE  WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-MATAGI-TRHK
             TO  H-ZOFKUMT-KJ-KIJUNBI        OF  H-TKMZBW04,
                 WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-MSG-1-3
      *----------  ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-MATAGI-TRHK
             TO  H-DUMMY-KBN                 OF  H-TKMZBW04,
                 WK-DUMMY-KBN                OF  WK-MSG-1-3
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-MATAGI-TRHK
             TO  H-TORI-JIYU                 OF  H-TKMZBW04,
                 WK-TORI-JIYU                OF  WK-MSG-1-3
      *----------  処理順決定日付
           MOVE  WK-SRJUN-KT-DATE            OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-DATE             OF  H-TKMZBW04,
                 WK-SRJUN-KT-DATE            OF  WK-MSG-1-3
      *----------  処理順同日優先度日付
           MOVE  WK-SRJUN-DJ-DATE            OF  WK-MATAGI-TRHK
             TO  H-SRJUN-DJ-DATE             OF  H-TKMZBW04,
                 WK-SRJUN-DJ-DATE            OF  WK-MSG-1-3
      *----------  処理順決定摘要
           MOVE  WK-SRJUN-KT-TEKIYO          OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-TEKIYO           OF  H-TKMZBW04,
                 WK-SRJUN-KT-TEKIYO          OF  WK-MSG-1-3
      *----------  処理順決定増減
           MOVE  WK-SRJUN-KT-ZOUGEN          OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-ZOUGEN           OF  H-TKMZBW04,
                 WK-SRJUN-KT-ZOUGEN          OF  WK-MSG-1-3
      *----------  処理順決定評価
           MOVE  WK-SRJUN-KT-HYOKA           OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-HYOKA            OF  H-TKMZBW04,
                 WK-SRJUN-KT-HYOKA           OF  WK-MSG-1-3
      *----------  未収計算対象フラグ
           MOVE  WK-MSKS-TARGET-FLG          OF  WK-MATAGI-TRHK
             TO  H-MSKS-TARGET-FLG           OF  H-TKMZBW04,
                 WK-MSKS-TARGET-FLG          OF  WK-MSG-1-3
      *----------  未収計算種類
           MOVE  WK-MSKS-SHRU                OF  WK-MATAGI-TRHK
             TO  H-MSKS-SHRU                 OF  H-TKMZBW04,
                 WK-MSKS-SHRU                OF  WK-MSG-1-3
      *----------  約定日
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  H-YKJ-YMD                   OF  H-TKMZBW04,
                 WK-YKJ-YMD                  OF  WK-MSG-1-3
      *----------  受渡日
           MOVE  WK-UKE-YMD                  OF  WK-MATAGI-TRHK
             TO  H-UKE-YMD                   OF  H-TKMZBW04,
                 WK-UKE-YMD                  OF  WK-MSG-1-3
      *----------  権利数量
           MOVE  WK-KENRI-SURYO              OF  WK-MATAGI-TRHK
             TO  H-KENRI-SURYO               OF  H-TKMZBW04,
                 WK-KENRI-SURYO              OF  WK-MSG-1-3
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-UPD-LOGIN-CMP-CD          OF  H-TKMZBW04,
                 WK-UPD-LOGIN-CMP-CD         OF  WK-MSG-1-3
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  H-UPD-PGMID                 OF  H-TKMZBW04,
                 WK-UPD-PGMID                OF  WK-MSG-1-3
      *    MOVE  SQL-INSERT-1-3              TO  SQLSTMT                @3212SEINO@@
           MOVE  SQL-INSERT-1-3              TO  SQLSTMT15              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日                   =["
      D            H-SYORI-YMD               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":起動ID                       =["
      D            H-KIDOU-ID                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD                  OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":開始基準日                   =["
      D            H-KAISI-KJN-YMD           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":基準日                       =["
      D            H-KJN-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード                   =["
      D            H-MEG-CD                  OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            H-SEC-SBT-CD              OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ     =["
      D            H-TATE-FLG                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":玉ID                         =["
      D            H-GYOKU-ID                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            H-TORI-ID                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":計上基準日                   =["
      D            H-KEIJOU-KIJUNBI          OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅赤黒区分                 =["
      D            H-ZOFKU-AKA-KBN           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅区分                     =["
      D            H-ZOFKU-KBN               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅元異動計上基準日         =["
      D            H-ZOFKUMT-KJ-KIJUNBI      OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ダミー区分                   =["
      D            H-DUMMY-KBN               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":取引事由                     =["
      D            H-TORI-JIYU               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定日付               =["
      D            H-SRJUN-KT-DATE           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順同日優先度日付         =["
      D            H-SRJUN-DJ-DATE           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定摘要               =["
      D            H-SRJUN-KT-TEKIYO         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定増減               =["
      D            H-SRJUN-KT-ZOUGEN         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順                       =["
      D            H-SRJUN                   OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":未収計算対象フラグ           =["
      D            H-MSKS-TARGET-FLG         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":未収計算種類                 =["
      D            H-MSKS-SHRU               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":約定日                       =["
      D            H-YKJ-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":受渡日                       =["
      D            H-UKE-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":権利数量                     =["
      D            H-KENRI-SURYO             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード =["
      D            H-UPD-LOGIN-CMP-CD        OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":更新プログラムＩＤ           =["
      D            H-UPD-PGMID               OF  H-TKMZBW04"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT            =["SQLSTMT "]"       @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT15            =["SQLSTMT15 "]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-3        =["WK-MSG-1-3 "]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-S15-INSERT=["              @3212SEINO@@
      D                         FLG-TKMZBW04-S15-INSERT "]"             @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW04-S15-INSERT = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC SQL PREPARE S2 FROM :SQLSTMT END-EXEC                 @3212SEINO@@
             EXEC SQL PREPARE S15 FROM :SQLSTMT15 END-EXEC              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE   =["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                       NOT = CNS-SQL-NORMAL
             THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-075
                 TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       S-INSERT-1-3,
                       WK-MSG-1-3              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
      *        EXECUTE S2                                               @3212SEINO@@
               EXECUTE S15
                 USING :H-TKMZBW04.H-SYORI-YMD,
                       :H-TKMZBW04.H-KIDOU-ID,
                       :H-TKMZBW04.H-RIYO-CMP-CD,
                       :H-TKMZBW04.H-FUND-CD,
                       :H-TKMZBW04.H-PTF-CD,
                       :H-TKMZBW04.H-KAISI-KJN-YMD,
                       :H-TKMZBW04.H-KJN-YMD,
                       :H-TKMZBW04.H-MEG-CD,
                       :H-TKMZBW04.H-SEC-SBT-CD,
                       :H-TKMZBW04.H-TATE-FLG,
                       :H-TKMZBW04.H-GYOKU-ID,
                       :H-TKMZBW04.H-TORI-ID,
                       :H-TKMZBW04.H-KEIJOU-KIJUNBI,
                       :H-TKMZBW04.H-ZOFKU-AKA-KBN,
                       :H-TKMZBW04.H-ZOFKU-KBN,
                       :H-TKMZBW04.H-ZOFKUMT-KJ-KIJUNBI,
                       :H-TKMZBW04.H-DUMMY-KBN,
                       :H-TKMZBW04.H-TORI-JIYU,
                       :H-TKMZBW04.H-SRJUN-KT-DATE,
                       :H-TKMZBW04.H-SRJUN-DJ-DATE,
                       :H-TKMZBW04.H-SRJUN-KT-TEKIYO,
                       :H-TKMZBW04.H-SRJUN-KT-ZOUGEN,
                       :H-TKMZBW04.H-SRJUN-KT-HYOKA,
                       :H-TKMZBW04.H-MSKS-TARGET-FLG,
                       :H-TKMZBW04.H-MSKS-SHRU,
                       :H-TKMZBW04.H-YKJ-YMD,
                       :H-TKMZBW04.H-UKE-YMD,
                       :H-TKMZBW04.H-KENRI-SURYO,
                       :H-TKMZBW04.H-UPD-LOGIN-CMP-CD,
                       :H-TKMZBW04.H-UPD-PGMID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE     =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW04-S15-INSERT     @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S15-INSERT=["
      D                        FLG-TKMZBW04-S15-INSERT"]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-UNIQUE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-076
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       S-INSERT-1-3,
                       WK-MSG-1-3            DELIMITED  BY SIZE
                 INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-077
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       S-INSERT-1-3,
                       WK-MSG-1-3            DELIMITED  BY SIZE
                 INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID ":黒の増幅取引を追加する"
      *-----------------------------------------------------------------
      *----------  ③黒の増幅取引を追加する
      *----------  跨ぎ取引.計上基準日
           MOVE  WK-KEIJOU-KIJUNBI           OF  WK-TKMZBW04
             TO  WK-KEIJOU-KIJUNBI           OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.増幅赤黒区分
           MOVE  CNS-KURO-SPACE
             TO  WK-ZOFKU-AKA-KBN            OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.増幅区分
           MOVE  CNS-PLUS-1
             TO  WK-ZOFKU-KBN                OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.増幅元異動計上基準日
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.処理順決定日付
           MOVE  WK-UKE-YMD                  OF  WK-MATAGI-TRHK
             TO  WK-SRJUN-KT-DATE            OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.処理順同日優先度日付
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  WK-SRJUN-DJ-DATE            OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-MATAGI-TRHK
             TO  WK-DUMMY-KBN                OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.取引事由
           MOVE  WK-TORI-JIYU                OF  WK-MATAGI-TRHK
             TO  WK-TORI-JIYU                OF  WK-MATAGI-TRHK
      *----------  跨ぎ取引.処理順決定評価
           MOVE  CNS-5
             TO  WK-SRJUN-KT-HYOKA           OF  WK-MATAGI-TRHK
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.計上基準日        =["
      D             WK-KEIJOU-KIJUNBI        OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅赤黒区分      =["
      D             WK-ZOFKU-AKA-KBN         OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅区分          =["
      D             WK-ZOFKU-KBN             OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.増幅元異動計上基準日=["
      D             WK-ZOFKUMT-KJ-KIJUNBI    OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.処理順決定日付    =["
      D             WK-SRJUN-KT-DATE         OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.処理順同日優先度日付=["
      D             WK-SRJUN-DJ-DATE         OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.ダミー区分        =["
      D             WK-DUMMY-KBN             OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.取引事由          =["
      D             WK-TORI-JIYU             OF  WK-MATAGI-TRHK"]"
      D    DISPLAY  CNS-PGM-ID ":跨ぎ取引.処理順決定評価    =["
      D             WK-SRJUN-KT-HYOKA        OF  WK-MATAGI-TRHK"]"
      *-----------------------------------------------------------------
      *----------  ④対象取引にデータinsert処理
      *----------  ＳＱＬ文
      *    INITIALIZE                        SQLSTMT                    @3212SEINO@@
           INITIALIZE                        SQLSTMT16                  @3212SEINO@@
                                             H-TKMZBW04
                                             WK-MSG-1-3
           MOVE  WK-TABLE-TKMZBW04           TO  SQL-TBL-ID-3
      *----------  処理実行日
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03
             TO  H-SYORI-YMD                 OF  H-TKMZBW04,
                 WK-SYORI-YMD                OF  WK-MSG-1-3
      *----------  起動ID
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03
             TO  H-KIDOU-ID                  OF  H-TKMZBW04,
                 WK-KIDOU-ID                 OF  WK-MSG-1-3
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW04,
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZBW04,
                 WK-FUND-CD                  OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZBW04,
                 WK-PTF-CD                   OF  WK-MSG-1-3
      *----------  開始基準日
           MOVE  WK-KAISI-KJN-YMD            OF  WK-TKMZBW03
             TO  H-KAISI-KJN-YMD             OF  H-TKMZBW04,
                 WK-KAISI-KJN-YMD            OF  WK-MSG-1-3
      *----------  基準日
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMZBW04,
                 WK-KJN-YMD                  OF  WK-MSG-1-3
      *----------  銘柄コード
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-MEG-CD                    OF  H-TKMZBW04,
                 WK-MEG-CD                   OF  WK-MSG-1-3
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD                OF  H-TKMZBW04,
                 WK-SEC-SBT-CD               OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG                 OF  WK-TKMZBW03
             TO  H-TATE-FLG                  OF  H-TKMZBW04,
                 WK-TATE-FLG                 OF  WK-MSG-1-3
      *----------  玉ID
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03
             TO  H-GYOKU-ID                  OF  H-TKMZBW04,
                 WK-GYOKU-ID                 OF  WK-MSG-1-3
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-MATAGI-TRHK
             TO  H-TORI-ID                   OF  H-TKMZBW04,
                 WK-TORI-ID                  OF  WK-MSG-1-3
      *----------  計上基準日
           MOVE  WK-KEIJOU-KIJUNBI           OF  WK-MATAGI-TRHK
             TO  H-KEIJOU-KIJUNBI            OF  H-TKMZBW04,
                 WK-KEIJOU-KIJUNBI           OF  WK-MSG-1-3
      *----------  増幅赤黒区分
           MOVE  WK-ZOFKU-AKA-KBN            OF  WK-MATAGI-TRHK
             TO  H-ZOFKU-AKA-KBN             OF  H-TKMZBW04,
                 WK-ZOFKU-AKA-KBN            OF  WK-MSG-1-3
      *----------  増幅区分
           MOVE  WK-ZOFKU-KBN                OF  WK-MATAGI-TRHK
             TO  H-ZOFKU-KBN                 OF  H-TKMZBW04,
                 WK-ZOFKU-KBN                OF  WK-MSG-1-3
      *----------  増幅元異動計上基準日
           MOVE  WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-MATAGI-TRHK
             TO  H-ZOFKUMT-KJ-KIJUNBI        OF  H-TKMZBW04,
                 WK-ZOFKUMT-KJ-KIJUNBI       OF  WK-MSG-1-3
      *----------  ダミー区分
           MOVE  WK-DUMMY-KBN                OF  WK-MATAGI-TRHK
             TO  H-DUMMY-KBN                 OF  H-TKMZBW04,
                 WK-DUMMY-KBN                OF  WK-MSG-1-3
      *----------  取引事由
           MOVE  WK-TORI-JIYU                OF  WK-MATAGI-TRHK
             TO  H-TORI-JIYU                 OF  H-TKMZBW04,
                 WK-TORI-JIYU                OF  WK-MSG-1-3
      *----------  処理順決定日付
           MOVE  WK-SRJUN-KT-DATE            OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-DATE             OF  H-TKMZBW04,
                 WK-SRJUN-KT-DATE            OF  WK-MSG-1-3
      *----------  処理順同日優先度日付
           MOVE  WK-SRJUN-DJ-DATE            OF  WK-MATAGI-TRHK
             TO  H-SRJUN-DJ-DATE             OF  H-TKMZBW04,
                 WK-SRJUN-DJ-DATE            OF  WK-MSG-1-3
      *----------  処理順決定摘要
           MOVE  WK-SRJUN-KT-TEKIYO          OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-TEKIYO           OF  H-TKMZBW04,
                 WK-SRJUN-KT-TEKIYO          OF  WK-MSG-1-3
      *----------  処理順決定増減
           MOVE  WK-SRJUN-KT-ZOUGEN          OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-ZOUGEN           OF  H-TKMZBW04,
                 WK-SRJUN-KT-ZOUGEN          OF  WK-MSG-1-3
      *----------  処理順決定評価
           MOVE  WK-SRJUN-KT-HYOKA           OF  WK-MATAGI-TRHK
             TO  H-SRJUN-KT-HYOKA            OF  H-TKMZBW04,
                 WK-SRJUN-KT-HYOKA           OF  WK-MSG-1-3
      *----------  未収計算対象フラグ
           MOVE  WK-MSKS-TARGET-FLG          OF  WK-MATAGI-TRHK
             TO  H-MSKS-TARGET-FLG           OF  H-TKMZBW04,
                 WK-MSKS-TARGET-FLG          OF  WK-MSG-1-3
      *----------  未収計算種類
           MOVE  WK-MSKS-SHRU                OF  WK-MATAGI-TRHK
             TO  H-MSKS-SHRU                 OF  H-TKMZBW04,
                 WK-MSKS-SHRU                OF  WK-MSG-1-3
      *----------  約定日
           MOVE  WK-YKJ-YMD                  OF  WK-MATAGI-TRHK
             TO  H-YKJ-YMD                   OF  H-TKMZBW04,
                 WK-YKJ-YMD                  OF  WK-MSG-1-3
      *----------  受渡日
           MOVE  WK-UKE-YMD                  OF  WK-MATAGI-TRHK
             TO  H-UKE-YMD                   OF  H-TKMZBW04,
                 WK-UKE-YMD                  OF  WK-MSG-1-3
      *----------  権利数量
           MOVE  WK-KENRI-SURYO              OF  WK-MATAGI-TRHK
             TO  H-KENRI-SURYO               OF  H-TKMZBW04,
                 WK-KENRI-SURYO              OF  WK-MSG-1-3
      *----------  更新ログインユーザ会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-UPD-LOGIN-CMP-CD          OF  H-TKMZBW04,
                 WK-UPD-LOGIN-CMP-CD         OF  WK-MSG-1-3
      *----------  更新プログラムＩＤ
           MOVE  CNS-PGM-ID
             TO  H-UPD-PGMID                 OF  H-TKMZBW04,
                 WK-UPD-PGMID                OF  WK-MSG-1-3
      *    MOVE  SQL-INSERT-1-3              TO  SQLSTMT                @3212SEINO@@
           MOVE  SQL-INSERT-1-3              TO  SQLSTMT16              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日                   =["
      D            H-SYORI-YMD               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":起動ID                       =["
      D            H-KIDOU-ID                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD                  OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":開始基準日                   =["
      D            H-KAISI-KJN-YMD           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":基準日                       =["
      D            H-KJN-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード                   =["
      D            H-MEG-CD                  OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            H-SEC-SBT-CD              OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ     =["
      D            H-TATE-FLG                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":玉ID                         =["
      D            H-GYOKU-ID                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            H-TORI-ID                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":計上基準日                   =["
      D            H-KEIJOU-KIJUNBI          OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅赤黒区分                 =["
      D            H-ZOFKU-AKA-KBN           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅区分                     =["
      D            H-ZOFKU-KBN               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":増幅元異動計上基準日         =["
      D            H-ZOFKUMT-KJ-KIJUNBI      OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ダミー区分                   =["
      D            H-DUMMY-KBN               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":取引事由                     =["
      D            H-TORI-JIYU               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定日付               =["
      D            H-SRJUN-KT-DATE           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順同日優先度日付         =["
      D            H-SRJUN-DJ-DATE           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定摘要               =["
      D            H-SRJUN-KT-TEKIYO         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定増減               =["
      D            H-SRJUN-KT-ZOUGEN         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順決定評価               =["
      D            H-SRJUN-KT-HYOKA          OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理順                       =["
      D            H-SRJUN                   OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":未収計算対象フラグ           =["
      D            H-MSKS-TARGET-FLG         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":未収計算種類                 =["
      D            H-MSKS-SHRU               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":約定日                       =["
      D            H-YKJ-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":受渡日                       =["
      D            H-UKE-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":権利数量                     =["
      D            H-KENRI-SURYO             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":更新ログインユーザ会社コード =["
      D            H-UPD-LOGIN-CMP-CD        OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":更新プログラムＩＤ           =["
      D            H-UPD-PGMID               OF  H-TKMZBW04"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT            =["SQLSTMT "]"       @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT16            =["SQLSTMT16 "]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-3        =["WK-MSG-1-3 "]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-S16-INSERT=["              @3212SEINO@@
      D                         FLG-TKMZBW04-S16-INSERT "]"             @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW04-S16-INSERT = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC SQL PREPARE S2 FROM :SQLSTMT END-EXEC                 @3212SEINO@@
             EXEC SQL PREPARE S16 FROM :SQLSTMT16 END-EXEC              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE   =["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                       NOT = CNS-SQL-NORMAL
             THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-078
                 TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       S-INSERT-1-3,
                       WK-MSG-1-3              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
      *        EXECUTE S2                                               @3212SEINO@@
               EXECUTE S16
                 USING :H-TKMZBW04.H-SYORI-YMD,
                       :H-TKMZBW04.H-KIDOU-ID,
                       :H-TKMZBW04.H-RIYO-CMP-CD,
                       :H-TKMZBW04.H-FUND-CD,
                       :H-TKMZBW04.H-PTF-CD,
                       :H-TKMZBW04.H-KAISI-KJN-YMD,
                       :H-TKMZBW04.H-KJN-YMD,
                       :H-TKMZBW04.H-MEG-CD,
                       :H-TKMZBW04.H-SEC-SBT-CD,
                       :H-TKMZBW04.H-TATE-FLG,
                       :H-TKMZBW04.H-GYOKU-ID,
                       :H-TKMZBW04.H-TORI-ID,
                       :H-TKMZBW04.H-KEIJOU-KIJUNBI,
                       :H-TKMZBW04.H-ZOFKU-AKA-KBN,
                       :H-TKMZBW04.H-ZOFKU-KBN,
                       :H-TKMZBW04.H-ZOFKUMT-KJ-KIJUNBI,
                       :H-TKMZBW04.H-DUMMY-KBN,
                       :H-TKMZBW04.H-TORI-JIYU,
                       :H-TKMZBW04.H-SRJUN-KT-DATE,
                       :H-TKMZBW04.H-SRJUN-DJ-DATE,
                       :H-TKMZBW04.H-SRJUN-KT-TEKIYO,
                       :H-TKMZBW04.H-SRJUN-KT-ZOUGEN,
                       :H-TKMZBW04.H-SRJUN-KT-HYOKA,
                       :H-TKMZBW04.H-MSKS-TARGET-FLG,
                       :H-TKMZBW04.H-MSKS-SHRU,
                       :H-TKMZBW04.H-YKJ-YMD,
                       :H-TKMZBW04.H-UKE-YMD,
                       :H-TKMZBW04.H-KENRI-SURYO,
                       :H-TKMZBW04.H-UPD-LOGIN-CMP-CD,
                       :H-TKMZBW04.H-UPD-PGMID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":INSERT-SQLCODE     =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW04-S16-INSERT     @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S16-INSERT=["
      D                        FLG-TKMZBW04-S16-INSERT"]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-UNIQUE
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-079
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     S-INSERT-1-3,
                     WK-MSG-1-3              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-080
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-INSERT,
                     S-INSERT-1-3,
                     WK-MSG-1-3              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  跨ぎ入れ子フラグ＝1:跨ぎ入れ"
      D             "子又は（跨ぎ入れ子フラグ＝0"
      D             "且つ跨ぎ入れ子フラグ2＝1）の場合  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       MATAGI-IRE-BAAI-EXT.
           EXIT.
      ******************************************************************
      *             ⑤『対象取引_1』カーソルクローズ処理
      ******************************************************************
      * TKMZBW04-1-CLOSE-RTN   SECTION.
      **----------------------<DEBUG>------------------------------------
      *D    DISPLAY  CNS-PGM-ID":****  ⑤『対象取引_1』カーソルクローズ"
      *D             "処理  STRAT  ****"
      **-----------------------------------------------------------------
      *     EXEC  SQL
      *       CLOSE TKMZBW04_CURSOR_1
      *     END-EXEC
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY CNS-PGM-ID":CLOSE SQLCODE           =["SQLCODE"]"
      **-------------------<DEBUG>---------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      **----------  対象取引_1カーソルオープンフラグ
      *       MOVE  CNS-OFF              TO  FLG-TKMZBW04-CR-1
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-1       =["
      *D            FLG-TKMZBW04-CR-1 "]"
      **-----------------------------------------------------------------
      *       CONTINUE
      *     ELSE
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"
      **-------------------<DEBUG>---------------------------------------
      **----------  エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *       MOVE  CNS-POS-081
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      **---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-6              DELIMITED  BY SIZE
      *         INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID":****  ⑤『対象取引_1』カーソルクローズ"
      *D             "処理  END  ****"
      **-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZBW04-1-CLOSE-EXT.
      *     EXIT.
      ******************************************************************
      *           (四)約→受前移動処理
      ******************************************************************
       MAE-IDO-RTN            SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":****  (四)約→受前移動処理  START  ****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文
      *    INITIALIZE                        SQLSTMT                    @3212SEINO@@
           INITIALIZE                        SQLSTMT07                  @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW04           TO  SQL-TBL-ID-7
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD              OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD               OF  H-TKMZBW04,
                 WK-RIYO-CMP-CD              OF  WK-MSG-1-7
      *----------  ファンドコード
           MOVE  WK-FUND-CD                  OF  WK-TKMZBW03
             TO  H-FUND-CD                   OF  H-TKMZBW04,
                 WK-FUND-CD                  OF  WK-MSG-1-7
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD                   OF  WK-TKMZBW03
             TO  H-PTF-CD                    OF  H-TKMZBW04,
                 WK-PTF-CD                   OF  WK-MSG-1-7
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD               OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD                OF  H-TKMZBW04,
                 WK-SEC-SBT-CD               OF  WK-MSG-1-7
      *----------  銘柄コード
           MOVE  WK-MEG-CD                   OF  WK-TKMZBW03
             TO  H-MEG-CD                    OF  H-TKMZBW04,
                 WK-MEG-CD                   OF  WK-MSG-1-7
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG                 OF  WK-TKMZBW03
             TO  H-TATE-FLG                  OF  H-TKMZBW04,
                 WK-TATE-FLG                 OF  WK-MSG-1-7
      *----------  玉ID
           MOVE  WK-GYOKU-ID                 OF  WK-TKMZBW03
             TO  H-GYOKU-ID                  OF  H-TKMZBW04,
                 WK-GYOKU-ID                 OF  WK-MSG-1-7
      *----------  処理実行日
           MOVE  WK-SYORI-YMD                OF  WK-TKMZBW03
             TO  H-SYORI-YMD                 OF  H-TKMZBW04,
                 WK-SYORI-YMD                OF  WK-MSG-1-7
      *----------  起動ID
           MOVE  WK-KIDOU-ID                 OF  WK-TKMZBW03
             TO  H-KIDOU-ID                  OF  H-TKMZBW04,
                 WK-KIDOU-ID                 OF  WK-MSG-1-7
      *----------  基準日
           MOVE  WK-KJN-YMD                  OF  WK-TKMZBW03
             TO  H-KJN-YMD                   OF  H-TKMZBW04,
                 WK-KJN-YMD                  OF  WK-MSG-1-7
      *----------  原取引ID
           MOVE  WK-TORI-ID                  OF  WK-MATAGI-TRHK
             TO  H-TORI-ID                   OF  H-TKMZBW04,
                 WK-TORI-ID                  OF  WK-MSG-1-7
      *    MOVE  SQL-DELETE-1-7              TO  SQLSTMT                @3212SEINO@@
           MOVE  SQL-DELETE-1-7              TO  SQLSTMT07              @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":利用会社コード               =["
      D            H-RIYO-CMP-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード               =["
      D            H-FUND-CD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード         =["
      D            H-PTF-CD                  OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード               =["
      D            H-SEC-SBT-CD              OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード                   =["
      D            H-MEG-CD                  OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ     =["
      D            H-TATE-FLG                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":玉ID                         =["
      D            H-GYOKU-ID                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":処理実行日                   =["
      D            H-SYORI-YMD               OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":起動ID                       =["
      D            H-KIDOU-ID                OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":基準日                       =["
      D            H-KJN-YMD                 OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                     =["
      D            H-TORI-ID                 OF  H-TKMZBW04"]"
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT07             =["SQLSTMT07"]"    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-7             =["WK-MSG-1-7"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-S7-DELETE=["               @3212SEINO@@
      D                         FLG-TKMZBW04-S7-DELETE"]"               @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW04-S7-DELETE = CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC SQL PREPARE S7 FROM :SQLSTMT END-EXEC                 @3212SEINO@@
             EXEC SQL PREPARE S7 FROM :SQLSTMT07 END-EXEC               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE        =["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                       NOT = CNS-SQL-NORMAL
             THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-082
                 TO  ERR-POS                   OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                    OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG         OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       S-DELETE-1-7,
                       WK-MSG-1-7              DELIMITED  BY SIZE
                 INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL
               EXECUTE S7
                 USING :H-TKMZBW04.H-RIYO-CMP-CD,
                       :H-TKMZBW04.H-FUND-CD,
                       :H-TKMZBW04.H-PTF-CD,
                       :H-TKMZBW04.H-SEC-SBT-CD,
                       :H-TKMZBW04.H-MEG-CD,
                       :H-TKMZBW04.H-TATE-FLG,
                       :H-TKMZBW04.H-GYOKU-ID,
                       :H-TKMZBW04.H-SYORI-YMD,
                       :H-TKMZBW04.H-KIDOU-ID,
                       :H-TKMZBW04.H-KJN-YMD,
                       :H-TKMZBW04.H-TORI-ID
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":DELETE-SQLCODE          =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW04-S7-DELETE      @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S7-DELETE=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S7-DELETE"]"                @3212SEINO@@
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-TKMZBW04-S7-DELETE      @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S7-DELETE=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S7-DELETE"]"                @3212SEINO@@
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID              OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-083
                 TO  ERR-POS                 OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD                  OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG       OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     S-DELETE-1-7,
                     WK-MSG-1-7              DELIMITED  BY SIZE
               INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
           COMPUTE  WK-TRHK-SELECT-KENSU
                 =  WK-TRHK-SELECT-KENSU - CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":取引SELECT件数=["WK-TRHK-SELECT-KENSU"]"
      D    DISPLAY  CNS-PGM-ID":****  (四)約→受前移動処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAE-IDO-EXT.
           EXIT.
      ******************************************************************
      *            3.2.3 対象取引処理順序決定処理
      ******************************************************************
       TSSKTK-SJUN-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  3.2.3 対象取引処理順序決定処理"
      D             "  START  *****"
      *-----------------------------------------------------------------
      *----------  1)処理順ORDERBYを設定する
           EVALUATE  SYRI-JUN                OF  WK-KKN-IDO-CALC-PATTERN
      *----------  ◆期間内異動計算パターン.処理順序＝'1' OR '5'の場合
             WHEN  CNS-SYRI-JUN-1
             WHEN  CNS-SYRI-JUN-5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"
      D             "'1'OR'5'の場合"
      *-----------------------------------------------------------------
               STRING  "SRJUN_KT_DATE,"
                       "SRJUN_KT_HYOKA,"
                       "SRJUN_KT_TEKIYO,"
                       "TORI_ID"             DELIMITED  BY SIZE
                 INTO  WK-SYRI-JUN-ORDERBY
      *----------  ◆期間内異動計算パターン.処理順序＝'2'OR'6'の場合
             WHEN  CNS-SYRI-JUN-2
             WHEN  CNS-SYRI-JUN-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"
      D             "'2'OR'6'の場合"
      *-----------------------------------------------------------------
               STRING  "SRJUN_KT_DATE,"
                       "SRJUN_KT_HYOKA,"
                       "SRJUN_KT_TEKIYO,"
                       "SRJUN_DJ_DATE,"
                       "TORI_ID"             DELIMITED  BY SIZE
                 INTO  WK-SYRI-JUN-ORDERBY
      *----------  ◆期間内異動計算パターン.処理順序＝'3'OR'7'の場合
             WHEN  CNS-SYRI-JUN-3
             WHEN  CNS-SYRI-JUN-7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"
      D             "'3'OR'7'の場合"
      *-----------------------------------------------------------------
               STRING  "SRJUN_KT_DATE,"
                       "SRJUN_KT_HYOKA,"
                       "SRJUN_KT_ZOUGEN,"
                       "TORI_ID"             DELIMITED  BY SIZE
                 INTO  WK-SYRI-JUN-ORDERBY
      *----------  ◆期間内異動計算パターン.処理順序＝'4'OR'8'の場合
             WHEN  CNS-SYRI-JUN-4
             WHEN  CNS-SYRI-JUN-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"
      D             "'4'OR'8'の場合"
      *-----------------------------------------------------------------
               STRING  "SRJUN_KT_DATE,"
                       "SRJUN_KT_HYOKA,"
                       "SRJUN_KT_ZOUGEN,"
                       "SRJUN_DJ_DATE,"
                       "TORI_ID"             DELIMITED  BY SIZE
                 INTO  WK-SYRI-JUN-ORDERBY
             WHEN OTHER
               CONTINUE
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID":処理順ORDERBY               =["
      D             WK-SYRI-JUN-ORDERBY"]"
      *-----------------------------------------------------------------
      *----------  20100223(GIPS2.0)  START
           INITIALIZE    WK-KUKAN-KENSUU
                         WK-GOUKEI-KENSUU
      *----------  20100223(GIPS2.0)  END
      *----------  2)対象取引情報テーブルから処理対象のレコードを取得する
           PERFORM  TKMZBW04-2-OPEN-RTN
      *----------  3)『対象取引_2情報』カーソルフェッチする
           MOVE  CNS-ON                  TO  FLG-TKMZBW04-FE-2
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSSKTK-SJUN-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TKMZBW04-2-FETCH-RTN
             UNTIL  FLG-TKMZBW04-FE-2   =  CNS-OFF
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TSSKTK-SJUN-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  4)『対象取引_2情報』カーソルクローズ処理
      *    PERFORM  TKMZBW04-2-CLOSE-RTN                                @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  3.2.3 対象取引処理順序決定処理"
      D             "  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       TSSKTK-SJUN-EXT.
           EXIT.
      ******************************************************************
      *         2)対象取引情報テーブルから処理対象のレコードを取得する
      ******************************************************************
       TKMZBW04-2-OPEN-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***** 2)対象取引情報テーブルから処理対"
      D             " 象のレコードを取得する *****"
      *-----------------------------------------------------------------
      *    INITIALIZE                   SQLSTMT                         @3212SEINO@@
           INITIALIZE                   SQLSTMT08-1                     @3212SEINO@@
                                        SQLSTMT08-2                     @3212SEINO@@
                                        SQLSTMT08-3                     @3212SEINO@@
                                        SQLSTMT08-4                     @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW04      TO  SQL-TBL-ID-8
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-TKMZBW03
             TO  H-SYORI-YMD            OF  H-TKMZBW04,
                 WK-SYORI-YMD           OF  WK-MSG-1-8
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-TKMZBW03
             TO  H-KIDOU-ID             OF  H-TKMZBW04,
                 WK-KIDOU-ID            OF  WK-MSG-1-8
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-TKMZBW03
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW04,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-8
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-TKMZBW03
             TO  H-FUND-CD              OF  H-TKMZBW04,
                 WK-FUND-CD             OF  WK-MSG-1-8
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-TKMZBW03
             TO  H-PTF-CD               OF  H-TKMZBW04,
                 WK-PTF-CD              OF  WK-MSG-1-8
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-TKMZBW03
             TO  H-KJN-YMD              OF  H-TKMZBW04,
                 WK-KJN-YMD             OF  WK-MSG-1-8
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-TKMZBW03
             TO  H-SEC-SBT-CD           OF  H-TKMZBW04,
                 WK-SEC-SBT-CD          OF  WK-MSG-1-8
      *----------  銘柄コード
           MOVE  WK-MEG-CD              OF  WK-TKMZBW03
             TO  H-MEG-CD               OF  H-TKMZBW04,
                 WK-MEG-CD              OF  WK-MSG-1-8
      *----------  資産負債・買建売建フラグ
           MOVE  WK-TATE-FLG            OF  WK-TKMZBW03
             TO  H-TATE-FLG             OF  H-TKMZBW04,
                 WK-TATE-FLG            OF  WK-MSG-1-8
      *----------  玉ID
           MOVE  WK-GYOKU-ID            OF  WK-TKMZBW03
             TO  H-GYOKU-ID             OF  H-TKMZBW04,
                 WK-GYOKU-ID            OF  WK-MSG-1-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":処理実行日              =["
      D            H-SYORI-YMD          OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":起動ID                  =["
      D            H-KIDOU-ID           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["
      D            H-RIYO-CMP-CD        OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["
      D            H-FUND-CD            OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["
      D            H-PTF-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":基準日                  =["
      D            H-KJN-YMD            OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["
      D            H-SEC-SBT-CD         OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["
      D            H-MEG-CD             OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":玉ID                    =["
      D            H-GYOKU-ID           OF  H-TKMZBW04"]"
      D    DISPLAY CNS-PGM-ID":期間内異動計算パターン.処理順序=["       @3212SEINO@@
      D            SYRI-JUN         OF  WK-KKN-IDO-CALC-PATTERN"]"      @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  20100223(GIPS2.0)  START
           INITIALIZE               H-CNT1
      *----------  20100223(GIPS2.0)  END
      *----------  1)処理順ORDERBYを設定する
           EVALUATE  SYRI-JUN                OF  WK-KKN-IDO-CALC-PATTERN@3212SEINO@@
      *----------  ◆期間内異動計算パターン.処理順序＝'1' OR '5'の場合  @3212SEINO@@
             WHEN  CNS-SYRI-JUN-1                                       @3212SEINO@@
             WHEN  CNS-SYRI-JUN-5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"      @3212SEINO@@
      D             "'1'OR'5'の場合"                                    @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  処理順ORDERBY
               MOVE  WK-SYRI-JUN-ORDERBY
                 TO  WK-ORDERBY             OF  WK-MSG-1-8
      *----ＳＱＬ文
               STRING  SQL-SELECT-1-8,
                       WK-SYRI-JUN-ORDERBY      DELIMITED  BY SIZE
      *          INTO  SQLSTMT                                          @3212SEINO@@
                 INTO  SQLSTMT08-1                                      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT08-1            =["SQLSTMT08-1"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-8             =["WK-MSG-1-8"]"
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2-1=["                   @3212SEINO@@
      D                        FLG-TKMZBW04-CR-2-1"]"                   @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
               IF  FLG-TKMZBW04-CR-2-1 = CNS-OFF                        @3212SEINO@@
               THEN                                                     @3212SEINO@@
      *          EXEC  SQL  PREPARE  S8  FROM :SQLSTMT  END-EXEC        @3212SEINO@@
                 EXEC  SQL  PREPARE  S8_1  FROM :SQLSTMT08-1  END-EXEC  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                 EVALUATE  SQLCODE
                   WHEN  CNS-SQL-NORMAL
                     CONTINUE                                           @3212SEINO@@
                   WHEN  OTHER
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名
                     MOVE  CNS-PGM-ID
                       TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                     MOVE  CNS-POS-084
                       TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                     MOVE  CNS-RTN-900
                       TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                     MOVE  SQLCODE
                       TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                     MOVE  CNS-DETAIL-1
                       TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   STRING  CNS-SQL-MSG-SELECT,
                           WK-MSG-1-8            DELIMITED  BY SIZE
                     INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                     PERFORM  ERR-RTN
                 END-EVALUATE
                 EXEC
                   SQL  DECLARE  TKMZBW04_CURSOR_2_1 CURSOR FOR  S8_1   @3212SEINO@@
                 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"
      *-----------------------------------------------------------------
                 EVALUATE  SQLCODE
                   WHEN  CNS-SQL-NORMAL
                     CONTINUE
                   WHEN  OTHER
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (DECLARE)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                     MOVE  CNS-PGM-ID
                       TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                     MOVE  CNS-POS-085
                       TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                     MOVE  CNS-RTN-900
                       TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                    MOVE  SQLCODE
                       TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                     MOVE  CNS-DETAIL-1
                       TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   STRING  CNS-SQL-MSG-SELECT,
                           WK-MSG-1-8            DELIMITED  BY SIZE
                     INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                     PERFORM  ERR-RTN
                 END-EVALUATE
               ELSE                                                     @3212SEINO@@
                CONTINUE                                                @3212SEINO@@
               END-IF                                                   @3212SEINO@@
               EXEC  SQL
                   OPEN TKMZBW04_CURSOR_2_1                             @3212SEINO@@
                     USING :H-TKMZBW04.H-SYORI-YMD,
                           :H-TKMZBW04.H-KIDOU-ID,
                           :H-TKMZBW04.H-RIYO-CMP-CD,
                           :H-TKMZBW04.H-FUND-CD,
                           :H-TKMZBW04.H-PTF-CD,
                           :H-TKMZBW04.H-KJN-YMD,
                           :H-TKMZBW04.H-MEG-CD,
                           :H-TKMZBW04.H-SEC-SBT-CD,
                           :H-TKMZBW04.H-TATE-FLG,
                           :H-TKMZBW04.H-GYOKU-ID
               END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"
      *-----------------------------------------------------------------
               EVALUATE  SQLCODE
                 WHEN  CNS-SQL-NORMAL
      *----------  対象取引_2カーソルオープンフラグ
                   MOVE  CNS-ON             TO  FLG-TKMZBW04-CR-2-1     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2-1       =["            @3212SEINO@@
      D            FLG-TKMZBW04-CR-2-1 "]"                              @3212SEINO@@
      *-----------------------------------------------------------------
                  WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                   MOVE  CNS-PGM-ID
                     TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-086
                     TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-900
                     TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE
                     TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-1
                     TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                 STRING  CNS-SQL-MSG-SELECT,
                         WK-MSG-1-8              DELIMITED  BY SIZE
                   INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理
                   PERFORM  ERR-RTN
               END-EVALUATE
      *----------  ◆期間内異動計算パターン.処理順序＝'2'OR'6'の場合
             WHEN  CNS-SYRI-JUN-2                                       @3212SEINO@@
             WHEN  CNS-SYRI-JUN-6                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"      @3212SEINO@@
      D             "'2'OR'6'の場合"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  処理順ORDERBY                                        @3212SEINO@@
               MOVE  WK-SYRI-JUN-ORDERBY                                @3212SEINO@@
                 TO  WK-ORDERBY             OF  WK-MSG-1-8              @3212SEINO@@
      *----ＳＱＬ文                                                     @3212SEINO@@
               STRING  SQL-SELECT-1-8,                                  @3212SEINO@@
                       WK-SYRI-JUN-ORDERBY      DELIMITED  BY SIZE      @3212SEINO@@
      *          INTO  SQLSTMT                                          @3212SEINO@@
                 INTO  SQLSTMT08-2                                      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT08-2            =["SQLSTMT08-2"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-8             =["WK-MSG-1-8"]" @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2-2=["                   @3212SEINO@@
      D                        FLG-TKMZBW04-CR-2-2"]"                   @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
               IF  FLG-TKMZBW04-CR-2-2 = CNS-OFF                        @3212SEINO@@
               THEN                                                     @3212SEINO@@
      *          EXEC  SQL  PREPARE  S8  FROM :SQLSTMT  END-EXEC        @3212SEINO@@
                 EXEC  SQL  PREPARE  S8_2  FROM :SQLSTMT08-2  END-EXEC  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                 EVALUATE  SQLCODE                                      @3212SEINO@@
                   WHEN  CNS-SQL-NORMAL                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   WHEN  OTHER                                          @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                     MOVE  CNS-PGM-ID                                   @3212SEINO@@
                       TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                     MOVE  CNS-POS-100                                  @3212SEINO@@
                       TO  ERR-POS            OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                     MOVE  CNS-RTN-900                                  @3212SEINO@@
                       TO  RTN-CD             OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                     MOVE  SQLCODE                                      @3212SEINO@@
                       TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                     MOVE  CNS-DETAIL-1                                 @3212SEINO@@
                       TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                   STRING  CNS-SQL-MSG-SELECT,                          @3212SEINO@@
                           WK-MSG-1-8            DELIMITED  BY SIZE     @3212SEINO@@
                     INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                     PERFORM  ERR-RTN                                   @3212SEINO@@
                 END-EVALUATE                                           @3212SEINO@@
                 EXEC                                                   @3212SEINO@@
                   SQL  DECLARE  TKMZBW04_CURSOR_2_2 CURSOR FOR  S8_2   @3212SEINO@@
                 END-EXEC                                               @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                 EVALUATE  SQLCODE                                      @3212SEINO@@
                   WHEN  CNS-SQL-NORMAL                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   WHEN  OTHER                                          @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (DECLARE)"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                     MOVE  CNS-PGM-ID                                   @3212SEINO@@
                       TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                     MOVE  CNS-POS-092                                  @3212SEINO@@
                       TO  ERR-POS            OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                     MOVE  CNS-RTN-900                                  @3212SEINO@@
                       TO  RTN-CD             OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                    MOVE  SQLCODE                                       @3212SEINO@@
                       TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                     MOVE  CNS-DETAIL-1                                 @3212SEINO@@
                       TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                   STRING  CNS-SQL-MSG-SELECT,                          @3212SEINO@@
                           WK-MSG-1-8            DELIMITED  BY SIZE     @3212SEINO@@
                     INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                     PERFORM  ERR-RTN                                   @3212SEINO@@
                 END-EVALUATE                                           @3212SEINO@@
               ELSE                                                     @3212SEINO@@
                CONTINUE                                                @3212SEINO@@
               END-IF                                                   @3212SEINO@@
               EXEC  SQL                                                @3212SEINO@@
                   OPEN TKMZBW04_CURSOR_2_2                             @3212SEINO@@
                     USING :H-TKMZBW04.H-SYORI-YMD,                     @3212SEINO@@
                           :H-TKMZBW04.H-KIDOU-ID,                      @3212SEINO@@
                           :H-TKMZBW04.H-RIYO-CMP-CD,                   @3212SEINO@@
                           :H-TKMZBW04.H-FUND-CD,                       @3212SEINO@@
                           :H-TKMZBW04.H-PTF-CD,                        @3212SEINO@@
                           :H-TKMZBW04.H-KJN-YMD,                       @3212SEINO@@
                           :H-TKMZBW04.H-MEG-CD,                        @3212SEINO@@
                           :H-TKMZBW04.H-SEC-SBT-CD,                    @3212SEINO@@
                           :H-TKMZBW04.H-TATE-FLG,                      @3212SEINO@@
                           :H-TKMZBW04.H-GYOKU-ID                       @3212SEINO@@
               END-EXEC                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               EVALUATE  SQLCODE                                        @3212SEINO@@
                 WHEN  CNS-SQL-NORMAL                                   @3212SEINO@@
      *----------  対象取引_2カーソルオープンフラグ                     @3212SEINO@@
                   MOVE  CNS-ON             TO  FLG-TKMZBW04-CR-2-2     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2-2       =["            @3212SEINO@@
      D            FLG-TKMZBW04-CR-2-2 "]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                  WHEN  OTHER                                           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"                  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                   MOVE  CNS-PGM-ID                                     @3212SEINO@@
                     TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                   MOVE  CNS-POS-093                                    @3212SEINO@@
                     TO  ERR-POS            OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                   MOVE  CNS-RTN-900                                    @3212SEINO@@
                     TO  RTN-CD             OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                   MOVE  SQLCODE                                        @3212SEINO@@
                     TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                   MOVE  CNS-DETAIL-1                                   @3212SEINO@@
                     TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                 STRING  CNS-SQL-MSG-SELECT,                            @3212SEINO@@
                         WK-MSG-1-8              DELIMITED  BY SIZE     @3212SEINO@@
                   INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                   PERFORM  ERR-RTN                                     @3212SEINO@@
               END-EVALUATE                                             @3212SEINO@@
      *----------  ◆期間内異動計算パターン.処理順序＝'3'OR'7'の場合    @3212SEINO@@
             WHEN  CNS-SYRI-JUN-3                                       @3212SEINO@@
             WHEN  CNS-SYRI-JUN-7                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"      @3212SEINO@@
      D             "'3'OR'7'の場合"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  処理順ORDERBY                                        @3212SEINO@@
               MOVE  WK-SYRI-JUN-ORDERBY                                @3212SEINO@@
                 TO  WK-ORDERBY             OF  WK-MSG-1-8              @3212SEINO@@
      *----ＳＱＬ文                                                     @3212SEINO@@
               STRING  SQL-SELECT-1-8,                                  @3212SEINO@@
                       WK-SYRI-JUN-ORDERBY      DELIMITED  BY SIZE      @3212SEINO@@
      *          INTO  SQLSTMT                                          @3212SEINO@@
                 INTO  SQLSTMT08-3                                      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT08-3            =["SQLSTMT08-3"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-8             =["WK-MSG-1-8"]" @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2-3=["                   @3212SEINO@@
      D                        FLG-TKMZBW04-CR-2-3"]"                   @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
               IF  FLG-TKMZBW04-CR-2-3 = CNS-OFF                        @3212SEINO@@
               THEN                                                     @3212SEINO@@
      *          EXEC  SQL  PREPARE  S8  FROM :SQLSTMT  END-EXEC        @3212SEINO@@
                 EXEC  SQL  PREPARE  S8_3  FROM :SQLSTMT08-3  END-EXEC  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                 EVALUATE  SQLCODE                                      @3212SEINO@@
                   WHEN  CNS-SQL-NORMAL                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   WHEN  OTHER                                          @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                     MOVE  CNS-PGM-ID                                   @3212SEINO@@
                       TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                     MOVE  CNS-POS-094                                  @3212SEINO@@
                       TO  ERR-POS            OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                     MOVE  CNS-RTN-900                                  @3212SEINO@@
                       TO  RTN-CD             OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                     MOVE  SQLCODE                                      @3212SEINO@@
                       TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                     MOVE  CNS-DETAIL-1                                 @3212SEINO@@
                       TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                   STRING  CNS-SQL-MSG-SELECT,                          @3212SEINO@@
                           WK-MSG-1-8            DELIMITED  BY SIZE     @3212SEINO@@
                     INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                     PERFORM  ERR-RTN                                   @3212SEINO@@
                 END-EVALUATE                                           @3212SEINO@@
                 EXEC                                                   @3212SEINO@@
                   SQL  DECLARE  TKMZBW04_CURSOR_2_3 CURSOR FOR  S8_3   @3212SEINO@@
                 END-EXEC                                               @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                 EVALUATE  SQLCODE                                      @3212SEINO@@
                   WHEN  CNS-SQL-NORMAL                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   WHEN  OTHER                                          @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (DECLARE)"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                     MOVE  CNS-PGM-ID                                   @3212SEINO@@
                       TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                     MOVE  CNS-POS-095                                  @3212SEINO@@
                       TO  ERR-POS            OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                     MOVE  CNS-RTN-900                                  @3212SEINO@@
                       TO  RTN-CD             OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                    MOVE  SQLCODE                                       @3212SEINO@@
                       TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                     MOVE  CNS-DETAIL-1                                 @3212SEINO@@
                       TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                   STRING  CNS-SQL-MSG-SELECT,                          @3212SEINO@@
                           WK-MSG-1-8            DELIMITED  BY SIZE     @3212SEINO@@
                     INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                     PERFORM  ERR-RTN                                   @3212SEINO@@
                 END-EVALUATE                                           @3212SEINO@@
               ELSE                                                     @3212SEINO@@
                CONTINUE                                                @3212SEINO@@
               END-IF                                                   @3212SEINO@@
               EXEC  SQL                                                @3212SEINO@@
                   OPEN TKMZBW04_CURSOR_2_3                             @3212SEINO@@
                     USING :H-TKMZBW04.H-SYORI-YMD,                     @3212SEINO@@
                           :H-TKMZBW04.H-KIDOU-ID,                      @3212SEINO@@
                           :H-TKMZBW04.H-RIYO-CMP-CD,                   @3212SEINO@@
                           :H-TKMZBW04.H-FUND-CD,                       @3212SEINO@@
                           :H-TKMZBW04.H-PTF-CD,                        @3212SEINO@@
                           :H-TKMZBW04.H-KJN-YMD,                       @3212SEINO@@
                           :H-TKMZBW04.H-MEG-CD,                        @3212SEINO@@
                           :H-TKMZBW04.H-SEC-SBT-CD,                    @3212SEINO@@
                           :H-TKMZBW04.H-TATE-FLG,                      @3212SEINO@@
                           :H-TKMZBW04.H-GYOKU-ID                       @3212SEINO@@
               END-EXEC                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               EVALUATE  SQLCODE                                        @3212SEINO@@
                 WHEN  CNS-SQL-NORMAL                                   @3212SEINO@@
      *----------  対象取引_2カーソルオープンフラグ                     @3212SEINO@@
                   MOVE  CNS-ON             TO  FLG-TKMZBW04-CR-2-3     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2-3       =["            @3212SEINO@@
      D            FLG-TKMZBW04-CR-2-3 "]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                  WHEN  OTHER                                           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"                  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                   MOVE  CNS-PGM-ID                                     @3212SEINO@@
                     TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                   MOVE  CNS-POS-096                                    @3212SEINO@@
                     TO  ERR-POS            OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                   MOVE  CNS-RTN-900                                    @3212SEINO@@
                     TO  RTN-CD             OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                   MOVE  SQLCODE                                        @3212SEINO@@
                     TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                   MOVE  CNS-DETAIL-1                                   @3212SEINO@@
                     TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                 STRING  CNS-SQL-MSG-SELECT,                            @3212SEINO@@
                         WK-MSG-1-8              DELIMITED  BY SIZE     @3212SEINO@@
                   INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                   PERFORM  ERR-RTN                                     @3212SEINO@@
               END-EVALUATE                                             @3212SEINO@@
      *----------  ◆期間内異動計算パターン.処理順序＝'4'OR'8'の場合    @3212SEINO@@
             WHEN  CNS-SYRI-JUN-4                                       @3212SEINO@@
             WHEN  CNS-SYRI-JUN-8                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"      @3212SEINO@@
      D             "'4'OR'8'の場合"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  処理順ORDERBY                                        @3212SEINO@@
               MOVE  WK-SYRI-JUN-ORDERBY                                @3212SEINO@@
                 TO  WK-ORDERBY             OF  WK-MSG-1-8              @3212SEINO@@
      *----ＳＱＬ文                                                     @3212SEINO@@
               STRING  SQL-SELECT-1-8,                                  @3212SEINO@@
                       WK-SYRI-JUN-ORDERBY      DELIMITED  BY SIZE      @3212SEINO@@
      *          INTO  SQLSTMT                                          @3212SEINO@@
                 INTO  SQLSTMT08-4                                      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      *D    DISPLAY CNS-PGM-ID":SQLSTMT                 =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLSTMT08-4            =["SQLSTMT08-4"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-8             =["WK-MSG-1-8"]" @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2-4=["                   @3212SEINO@@
      D                        FLG-TKMZBW04-CR-2-4"]"                   @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
               IF  FLG-TKMZBW04-CR-2-4 = CNS-OFF                        @3212SEINO@@
               THEN                                                     @3212SEINO@@
      *          EXEC  SQL  PREPARE  S8  FROM :SQLSTMT  END-EXEC        @3212SEINO@@
                 EXEC  SQL  PREPARE  S8_4  FROM :SQLSTMT08-4  END-EXEC  @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLCODE-PREPARE         =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                 EVALUATE  SQLCODE                                      @3212SEINO@@
                   WHEN  CNS-SQL-NORMAL                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   WHEN  OTHER                                          @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (PREPARE)"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                     MOVE  CNS-PGM-ID                                   @3212SEINO@@
                       TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                     MOVE  CNS-POS-097                                  @3212SEINO@@
                       TO  ERR-POS            OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                     MOVE  CNS-RTN-900                                  @3212SEINO@@
                       TO  RTN-CD             OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                     MOVE  SQLCODE                                      @3212SEINO@@
                       TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                     MOVE  CNS-DETAIL-1                                 @3212SEINO@@
                       TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                   STRING  CNS-SQL-MSG-SELECT,                          @3212SEINO@@
                           WK-MSG-1-8            DELIMITED  BY SIZE     @3212SEINO@@
                     INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                     PERFORM  ERR-RTN                                   @3212SEINO@@
                 END-EVALUATE                                           @3212SEINO@@
                 EXEC                                                   @3212SEINO@@
                   SQL  DECLARE  TKMZBW04_CURSOR_2_4 CURSOR FOR  S8_4   @3212SEINO@@
                 END-EXEC                                               @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLCODE-DECLARE         =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                 EVALUATE  SQLCODE                                      @3212SEINO@@
                   WHEN  CNS-SQL-NORMAL                                 @3212SEINO@@
                     CONTINUE                                           @3212SEINO@@
                   WHEN  OTHER                                          @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (DECLARE)"                @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                     MOVE  CNS-PGM-ID                                   @3212SEINO@@
                       TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                     MOVE  CNS-POS-098                                  @3212SEINO@@
                       TO  ERR-POS            OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                     MOVE  CNS-RTN-900                                  @3212SEINO@@
                       TO  RTN-CD             OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                    MOVE  SQLCODE                                       @3212SEINO@@
                       TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                     MOVE  CNS-DETAIL-1                                 @3212SEINO@@
                       TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1    @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                   STRING  CNS-SQL-MSG-SELECT,                          @3212SEINO@@
                           WK-MSG-1-8            DELIMITED  BY SIZE     @3212SEINO@@
                     INTO  FREE-MSG              OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                     PERFORM  ERR-RTN                                   @3212SEINO@@
                 END-EVALUATE                                           @3212SEINO@@
               ELSE                                                     @3212SEINO@@
                CONTINUE                                                @3212SEINO@@
               END-IF                                                   @3212SEINO@@
               EXEC  SQL                                                @3212SEINO@@
                   OPEN TKMZBW04_CURSOR_2_4                             @3212SEINO@@
                     USING :H-TKMZBW04.H-SYORI-YMD,                     @3212SEINO@@
                           :H-TKMZBW04.H-KIDOU-ID,                      @3212SEINO@@
                           :H-TKMZBW04.H-RIYO-CMP-CD,                   @3212SEINO@@
                           :H-TKMZBW04.H-FUND-CD,                       @3212SEINO@@
                           :H-TKMZBW04.H-PTF-CD,                        @3212SEINO@@
                           :H-TKMZBW04.H-KJN-YMD,                       @3212SEINO@@
                           :H-TKMZBW04.H-MEG-CD,                        @3212SEINO@@
                           :H-TKMZBW04.H-SEC-SBT-CD,                    @3212SEINO@@
                           :H-TKMZBW04.H-TATE-FLG,                      @3212SEINO@@
                           :H-TKMZBW04.H-GYOKU-ID                       @3212SEINO@@
               END-EXEC                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN           =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               EVALUATE  SQLCODE                                        @3212SEINO@@
                 WHEN  CNS-SQL-NORMAL                                   @3212SEINO@@
      *----------  対象取引_2カーソルオープンフラグ                     @3212SEINO@@
                   MOVE  CNS-ON             TO  FLG-TKMZBW04-CR-2-4     @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2-4       =["            @3212SEINO@@
      D            FLG-TKMZBW04-CR-2-4 "]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
                  WHEN  OTHER                                           @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー  (OPEN)"                  @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー検知プログラム名                               @3212SEINO@@
                   MOVE  CNS-PGM-ID                                     @3212SEINO@@
                     TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  ポジション                                           @3212SEINO@@
                   MOVE  CNS-POS-099                                    @3212SEINO@@
                     TO  ERR-POS            OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  リターンコード                                       @3212SEINO@@
                   MOVE  CNS-RTN-900                                    @3212SEINO@@
                     TO  RTN-CD             OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  詳細リターンコード                                   @3212SEINO@@
                   MOVE  SQLCODE                                        @3212SEINO@@
                     TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  詳細リターンコードデコードフラグ                     @3212SEINO@@
                   MOVE  CNS-DETAIL-1                                   @3212SEINO@@
                     TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1      @3212SEINO@@
      *----------  フリーメッセージ                                     @3212SEINO@@
                 STRING  CNS-SQL-MSG-SELECT,                            @3212SEINO@@
                         WK-MSG-1-8              DELIMITED  BY SIZE     @3212SEINO@@
                   INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1 @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["              @3212SEINO@@
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":ポジション             =["              @3212SEINO@@
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["              @3212SEINO@@
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["              @3212SEINO@@
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["     @3212SEINO@@
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["              @3212SEINO@@
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"       @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *----------  エラー処理                                           @3212SEINO@@
                   PERFORM  ERR-RTN                                     @3212SEINO@@
               END-EVALUATE                                             @3212SEINO@@
             WHEN OTHER                                                 @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-EVALUATE                                                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***** 2)対象取引情報テーブルから処理対"
      D             " 象のレコードを取得する  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-2-OPEN-EXT.
           EXIT.
      ******************************************************************
      *       3)『対象取引_2』カーソルフェッチする
      ******************************************************************
       TKMZBW04-2-FETCH-RTN   SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『対象取引_2』カーソルフェッチ"
      D             "する START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  H-TORI-FETCH
                       H-SRJUN-FETCH
           EVALUATE  SYRI-JUN                OF  WK-KKN-IDO-CALC-PATTERN@3212SEINO@@
      *----------  ◆期間内異動計算パターン.処理順序＝'1' OR '5'の場合  @3212SEINO@@
             WHEN  CNS-SYRI-JUN-1                                       @3212SEINO@@
             WHEN  CNS-SYRI-JUN-5                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"      @3212SEINO@@
      D             "'1'OR'5'の場合"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               EXEC  SQL                                                @3212SEINO@@
                   FETCH                                                @3212SEINO@@
                        TKMZBW04_CURSOR_2_1                             @3212SEINO@@
                   INTO :H-TORI-OCCURS                                  @3212SEINO@@
               END-EXEC                                                 @3212SEINO@@
      *----------  ◆期間内異動計算パターン.処理順序＝'2'OR'6'の場合    @3212SEINO@@
             WHEN  CNS-SYRI-JUN-2                                       @3212SEINO@@
             WHEN  CNS-SYRI-JUN-6                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"      @3212SEINO@@
      D             "'2'OR'6'の場合"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               EXEC  SQL                                                @3212SEINO@@
                   FETCH                                                @3212SEINO@@
                        TKMZBW04_CURSOR_2_2                             @3212SEINO@@
                   INTO :H-TORI-OCCURS                                  @3212SEINO@@
               END-EXEC                                                 @3212SEINO@@
      *----------  ◆期間内異動計算パターン.処理順序＝'3'OR'7'の場合    @3212SEINO@@
             WHEN  CNS-SYRI-JUN-3                                       @3212SEINO@@
             WHEN  CNS-SYRI-JUN-7                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"      @3212SEINO@@
      D             "'3'OR'7'の場合"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               EXEC  SQL                                                @3212SEINO@@
                   FETCH                                                @3212SEINO@@
                        TKMZBW04_CURSOR_2_3                             @3212SEINO@@
                   INTO :H-TORI-OCCURS                                  @3212SEINO@@
               END-EXEC                                                 @3212SEINO@@
      *----------  ◆期間内異動計算パターン.処理順序＝'4'OR'8'の場合    @3212SEINO@@
             WHEN  CNS-SYRI-JUN-4                                       @3212SEINO@@
             WHEN  CNS-SYRI-JUN-8                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":期間内異動計算パターン.処理順序＝"      @3212SEINO@@
      D             "'4'OR'8'の場合"                                    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
               EXEC  SQL                                                @3212SEINO@@
                   FETCH                                                @3212SEINO@@
                        TKMZBW04_CURSOR_2_4                             @3212SEINO@@
                   INTO :H-TORI-OCCURS                                  @3212SEINO@@
               END-EXEC                                                 @3212SEINO@@
             WHEN OTHER                                                 @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-EVALUATE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY CNS-PGM-ID":SQLCODE-FETCH           =["SQLCODE"]"    @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  ①処理順決定処理
               COMPUTE  WK-KUKAN-KENSUU = SQLERRD(3) - WK-GOUKEI-KENSUU
               MOVE  SQLERRD(3)         TO  WK-GOUKEI-KENSUU
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW04-2-FETCH-RTN-1]"      GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               PERFORM  VARYING  H-CNT1  FROM CNS-1 BY CNS-1
               UNTIL  H-CNT1  > WK-KUKAN-KENSUU
               COMPUTE  WK-WK-SRJUN
                     =  WK-WK-SRJUN  +  CNS-1
      *----------  処理順
               MOVE  WK-WK-SRJUN
                 TO  H-SRJUN            OF  H-SRJUN-OCCURS(H-CNT1)
      *----------  処理実行日
               MOVE  WK-SYORI-YMD       OF  WK-TKMZBW03
                 TO  H-SYORI-YMD        OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  起動ID
               MOVE  WK-KIDOU-ID        OF  WK-TKMZBW03
                 TO  H-KIDOU-ID         OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  利用会社コード
               MOVE  WK-RIYO-CMP-CD     OF  WK-TKMZBW03
                 TO  H-RIYO-CMP-CD      OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  ファンドコード
               MOVE  WK-FUND-CD         OF  WK-TKMZBW03
                 TO  H-FUND-CD          OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  ポートフォリオコード
               MOVE  WK-PTF-CD          OF  WK-TKMZBW03
                 TO  H-PTF-CD           OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  基準日
               MOVE  WK-KJN-YMD         OF  WK-TKMZBW03
                 TO  H-KJN-YMD          OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  証券種別コード
               MOVE  WK-SEC-SBT-CD      OF  WK-TKMZBW03
                 TO  H-SEC-SBT-CD       OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  銘柄コード
               MOVE  WK-MEG-CD          OF  WK-TKMZBW03
                 TO  H-MEG-CD           OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  資産負債・買建売建フラグ
               MOVE  WK-TATE-FLG        OF  WK-TKMZBW03
                 TO  H-TATE-FLG         OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  玉ID
               MOVE  WK-GYOKU-ID        OF  WK-TKMZBW03
                 TO  H-GYOKU-ID         OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  原取引ID
               MOVE  H-TORI-ID          OF  H-TORI-OCCURS(H-CNT1)
                 TO  H-TORI-ID          OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  増幅赤黒区分
               MOVE  H-ZOFKU-AKA-KBN    OF  H-TORI-OCCURS(H-CNT1)
                 TO  H-ZOFKU-AKA-KBN    OF  H-TAISYO-OCCURS(H-CNT1)
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":処理順                  =["
      D            H-SRJUN              OF  H-SRJUN-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":処理実行日              =["
      D            H-SYORI-YMD          OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":起動ID                  =["
      D            H-KIDOU-ID           OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["
      D            H-RIYO-CMP-CD        OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["
      D            H-FUND-CD            OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["
      D            H-PTF-CD             OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":基準日                  =["
      D            H-KJN-YMD            OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["
      D            H-SEC-SBT-CD         OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["
      D            H-MEG-CD             OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":玉ID                    =["
      D            H-GYOKU-ID           OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                =["
      D            H-TORI-ID            OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":増幅赤黒区分            =["
      D            H-ZOFKU-AKA-KBN      OF  H-TAISYO-OCCURS(H-CNT1)"]"
      *-----------------------------------------------------------------
               END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW04-2-FETCH-RTN-1]"      GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
               MOVE  WK-KUKAN-KENSUU    TO  H-CNT3
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":H-CNT3   =[" H-CNT3 "]"
      *-----------------------------------------------------------------
      *----------  ②対象取引テーブルにupdate処理
               PERFORM  TKMZBW04-UPDATE-RTN
             WHEN  CNS-SQL-NOTFOUND
      *----------  対象取引_2カーソルオープンフラグ
               MOVE  CNS-OFF            TO  FLG-TKMZBW04-FE-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-FE-2       =["
      D            FLG-TKMZBW04-FE-2 "]"
      *-----------------------------------------------------------------
               IF  SQLERRD(3)  NOT = CNS-0
               THEN
      *----------  ①処理順決定処理
               COMPUTE  WK-KUKAN-KENSUU = SQLERRD(3) - WK-GOUKEI-KENSUU
                 MOVE  SQLERRD(3)         TO  WK-GOUKEI-KENSUU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLERRD(3)       =["
      D            SQLERRD(3) "]"
      D    DISPLAY CNS-PGM-ID":WK-KUKAN-KENSUU       =["
      D            WK-KUKAN-KENSUU "]"
      D    DISPLAY CNS-PGM-ID":WK-GOUKEI-KENSUU       =["
      D            WK-GOUKEI-KENSUU "]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW04-2-FETCH-RTN-2]"      GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
                 PERFORM  VARYING  H-CNT1  FROM CNS-1 BY CNS-1
                 UNTIL  H-CNT1  > WK-KUKAN-KENSUU
                 COMPUTE  WK-WK-SRJUN
                       =  WK-WK-SRJUN  +  CNS-1
      *----------  処理順
                 MOVE  WK-WK-SRJUN
                   TO  H-SRJUN            OF  H-SRJUN-OCCURS(H-CNT1)
      *----------  処理実行日
                 MOVE  WK-SYORI-YMD       OF  WK-TKMZBW03
                   TO  H-SYORI-YMD        OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  起動ID
                 MOVE  WK-KIDOU-ID        OF  WK-TKMZBW03
                   TO  H-KIDOU-ID         OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  利用会社コード
                 MOVE  WK-RIYO-CMP-CD     OF  WK-TKMZBW03
                   TO  H-RIYO-CMP-CD      OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  ファンドコード
                 MOVE  WK-FUND-CD         OF  WK-TKMZBW03
                   TO  H-FUND-CD          OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  ポートフォリオコード
                 MOVE  WK-PTF-CD          OF  WK-TKMZBW03
                   TO  H-PTF-CD           OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  基準日
                 MOVE  WK-KJN-YMD         OF  WK-TKMZBW03
                   TO  H-KJN-YMD          OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  証券種別コード
                 MOVE  WK-SEC-SBT-CD      OF  WK-TKMZBW03
                   TO  H-SEC-SBT-CD       OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  銘柄コード
                 MOVE  WK-MEG-CD          OF  WK-TKMZBW03
                   TO  H-MEG-CD           OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  資産負債・買建売建フラグ
                 MOVE  WK-TATE-FLG        OF  WK-TKMZBW03
                   TO  H-TATE-FLG         OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  玉ID
                 MOVE  WK-GYOKU-ID        OF  WK-TKMZBW03
                   TO  H-GYOKU-ID         OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  原取引ID
                 MOVE  H-TORI-ID          OF  H-TORI-OCCURS(H-CNT1)
                   TO  H-TORI-ID          OF  H-TAISYO-OCCURS(H-CNT1)
      *----------  増幅赤黒区分
                 MOVE  H-ZOFKU-AKA-KBN    OF  H-TORI-OCCURS(H-CNT1)
                   TO  H-ZOFKU-AKA-KBN    OF  H-TAISYO-OCCURS(H-CNT1)
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":処理順                  =["
      D            H-SRJUN              OF  H-SRJUN-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":処理実行日              =["
      D            H-SYORI-YMD          OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":起動ID                  =["
      D            H-KIDOU-ID           OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":利用会社コード          =["
      D            H-RIYO-CMP-CD        OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":ファンドコード          =["
      D            H-FUND-CD            OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":ポートフォリオコード    =["
      D            H-PTF-CD             OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":基準日                  =["
      D            H-KJN-YMD            OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":証券種別コード          =["
      D            H-SEC-SBT-CD         OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":銘柄コード              =["
      D            H-MEG-CD             OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":資産負債・買建売建フラグ=["
      D            H-TATE-FLG           OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":玉ID                    =["
      D            H-GYOKU-ID           OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":原取引ID                =["
      D            H-TORI-ID            OF  H-TAISYO-OCCURS(H-CNT1)"]"
      D    DISPLAY CNS-PGM-ID":増幅赤黒区分            =["
      D            H-ZOFKU-AKA-KBN      OF  H-TAISYO-OCCURS(H-CNT1)"]"
      *-----------------------------------------------------------------
                 END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TKMZBW04-2-FETCH-RTN-2]"      GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
                 MOVE  WK-KUKAN-KENSUU  TO  H-CNT3
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":H-CNT3   =[" H-CNT3 "]"
      *-----------------------------------------------------------------
                 IF  H-CNT3 = ZERO
                 THEN
                   CONTINUE
                 ELSE
      *----------  ②対象取引テーブルにupdate処理
                   PERFORM  TKMZBW04-UPDATE-RTN
                 END-IF
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY CNS-PGM-ID":SQL処理エラー  (FETCH)"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-087
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-8         DELIMITED  BY SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  2)『対象取引_2』カーソルフェッチ"
      D             "する  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-2-FETCH-EXT.
           EXIT.
      ******************************************************************
      *       4)『対象取引_2情報』カーソルクローズ処理
      ******************************************************************
      * TKMZBW04-2-CLOSE-RTN   SECTION.
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID ":****  2)『対象取引_2』カーソルフェッチ"
      *D             "する START  ****"
      **-----------------------------------------------------------------
      *     EXEC  SQL
      *       CLOSE TKMZBW04_CURSOR_2
      *     END-EXEC
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY CNS-PGM-ID":CLOSE SQLCODE               =["SQLCODE"]"
      **-------------------<DEBUG>---------------------------------------
      *     IF  SQLCODE                  = CNS-SQL-NORMAL
      *     THEN
      **----------  対象取引_2カーソルオープンフラグ
      *       MOVE  CNS-OFF              TO  FLG-TKMZBW04-CR-2
      **-----------------------DEBUG-------------------------------------
      *D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-CR-2           =["
      *D            FLG-TKMZBW04-CR-2 "]"
      **-----------------------------------------------------------------
      *     ELSE
      **-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":CURSOR CLOSE エラー"
      **-------------------<DEBUG>---------------------------------------
      **----------  エラー検知プログラム名
      *       MOVE  CNS-PGM-ID
      *         TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      **----------  ポジション
      *       MOVE  CNS-POS-088
      *         TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      **----------  リターンコード
      *       MOVE  CNS-RTN-900
      *         TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコード
      *       MOVE  SQLCODE
      *         TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      **----------  詳細リターンコードデコードフラグ
      *       MOVE  CNS-DETAIL-1
      *         TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      **---------- フリーメッセージ
      *       STRING  CNS-SQL-MSG-SELECT,
      *               WK-MSG-1-8              DELIMITED  BY SIZE
      *         INTO  FREE-MSG                OF  PARM-SCZY1170-ARG1
      **--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      **-----------------------------------------------------------------
      **----------  エラー処理
      *       PERFORM  ERR-RTN
      *     END-IF
      **-----------------------<DEBUG>-----------------------------------
      *D    DISPLAY  CNS-PGM-ID ":****  2)『対象取引_2』カーソルフェッチ"
      *D             "する END  ****"
      **-----------------------------------------------------------------
      *     CONTINUE.
      * TKMZBW04-2-CLOSE-EXT.
      *     EXIT.
      ******************************************************************
      *       ②対象取引テーブルにupdate処理
      ******************************************************************
       TKMZBW04-UPDATE-RTN    SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  ②対象取引テーブルにupdate処理"
      D             " START  ****"
      *-----------------------------------------------------------------
      *    INITIALIZE                   SQLSTMT                         @3212SEINO@@
           INITIALIZE                   SQLSTMT09                       @3212SEINO@@
           MOVE  WK-TABLE-TKMZBW04      TO  SQL-TBL-ID-9
      *----------  ＳＱＬ文
      *    MOVE  SQL-UPDATE-1-9         TO  SQLSTMT                     @3212SEINO@@
           MOVE  SQL-UPDATE-1-9         TO  SQLSTMT09                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLSTMT                =["SQLSTMT"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":SQLSTMT09               =["SQLSTMT09"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-9             =["WK-MSG-1-9"]"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW04-S9-UPDATE=["
      D                         FLG-TKMZBW04-S9-UPDATE"]"
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-TKMZBW04-S9-UPDATE = CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
      *      EXEC SQL PREPARE S9 FROM :SQLSTMT END-EXEC                 @3212SEINO@@
             EXEC SQL PREPARE S9 FROM :SQLSTMT09 END-EXEC               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE        =["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  NOT = CNS-SQL-NORMAL
             THEN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-089
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       S-UPDATE-1-9       DELIMITED  BY SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL FOR :H-CNT3
               EXECUTE S9
                 USING :H-SRJUN-OCCURS,
                       :H-TAISYO-OCCURS
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":UPDATE-SQLCODE          =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-TKMZBW04-S9-UPDATE      @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S9-UPDATE=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S9-UPDATE"]"                @3212SEINO@@
      *-----------------------------------------------------------------
               INITIALIZE  H-CNT1
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-090
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             STRING  CNS-SQL-MSG-UPDATE,
                     S-UPDATE-1-9       DELIMITED  BY SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  ②対象取引テーブルにupdate処理"
      D             " END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZBW04-UPDATE-EXT.
           EXIT.
      ******************************************************************
      *                 3.3後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   後処理  START  ***"
      *D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1810-ARG1=["
      *D             PARM-SMZJ1810-ARG1       OF PARM-SMZJ1810-INOUT"]"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"                  USING  PARM-SCZY1170-IN
                                                    PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG        TO  PARM-SMZJ1810-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ1810-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ1810-ARG3(COUNTER   OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ1810-ARG3(COUNTER   OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ1810-ARG3(COUNTER   OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ1810-ARG3(COUNTER   OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ1810-ARG3(COUNTER   OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ1810-ARG3(COUNTER   OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID":***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           GOBACK.
      ******************************************************************
      *                 3.4エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ERR-RTN  START  ***"
      *-----------------------------------------------------------------
      *----------  3.4.1カーソルを閉じる
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S2-INSERT=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S2-INSERT"]"                @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S14-INSERT=["               @3212SEINO@@
      D                        FLG-TKMZBW04-S14-INSERT"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S15-INSERT=["               @3212SEINO@@
      D                        FLG-TKMZBW04-S15-INSERT"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S16-INSERT=["               @3212SEINO@@
      D                        FLG-TKMZBW04-S16-INSERT"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S7-DELETE=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S7-DELETE"]"                @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S9-UPDATE=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S9-UPDATE"]"                @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW18-S10-INSERT=["               @3212SEINO@@
      D                        FLG-TKMZBW18-S10-INSERT"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID": 取引_1カーソルオープンフラグ1 = ["
      D            FLG-TKMXTR00-CR-1-1"]"
      D    DISPLAY CNS-PGM-ID": 取引_1カーソルオープンフラグ2 = ["
      D            FLG-TKMXTR00-CR-1-2"]"
      D    DISPLAY CNS-PGM-ID": 取引_2カーソルオープンフラグ = ["
      D            FLG-TKMXTR00-CR-2"]"
      D    DISPLAY CNS-PGM-ID": 対象取引_1カーソルオープンフラグ = ["
      D            FLG-TKMZBW04-CR-1"]"
      D    DISPLAY CNS-PGM-ID": 対象取引カーソルオープンフラグ = ["
      D            FLG-TKMZBW04-CR"]"
      D    DISPLAY CNS-PGM-ID": 対象取引_2カーソルオープンフラグ1 = ["
      D            FLG-TKMZBW04-CR-2-1"]"
      D    DISPLAY CNS-PGM-ID": 対象取引_2カーソルオープンフラグ2= ["
      D            FLG-TKMZBW04-CR-2-2"]"
      D    DISPLAY CNS-PGM-ID": 対象取引_2カーソルオープンフラグ3= ["
      D            FLG-TKMZBW04-CR-2-3"]"
      D    DISPLAY CNS-PGM-ID": 対象取引_2カーソルオープンフラグ4= ["
      D            FLG-TKMZBW04-CR-2-4"]"
      D    DISPLAY CNS-PGM-ID": 残高異動カーソルオープンフラグ2 = ["
      D            FLG-TKMZZI00-CR-2"]"
      D    DISPLAY CNS-PGM-ID": 残高異動カーソルオープンフラグ = ["
      D            FLG-TKMZZI00-CR"]"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                TO  FLG-TKMZBW04-S2-INSERT      @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW04-S14-INSERT     @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW04-S15-INSERT     @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW04-S16-INSERT     @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW04-S7-DELETE      @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW04-S9-UPDATE      @3212SEINO@@
           MOVE  CNS-OFF                TO  FLG-TKMZBW18-S10-INSERT     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S2-INSERT=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S2-INSERT"]"                @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S14-INSERT=["               @3212SEINO@@
      D                        FLG-TKMZBW04-S14-INSERT"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S15-INSERT=["               @3212SEINO@@
      D                        FLG-TKMZBW04-S15-INSERT"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S16-INSERT=["               @3212SEINO@@
      D                        FLG-TKMZBW04-S16-INSERT"]"               @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S7-DELETE=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S7-DELETE"]"                @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW04-S9-UPDATE=["                @3212SEINO@@
      D                        FLG-TKMZBW04-S9-UPDATE"]"                @3212SEINO@@
      D    DISPLAY CNS-PGM-ID":FLG-TKMZBW18-S10-INSERT=["               @3212SEINO@@
      D                        FLG-TKMZBW18-S10-INSERT"]"               @3212SEINO@@
      *-----------------------------------------------------------------
           IF  FLG-TKMXTR00-CR-1-1      = CNS-ON
           THEN
      *----------  取引_1カーソルオープンフラグ＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":取引_1カーソルオープンフラグ＝1 の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMXTR00_CURSOR_1
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMXTR00-CR-1-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 取引_1カーソルオープンフラグ = ["
      D            FLG-TKMXTR00-CR-1-1"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMXTR00-CR-1-2      = CNS-ON
           THEN
      *----------  取引_1カーソルオープンフラグ＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":取引_1カーソルオープンフラグ＝1 の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMXTR00_CURSOR_2
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMXTR00-CR-1-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 取引_1カーソルオープンフラグ = ["
      D            FLG-TKMXTR00-CR-1-2"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZZI00-CR-2        = CNS-ON
           THEN
      *----------  残高異動カーソルオープンフラグ2＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":残高異動カーソルオープンフラグ2＝1の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZZI00_CURSOR_2
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMZZI00-CR-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 残高異動カーソルオープンフラグ2 = ["
      D            FLG-TKMZZI00-CR-2"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZZI00-CR          = CNS-ON
           THEN
      *----------  残高異動カーソルオープンフラグ＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":残高異動カーソルオープンフラグ＝1の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZZI00_CURSOR
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMZZI00-CR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 残高異動カーソルオープンフラグ = ["
      D            FLG-TKMZZI00-CR"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW04-CR          = CNS-ON
           THEN
      *----------  対象取引カーソルオープンフラグ＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":対象取引カーソルオープンフラグ＝1の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZBW04_CURSOR
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMZBW04-CR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 対象取引カーソルオープンフラグ = ["
      D            FLG-TKMZBW04-CR"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW04-CR-1        = CNS-ON
           THEN
      *----------  対象取引_1カーソルオープンフラグ＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":対象取引_1カーソルオープンフラグ＝1の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZBW04_CURSOR_1
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMZBW04-CR-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 対象取引_1カーソルオープンフラグ = ["
      D            FLG-TKMZBW04-CR-1"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW04-CR-2-1        = CNS-ON
           THEN
      *----------  対象取引_2カーソルオープンフラグ1＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":対象取引_2カーソルオープンフラグ1＝1の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZBW04_CURSOR_2_1
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMZBW04-CR-2-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 対象取引_2カーソルオープンフラグ1 = ["
      D            FLG-TKMZBW04-CR-2-1"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW04-CR-2-2        = CNS-ON
           THEN
      *----------  対象取引_2カーソルオープンフラグ2＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":対象取引_2カーソルオープンフラグ2＝1の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZBW04_CURSOR_2_2
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMZBW04-CR-2-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 対象取引_2カーソルオープンフラグ2 = ["
      D            FLG-TKMZBW04-CR-2-2"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW04-CR-2-3        = CNS-ON
           THEN
      *----------  対象取引_2カーソルオープンフラグ3＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":対象取引_2カーソルオープンフラグ3＝1の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZBW04_CURSOR_2_3
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMZBW04-CR-2-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 対象取引_2カーソルオープンフラグ3 = ["
      D            FLG-TKMZBW04-CR-2-3"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZBW04-CR-2-4        = CNS-ON
           THEN
      *----------  対象取引_2カーソルオープンフラグ4＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID
      D            ":対象取引_2カーソルオープンフラグ4＝1の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMZBW04_CURSOR_2_4
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMZBW04-CR-2-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 対象取引_2カーソルオープンフラグ4 = ["
      D            FLG-TKMZBW04-CR-2-4"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMXTR00-CR-2        = CNS-ON
           THEN
      *----------  取引_2カーソルオープンフラグ＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":取引_2カーソルオープンフラグ＝1 の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMXTR00_CURSOR_3
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMXTR00-CR-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 取引_2カーソルオープンフラグ = ["
      D            FLG-TKMXTR00-CR-2"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMXTR00-CR-13        = CNS-ON
           THEN
      *----------  取引カーソルオープンフラグ＝1 の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":取引カーソルオープンフラグ＝1 の場合"
      *-----------------------------------------------------------------
             EXEC  SQL
               CLOSE TKMXTR00_CUR13
             END-EXEC
             MOVE  CNS-OFF               TO  FLG-TKMXTR00-CR-13
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID": 取引カーソルオープンフラグ = ["
      D            FLG-TKMXTR00-CR-13"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  3.4.2リターンパッケージの設定
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"                  USING  PARM-SCZY1170-IN
                                                    PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG        TO  PARM-SMZJ1810-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID":  PARM-SCZY1170-RTNPKG = ["
      D                                        PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY CNS-PGM-ID":  PARM-SMZJ1810-ARG3 = ["
      D                                          PARM-SMZJ1810-ARG3"]"
      D    DISPLAY CNS-PGM-ID":  COUNT       = ["
      D                              COUNTER  OF PARM-SMZJ1810-ARG3"]"
      D    DISPLAY CNS-PGM-ID":  エラー検知プログラム名=[" ERR-PGM-ID
      D       OF PARM-SMZJ1810-ARG3(COUNTER  OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  ポジション            =["ERR-POS
      D       OF PARM-SMZJ1810-ARG3(COUNTER  OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  リターンコード        =["RTN-CD
      D       OF PARM-SMZJ1810-ARG3(COUNTER  OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコード    =["
      D       DETAIL-RTN-CD
      D       OF PARM-SMZJ1810-ARG3(COUNTER  OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D       DETAIL-RTN-CD-FLG
      D       OF PARM-SMZJ1810-ARG3(COUNTER  OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY CNS-PGM-ID":  フリーメッセージ      =["FREE-MSG
      D       OF PARM-SMZJ1810-ARG3(COUNTER  OF PARM-SMZJ1810-ARG3)"]"
      D    DISPLAY CNS-PGM-ID
      D           ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY CNS-PGM-ID": ***  ERR-RTN  END  ***"
      D    DISPLAY CNS-PGM-ID": ***  SMZJ1810処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
