      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * ＩＤ           : MUSR2651
      * 名称           : GAMMA残高データ生成処理
      * 処理概要       : 指定されたポートフォリオ且つ残高基準日FROM～TO
      *                  期間内の処理対象日のデータを運用成果残高テーブ
      *                  ルから抽出し、ＧＡＭMＡ用出力ファイルを作成
      *                  する。
      *                  更新結果により、進捗管理テーブルに対して、
      *                 「進捗タスクID」が運用成果GX残高の
      *                 「進捗ステータス」を更新する。
      * 参照ＤＢ       : 運用成果残高
      * 更新ＤＢ       : なし
      * 引数           : 利用会社コード
      *                  処理実行日
      *                  業務タスクID
      *                  起動ＩＤ
      *                  ファイルパス
      *
      * 改訂履歴
      * 年月日   区分 所属     担当    内容
      * -------- ---- -------- ------- ---------------------------------
      * 20080613 新規 SCS      徐勝飛  新規作成
      * 20080908 修正 SCS      黄剣鵬  修正
      * 20081029 修正 SCS      許国戦  修正
      * 20081104 修正 SCS      許国戦  連結障害対応No.362
      * 20081202 修正 SCS      劉輝    残タスク129の対応
      * 20081204 修正 SCS      馬輝    残タスク159の対応
      * 20081204 修正 SCS      馬輝    残タスク157の対応
      * 20081211 修正 SCS      馬輝    残タスク135の対応
      * 20081211 修正 SCS      馬輝    連結障害775の対応
      * 20081212 修正 SCS      馬輝    連結障害841の対応
      * 20081222 修正 SCS      馬輝    連結障害211の対応
      * 20081230 修正 SCS      馬輝    連結障害493の対応
      * 20090106 修正 SCS      馬輝    連結障害20090106の対応
      * 20090106 修正 SCS      馬輝    連結障害1077の対応
      * 20090227 修正 SCS      黄剣鵬  修正
      * 20090319 修正 SCS      黄剣鵬  連結障害1532の対応
      * 20090320 修正 SCS      黄剣鵬  連結障害No.1579
      * 20090323 修正 SCS      黄剣鵬  連結障害No.1577
      * 20090512 修正 SCS      馬輝    テーマ252対応
      * 20090615 修正 SCS      馬輝    残タスク238の対応
      * 20090615 修正 SCS      馬輝    残タスク246の対応
      * 20090707 修正 SCS      馬輝    テーマ891の対応
      * 20090710 修正 SCS      馬輝    テーマ945の対応
      * 20090714 修正 SCS      馬輝    テーマ965の対応
      * 20090716 修正 SCS      馬輝    テーマ1007の対応
      * 20090720 修正 SCS      馬輝    テーマ1011の対応
      * 20090728 修正 SCS      黄剣鵬  テーマ1102対応
      * 20090727 修正 SCS      馬輝    テーマ1136
      * 20090818 修正 SCS      馬輝    テーマ1304
      * 20090818 修正 SCS      馬輝    テーマ1236
      * 20090824 修正 SCS      馬輝    テーマ1061の対応
      * 20090824 修正 SCS      馬輝    テーマ1379の対応
      * 20090824 修正 SCS      馬輝    テーマ1382の対応
      * 20090828 修正 SCS      馬輝    テーマ1418の対応
      * 20090828 修正 SCS      馬輝    テーマ1419の対応
      * 20090903 修正 SCS      馬輝    テーマ1015の対応
      * 20090907 修正 SCS      馬輝    テーマ1374の対応
      * 20090910 修正 SCS      馬輝    テーマ1527の対応
      * 20090910 修正 SCS      馬輝    テーマ1526の対応
      * 20090918 修正 SCS      馬輝    テーマ1644の対応
      * 20090924 修正 SCS      馬輝    テーマ1650の対応
      * 20090924 修正 SCS      梅春栄  テーマ1769の対応
      * 20091009 修正 SCS      馬輝    テーマ1801の対応
      * 20091009 修正 SCS      馬輝    テーマ1802の対応
      * 20091009 修正 SCS      馬輝    テーマ1803の対応
      * 20091009 修正 SCS      馬輝    テーマ1905の対応
      * 20091102 修正 SCS      梅春栄  テーマ1976の対応
      * 20091107 修正 SCS      黄剣鵬  テーマ2026の対応
      * 20091102 修正 SCS      梅春栄  テーマ2057の対応
      * 20091202 修正 SCS      丁      テーマ2185対応
      * 20091210 修正 SCS      黄剣鵬  テーマ2216対応
      * 20091216 修正 SCS      梅春栄  テーマ2275の対応
      * 20091218 修正 SCS      梅春栄  テーマ2286の対応
      * 20100114 修正 SCS      黄剣鵬  テーマ1945対応
      * 20100404 修正 SCS      陳琦偉  テーマ2682の対応
      * 20100624 修正 SCS      徐志成  テーマ2833の対応
      * 20110228 修正 SCS      高志軍  テーマ2693対応
      * 20110628 修正 SCS      高志軍  テーマ3276対応
      * 20120723 修正 SCS      潘遠    テーマ3422対応
      * 20120802 修正 SCS      潘遠    テーマ3428対応
      * 20120830 修正 SCS      馬旭君  テーマ3422追加修正対応
      * 20130115 修正 SCS      査      テーマ3456対応
      * 20130117 修正 ISC      蒋小波  テーマ3406対応
      * 20130718 修正 SCS      馬旭君  テーマ3344対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    MUSR2651.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-06-13.
       DATE-COMPILED.
      ******************************************************************
      *
      *        環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V  WITH  DEBUGGING  MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
           SELECT  OUT-FILE
                              ASSIGN  TO  OUTFILE
                              ORGANIZATION IS  LINE SEQUENTIAL
                              FILE STATUS  IS  WK-FILE-STATUS.
           SELECT  OUT-FILE-2
                              ASSIGN  TO  OUTFILE-2
                              ORGANIZATION IS  LINE SEQUENTIAL
                              FILE STATUS  IS  WK-FILE-STATUS-2.
           SELECT  OUT-FILE-3
                              ASSIGN  TO  OUTFILE-3
                              ORGANIZATION IS  LINE SEQUENTIAL
                              FILE STATUS  IS  WK-FILE-STATUS-3.
           SELECT  OUT-FILE-4
                              ASSIGN  TO  OUTFILE-4
                              ORGANIZATION IS  LINE SEQUENTIAL
                              FILE STATUS  IS  WK-FILE-STATUS-4.
           SELECT  OUT-FILE-5
                              ASSIGN  TO  OUTFILE-5
                              ORGANIZATION IS  LINE SEQUENTIAL
                              FILE STATUS  IS  WK-FILE-STATUS-5.
           SELECT  OUT-FILE-6
                              ASSIGN  TO  OUTFILE-6
                              ORGANIZATION IS  LINE SEQUENTIAL
                              FILE STATUS  IS  WK-FILE-STATUS-6.
           SELECT  OUT-FILE-7
                              ASSIGN  TO  OUTFILE-7
                              ORGANIZATION IS  LINE SEQUENTIAL
                              FILE STATUS  IS  WK-FILE-STATUS-7.
           SELECT  OUT-FILE-8
                              ASSIGN  TO  OUTFILE-8
                              ORGANIZATION IS  LINE SEQUENTIAL
                              FILE STATUS  IS  WK-FILE-STATUS-8.
      ******************************************************************
      *
      *        デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       FILE                   SECTION.
       FD  OUT-FILE
                         DATA       RECORD  DAT-REC
                         LABEL      RECORD  IS
                                              STANDARD.
       01  DAT-REC                 PIC  X(3000).
       FD  OUT-FILE-2
                         DATA       RECORD  DAT-REC2
                         LABEL      RECORD  IS
                                              STANDARD.
       01  DAT-REC2                PIC  X(3000).
       FD  OUT-FILE-3
                         DATA       RECORD  DAT-REC3
                         LABEL      RECORD  IS
                                              STANDARD.
       01  DAT-REC3                PIC  X(3000).
       FD  OUT-FILE-4
                         DATA       RECORD  DAT-REC4
                         LABEL      RECORD  IS
                                              STANDARD.
       01  DAT-REC4                PIC  X(3000).
       FD  OUT-FILE-5
                         DATA       RECORD  DAT-REC5
                         LABEL      RECORD  IS
                                              STANDARD.
       01  DAT-REC5                PIC  X(3000).
       FD  OUT-FILE-6
                         DATA       RECORD  DAT-REC6
                         LABEL      RECORD  IS
                                              STANDARD.
       01  DAT-REC6                PIC  X(3000).
       FD  OUT-FILE-7
                         DATA       RECORD  DAT-REC7
                         LABEL      RECORD  IS
                                              STANDARD.
       01  DAT-REC7                PIC  X(3000).
       FD  OUT-FILE-8
                         DATA       RECORD  DAT-REC8
                         LABEL      RECORD  IS
                                              STANDARD.
       01  DAT-REC8                PIC  X(3000).
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
      *----------  共通用コンスタント
         05  CNS-USCNS.
           COPY "USCNS.cpy".
      *----------  プログラムID
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "MUSR2651".
      *----------  運用成果残高
         05  CNS-TBL-TKUSZT01      PIC  X(08)  VALUE  "TKUSZT01".
      *----------  進捗管理
         05  CNS-TBL-TKDYAA40      PIC  X(08)  VALUE  "TKDYAA40".
      *----------  ポートフォリオ評価系列
      *******         テーマ2693     20100404 修正  開始        ********
         05  CNS-TBL-TKPFZK04      PIC  X(08)  VALUE  "TKPFZK04".
      *******         テーマ2693     20100404 修正  終了        ********
      *******         テーマ3406     20130117 修正  開始        ********
      *----------  ＳＢＡ残高データ接続
         05  CNS-SBA-ZANDAKA-SETUZOKU
                                   PIC  X(07)  VALUE  "T6820US".
      *******         テーマ3406     20130117 修正  終了        ********
         05  CNS-BL0001            PIC  X(06)  VALUE  "BL0001".
         05  CNS-RS                PIC  X(02)  VALUE  "RS".
         05  CNS-R                 PIC  X(01)  VALUE  "R".
         05  CNS-RX-TEXT           PIC  X(02)  VALUE  "RX".
         05  CNS-PATH-05           PIC  X(02)  VALUE  "05".
         05  CNS-TEXT-OTHR         PIC  X(04)  VALUE  "OTHR".
         05  CNS-TEXT-OTH          PIC  X(04)  VALUE  "OTH ".
         05  CNS-TEXT-WR           PIC  X(04)  VALUE  "WR  ".
         05  CNS-TEXT-WRD          PIC  X(04)  VALUE  "WRD ".
         05  CNS-TEXT-SUPN         PIC  X(04)  VALUE  "SUPN".
         05  CNS-TEXT-SUP          PIC  X(04)  VALUE  "SUP ".
         05  CNS-OTHR              PIC  X(04)  VALUE  "OTHR".
      *------------------ <連結障害841の対応 START>---------------------
         05  CNS-SPACE-99          PIC  X(04)  VALUE  "99  ".
      *------------------ <連結障害841の対応 END>-----------------------
      *----------  置換文字
         05  CNS-TEXT-1            PIC  X(30)  VALUE
                                       "処理対象実行状況管理明細データ".
      *----------  最大連番
         05  CNS-SAIDAI-RBN-08     PIC  9(01)  VALUE  8.
      *----------  拠点サーバ区分
         05  CNS-KYOTEN-KBN-02     PIC  X(02)  VALUE  "02".
         05  CNS-TEXT-TK1          PIC  X(14)  VALUE  "運用通貨コード".
         05  CNS-BIKKOU-1          PIC  X(07)  VALUE  "備考_１".
         05  CNS-D001              PIC  X(04)  VALUE  "$001".
         05  CNS-TEXT-T            PIC  X(01)  VALUE  "T".
         05  CNS-MEG-RECVLC        PIC  X(06)  VALUE  "RECVLC".
         05  CNS-MEG-RECVBC        PIC  X(06)  VALUE  "RECVBC".
         05  CNS-MEG-PAYLC         PIC  X(05)  VALUE  "PAYLC".
         05  CNS-MEG-PAYBC         PIC  X(05)  VALUE  "PAYBC".
         05  CNS-MEG-PAYLC2        PIC  X(06)  VALUE  "PAYLC2".
         05  CNS-MEG-PAYBC2        PIC  X(06)  VALUE  "PAYBC2".
         05  CNS-MEG-PAYLC3        PIC  X(06)  VALUE  "PAYLC3".
         05  CNS-MEG-PAYBC3        PIC  X(06)  VALUE  "PAYBC3".
         05  CNS-MEG-ACRECVLC      PIC  X(08)  VALUE  "ACRECVLC".
         05  CNS-MEG-ACPAYLC       PIC  X(07)  VALUE  "ACPAYLC".
         05  CNS-MEG-MARECVLC      PIC  X(08)  VALUE  "MARECVLC".
         05  CNS-MEG-MARECVBC      PIC  X(08)  VALUE  "MARECVBC".
         05  CNS-MEG-MAPAYLC       PIC  X(07)  VALUE  "MAPAYLC".
         05  CNS-MEG-MAPAYBC       PIC  X(07)  VALUE  "MAPAYBC".
         05  CNS-EX                PIC  X(02)  VALUE  "EX".
         05  CNS-CASH              PIC  X(04)  VALUE  "CASH".
         05  CNS-SJTK              PIC  X(11)  VALUE  "unpaid cost".
         05  CNS-MEG-SJTK-J        PIC  X(08)  VALUE  "未払費用".
         05  CNS-UNPAIDCOST        PIC  X(10)  VALUE  "UNPAIDCOST".
         05  CNS-ACSU              PIC  X(04)  VALUE  "ACSU".
         05  CNS-CFEU              PIC  X(04)  VALUE  "CFEU".
         05  CNS-CSOU              PIC  X(04)  VALUE  "CSOU".
         05  CNS-CSTU              PIC  X(04)  VALUE  "CSTU".
         05  CNS-STXU              PIC  X(04)  VALUE  "STXU".
         05  CNS-TSTU              PIC  X(04)  VALUE  "TSTU".
         05  CNS-DATA-TEXT         PIC  X(14)
                                   VALUE  "進捗管理データ".
         05  CNS-RTN-112           PIC  X(03)  VALUE  "112".
         05  CNS-TR-UN             PIC  X(20)
                                   VALUE  "取引運用為替換算情報".
      *******         テーマ3422              修正  開始        ********
         05  CNS-KS-UN             PIC  X(20)
                                   VALUE  "取引決済為替換算情報".
      *******         テーマ3422              修正  終了        ********
         05  CNS-HYK-EX            PIC  X(16)
                                   VALUE  "評価為替取得方法".
         05  CNS-EX-KRTU           PIC  X(08)  VALUE  "為替系列".
         05  CNS-TASK-T7080US      PIC  X(07)  VALUE  "T7080US".
         05  CNS-KUNI-CD-RYAKU     PIC  X(13)  VALUE  "国コード_略式".
         05  CNS-MISYU-GAIKA-J     PIC  X(14)  VALUE  "未収金（外貨）".
         05  CNS-MISYU-GAIKA-E     PIC  X(14)  VALUE  "recievable(LC)".
         05  CNS-MISYU-UNYO-J      PIC  X(14)  VALUE  "未収金（運用）".
         05  CNS-MISYU-UNYO-E      PIC  X(14)  VALUE  "recievable(BC)".
         05  CNS-MIBARAI-GAIKA-J   PIC  X(14)  VALUE  "未払金（外貨）".
         05  CNS-MIBARAI-GAIKA-E   PIC  X(11)  VALUE  "payable(LC)".
         05  CNS-MIBARAI-UNYO-J    PIC  X(14)  VALUE  "未払金（運用）".
         05  CNS-MIBARAI-UNYO-E    PIC  X(11)  VALUE  "payable(BC)".
         05  CNS-YKJ               PIC  X(08)  VALUE  "基準日：".
         05  CNS-MEG-CD-AIFA       PIC  X(26)
                                   VALUE  "銘柄コードリファレンス情報".
         05  CNS-GAIBU-CD          PIC  X(14)  VALUE  "；外部コード：".
         05  CNS-MEG-CD            PIC  X(10)  VALUE  "銘柄コード".
         05  CNS-GX-ZANKO          PIC  X(22)
                                   VALUE  "ＧＸ残高（全ファイル）".
         05  CNS-TRHK-TUKA-CD      PIC  X(16)
                                   VALUE  "取引通貨コード：".
         05  CNS-KZYN-YMD          PIC  X(10)  VALUE  "；基準日：".
         05  CNS-PRI-J             PIC  X(04)  VALUE  "元本".
         05  CNS-PRI-E             PIC  X(09)  VALUE  "PRINCIPAL".
         05  CNS-18-10             PIC  S9(08)V9(10)
                                   VALUE  99999999.9999999999.
         05  CNS-18-10-2           PIC  S9(08)V9(10)
                                   VALUE  -99999999.9999999999.
         05  CNS-MEG-TEXT          PIC  X(12)  VALUE  "銘柄コード：".
         05  CNS-TUK-TEXT          PIC  X(12)  VALUE  "；銘柄通貨：".
         05  CNS-SEC-TEXT          PIC  X(12)  VALUE  "；証券種別：".
         05  CNS-SSE-TEXT          PIC  X(12)  VALUE  "；株式種別：".
      *----------  GX残高データ接続
         05  CNS-ST01100           PIC  X(07)  VALUE  "ST01100".
         05  CNS-MSG-E000355       PIC  X(07)  VALUE  "E000355".
         05  CNS-MSG-I000653       PIC  X(07)  VALUE  "I000653".
      *----------  テーマ3276　開始
         05  CNS-CMP-1054          PIC  X(04)  VALUE  "1054".
         05  CNS-MEG-RES1          PIC  X(04)  VALUE  "RES1".
         05  CNS-SEC-XMOS          PIC  X(04)  VALUE  "XMOS".
         05  CNS-SEC-S             PIC  X(01)  VALUE  "S".
      *----------  テーマ3276　終了
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *---------- デフォルトリファレンスコードフラグ
         05  FLG-DEFAULT-KRTU-CD   PIC  9(01).
      *----------  オラクル接続フラグ
         05  FLG-ORA-CONNECT       PIC  9(01).
      *----------  カーソルオープンフラグ
         05  FLG-CR-OPEN           PIC  9(01).
      *----------  カーソルオープンフラグ
         05  FLG-CR-OPEN2          PIC  9(01).
      *******         テーマ2693     20100404 修正  開始        ********
      *----------  カーソルオープンフラグ
         05  FLG-CR-OPEN3          PIC  9(01).
      *******         テーマ2693     20100404 修正  終了        ********
      *----------  STOP
         05  FLG-STOP              PIC  9(01).
      *----------  STOP
         05  FLG-STOP-2            PIC  9(01).
      *----------  FETCH-END
         05  FLG-FETCH-END2        PIC  9(01).
      *----------  システムエラーフラグ
         05  FLG-SYSTEM-ERR        PIC  9(01).
      *----------  後処理業務エラーフラグ
         05  FLG-GYOMU-ERR         PIC  9(01).
      *----------  明細業務エラーフラグ
         05  FLG-MEISAI-GYOMU-ERR  PIC  9(01).
      *----------  ファイルオープンフラグ
         05  FLG-FILE-OPEN         PIC  9(01).
      *----------  ファイルオープンフラグ
         05  FLG-FILE-OPEN-2       PIC  9(01).
      *----------  ファイルオープンフラグ
         05  FLG-FILE-OPEN-3       PIC  9(01).
      *----------  ファイルオープンフラグ
         05  FLG-FILE-OPEN-4       PIC  9(01).
      *----------  ファイルオープンフラグ
         05  FLG-FILE-OPEN-5       PIC  9(01).
      *----------  ファイルオープンフラグ
         05  FLG-FILE-OPEN-6       PIC  9(01).
      *----------  ファイルオープンフラグ
         05  FLG-FILE-OPEN-7       PIC  9(01).
      *----------  ファイルオープンフラグ
         05  FLG-FILE-OPEN-8       PIC  9(01).
      *----------  ワーク進捗フラグ
         05  FLG-UPD               PIC  9(01).
      *----------  DATA-OUT判断フラグ
         05  FLG-DATA-OUT          PIC  9(01).
      *----------  次のワークポートフォリオ明細ド
         05  FLG-NEXT-MEISAI       PIC  9(01).
      ******************************************************************
      *                SQL  エリア
      ******************************************************************
       01  SQL-AREA.
         05  SQL-SELECT.
      *----------  SELECT
           10  FILLER              PIC  X(07)
               VALUE  "SELECT ".
      *----------  利用会社コード
           10  FILLER              PIC  X(13)
               VALUE  " RIYO_CMP_CD,".
      *----------  ファンドコード
           10  FILLER              PIC  X(09)
               VALUE  " FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(08)
               VALUE  " PTF_CD,".
      *----------  約定受渡区分
           10  FILLER              PIC  X(11)
               VALUE  " YJ_UW_KBN,".
      *----------  残高日付
           10  FILLER              PIC  X(11)
               VALUE  " ZANTK_YMD,".
      *----------  決算日断面区分
           10  FILLER              PIC  X(17)
               VALUE  " KSN_YMD_DMN_KBN,".
      *----------  評価系列コード
           10  FILLER              PIC  X(13)
               VALUE  " HYK_KRTU_CD,".
      *----------  証券種別コード
           10  FILLER              PIC  X(11)
               VALUE  "SEC_SBT_CD,".
      *----------  取消フラグ
           10  FILLER              PIC  X(09)
               VALUE  " DEL_KBN,".
      *----------  確定フラグ
           10  FILLER              PIC  X(08)
               VALUE  " KT_KBN,".
      *----------  取引通貨
           10  FILLER              PIC  X(11)
               VALUE  " TRHK_TUKA,".
      *----------  為替取引決済通貨
           10  FILLER              PIC  X(16)
               VALUE  " KWS_TH_TUKA_CD,".
      *----------  発行国コード
           10  FILLER              PIC  X(09)
               VALUE  " HAKO_CD,".
      *----------  銘柄コード
           10  FILLER              PIC  X(08)
               VALUE  " MEG_CD,".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(10)
               VALUE  " TATE_FLG,".
      *----------  個別建玉約定日
           10  FILLER              PIC  X(12)
               VALUE  " TG_YKJ_YMD,".
      *----------  個別玉管理番号
           10  FILLER              PIC  X(13)
               VALUE  " KB_KANRI_ID,".
      *----------  カストディコード
           10  FILLER              PIC  X(09)
               VALUE  " CAST_CD,".
      *----------  保有数量
           10  FILLER              PIC  X(11)
               VALUE  " HOU_SURYO,".
      *----------  数量単位
           10  FILLER              PIC  X(12)
               VALUE  " SURYO_TANI,".
      *----------  取得金額(取引通貨)
           10  FILLER              PIC  X(13)
               VALUE  " THTK_ST_KNG,".
      *----------  取得単価(取引通貨)
           10  FILLER              PIC  X(13)
               VALUE  " THTK_ST_TNK,".
      *----------  時価(取引通貨)
           10  FILLER              PIC  X(12)
               VALUE  " CP_KRTU_CD,".
      *----------  時価採用日付
           10  FILLER              PIC  X(14)
               VALUE  " CP_SAIYO_YMD,".
      *----------  時価採用市場
           10  FILLER              PIC  X(15)
               VALUE  " CP_SAIYO_SIJO,".
      *----------  評価金額(取引通貨)
           10  FILLER              PIC  X(13)
               VALUE  " THTK_HYK_KN,".
      *----------  評価損益(取引通貨)
           10  FILLER              PIC  X(16)
               VALUE  " THTK_HYK_SNEKI,".
      *----------  前払金残(取引通貨)
           10  FILLER              PIC  X(13)
               VALUE  " THTK_PPAYZN,".
      *----------  経過利息金額(取引通貨)
           10  FILLER              PIC  X(14)
               VALUE  " THTK_KEKA_RS,".
      *----------  未収収益(取引通貨)
           10  FILLER              PIC  X(13)
               VALUE  " THTK_MS_EKI,".
      *----------  評価為替レート
           10  FILLER              PIC  X(09)
               VALUE  " HYK_KWS,".
      *----------  為替採用日付
           10  FILLER              PIC  X(15)
               VALUE  " KWS_SAIYO_YMD,".
      *----------  為替採用ソース
           10  FILLER              PIC  X(18)
               VALUE  " KWS_SAIYO_SOURCE,".
      *----------  取得金額(運用通貨為替換算額)
           10  FILLER              PIC  X(17)
               VALUE  " UYTK_KWS_BOKAZN,".
      *----------  取得金額(運用通貨)
           10  FILLER              PIC  X(12)
               VALUE  " SHTK_KN_LC,".
      *----------  取得単価(運用通貨)
           10  FILLER              PIC  X(13)
               VALUE  " UYTK_ST_TNK,".
      *----------  評価金額(運用通貨)
           10  FILLER              PIC  X(11)
               VALUE  " HYK_KN_LC,".
      *----------  評価損益(運用通貨)
           10  FILLER              PIC  X(14)
               VALUE  " HYK_SNEKI_LC,".
      *----------  前払金残(運用通貨)
           10  FILLER              PIC  X(14)
               VALUE  " UYTK_PPAY_ZN,".
      *----------  経過利息金額(運用通貨)
           10  FILLER              PIC  X(14)
               VALUE  " UYTK_KEKA_RS,".
      *----------  未収収益(運用通貨)
           10  FILLER              PIC  X(13)
               VALUE  " UYTK_MS_EKI,".
      *----------  備考１
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU1,".
      *----------  備考２
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU2,".
      *----------  備考３
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU3,".
      *----------  備考４
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU4,".
      *----------  備考５
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU5,".
      *----------  備考６
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU6,".
      *----------  備考７
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU7,".
      *----------  備考８
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU8,".
      *----------  備考９
           10  FILLER              PIC  X(08)
               VALUE  " BIKOU9,".
      *----------  投資対象国
           10  FILLER              PIC  X(16)
               VALUE  " TS_TARGET_KUNI,".
      *----------  未払費用残(取引通貨)
           10  FILLER              PIC  X(14)
               VALUE  " SJTK_MBHY_ZN,".
      *----------  未払費用残(運用通貨)
           10  FILLER              PIC  X(14)
               VALUE  " UYTK_MBHY_ZN,".
      *----------  建玉為替レート
           10  FILLER              PIC  X(17)
               VALUE  " TGYOKU_KWS_RATE,".
      *----------  建玉約定金額残(取引通貨)
           10  FILLER              PIC  X(17)
               VALUE  " THTK_TG_YJKN_ZN,".
      *----------  建玉約定金額残(運用通貨)
           10  FILLER              PIC  X(17)
               VALUE  " UYTK_TG_YJKN_ZN,".
      *----------  建玉手数料残(取引通貨)
           10  FILLER              PIC  X(16)
               VALUE  " THTK_TG_TSR_ZN,".
      *----------  建玉手数料残(運用通貨)
           10  FILLER              PIC  X(16)
               VALUE  " UYTK_TG_TSR_ZN,".
      *----------  建玉消費税残(取引通貨)
           10  FILLER              PIC  X(18)
               VALUE  " THTK_TG_S_TAX_ZN,".
      *----------  建玉消費税残(運用通貨)
           10  FILLER              PIC  X(18)
               VALUE  " UYTK_TG_S_TAX_ZN,".
      *----------  建玉その他費用残(取引通貨)
           10  FILLER              PIC  X(21)
               VALUE  " THTK_TG_ELS_HIYO_ZN,".
      *----------  建玉その他費用残(運用通貨)
           10  FILLER              PIC  X(21)
               VALUE  " UYTK_TG_ELS_HIYO_ZN,".
      *----------  建玉精算金額残(取引通貨)
           10  FILLER              PIC  X(17)
               VALUE  " THTK_TG_SSKG_ZN,".
      *----------  建玉精算金額残(運用通貨)
           10  FILLER              PIC  X(17)
               VALUE  " UYTK_TG_SSKG_ZN,".
      *----------  前受金残(取引通貨)
           10  FILLER              PIC  X(14)
               VALUE  " THTK_AREC_ZN,".
      *----------  前受金残(運用通貨)
           10  FILLER              PIC  X(14)
               VALUE  " UYTK_AREC_ZN,".
      *----------  仮払金残(取引通貨)
           10  FILLER              PIC  X(14)
               VALUE  " THTK_SPAY_ZN,".
      *----------  仮払金残(運用通貨)
           10  FILLER              PIC  X(14)
               VALUE  " UYTK_SPAY_ZN,".
      *----------  源泉税(取引通貨)
           10  FILLER              PIC  X(10)
               VALUE  " THTK_GSZ,".
      *----------  源泉税(運用通貨)
           10  FILLER              PIC  X(15)
               VALUE  " GENSEN_TAX_LC,".
      *----------  源泉税還付予定額残高(取引通貨)
           10  FILLER              PIC  X(18)
               VALUE  " THTK_GSZKP_YT_ZN,".
      *----------  源泉税還付予定額残高(運用通貨)
           10  FILLER              PIC  X(18)
               VALUE  " UYTK_GSZKP_YT_ZN,".
      *----------  簿価為替レート
           10  FILLER              PIC  X(10)
               VALUE  " BOKA_KWS,".
      *----------  移管評価損益残(取引通貨)
           10  FILLER              PIC  X(20)
               VALUE  " THTK_IKAN_HYK_SEZN,".
      *----------  移管評価損益残(運用通貨)
           10  FILLER              PIC  X(20)
               VALUE  " UYTK_IKAN_HYK_SEZN,".
      *----------  移管未収収益(取引通貨)
           10  FILLER              PIC  X(19)
               VALUE  " SJTK_IKAN_MSSHEKI,".
      *----------  移管未収収益(運用通貨)
           10  FILLER              PIC  X(19)
               VALUE  " UYTK_IKAN_MSSHEKI,".
      *----------  移管前払金評価損益残(運用通貨)
           10  FILLER              PIC  X(18)
               VALUE  " UYTK_IKAN_PPHKZN,".
      *----------  ＯＰ資産負債・買建売建フラグ
           10  FILLER              PIC  X(13)
               VALUE  " OP_TATE_FLG,".
      *----------  時価系列コード
           10  FILLER              PIC  X(14)
               VALUE  " JIKA_KRTU_CD,".
      *----------  取得時遡及有無
           10  FILLER              PIC  X(14)
               VALUE  " SKYU_UMU_FLG,".
      *----------  時価種類
           10  FILLER              PIC  X(11)
               VALUE  " JIKA_SHRU,".
      *----------  ソース区分
           10  FILLER              PIC  X(12)
               VALUE  " SOURCE_KBN,".
      *----------  前払金評価額(運用通貨)
           10  FILLER              PIC  X(19)
               VALUE  " UYTK_KPPAY_HYK_GK,".
      *----------  前払金評価損益(運用通貨)
           10  FILLER              PIC  X(17)
               VALUE  " UYTK_PPAY_SNEKI,".
      *----------  未収収益評価為替レート
           10  FILLER              PIC  X(18)
               VALUE  " MS_SHEKI_HYK_KWS,".
      *----------  源泉税評価為替レート
           10  FILLER              PIC  X(18)
               VALUE  " GENS_TAX_HYK_KWS,".
      *----------  データ区分
           10  FILLER              PIC  X(10)
               VALUE  " DATA_KBN,".
      *----------  商品区分
           10  FILLER              PIC  X(12)
               VALUE  " SYOHIN_KBN,".
      *----------  帳票出力区分
           10  FILLER              PIC  X(09)
               VALUE  " REP_KBN,".
      *----------  項目コード１
           10  FILLER              PIC  X(08)
               VALUE  " KODE_1,".
      *----------  数値１１
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_11,".
      *----------  数値１２
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_12,".
      *----------  数値１３
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_13,".
      *----------  項目コード２
           10  FILLER              PIC  X(08)
               VALUE  " KODE_2,".
      *----------  数値２１
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_21,".
      *----------  数値２２
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_22,".
      *----------  数値２３
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_23,".
      *----------  項目コード３
           10  FILLER              PIC  X(08)
               VALUE  " KODE_3,".
      *----------  数値３１
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_31,".
      *----------  数値３２
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_32,".
      *----------  数値３３
           10  FILLER              PIC  X(09)
               VALUE  " SUJI_33,".
      *----------  予備１
           10  FILLER              PIC  X(07)
               VALUE  " YOBI1,".
      *----------  予備２
           10  FILLER              PIC  X(07)
               VALUE  " YOBI2,".
      *----------  作成フラグ
           10  FILLER              PIC  X(08)
               VALUE  " SK_FLG,".
      *----------  作成画面ＩＤ
           10  FILLER              PIC  X(10)
               VALUE  " SK_GAMEN,".
      *----------  作成ファイル名
           10  FILLER              PIC  X(09)
               VALUE  " SK_FILE,".
      *----------  作成日時
           10  FILLER              PIC  X(09)
               VALUE  " SK_DATE,".
      *----------  作成ログインユーザ会社コード
           10  FILLER              PIC  X(17)
               VALUE  " SK_LOGIN_CMP_CD,".
      *----------  作成ユーザＩＤ
           10  FILLER              PIC  X(08)
               VALUE  " SK_SID,".
      *----------  作成プログラムＩＤ
           10  FILLER              PIC  X(10)
               VALUE  " SK_PGMID,".
      *----------  更新フラグ
           10  FILLER              PIC  X(09)
               VALUE  " UPD_FLG,".
      *----------  更新画面ＩＤ
           10  FILLER              PIC  X(11)
               VALUE  " UPD_GAMEN,".
      *----------  更新ファイル名
           10  FILLER              PIC  X(10)
               VALUE  " UPD_FILE,".
      *----------  更新日時
           10  FILLER              PIC  X(10)
               VALUE  " UPD_DATE,".
      *----------  更新ログインユーザ会社コード
           10  FILLER              PIC  X(18)
               VALUE  " UPD_LOGIN_CMP_CD,".
      *----------  更新ユーザＩＤ
           10  FILLER              PIC  X(09)
               VALUE  " UPD_SID,".
      *----------  更新プログラムＩＤ
           10  FILLER              PIC  X(10)
               VALUE  " UPD_PGMID".
      *----------  FROM テーブルTKUSZT01
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKUSZT01    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(17)
               VALUE  "RIYO_CMP_CD = :V1".
      *----------  ファンドコード
           10  FILLER              PIC  X(18)
               VALUE  " AND FUND_CD = :V2".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(17)
               VALUE  " AND PTF_CD = :V3".
      *----------  期間FROM
           10  FILLER              PIC  X(21)
               VALUE  " AND ZANTK_YMD >= :V4".
      *----------  期間TO
           10  FILLER              PIC  X(21)
               VALUE  " AND ZANTK_YMD <= :V5".
      *----------  決算日断面区分
           10  FILLER              PIC  X(06)  VALUE  " AND (".
      *----------  決算日断面区分(1)
           10  FILLER              PIC  X(26)
               VALUE  " KSN_YMD_DMN_KBN = '1' OR ".
      *----------  決算日断面区分(2)
           10  FILLER              PIC  X(24)
               VALUE  " KSN_YMD_DMN_KBN =  '0' ".
           10  FILLER              PIC  X(03)  VALUE  " ) ".
      *----------  評価系列コード
           10  FILLER              PIC  X(22)
               VALUE  " AND HYK_KRTU_CD = :V6".
      *----------  残高日付
           10  FILLER              PIC  X(20)
               VALUE  " AND ZANTK_YMD = :V7".
      *----------  ORDER BY
           10  FILLER              PIC  X(19)
               VALUE  " ORDER BY ZANTK_YMD".
           10  FILLER              PIC  X(10)
               VALUE  ",TRHK_TUKA".
           10  FILLER              PIC  X(11)
               VALUE  ",SEC_SBT_CD".
           10  FILLER              PIC  X(07)
               VALUE  ",MEG_CD".
           10  FILLER              PIC  X(09)
               VALUE  ",TATE_FLG".
           10  FILLER              PIC  X(12)
               VALUE  ",KB_KANRI_ID".
           10  FILLER              PIC  X(08)
               VALUE  ",CAST_CD".
         05  SQL-SELECT-2.
      *----------  SELECT
           10  FILLER              PIC  X(07)
               VALUE  "SELECT ".
      *----------  残高日付
           10  FILLER              PIC  X(18)
               VALUE  "DISTINCT ZANTK_YMD".
      *----------  FROM テーブルTKUSZT01
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKUSZT01    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(17)
               VALUE  "RIYO_CMP_CD = :V1".
      *----------  ファンドコード
           10  FILLER              PIC  X(18)
               VALUE  " AND FUND_CD = :V2".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(17)
               VALUE  " AND PTF_CD = :V3".
      *----------  期間FROM
           10  FILLER              PIC  X(21)
               VALUE  " AND ZANTK_YMD >= :V4".
      *----------  期間TO
           10  FILLER              PIC  X(21)
               VALUE  " AND ZANTK_YMD <= :V5".
      *----------  決算日断面区分
           10  FILLER              PIC  X(06)  VALUE  " AND (".
      *----------  決算日断面区分(1)
           10  FILLER              PIC  X(26)
               VALUE  " KSN_YMD_DMN_KBN = '1' OR ".
      *----------  決算日断面区分(2)
           10  FILLER              PIC  X(24)
               VALUE  " KSN_YMD_DMN_KBN =  '0' ".
           10  FILLER              PIC  X(03)  VALUE  " ) ".
      *----------  評価系列コード
           10  FILLER              PIC  X(22)
               VALUE  " AND HYK_KRTU_CD = :V6".
      *----------  ORDER BY
           10  FILLER              PIC  X(19)
               VALUE  " ORDER BY ZANTK_YMD".
         05  SQL-SELECT-TKDYAA40.
      *----------  NVL(MAX(基準日), 0)
           10  FILLER              PIC  X(39)
               VALUE  " BEGIN SELECT NVL(MAX(SS_SYORI_YMD), 0)".
           10  FILLER              PIC  X(09)
               VALUE  " INTO :V1".
      *----------  FROM テーブルTKDYAA40
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKDYAA40    PIC  X(13).
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(17)
               VALUE  "RIYO_CMP_CD = :V2".
      *----------  ファンドコード
           10  FILLER              PIC  X(18)
               VALUE  " AND FUND_CD = :V3".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(17)
               VALUE  " AND PTF_CD = :V4".
      *----------  評価系列コード
           10  FILLER              PIC  X(22)
               VALUE  " AND HYK_KRTU_CD = :V5".
      *----------  進捗タスクID
           10  FILLER              PIC  X(25)
               VALUE  " AND SHINTK_TASK_ID = :V6".
      *----------  進捗ステータス
           10  FILLER              PIC  X(27)
               VALUE  " AND SHINTK_STS = :V7;END; ".
      *******         テーマ2693     20100404 修正  開始        ********
      *----------  デフォルト評価系列で確定済みチェック
         05  SQL-SELECT-3.
      *----------  SELECT
           10  FILLER              PIC  X(21)
               VALUE  " SELECT B.TEKIYO_FROM".
      *----------  FROM テーブルTKUSZT01
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKDYAA40    PIC  X(13).
           10  FILLER              PIC  X(04)
               VALUE  " A, ".
           10  SQL-TBL-TKPFZK04    PIC  X(13).
           10  FILLER              PIC  X(03)
               VALUE  " B ".
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(20)
               VALUE  " A.RIYO_CMP_CD = :V1".
      *----------  利用会社コード
           10  FILLER              PIC  X(24)
               VALUE  " AND B.RIYO_CMP_CD = :V2".
      *----------  ファンドコード
           10  FILLER              PIC  X(20)
               VALUE  " AND B.FUND_CD = :V3".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(19)
               VALUE  " AND B.PTF_CD = :V4".
      *----------  ファンドコード
           10  FILLER              PIC  X(26)
               VALUE  " AND A.FUND_CD = B.FUND_CD".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(24)
               VALUE  " AND A.PTF_CD = B.PTF_CD".
      *----------  評価系列コード
           10  FILLER              PIC  X(34)
               VALUE  " AND A.HYK_KRTU_CD = B.HYK_KRTU_CD".
      *----------  進捗タスクID
           10  FILLER              PIC  X(27)
               VALUE  " AND A.SHINTK_TASK_ID = :V6".
      *----------  進捗ステータス
           10  FILLER              PIC  X(25)
               VALUE  " AND A.SHINTK_STS = '000'".
      *----------  デフォルト評価系列区分
           10  FILLER              PIC  X(28)
               VALUE  " AND B.DEFAULT_HYK_FLG = '1'".
      *----------  最終処理年月日
           10  FILLER              PIC  X(36)
               VALUE  " AND A.SS_SYORI_YMD >= B.TEKIYO_FROM".
      *----------  最終処理年月日
           10  FILLER              PIC  X(26)
               VALUE  " AND A.SS_SYORI_YMD >= :V7".
      *----------  最終処理年月日
           10  FILLER              PIC  X(26)
               VALUE  " AND A.SS_SYORI_YMD <= :V8".
           10  FILLER              PIC  X(15)
               VALUE  " AND ROWNUM = 1".
      *******         テーマ2693     20100404 修正  終了        ********
      ******************************************************************
      *                SQL通信領域
      ******************************************************************
      *----------  SQLコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  ORACLE接続ユーザ領域
         05  H-ORA-USER            PIC  X(80).
         05  HST-TBL-TKDYAA40-SELECT.
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
         05  HST-SEL-TKDYAA40-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *----------  進捗タスクID
           10  H-SHINTK-TASK-ID    PIC  X(07).
      *----------  進捗ステータス
           10  H-SHINTK-STS        PIC  X(03).
         05  HST-TBL-SELECT.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  約定受渡区分
           10  H-YJ-UW-KBN         PIC  X(01).
      *----------  残高日付
           10  H-ZANTK-YMD         PIC  S9(08).
      *----------  決算日断面区分
           10  H-KSN-YMD-DMN-KBN   PIC  X(01).
      *----------  評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *----------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *----------  取消フラグ
           10  H-DEL-KBN           PIC  X(01).
      *----------  確定フラグ
           10  H-KT-KBN            PIC  X(01).
      *----------  取引通貨
           10  H-TRHK-TUKA         PIC  X(04).
      *----------  為替取引決済通貨
           10  H-KWS-TH-TUKA-CD    PIC  X(04).
      *----------  発行国コード
           10  H-HAKO-CD           PIC  X(04).
      *----------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *----------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *----------  個別建玉約定日
           10  H-TG-YKJ-YMD        PIC  S9(08).
      *----------  個別玉管理番号
           10  H-KB-KANRI-ID       PIC  X(10).
      *----------  カストディコード
           10  H-CAST-CD           PIC  X(04).
      *----------  保有数量
           10  H-HOU-SURYO         PIC  S9(12)V9(06).
      *----------  数量単位
           10  H-SURYO-TANI        PIC  S9(12)V9(06).
      *----------  取得金額(取引通貨)
           10  H-THTK-ST-KNG       PIC  S9(15)V9(03).
      *----------  取得単価(取引通貨)
           10  H-THTK-ST-TNK       PIC  S9(08)V9(10).
      *----------  時価(取引通貨)
           10  H-CP-KRTU-CD        PIC  S9(08)V9(10).
      *----------  時価採用日付
           10  H-CP-SAIYO-YMD      PIC  S9(08).
      *----------  時価採用市場
           10  H-CP-SAIYO-SIJO     PIC  X(04).
      *----------  評価金額(取引通貨)
           10  H-THTK-HYK-KN       PIC  S9(15)V9(03).
      *----------  評価損益(取引通貨)
           10  H-THTK-HYK-SNEKI    PIC  S9(15)V9(03).
      *----------  前払金残(取引通貨)
           10  H-THTK-PPAYZN       PIC  S9(15)V9(03).
      *----------  経過利息金額(取引通貨)
           10  H-THTK-KKRS         PIC  S9(12)V9(06).
      *----------  未収収益(取引通貨)
           10  H-THTK-MS-EKI       PIC  S9(15)V9(03).
      *----------  評価為替レート
           10  H-HYK-KWS           PIC  S9(08)V9(10).
      *----------  為替採用日付
           10  H-KWS-SAIYO-YMD     PIC  S9(08).
      *----------  為替採用ソース
           10  H-KWS-SAIYO-SOURCE  PIC  X(04).
      *----------  取得金額(運用通貨為替換算額)
           10  H-UYTK-KWS-BOKAZN   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨)
           10  H-SHTK-KN-LC        PIC  S9(15)V9(03).
      *----------  取得単価(運用通貨)
           10  H-UYTK-ST-TNK       PIC  S9(08)V9(10).
      *----------  評価金額(運用通貨)
           10  H-HYK-KN-LC         PIC  S9(15)V9(03).
      *----------  評価損益(運用通貨)
           10  H-HYK-SNEKI-LC      PIC  S9(15)V9(03).
      *----------  前払金残(運用通貨)
           10  H-UYTK-PPAY-ZN      PIC  S9(15)V9(03).
      *----------  経過利息(運用通貨)
           10  H-KEKA-RSK-LC       PIC  S9(12)V9(06).
      *----------  未収収益(運用通貨)
           10  H-UYTK-MS-EKI       PIC  S9(15)V9(03).
      *----------  備考１
           10  H-BIKOU-1           PIC  X(20).
      *----------  備考２
           10  H-BIKOU-2           PIC  X(20).
      *----------  備考３
           10  H-BIKOU-3           PIC  X(12).
      *----------  備考４
           10  H-BIKOU-4           PIC  X(12).
      *----------  備考５
           10  H-BIKOU-5           PIC  S9(12)V9(06).
      *----------  備考６
           10  H-BIKOU-6           PIC  S9(12)V9(06).
      *----------  備考７
           10  H-BIKOU-7           PIC  S9(12)V9(06).
      *----------  備考８
           10  H-BIKOU-8           PIC  S9(08)V9(10).
      *----------  備考９
           10  H-BIKOU-9           PIC  S9(12)V9(06).
      *----------  投資対象国
           10  H-TS-TARGET-KUNI    PIC  X(04).
      *----------  未払費用残(取引通貨)
           10  H-SJTK-MBHY-ZN      PIC  S9(15)V9(03).
      *----------  未払費用残(運用通貨)
           10  H-UYTK-MBHY-ZN      PIC  S9(15)V9(03).
      *----------  建玉為替レート
           10  H-TGYOKU-KWS-RATE   PIC  S9(08)V9(10).
      *----------  建玉約定金額残(取引通貨)
           10  H-THTK-TG-YJKN-ZN   PIC  S9(15)V9(03).
      *----------  建玉約定金額残(運用通貨)
           10  H-UYTK-TG-YJKN-ZN   PIC  S9(15)V9(03).
      *----------  建玉手数料残(取引通貨)
           10  H-THTK-TG-TSR-ZN    PIC  S9(15)V9(03).
      *----------  建玉手数料残(運用通貨)
           10  H-UYTK-TG-TSR-ZN    PIC  S9(15)V9(03).
      *----------  建玉消費税残(取引通貨)
           10  H-THTK-TG-S-TAX-ZN  PIC  S9(15)V9(03).
      *----------  建玉消費税残(運用通貨)
           10  H-UYTK-TG-S-TAX-ZN  PIC  S9(15)V9(03).
      *----------  建玉その他費用残(取引通貨)
           10  H-THTK-TG-ELS-HIYO-ZN
                                   PIC  S9(15)V9(03).
      *----------  建玉その他費用残(運用通貨)
           10  H-UYTK-TG-ELS-HIYO-ZN
                                   PIC  S9(15)V9(03).
      *----------  建玉精算金額残(取引通貨)
           10  H-THTK-TG-SSKG-ZN   PIC  S9(15)V9(03).
      *----------  建玉精算金額残(運用通貨)
           10  H-UYTK-TG-SSKG-ZN   PIC  S9(15)V9(03).
      *----------  前受金残(取引通貨)
           10  H-THTK-AREC-ZN      PIC  S9(15)V9(03).
      *----------  前受金残(運用通貨)
           10  H-UYTK-AREC-ZN      PIC  S9(15)V9(03).
      *----------  仮払金残(取引通貨)
           10  H-THTK-SPAY-ZN      PIC  S9(15)V9(03).
      *----------  仮払金残(運用通貨)
           10  H-UYTK-SPAY-ZN      PIC  S9(15)V9(03).
      *----------  源泉税(取引通貨)
           10  H-THTK-GSZ          PIC  S9(15)V9(03).
      *----------  源泉税(運用通貨)
           10  H-GENSEN-TAX-LC     PIC  S9(15)V9(03).
      *----------  源泉税還付予定額残高(取引通貨)
           10  H-THTK-GSZKP-YT-ZN  PIC  S9(15)V9(03).
      *----------  源泉税還付予定額残高(運用通貨)
           10  H-UYTK-GSZKP-YT-ZN  PIC  S9(15)V9(03).
      *----------  簿価為替レート
           10  H-BOKA-KWS          PIC  S9(08)V9(10).
      *----------  移管評価損益残(取引通貨)
           10  H-THTK-IKAN-HYK-SEZN
                                   PIC  S9(15)V9(03).
      *----------  移管評価損益残(運用通貨)
           10  H-UYTK-IKAN-HYK-SEZN
                                   PIC  S9(15)V9(03).
      *----------  移管未収収益(取引通貨)
           10  H-SJTK-IKAN-MSSHEKI
                                   PIC  S9(15)V9(03).
      *----------  移管未収収益(運用通貨)
           10  H-UYTK-IKAN-MSSHEKI
                                   PIC  S9(15)V9(03).
      *----------  移管前払金評価損益残(運用通貨)
           10  H-UYTK-IKAN-PPHKZN
                                   PIC  S9(15)V9(03).
      *----------  ＯＰ資産負債・買建売建フラグ
           10  H-OP-TATE-FLG       PIC  X(01).
      *----------  時価系列コード
           10  H-JIKA-KRTU-CD      PIC  X(04).
      *----------  取得時遡及有無
           10  H-SKYU-UMU-FLG      PIC  X(01).
      *----------  時価種類
           10  H-JIKA-SHRU         PIC  X(04).
      *----------  ソース区分
           10  H-SOURCE-KBN        PIC  X(02).
      *----------  前払金評価額(運用通貨)
           10  H-UYTK-KPPAY-HYK-GK PIC  S9(15)V9(03).
      *----------  前払金評価損益(運用通貨)
           10  H-UYTK-PPAY-SNEKI   PIC  S9(15)V9(03).
      *----------  未収収益評価為替レート
           10  H-MS-SHEKI-HYK-KWS  PIC  S9(08)V9(10).
      *----------  源泉税評価為替レート
           10  H-GENS-TAX-HYK-KWS  PIC  S9(08)V9(10).
      *----------  データ区分
           10  H-DATA-KBN          PIC  X(01).
      *----------  商品区分
           10  H-SYOHIN-KBN        PIC  X(02).
      *----------  帳票出力区分
           10  H-REP-KBN           PIC  X(01).
      *----------  項目コード１
           10  H-KODE-1            PIC  X(20).
      *----------  数値１１
      *------------------ <残タスク129の対応 START>---------------------
           10  H-SUJI-11           PIC  S9(15)V9(03).
      *------------------ <残タスク129の対応 END>-----------------------
      *----------  数値１２
           10  H-SUJI-12           PIC  S9(15)V9(03).
      *----------  数値１３
           10  H-SUJI-13           PIC  S9(15)V9(03).
      *----------  項目コード２
           10  H-KODE-2            PIC  X(20).
      *----------  数値２１
           10  H-SUJI-21           PIC  S9(15)V9(03).
      *----------  数値２２
           10  H-SUJI-22           PIC  S9(15)V9(03).
      *----------  数値２３
           10  H-SUJI-23           PIC  S9(15)V9(03).
      *----------  項目コード３
           10  H-KODE-3            PIC  X(20).
      *----------  数値３１
           10  H-SUJI-31           PIC  S9(15)V9(03).
      *----------  数値３２
           10  H-SUJI-32           PIC  S9(15)V9(03).
      *----------  数値３３
           10  H-SUJI-33           PIC  S9(15)V9(03).
      *----------  予備１
           10  H-YOBI1             PIC  X(20).
      *----------  予備２
           10  H-YOBI2             PIC  X(20).
      *----------  作成フラグ
           10  H-SK-FLG            PIC  X(01).
      *----------  作成画面ＩＤ
           10  H-SK-GAMEN          PIC  X(08).
      *----------  作成ファイル名
           10  H-SK-FILE           PIC  X(20).
      *----------  作成日時
           10  H-SK-DATE           PIC  X(14).
      *----------  作成ログインユーザ会社コード
           10  H-SK-LOGIN-CMP-CD   PIC  X(04).
      *----------  作成ユーザＩＤ
           10  H-SK-SID            PIC  X(20).
      *----------  作成プログラムＩＤ
           10  H-SK-PGMID          PIC  X(16).
      *----------  更新フラグ
           10  H-UPD-FLG           PIC  X(01).
      *----------  更新画面ＩＤ
           10  H-UPD-GAMEN         PIC  X(08).
      *----------  更新ファイル名
           10  H-UPD-FILE          PIC  X(20).
      *----------  更新日時
           10  H-UPD-DATE          PIC  X(14).
      *----------  更新ログインユーザ会社コード
           10  H-UPD-LOGIN-CMP-CD  PIC  X(04).
      *----------  更新ユーザＩＤ
           10  H-UPD-SID           PIC  X(20).
      *----------  更新プログラムＩＤ
           10  H-UPD-PGMID         PIC  X(16).
         05  HST-SELECT-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  期間FROM
           10  H-KIKAN-FR          PIC  S9(08).
      *----------  期間TO
           10  H-KIKAN-TO          PIC  S9(08).
      *----------  評価系列コード
           10  H-HYK-KRTU-CD       PIC  X(04).
      *----------  残高日付
           10  H-ZANTK-YMD         PIC  S9(08).
      *******         テーマ2693     20100404 修正  開始        ********
         05  HST-SELECT-3-WHERE.
      *----------  利用会社コード1
           10  H-RIYO-CMP-CD-1     PIC  X(04).
      *----------  利用会社コード2
           10  H-RIYO-CMP-CD-2     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  進捗タスクID
           10  H-SHINTK-TASK-ID    PIC  X(07).
      *----------  期間FROM
           10  H-KIKAN-FR          PIC  S9(08).
      *----------  期間TO
           10  H-KIKAN-TO          PIC  S9(08).
      *******         テーマ2693     20100404 修正  終了        ********
         05  HST-TBL-SELECT-2.
      *----------  残高日付
           10  H-ZANTK-YMD         PIC  S9(08).
      *******         テーマ2693     20100404 修正  開始        ********
         05  HST-TBL-SELECT-3.
      *----------  適用FROM
           10  H-TEKIYO-FR         PIC  S9(08).
      *******         テーマ2693     20100404 修正  終了        ********
      *----------  SQLSTMT-S
         05  SQLSTMT-S             PIC  X(3000).
      *----------  SQLSTMT-S2
         05  SQLSTMT-S2            PIC  X(3000).
      *******         テーマ2693     20100404 修正  開始        ********
      *----------  SQLSTMT-S3
         05  SQLSTMT-S3            PIC  X(3000).
      *******         テーマ2693     20100404 修正  終了        ********
      *----------  SQLSTMT-S-TKDYAA40
         05  SQLSTMT-S-TKDYAA40    PIC  X(3000).
           EXEC  SQL  END     DECLARE   SECTION  END-EXEC.
      ******************************************************************
      *                ワーク  エリア
      ******************************************************************
       01  WK-DENBUN-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      *----------  AIFA情報
         05  WK-AIFA.
             COPY  "WOMCMAIFA.CPY".
      *----------  共通ヘッダ
         05  WK-HEADER.
             COPY  "CZCOMMONHEADER.cpy".
      *----------  上り電文情報
         05  WK-DENBUN-INFO.
             COPY  "INMUSR2610_COBOL.cpy".
       01  WORK-AREA.
      *---------- 株式種別（リファレンス情報）
         05  WK-RF-KABU-SBT        PIC  X(02).
      *----------  ＧＸ債券キャッシュフロー
         05  WK-CASH-FLOW-KBN      PIC  X(01).
         05  WK-TEMP-MSG.
           10  WK-TEMP-MSG-TEXT    PIC  X(08).
           10  WK-TEMP-MSG-YKJ     PIC  X(08).
      *----------  運用通貨コード
         05  WK-CAPITAL-TUKA-CD    PIC  X(04).
         05  WK-TEMP-DATA.
      *----------  時価(取引通貨)
           10  WK-CP-KRTU-CD       PIC  S9(08)V9(10).
      *----------  評価為替レート
           10  WK-HYK-KWS          PIC  S9(08)V9(10).
      *----------  取得単価(取引通貨)
           10  WK-THTK-ST-TNK      PIC  S9(08)V9(10).
      *----------  保有数量
           10  WK-HOU-SURYO        PIC  S9(15)V9(06).
      *----------  数量単位
           10  WK-SURYO-TANI       PIC  S9(12)V9(06).
      *----------  取得金額(取引通貨)
           10  WK-THTK-ST-KNG      PIC  S9(15)V9(03).
      *----------  評価金額(取引通貨)
           10  WK-THTK-HYK-KN      PIC  S9(15)V9(03).
      *----------  評価金額(運用通貨)
           10  WK-HYK-KN-LC        PIC  S9(15)V9(03).
      *----------  備考１
           10  WK-BIKOU-1          PIC  X(20).
         05  WK-SUM-DATA.
      *----------  保有数量
           10  WK-HOU-SURYO-SUM    PIC  S9(15)V9(06).
      *----------  取得金額(取引通貨)
           10  WK-THTK-ST-KNG-SUM  PIC  S9(15)V9(03).
      *----------  評価金額(取引通貨)
           10  WK-THTK-HYK-KN-SUM  PIC  S9(15)V9(03).
      *----------  評価損益(取引通貨)
           10  WK-THTK-HYK-SNEKI-SUM
                                   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨為替換算額)
           10  WK-UYTK-KWS-BOKAZN-SUM
                                   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨)
           10  WK-SHTK-KN-LC-SUM   PIC  S9(15)V9(03).
      *----------  評価金額(運用通貨)
           10  WK-HYK-KN-LC-SUM    PIC  S9(15)V9(03).
      *----------  評価損益(運用通貨)
           10  WK-HYK-SNEKI-LC-SUM PIC  S9(15)V9(03).
      *----------  現金集計出力フラグ
           10  WK-GENKIN-OUT       PIC  X(01).
         05  WK-SUM-DATA-2.
           10  WK-SUM-DATA2        OCCURS  10.
      *----------  保有数量
             15  WK-HOU-SURYO-SUM-2
                                   PIC  S9(15)V9(06).
      *----------  取得金額(取引通貨)
             15  WK-THTK-ST-KNG-SUM-2
                                   PIC  S9(15)V9(03).
      *----------  評価金額(取引通貨)
             15  WK-THTK-HYK-KN-SUM-2
                                   PIC  S9(15)V9(03).
      *----------  評価損益(取引通貨)
             15  WK-THTK-HYK-SNEKI-SUM-2
                                   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨為替換算額)
             15  WK-UYTK-KWS-BOKAZN-SUM-2
                                   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨)
             15  WK-SHTK-KN-LC-SUM-2
                                   PIC  S9(15)V9(03).
      *----------  評価金額(運用通貨)
             15  WK-HYK-KN-LC-SUM-2
                                   PIC  S9(15)V9(03).
      *----------  評価損益(運用通貨)
             15  WK-HYK-SNEKI-LC-SUM-2
                                   PIC  S9(15)V9(03).
      *----------  銘柄コード
             15  WK-MEG-CD-2       PIC  X(20).
      *----------  証券発行元の所属する国
             15  WK-HAKO-CD-CD-2   PIC  X(02).
      *---------- 銘柄名称(日本語)
             15  WK-MEG-MEI-JP-2   PIC  X(80).
      *---------- 銘柄名称(英語)
             15  WK-MEG-MEI-EN-2   PIC  X(40).
      *----------  現金集計出力フラグ
             15  WK-GENKIN-OUT-2   PIC  X(01).
         05  WK-SUM-DATA-3.
           10  WK-SUM-DATA3        OCCURS  3.
      *----------  保有数量
             15  WK-HOU-SURYO-SUM-3
                                   PIC  S9(15)V9(06).
      *----------  取得金額(取引通貨)
             15  WK-THTK-ST-KNG-SUM-3
                                   PIC  S9(15)V9(03).
      *----------  評価金額(取引通貨)
             15  WK-THTK-HYK-KN-SUM-3
                                   PIC  S9(15)V9(03).
      *----------  評価損益(取引通貨)
             15  WK-THTK-HYK-SNEKI-SUM-3
                                   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨為替換算額)
             15  WK-UYTK-KWS-BOKAZN-SUM-3
                                   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨)
             15  WK-SHTK-KN-LC-SUM-3
                                   PIC  S9(15)V9(03).
      *----------  評価金額(運用通貨)
             15  WK-HYK-KN-LC-SUM-3
                                   PIC  S9(15)V9(03).
      *----------  評価損益(運用通貨)
             15  WK-HYK-SNEKI-LC-SUM-3
                                   PIC  S9(15)V9(03).
      *----------  銘柄コード
             15  WK-MEG-CD-3       PIC  X(20).
      *----------  証券発行元の所属する国
             15  WK-HAKO-CD-3      PIC  X(02).
      *---------- 銘柄名称(日本語)
             15  WK-MEG-MEI-JP-3   PIC  X(80).
      *---------- 銘柄名称(英語)
             15  WK-MEG-MEI-EN-3   PIC  X(40).
      *----------  現金集計出力フラグ
             15  WK-GENKIN-OUT-3   PIC  X(01).
         05  WK-SUM-DATA-4.
           10  WK-SUM-DATA4        OCCURS  2.
      *----------  保有数量
             15  WK-HOU-SURYO-SUM-4
                                   PIC  S9(15)V9(06).
      *----------  取得金額(取引通貨)
             15  WK-THTK-ST-KNG-SUM-4
                                   PIC  S9(15)V9(03).
      *----------  評価金額(取引通貨)
             15  WK-THTK-HYK-KN-SUM-4
                                   PIC  S9(15)V9(03).
      *----------  評価損益(取引通貨)
             15  WK-THTK-HYK-SNEKI-SUM-4
                                   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨為替換算額)
             15  WK-UYTK-KWS-BOKAZN-SUM-4
                                   PIC  S9(15)V9(03).
      *----------  取得金額(運用通貨)
             15  WK-SHTK-KN-LC-SUM-4
                                   PIC  S9(15)V9(03).
      *----------  評価金額(運用通貨)
             15  WK-HYK-KN-LC-SUM-4
                                   PIC  S9(15)V9(03).
      *----------  評価損益(運用通貨)
             15  WK-HYK-SNEKI-LC-SUM-4
                                   PIC  S9(15)V9(03).
      *----------  銘柄コード
             15  WK-MEG-CD-4       PIC  X(20).
      *----------  証券種別
             15  WK-SEC-SBT-CD-4   PIC  X(04).
      *----------  証券発行元の所属する国
             15  WK-HAKO-CD-4      PIC  X(02).
      *---------- 銘柄名称(日本語)
             15  WK-MEG-MEI-JP-4   PIC  X(80).
      *---------- 銘柄名称(英語)
             15  WK-MEG-MEI-EN-4   PIC  X(40).
      *----------  現金集計出力フラグ
             15  WK-GENKIN-OUT-4   PIC  X(01).
      *----------  為替乗算/除算区分（評価為替レート用）
         05  WK-KWS-ZYOUHO-JZS     PIC  X(01).
      *----------  為替乗算/除算区分（時価（取引通貨）用）
         05  WK-KWS-ZYOUHO-JZS-2   PIC  X(01).
      *----------  約定主義会計フラグ
         05  WK-YKJ-SYUGI-KAIKEI   PIC  X(01).
      *----------  仕訳基準パターンコード
         05  WK-SWK-KJN-PTN-CD     PIC  X(08).
         05  WK-UPD-TIME           PIC  X(06).
         05  WK-UPD-TIME-9
                                   REDEFINES  WK-UPD-TIME
                                   PIC  9(06).
      *---------- ヘッダー
         05  WK-HEADER-TITLE.
           10  FILLER              PIC  X(06)  VALUE  "IAFPOH".
           10  FILLER              PIC  X(01)  VALUE  X'09'.
           10  WK-KJN-YMD          PIC  9(08).
           10  FILLER              PIC  9(02)  VALUE  0.
           10  FILLER              PIC  X(01)  VALUE  X'09'.
           10  WK-Y-U-FLG          PIC  X(01).
      *---------- ヘッダー
         05  WK-FOOT.
           10  FILLER              PIC  X(06)  VALUE  "IAFPOF".
           10  FILLER              PIC  X(01)  VALUE  X'09'.
           10  WK-FILE-KENSUU      PIC  X(18).
      *---------- 銘柄名称(日本語)
         05  WK-MEG-MEI-JP         PIC  X(60).
      *---------- 銘柄名称(英語)
         05  WK-MEG-MEI-EN         PIC  X(60).
      *---------- 債券ｸｰﾎﾟﾝ
         05  WK-SAKEN-KP-KBN       PIC  S9(12)V9(06).
      *---------- 債券償還日
         05  WK-SAKEN-SK-YMD       PIC  9(08).
      *---------- 資産分類コード
         05  WK-SISAN-BUNRUI-CD    PIC  X(04).
      *---------- コールプット区分
         05  WK-CALL-PUT-KBN       PIC  X(01).
      *------------------ <連結障害841の対応 START>---------------------
      *----------  証券種別_外部コード
         05  WK-SEC-SBT-CD-2       PIC  X(04).
         05  WK-SEC-SBT-CD-3       PIC  X(04).
         05  WK-GAIBU-CD           PIC  X(04).
      *------------------ <連結障害841の対応 END>-----------------------
      *----------  ｶｽﾄﾃﾞｨｺｰﾄ
         05  WK-CAST-CD-2          PIC  X(11).
      *---------- 外部銘柄コード
         05  WK-GAIBU-MEG-CD       PIC  X(20).
         05  WK-GAIBU-MEG-CD1      PIC  X(20).
      *---------- コードリファレンス系列コード
         05  WK-CD-REF-KRTU-CD     PIC  X(04).
      *---------- デフォルトコードリファレンス系列コード
         05  WK-DEFAULT-KRTU-CD    PIC  X(04).
      *---------- 証券種別コード
         05  WK-SEC-SBT-CD         PIC  X(04).
      *---------- 発行体国コード
         05  WK-HAKO-CD            PIC  X(04).
      *---------- 投資対象国コード
         05  WK-TS-TARGET-KUNI     PIC  X(04).
      *---------- 自社コードフラグ
         05  WK-JS-CD-FLG          PIC  X(01).
      *----------  国コード略式
         05  WK-HAKO-CD-2          PIC  X(02).
      *------------------ <残タスク135の対応 START>---------------------
      *----------  ワーク商品区分
         05  WK-SYOHIN-KBN         PIC  X(02).
      *------------------ <残タスク135の対応 END>-----------------------
      *----------  管理数量単位
         05  WK-KANRI-SURYO-TANI   PIC  S9(12)V9(06).
         05  WK-J                  PIC  9(05).
      *----------  DATファイル名
         05  WK-FILE-NAME          PIC  X(255).
      *----------  DATファイル名2
         05  WK-FILE-2-NAME        PIC  X(255).
      *----------  DATファイル名3
         05  WK-FILE-3-NAME        PIC  X(255).
      *----------  DATファイル名4
         05  WK-FILE-4-NAME        PIC  X(255).
      *----------  DATファイル名5
         05  WK-FILE-5-NAME        PIC  X(255).
      *----------  DATファイル名6
         05  WK-FILE-6-NAME        PIC  X(255).
      *----------  DATファイル名7
         05  WK-FILE-7-NAME        PIC  X(255).
      *----------  DATファイル名8
         05  WK-FILE-8-NAME        PIC  X(255).
      *----------  ファイルパス
         05  WK-FILE-PASS          PIC  X(256).
      *----------  パス付けDATファイル
         05  WK-PSACT-DAT-FILE     PIC  X(256).
      *----------  ファイルリターン
         05  WK-FILE-STATUS        PIC  X(02).
      *----------  パス付けDATファイル
         05  WK-PSACT-DAT-FILE-2   PIC  X(256).
      *----------  パス付けDATファイル3
         05  WK-PSACT-DAT-FILE-3   PIC  X(256).
      *----------  パス付けDATファイル4
         05  WK-PSACT-DAT-FILE-4   PIC  X(256).
      *----------  パス付けDATファイル5
         05  WK-PSACT-DAT-FILE-5   PIC  X(256).
      *----------  パス付けDATファイル6
         05  WK-PSACT-DAT-FILE-6   PIC  X(256).
      *----------  パス付けDATファイル7
         05  WK-PSACT-DAT-FILE-7   PIC  X(256).
      *----------  パス付けDATファイル8
         05  WK-PSACT-DAT-FILE-8   PIC  X(256).
      *----------  ファイルリターン
         05  WK-FILE-STATUS-2      PIC  X(02).
      *----------  ファイルリターン
         05  WK-FILE-STATUS-3      PIC  X(02).
      *----------  ファイルリターン
         05  WK-FILE-STATUS-4      PIC  X(02).
      *----------  ファイルリターン
         05  WK-FILE-STATUS-5      PIC  X(02).
      *----------  ファイルリターン
         05  WK-FILE-STATUS-6      PIC  X(02).
      *----------  ファイルリターン
         05  WK-FILE-STATUS-7      PIC  X(02).
      *----------  ファイルリターン
         05  WK-FILE-STATUS-8      PIC  X(02).
      *----------  接続引数
         05  WK-ARGUMENT.
      *----------  利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
      *----------  処理実行日
           10  WK-SHORI-YMD        PIC  X(08).
           10  WK-SHORI-YMD-9
                                   REDEFINES  WK-SHORI-YMD
                                   PIC  9(08).
      *----------  業務タスクID
           10  WK-GYOMU-TASK-ID    PIC  X(07).
      *----------  起動ID
           10  WK-KIDOU-ID         PIC  X(04).
      *----------  LOOP
         05  WK-LOOP.
           10  WK-IDX-J            PIC  9(05).
           10  WK-IDX-K            PIC  9(02).
           10  WK-IDX-M            PIC  9(02).
           10  WK-IDX-I            PIC  9(02).
           10  WK-IDX-P            PIC  9(02).
           10  WK-IDX-Q            PIC  9(02).
           10  WK-IDX-X            PIC  9(02).
           10  WK-IDX-Y            PIC  9(02).
           10  WK-IDX-C            PIC  9(02).
           10  WK-IDX-D            PIC  9(02).
      *----------  COUNT
         05  WK-COUNT.
           10  WK-COUNT-1          PIC  9(02).
      *----------  件数
         05  WK-KENSUU.
      *----------  書き込む件数
           10  WK-WRITE-KENSUU     PIC  9(09).
           10  WK-WRITE-KENSUU2    PIC  9(09).
           10  WK-WRITE-KENSUU3    PIC  9(09).
           10  WK-WRITE-KENSUU4    PIC  9(09).
           10  WK-WRITE-KENSUU5    PIC  9(09).
           10  WK-WRITE-KENSUU6    PIC  9(09).
           10  WK-WRITE-KENSUU7    PIC  9(09).
           10  WK-WRITE-KENSUU8    PIC  9(09).
           10  WK-WRITE-TEMP       PIC  9(09).
           10  WK-WRITE-TEMP2      PIC  9(09).
           10  WK-WRITE-TEMP3      PIC  9(09).
           10  WK-WRITE-TEMP4      PIC  9(09).
           10  WK-FETCH-KENSUU     PIC  9(09).
           10  WK-SELECT-KENSUU    PIC  9(09).
           10  WK-STOP-KENSUU      PIC  9(03).
      *----------  エラーフリーメッセージ
         05  WK-SQL-ERR-MSG.
      *----------  SELECTリーメッセージ
           10  WK-SELECT-FREE-MSG  PIC  X(5000).
           10  WK-SELECT-FREE-MSG2 PIC  X(5000).
      *******         テーマ2693     20100404 修正  開始        ********
           10  WK-SELECT-FREE-MSG3 PIC  X(5000).
      *******         テーマ2693     20100404 修正  終了        ********
      *----------  TKDYAA40リーメッセージ
           10  WK-SEL-TKDYAA40-FREE-MSG
                                   PIC  X(3000).
      *----------  日付
         05  WK-DATE.
      *----------  マシン日付時刻
           10  WK-MAC-DATE-TIME    PIC  X(14).
      *----------  ファンド&ポートフォリオオ明細
         05  WK-FUND-PTF-DETAIL.
      *----------  ヒット件数
           10  WK-HIT-KENSU        PIC  9(05).
      *----------  返却データ
           10  WK-PTF-ATT-DATA     OCCURS  50000.
      *----------  ファンドコード
             15  WK-FUND-CD-DETAIL PIC  X(12).
      *----------  ファンド名（日）
             15  WK-FND-MEI-JPN-DETAIL
                                   PIC  X(60).
      *----------  ポートフォリオコード
             15  WK-PTF-CD-DETAIL  PIC  X(04).
      *----------  ポートフォリオ名（日）
             15  WK-PTF-MEI-JPN-DETAIL
                                   PIC  X(60).
      *----------  デフォルト評価系列コード
             15  WK-DEFAUL-THYK-CD
                                   PIC  X(04).
      *----------基準日From
             15  WK-KZYN-YMD-FROM  PIC  9(08).
      *----------基準日To
             15  WK-KZYN-YMD-TO    PIC  9(08).
      *----------  ワークシステムエラー情報
         05  WK-SYS-ERR-INFO.
      *---------- エラー検知プログラム名
           10  WK-ERR-PGM-ID       PIC  X(16).
      *---------- ポジション
           10  WK-ERR-POS          PIC  X(04).
      *---------- リターンコード
           10  WK-RTN-CD           PIC  X(03).
      *---------- 詳細リターンコード
           10  WK-DETAIL-RTN-CD    PIC  S9(09).
      *----------  詳細リターンコードデコードフラグ
           10  WK-DETAIL-RTN-CD-FLG
                                   PIC  X(01).
      *---------- フリーメッセージ
           10  WK-FREE-MSG         PIC  X(2000).
      *---------- ワーク業務エラー情報
         05  WK-GYOMU-ERR-INFO.
           10  WK-MESSAGE-AREA     OCCURS  999.
      *---------- ファンドコード
             15  WK-GYOMU-FUND-CD  PIC  X(12).
      *---------- ポートフォリオコード
             15  WK-GYOMU-PTF-CD   PIC  X(04).
      *---------- 評価系列コード
             15  WK-GYOMU-HYK-KRTU-CD
                                   PIC  X(04).
      *---------- 帳票ID
             15  WK-GYOMU-REP-ID   PIC  X(08).
      *---------- 帳票任意コード
             15  WK-GYOMU-REP-ANY-CD
                                   PIC  X(50).
      *---------- 基準日From
             15  WK-GYOMU-KJN-YMD-FROM
                                   PIC  X(08).
      *---------- 基準日To
             15  WK-GYOMU-KJN-YMD-TO
                                   PIC  X(08).
      *---------- メッセージID
             15  WK-GYOMU-MSG-ID   PIC  X(07).
      *---------- 置換文字
             15  WK-GYOMU-TIKAN-MOJI.
               20  WK-GYOMU-TK-MOJI
                                   OCCURS  5
                                   PIC  X(30).
      *---------- フリーメッセージ
             15  WK-GYOMU-FREE-MSG PIC  X(200).
      *----------  ワーク期間
         05  WK-KIKAN.
      *----------  期間FROM
           10  WK-KIKAN-FR         PIC  X(08).
           10  WK-KIKAN-FR-9
                                   REDEFINES  WK-KIKAN-FR
                                   PIC  9(08).
      *----------  期間TO
           10  WK-KIKAN-TO         PIC  X(08).
           10  WK-KIKAN-TO-9
                                   REDEFINES  WK-KIKAN-TO
                                   PIC  9(08).
      *----------  基準日
         05  WK-END-YMD-KJN.
           10  WK-END-YY-KJN       PIC  9(04).
           10  WK-END-MM-KJN       PIC  9(02).
           10  WK-END-DD-KJN       PIC  9(02).
         05  WK-END-YMD-KJN-9
                                   REDEFINES  WK-END-YMD-KJN
                                   PIC  9(08).
      *----------  TABLE-NAME
         05  WK-TBL-NAME.
      *----------  運用成果残高
           10  WK-TBL-TKUSZT01     PIC  X(13).
      *----------  進捗管理
           10  WK-TBL-TKDYAA40     PIC  X(13).
      *******         テーマ2693     20100404 修正  開始        ********
      *----------  ポートフォリオ評価系列
           10  WK-TBL-TKPFZK04     PIC  X(13).
      *******         テーマ2693     20100404 修正  終了        ********
      *----------  リターンコード
         05  WK-RTN-CODE           PIC  9(02).
      *----------  実行ステータス
         05  WK-STATUS             PIC  9(02).
         05  WK-1190-STATUS        PIC  9(02).
      *----------  エラー種別
         05  WK-ERR-SYUBETU        PIC  X(01).
      *----------  SCZY1020取得日付
         05  WK-FROM1020-DATE      PIC  9(08).
      *---------- ポートフォリオコードTEMP
         05  WK-TEMP-PTF-CD        PIC  X(20).
      *----------  約定受渡区分
         05  WK-YJ-UW-KBN-NEW      PIC  X(01).
         05  WK-YJ-UW-KBN-OLD      PIC  X(01).
      *----------  ワークブレイクキーNEW
         05  WK-BREAK-KEY-NEW.
      *---------- 証券種別コード
           10  WK-SEC-SBT-CD-NEW   PIC  X(04).
      *---------- 取引通貨
           10  WK-TRHK-TUKA-NEW    PIC  X(04).
      *---------- 銘柄コード
           10  WK-MEG-CD-NEW       PIC  X(15).
      *---------- 資産負債・買建売建フラグ
           10  WK-TATE-FLG-NEW     PIC  X(01).
      *----------  ワークブレイクキーOLD
         05  WK-BREAK-KEY-OLD.
      *---------- 証券種別コード
           10  WK-SEC-SBT-CD-OLD   PIC  X(04).
      *---------- 取引通貨
           10  WK-TRHK-TUKA-OLD    PIC  X(04).
      *---------- 銘柄コード
           10  WK-MEG-CD-OLD       PIC  X(15).
      *---------- 資産負債・買建売建フラグ
           10  WK-TATE-FLG-OLD     PIC  X(01).
      *----------  FILE
         05  WK-REC.
           COPY  "MUSRGXZT.cpy".
      *---------- 合計用
         05  WK-REC2.
           COPY  "MUSRGXZT.cpy".
         05  WK-REC3.
           10  WK-REC-REC          OCCURS  10.
             COPY  "MUSRGXZT.cpy".
         05  WK-REC4.
           10  WK-REC-REC4         OCCURS  3.
             COPY  "MUSRGXZT.cpy".
         05  WK-REC5.
           10  WK-REC-REC5         OCCURS  2.
             COPY  "MUSRGXZT.cpy".
      *------------------ <残タスク135の対応 START>---------------------
      *---------- 取引通貨
         05  WK-TRHK-TUKA          PIC  X(04).
      *---------- 為替決済通貨
         05  WK-KWS-TH-TUKA-CD     PIC  X(04).
      *------------------ <残タスク135の対応 END>-----------------------
      *----------  エラーカウンター数
         05  WK-ERR-CNT            PIC  9(02).
         05  WK-18-18-X
             PIC  -----------------9.999999999999999999.
         05  WK-NUM-1              PIC  9(02).
         05  WK-NUM-LENGTH         PIC  9(02).
         05  WK-NUM-FROM           PIC  9(02).
         05  WK-HYK-EX-SHTK-PTN-CD PIC  X(04).
         05  WK-PRIO-1-EX-KRTU     PIC  X(04).
         05  WK-KUNI-CD-RYAKU      PIC  X(02).
         05  WK-SEC-SBT-4156       PIC  X(04).
         05  WK-MEG-CD-3002        PIC  X(15).
         05  WK-SEC-SBT-3002       PIC  X(04).
         05  WK-MEG-CD-3002-3      PIC  X(15).
         05  WK-SEC-SBT-3002-3     PIC  X(04).
         05  WK-MEG-CD-3004        PIC  X(15).
         05  WK-HAKO-CD-4102       PIC  X(04).
         05  WK-SEC-SBT-4182-2     PIC  X(04).
         05  WK-HYK-EX-FLG         PIC  9(01).
         05  WK-PRIO-1-FLG         PIC  9(01).
         05  WK-TRHK-TUKA-4012     PIC  X(04).
         05  WK-KWS-ZYOUHO-FLG     PIC  9(01).
         05  WK-PRIO-3017          PIC  X(04).
         05  WK-TRHK-TUKA-3017     PIC  X(04).
         05  WK-CAPITAL-TUKA-3017  PIC  X(04).
         05  WK-BIKOU-FLG          PIC  9(01).
         05  WK-BIKOU-4116         PIC  X(20).
         05  WK-KUNI-FLG           PIC  9(01).
         05  WK-TRHK-TUKA-0604     PIC  X(04).
         05  WK-RTN-4156           PIC  X(03).
         05  WK-RTN-3004           PIC  X(03).
         05  WK-RTN-3002           PIC  X(03).
         05  WK-RTN-4102           PIC  X(03).
         05  WK-RTN-4182-2         PIC  X(03).
         05  WK-RTN-3017           PIC  X(03).
         05  WK-RTN-3017-2         PIC  X(03).
         05  WK-RTN-4116           PIC  X(03).
         05  WK-RTN-3002-3         PIC  X(03).
         05  WK-RTN-4009           PIC  X(03).
         05  WK-RTN-4012           PIC  X(03).
         05  WK-RTN-0604           PIC  X(03).
         05  WK-RTN-3002-2         PIC  X(03).
      *----------  テーマ3276　開始
         05  WK-ITIOKU-TNK         PIC  S9(09)V9(09).
         05  WK-ITIOKU-CP          PIC  S9(09)V9(09).
         05  WK-ITIOKU-ST-TNK      PIC  S9(09)V9(09).
      *----------  テーマ3276　終了
      *******         テーマ3422              修正  開始        ********
      *----------  ワーク取引決済乗除区分フラグ
         05  WK-TH-ZYOUHO-FLG      PIC  9(01).
      *----------  ワーク約定為替換算時採用系列_時価(取引通貨)用
         05  WK-PRIO-CP            PIC  X(04).
      *----------  ワークベース通貨コード_時価(取引通貨)用
         05  WK-BASE-TUKA-CP       PIC  X(04).
      *----------  ワーク目的通貨コード_時価(取引通貨)用
         05  WK-MOKU-TUKA-CP       PIC  X(04).
      *******         テーマ3422              修正  終了        ********
      *----------　テーマ3344対応開始
      *----------  未収収益(取引通貨)
         05  WK-THTK-MS-EKI        PIC  S9(15)V9(03).
      *----------  未収収益(運用通貨)
         05  WK-UYTK-MS-EKI        PIC  S9(15)V9(03).
      *----------　テーマ3344対応終了
      ******************************************************************
      *        共通関数引数用パラメータ エリア
      ******************************************************************
       01  PARM-SCZY3026-INOUT.
           COPY  "SCZY3026.cpy".
      *----------  カウンターパーティ全項目取得ルーチン
       01  PARM-SCZY4116-INOUT.
           COPY  "SCZY4116.cpy".
      *----------  為替換算情報取得ルーチン
       01  PARM-SCZY3017-INOUT.
           COPY  "SCZY3017.cpy".
      *----------  ポートフォリオ属性テーブルからデータを取得
       01  PARM-SCZY4007-INOUT.
           COPY  "SCZY4007.cpy".
      *----------  評価系列取得ルーチン
       01  PARM-SCZY4009-INOUT.
           COPY  "SCZY4009.cpy".
      *----------  評価為替取得方法パターン取得ルーチン
       01  PARM-SCZY4012-INOUT.
           COPY  "SCZY4012.cpy".
      *----------  環境変数取得
       01  PARM-SCZY4903-INOUT.
           COPY  "SCZY4903.cpy".
      *----------  処理対象実行状況管理明細ＧＥＴ
       01  PARM-SCZY7200-INOUT.
           COPY  "SCZY7200.cpy".
      *----------  システム日付・マシン日付時刻ＧＥＴルーチン
       01  PARM-SCZY1010-INOUT.
           COPY  "SCZY1010.cpy".
      *----------  カレンダールーチン
       01  PARM-SCZY1020-INOUT.
           COPY  "SCZY1020.cpy".
      *----------  テーブルID取得
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  リターンパッケージセット
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
           COPY "CZRTNPACKAGE.cpy".
      *----------  進捗管理ＩＮＳＵＰＤルーチン
       01  PARM-SUSC0405-INOUT.
           COPY  "SUSC0405.cpy".
      *----------  ＧＸ用証券種別コード変換ルーチン
       01  PARM-SUSC0603-INOUT.
           COPY  "SUSC0603.cpy".
      *----------  ＧＸ用通貨コード→国コード変換ルーチン
       01  PARM-SUSC0604-INOUT.
           COPY  "SUSC0604.cpy".
      *----------  GX集約データ生成処理起動単体チェック
       01  PARM-SUSR2601-INOUT.
           COPY  "SUSR2601.cpy".
      *----------  GX集約データ生成処理起動O3Wチェックルーチン
       01  PARM-AIFA-HDR.
           COPY  "WOMCMAIFA.CPY".
       01  PARM-USER-ATTR-HDR.
           COPY  "CZCOMMONHEADER.cpy".
      *----- 入出力パラメータ
       01  PARM-SUSR2602-ARG-IN.
           COPY  "INMUSR2610_COBOL.cpy".
       01  PARM-SUSR2602-ARG-OUT.
           COPY  "SUSR2602.cpy".
      *----------  内部⇒外部銘柄コード変換ルーチン
       01  PARM-SCZY3002-INOUT.
           COPY  "SCZY3002.cpy".
      *----------  銘柄属性取得ルーチン
       01  PARM-SCZY3004-INOUT.
           COPY  "SCZY3004.cpy".
      *----------  ポートフォリオと有効期間取得取得ルーチン
       01  PARM-SCZY4002-INOUT.
           COPY  "SCZY4002.cpy".
       01  PARM-SCZY4002-AIFA-HEADER.
         05  WK-IN-AIFA.
      *----------  AIFA情報
           COPY  "WOMCMAIFA.CPY".
         05  WK-IN-HEADER.
      *----------  共通ヘッダ
           COPY  "CZCOMMONHEADER.cpy".
      *----------  国全項目取得
       01  PARM-SCZY4102-INOUT.
           COPY  "SCZY4102.cpy".
      *----------  内部⇒外部コードリファレンス変換ルーチン
       01  PARM-SCZY4182-INOUT.
           COPY  "SCZY4182.cpy".
      *------------------ <残タスク135の対応 START>---------------------
      *----------  商品属性全項目取得
       01  PARM-SCZY4156-INOUT.
           COPY  "SCZY4156.cpy".
      *------------------ <残タスク135の対応 END>-----------------------
      *----------  バッチ開始メッセージ出力ルーチン
       01  PARM-SCZY7010-IN.
           COPY  "SCZY7010.cpy".
      *----------  バッチ終了メッセージ出力ルーチン
       01  PARM-SCZY7020-INOUT.
           COPY  "SCZY7020.cpy".
      *----------  バッチ処理件数出力ルーチン
       01  PARM-SCZY7040-IN.
           COPY  "SCZY7040.cpy".
      *----------  実行状況管理明細ＩＮＳルーチン
       01  PARM-SCZY7050-IN.
           COPY  "SCZY7050.cpy".
      *----------  実行状況管理SELルーチン
       01  PARM-SCZY7060-INOUT.
           COPY  "SCZY7060.cpy".
      *----------  ポートフォリオ別メッセージＩＮＳルーチン
       01  PARM-SCZY7080-INOUT.
           COPY  "SCZY7080.cpy".
      *----------  バッチ引数一括ＧＥＴルーチン
       01  PARM-SCZY7090-INOUT.
           COPY  "SCZY7090.cpy".
      *----------  バッチＤＢ接続情報取得
       01  PARM-SCZY7100-INOUT.
           COPY  "SCZY7100.cpy".
      *----------  転送制御ファイル作成
       01  PARM-SCZY7180-INOUT.
           COPY  "SCZY7180.cpy".
      *----------  実行状況管理明細ＵＰＤルーチン
       01  PARM-SCZY7210-INOUT.
           COPY  "SCZY7210.cpy".
      *----------  実行状況管理停止判断ルーチン
       01  PARM-SCZY7220-INOUT.
           COPY  "SCZY7220.cpy".
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      *------------------ <残タスク129の対応 START>---------------------
      *----------  運用成果残高データHIGHVALUE変換
       01  PARM-SUSC0057-INOUT.
           COPY  "SUSC0057.cpy".
      *------------------ <残タスク129の対応 END>-----------------------
      ******************************************************************
      *        手 続 き 部
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
      *    処理全体
      ******************************************************************
       BASE-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  MUSR2651  START  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  前処理
           PERFORM  INIT-RTN
      *----------  主処理
           PERFORM  MAIN-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE          =["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
           IF  WK-RTN-CODE NOT = CNS-RTN-BT16
           THEN
      *----------  後処理
             PERFORM  END-RTN
           ELSE
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  MUSR2651  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1.ワークエリアの初期化
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2.開始メッセージ出力
           PERFORM  PUT-BIGN-MSG-RTN
      *----------  3.1.3.引数取得
           PERFORM  EXEC-ARG-GET-RTN
      *----------  3.1.4.環境変数取得
           PERFORM  ENV-STK-RTN
      *----------  3.1.5.ＤＢ接続情報取得
           PERFORM  GET-DB-VAR-RTN
      *---------   3.1.6.オラクル接続
           PERFORM  CONNECT-ORA-RTN
      *----------  3.1.7.システム日付取得
           PERFORM  SYS-DATE-RTN
      *----------  3.1.8.テーブルID取得
           PERFORM  TBLID-GET-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1.ワークエリアの初期化
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワークエリアの初期化  START  ***"
      *-----------------------------------------------------------------
      *----------  ワークエリアの初期化
           INITIALIZE     FLG-AREA
                          SQL-AREA
                          HST-AREA
                          WK-DENBUN-AREA
                          WORK-AREA
                          PARM-SCZY3026-INOUT
                          PARM-SCZY4116-INOUT
                          PARM-SCZY3017-INOUT
                          PARM-SCZY4007-INOUT
                          PARM-SCZY4009-INOUT
                          PARM-SCZY4012-INOUT
                          PARM-SCZY1010-INOUT
                          PARM-SCZY1020-INOUT
                          PARM-SCZY1160-INOUT
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-SUSC0405-INOUT
                          PARM-SUSC0603-INOUT
                          PARM-SUSC0604-INOUT
                          PARM-SUSR2601-INOUT
                          PARM-AIFA-HDR
                          PARM-USER-ATTR-HDR
                          PARM-SUSR2602-ARG-IN
                          PARM-SUSR2602-ARG-OUT
                          PARM-SCZY3002-INOUT
                          PARM-SCZY3004-INOUT
                          PARM-SCZY4002-INOUT
                          PARM-SCZY4002-AIFA-HEADER
                          PARM-SCZY4102-INOUT
                          PARM-SCZY4182-INOUT
                          PARM-SCZY4903-INOUT
                          PARM-SCZY7010-IN
                          PARM-SCZY7020-INOUT
                          PARM-SCZY7040-IN
                          PARM-SCZY7050-IN
                          PARM-SCZY7060-INOUT
                          PARM-SCZY7080-INOUT
                          PARM-SCZY7090-INOUT
                          PARM-SCZY7100-INOUT
                          PARM-SCZY7180-INOUT
                          PARM-SCZY7210-INOUT
                          PARM-SCZY7220-INOUT
                          PARM-SCZY7200-INOUT
                          PARM-SUSC0057-INOUT
                          PARM-RTNPKG
           MOVE  CNS-OFF           TO  WK-HYK-EX-FLG
           MOVE  CNS-OFF           TO  WK-PRIO-1-FLG
           MOVE  CNS-OFF           TO  WK-KWS-ZYOUHO-FLG
           MOVE  CNS-OFF           TO  WK-BIKOU-FLG
           MOVE  CNS-OFF           TO  WK-KUNI-FLG
      *******         テーマ3422              修正  開始        ********
           MOVE  CNS-OFF           TO  WK-TH-ZYOUHO-FLG
      *******         テーマ3422              修正  終了        ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワークエリアの初期化  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2.開始メッセージ出力処理
      ******************************************************************
       PUT-BIGN-MSG-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  開始メッセージ出力処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7010-IN
      *----------  プログラムID
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7010-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7010-ARG:"
      D    DISPLAY  CNS-PGM-ID":プログラムID=["
      D             PGM-ID              OF  PARM-SCZY7010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7010 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7010"             USING  PARM-SCZY7010-IN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7010 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  開始メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PUT-BIGN-MSG-EXT.
           EXIT.
      ******************************************************************
      *    3.1.3.引数取得
      ******************************************************************
       EXEC-ARG-GET-RTN       SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"*****   引数取得処理  START   *****"
      *-----------------------------------------------------------------
           INITIALIZE               PARM-SCZY7090-INOUT
                                    PARM-RTNPKG
      *----------  引数NO（引数の何番目）
           MOVE  CNS-4
             TO  ARG-NUM                OF  PARM-SCZY7090-ARG1
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":引数NO=["
      D             ARG-NUM             OF  PARM-SCZY7090-ARG1"]"
      D    DISPLAY  CNS-PGM-ID  ":CALL SCZY7090 :バッチ引数取得ルーチン"
      *-----------------------------------------------------------------
           CALL   "SCZY7090"            USING  PARM-SCZY7090-INOUT
                                               PARM-RTNPKG
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID  ":RTN-CODE=["RTN-CD
      D        OF PARM-RTNPKG(COUNTER   OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ワーク利用会社コード
             MOVE  ARG-STRING       OF  PARM-SCZY7090-ARG2(CNS-1)
               TO  WK-RIYO-CMP-CD
      *----------  ワーク処理実行日
             MOVE  ARG-STRING       OF  PARM-SCZY7090-ARG2(CNS-2)
               TO  WK-SHORI-YMD
      *----------  ワーク業務タスクID
             MOVE  ARG-STRING       OF  PARM-SCZY7090-ARG2(CNS-3)
               TO  WK-GYOMU-TASK-ID OF  WK-ARGUMENT
      *----------  ワーク起動ＩＤ
             MOVE  ARG-STRING       OF  PARM-SCZY7090-ARG2(CNS-4)
               TO  WK-KIDOU-ID
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*****   バッチ引数の取得正常   *****"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク処理実行日    =["WK-SHORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク業務タスクID  =["
      D             WK-GYOMU-TASK-ID     OF  WK-ARGUMENT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク起動ＩＤ      =["WK-KIDOU-ID"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":バッチ引数取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16           TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG            TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID             TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-001            TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901            TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD                 OF  PARM-RTNPKG
                                              (COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0           TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                  TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  引数取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       EXEC-ARG-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.1.4.環境変数取得
      ******************************************************************
       ENV-STK-RTN            SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"*****   環境変数取得処理  START   *****"
      *-----------------------------------------------------------------
      *----------  環境変数からパスワードを取得する
           INITIALIZE  PARM-SCZY4903-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4903-ARG1
      *----------  PATH区分
           MOVE  CNS-PATH-05
             TO  PATH-KBN               OF  PARM-SCZY4903-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4903-ARG:"
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4903-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PATH-KBN=["
      D             PATH-KBN            OF  PARM-SCZY4903-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4903 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4903"             USING  PARM-SCZY4903-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4903 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4903)=["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=[" PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":環境変数取得 正常"
      *-----------------------------------------------------------------
               MOVE  RTN-PATH           OF  PARM-SCZY4903-ARG2
                 TO  WK-FILE-PASS
      *----------  取得できない場合
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":環境変数取得 取得できない"
      *-----------------------------------------------------------------
      *----------  ワークエラーパッケージを編集
               MOVE  PARM-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16       TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-002        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-FILE-PASS=["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":***  環境変数取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ENV-STK-EXT.
           EXIT.
      ******************************************************************
      *    3.1.5.バッチＤＢ接続情報取得
      ******************************************************************
       GET-DB-VAR-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢ接続情報取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7100-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7100-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7100-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード         =["
      D             RIYO-CMP-CD         OF  PARM-SCZY7100-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7100 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7100"             USING  PARM-SCZY7100-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7100 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7100)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  DB接続情報
             MOVE  DB-SETUZOKU-JYOUHOU  OF PARM-SCZY7100-ARG2
               TO  H-ORA-USER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢ接続情報取得 正常"
      D    DISPLAY  CNS-PGM-ID":H-ORA-USER         =["H-ORA-USER"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢ接続情報取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-003          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   ＤＢ接続情報取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-DB-VAR-EXT.
           EXIT.
      ******************************************************************
      *    3.1.6.ORACLE接続
      ******************************************************************
       CONNECT-ORA-RTN        SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   ORACLE接続  START   *****"
      *-----------------------------------------------------------------
      *----------  ORACLE接続
           EXEC SQL
             CONNECT :H-ORA-USER
           END-EXEC
           EVALUATE  SQLCODE
      *----------  SQLCODE=「0：正常終了」 の場合
             WHEN  CNS-SQL-NORMAL
      *----------  ORACLE接続フラグON(接続成功)
               MOVE  CNS-ON             TO  FLG-ORA-CONNECT
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ORACLE接続成功 :SQLCODE=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  SQLCODE≠「0：正常終了」 の場合
             WHEN  OTHER
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ORACLE接続エラー:SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16      TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID        TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-004       TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900       TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE           TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1      TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  CNS-CONNECT-ERR   TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"*****   ORACLE接続  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CONNECT-ORA-EXT.
           EXIT.
      ******************************************************************
      *    3.1.7.システム日付取得
      ******************************************************************
       SYS-DATE-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  システム日付取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1010-INOUT
                       PARM-RTNPKG
      *----------  OL/BT区分
           MOVE  CNS-BT
             TO  DATE-KBN               OF  PARM-SCZY1010-ARG1
      *----------  時刻形式区分
           MOVE  CNS-TIME-FORM-KBN-1
             TO  TIME-FORM-KBN          OF  PARM-SCZY1010-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1010-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1010-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード         =["
      D             RIYO-CMP-CD         OF  PARM-SCZY1010-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":OL/BT区分              =["
      D             DATE-KBN            OF  PARM-SCZY1010-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":時刻形式区分           =["
      D             TIME-FORM-KBN       OF  PARM-SCZY1010-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1010 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1010"             USING  PARM-SCZY1010-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1010 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1010)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  MAC-DATE-TIME        OF PARM-SCZY1010-ARG2
               TO  WK-MAC-DATE-TIME
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":システム日付取得 正常"
      D    DISPLAY  CNS-PGM-ID":マシン日付時刻=["WK-MAC-DATE-TIME"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":システム日付取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-005          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  システム日付取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SYS-DATE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.8.テーブルID取得
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  テーブルID(1)
           MOVE  CNS-TBL-TKUSZT01
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  テーブルID(2)
           MOVE  CNS-TBL-TKDYAA40
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *******         テーマ2693     20100404 修正  開始        ********
      *----------  テーブルID(3)
           MOVE  CNS-TBL-TKPFZK04
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *******         テーマ2693     20100404 修正  終了        ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1160-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード  =["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1   "]"
      D    DISPLAY  CNS-PGM-ID":テーブルID(1)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":テーブルID(2)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(2)"]"
      *******         テーマ2693     20100404 修正  開始        ********
      D    DISPLAY  CNS-PGM-ID":テーブルID(3)   =["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(3)"]"
      *******         テーマ2693     20100404 修正  終了        ********
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1160 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1160 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得 正常"
      *-----------------------------------------------------------------
      *----------  ワークテーブルID1
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKUSZT01
      *----------  ワークテーブルID2
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TBL-TKDYAA40
      *******         テーマ2693     20100404 修正  開始        ********
      *----------  ワークテーブルID3
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TBL-TKPFZK04
      *******         テーマ2693     20100404 修正  終了        ********
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-006          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY1160取得テーブルID:"
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKUSZT01=["WK-TBL-TKUSZT01"]"
      *******         テーマ2693     20100404 修正  開始        ********
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKPFZK04=["WK-TBL-TKPFZK04"]"
      *******         テーマ2693     20100404 修正  終了        ********
      D    DISPLAY  CNS-PGM-ID":WK-TBL-TKDYAA40=["WK-TBL-TKDYAA40"]"
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.1.9.ファイル名作成処理
      ******************************************************************
       GET-FILE-NAME-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファイル名作成処理  START "
      *-----------------------------------------------------------------
           STRING  CNS-RX-TEXT               DELIMITED BY SPACE
                   WK-RIYO-CMP-CD            DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-SHORI-YMD              DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-KIDOU-ID               DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-GYOMU-TASK-ID          DELIMITED BY SPACE
                   "_01"                     DELIMITED BY SPACE
                                             INTO  WK-FILE-NAME
           END-STRING
           STRING  WK-FILE-PASS              DELIMITED BY SPACE
                   "/"                       DELIMITED BY SPACE
                   WK-FILE-NAME              DELIMITED BY SPACE
                                           INTO  WK-PSACT-DAT-FILE
           END-STRING
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.ファイル名    =["WK-FILE-NAME"]"
      D    DISPLAY  CNS-PGM-ID":ファイルパス    =["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":パス付けDATファイル=["
      D             WK-PSACT-DAT-FILE"]"
      D    DISPLAY  CNS-PGM-ID": ファイル名作成処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-NAME-EXT.
           EXIT.
      ******************************************************************
      *    3.1.10.ファイルオープン
      ******************************************************************
       OPEN-FILE-RTN          SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-RTN]"               GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY   CNS-PGM-ID":ファイルオープン処理  START "
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                TO  FLG-FILE-OPEN
           MOVE  WK-PSACT-DAT-FILE      TO  OUTFILE
           OPEN  OUTPUT OUT-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS=[" WK-FILE-STATUS "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS
             WHEN  CNS-FILE-NORMAL
               MOVE  CNS-ON                  TO  FLG-FILE-OPEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイルオープン正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイルオープンエラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-007          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-200          TO  WK-RTN-CD
      *----------  詳細リターンコード
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(WK-FILE-STATUS)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
             STRING  "ファイル:["
                     WK-PSACT-DAT-FILE
                     "]オープンエラー"
               DELIMITED BY SPACE       INTO  WK-FREE-MSG
             END-STRING
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファイルオープンフラグ=["
      D             FLG-FILE-OPEN "]"
      D    DISPLAY  CNS-PGM-ID":ファイルオープン処理  END "
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-RTN]"               GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-FILE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.11.受渡ファイル名作成処理
      ******************************************************************
       GET-FILE-2-NAME-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡ファイル名作成処理  START "
      *-----------------------------------------------------------------
           STRING  CNS-RX-TEXT               DELIMITED BY SPACE
                   WK-RIYO-CMP-CD            DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-SHORI-YMD              DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-KIDOU-ID               DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-GYOMU-TASK-ID          DELIMITED BY SPACE
                   "_02"                     DELIMITED BY SPACE
                                             INTO  WK-FILE-2-NAME
           END-STRING
           STRING  WK-FILE-PASS              DELIMITED BY SPACE
                   "/"                       DELIMITED BY SPACE
                   WK-FILE-2-NAME            DELIMITED BY SPACE
                                             INTO  WK-PSACT-DAT-FILE-2
           END-STRING
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.受渡ファイル名=["WK-FILE-2-NAME"]"
      D    DISPLAY  CNS-PGM-ID":受渡ファイルパス=["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":パス付けDAT受渡ファイル=["
      D             WK-PSACT-DAT-FILE-2"]"
      D    DISPLAY  CNS-PGM-ID": 受渡ファイル名作成処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-2-NAME-EXT.
           EXIT.
      ******************************************************************
      *    3.1.11.受渡ファイルオープン
      ******************************************************************
       OPEN-FILE-2-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-2-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY   CNS-PGM-ID":受渡ファイルオープン処理  START "
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                     TO  FLG-FILE-OPEN-2
           MOVE  WK-PSACT-DAT-FILE-2         TO  OUTFILE-2
           OPEN  OUTPUT OUT-FILE-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-2=[" WK-FILE-STATUS-2 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-2
             WHEN  CNS-FILE-NORMAL
               MOVE  CNS-ON                  TO  FLG-FILE-OPEN-2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT受渡ファイルオープン正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT受渡ファイルオープンエラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-008          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-200          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-2)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
             MOVE  SPACE                TO  WK-FREE-MSG
             STRING  "ファイル:["
                     WK-PSACT-DAT-FILE-2
                     "]オープンエラー"
               DELIMITED BY SIZE         INTO  WK-FREE-MSG
             END-STRING
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡ファイルオープンフラグ=["
      D             FLG-FILE-OPEN-2 "]"
      D    DISPLAY  CNS-PGM-ID":受渡ファイルオープン処理  END "
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-2-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-FILE-2-EXT.
           EXIT.
      ******************************************************************
      *    3.2.主処理
      ******************************************************************
       MAIN-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MAIN-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.1.処理対象取得処理
           PERFORM  SHORI-KENRI-GET-RTN
      *----------  3.2.2.実行状況更新処理
           PERFORM  STATUS-KOUSIN-1-RTN
      *----------  3.2.4.GAMMA残高データ出力処理
           PERFORM                  VARYING  WK-IDX-J
             FROM  CNS-1 BY CNS-1 UNTIL  WK-IDX-J > WK-HIT-KENSU
                OR  WK-RTN-CODE NOT < CNS-16
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-J=["WK-IDX-J"]"
      D    DISPLAY  CNS-PGM-ID":WK-GYOMU-TASK-ID=["
      D             WK-GYOMU-TASK-ID  OF  WK-ARGUMENT"]"
      *-----------------------------------------------------------------
      *******         テーマ2682     20100404 修正  開始        ********
             IF  WK-GYOMU-TASK-ID  OF  WK-ARGUMENT  =  CNS-TASK-T7080US
             THEN
               PERFORM  SINU-CHECK-RTN
             ELSE
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":FLG-NEXT-MEISAI=["FLG-NEXT-MEISAI"]"
      *-----------------------------------------------------------------
      *******         テーマ2682     20100404 修正  終了        ********
      *----------  3)GAMMA残高データ出力処理
             IF  WK-STATUS = CNS-0 AND FLG-NEXT-MEISAI = CNS-OFF
             THEN
               PERFORM  DATA-OUT-RTN
             ELSE
               CONTINUE
             END-IF
      *----------  初期化
             INITIALIZE  WK-J
                         WK-STATUS
                         WK-SELECT-KENSUU
                         WK-GYOMU-ERR-INFO
                         FLG-STOP-2
                         FLG-MEISAI-GYOMU-ERR
                         FLG-NEXT-MEISAI
           END-PERFORM
      *----------  フッターをダウンロードファイルに書き
           PERFORM  FOOT-OUT-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-UPD =["FLG-UPD"]"
      *-----------------------------------------------------------------
      *------------------ <連結障害1077の対応 START>--------------------
      *---------- ファイル出力件数処理
           PERFORM  WRITE-KENSUU-RTN
      *------------------ <連結障害1077の対応 END>----------------------
      *---------- 実行状況更新処理2
           PERFORM  STATUS-KOUSIN-2-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MAIN-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.処理対象取得処理
      ******************************************************************
       SHORI-KENRI-GET-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  処理対象取得処理  START  ***"
      *-----------------------------------------------------------------
      *----------  1) 電文情報取得とチェック処理
           PERFORM  DENBUN-GET-CHECK-RTN
      *----------  4) ポートフォリオ明細取得処理
           PERFORM  PTF-DETAIL-GET-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  処理対象取得処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SHORI-KENRI-GET-EXT.
           EXIT.
      ******************************************************************
      *    1) 電文情報取得とチェック処理
      ******************************************************************
       DENBUN-GET-CHECK-RTN   SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 電文情報取得とチェック処理START ***"
      *-----------------------------------------------------------------
      *----------  電文情報取得処理
           PERFORM  DENBUN-INFO-GET-RTN
      *----------  汎用残高ダウンロード処理起動O3Wチェックルーチン
           PERFORM  O3W-CHECK-RTN
      *----------  電文情報チェック処理
           PERFORM  DAT-START-RTN
      *----------  2）期間取得
           PERFORM  KIKAN-GET-RTN
      *----------  3）期間チェック処理
           PERFORM  KIKAN-CHECK-RTN
      *----------  GXファイルをオープンする
      *------------------ <連結障害No.1577対応 START>-------------------
           PERFORM  GX-FILE-OPEN-RTN
      *------------------ <連結障害No.1577対応   END>-------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 電文情報取得とチェック処理END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DENBUN-GET-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    電文情報取得処理
      ******************************************************************
       DENBUN-INFO-GET-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報取得処理 START  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DENBUN-INFO-GET-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7060-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF PARM-SCZY7060-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF PARM-SCZY7060-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF PARM-SCZY7060-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7060-ARG:"
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SYORI-YMD=["
      D             SYORI-YMD           OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":KIDOU-ID=["
      D             KIDOU-ID            OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7060 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7060"             USING  PARM-SCZY7060-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7060 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7060)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  DENBUN-INFO       OF  PARM-SCZY7060-ARG3
               TO  WK-DENBUN-AREA
      *******         テーマ3406     20130117 修正  開始        ********
      *----------  ワーク業務タスクID＝"T6820US"（ＳＢＡ残高データ接続）
      *----------  の場合,ワーク電文情報．合成ポート再計算フラグ←"0"
             IF  WK-GYOMU-TASK-ID     OF  WK-ARGUMENT
              =  CNS-SBA-ZANDAKA-SETUZOKU
             THEN
               MOVE  CNS-X-0          TO  I-FLG-KEISAN
                                      OF  WK-DENBUN-AREA
             ELSE
               CONTINUE
             END-IF
      *******         テーマ3406     20130117 修正  終了        ********
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":電文情報取得処理  正常"
      D    DISPLAY  CNS-PGM-ID":WK-AIFA=["WK-AIFA"]"
      D    DISPLAY  CNS-PGM-ID":WK-HEADER=["WK-HEADER"]"
      D    DISPLAY  CNS-PGM-ID":WK-DENBUN-INFO=["WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":電文情報取得処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-009          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報取得処理 END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DENBUN-INFO-GET-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       DENBUN-INFO-GET-EXT.
           EXIT.
      ******************************************************************
      *    汎用残高ダウンロード処理起動O3Wチェックルーチン
      ******************************************************************
       O3W-CHECK-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":汎用残高ダウンロード処理起動O3W START *"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-AIFA-HDR
                       PARM-USER-ATTR-HDR
                       PARM-SUSR2602-ARG-IN
                       PARM-SUSR2602-ARG-OUT
           MOVE  WK-AIFA               TO  PARM-AIFA-HDR
           MOVE  WK-HEADER             TO  PARM-USER-ATTR-HDR
           MOVE  WK-DENBUN-INFO
             TO  PARM-SUSR2602-ARG-IN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSR2602-ARG:"
      D    DISPLAY  CNS-PGM-ID":AIFA-HDR=["PARM-AIFA-HDR"]"
      D    DISPLAY  CNS-PGM-ID":USER-ATTR-HDR=["PARM-USER-ATTR-HDR"]"
      D    DISPLAY  CNS-PGM-ID":SUSR2602-ARG-IN=["
      D             PARM-SUSR2602-ARG-IN"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSR2602 START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSR2602"             USING PARM-AIFA-HDR
                                              PARM-USER-ATTR-HDR
                                              PARM-SUSR2602-ARG-IN
                                              PARM-SUSR2602-ARG-OUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSR2602 END  ***"
      D    DISPLAY  CNS-PGM-ID":I-KJN-YMD-TO       =["
      D             I-KJN-YMD-TO OF PARM-SUSR2602-ARG-IN"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSR2602)       =["
      D             RTN-CD OF PARM-SUSR2602-ARG-OUT"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-SUSR2602-ARG-OUT
             WHEN   CNS-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":汎用残高ダウンロード処理起動O3W 正常 **"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":汎用残高ダウンロード処理起動O3Wエラー *"
      *-----------------------------------------------------------------
               MOVE  CNS-8              TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
               MOVE  SUSR2602-BT-OUT
                 TO  WK-GYOMU-ERR-INFO
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-GYOMU-ERR
               PERFORM  END-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":汎用残高ダウンロード処理起動O3W END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       O3W-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    GX集約データ生成処理起動単体チェック
      ******************************************************************
       DAT-START-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GX集約データ生成単体チェック START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSR2601-INOUT
                       PARM-RTNPKG
      *----------  SPP/バッチ起動区分
           MOVE  CNS-KIDOU-KBN-B
             TO  KIDOU-KBN              OF   PARM-SUSR2601-INOUT
           MOVE  WK-DENBUN-INFO
             TO  PARM-SUSR2601-ARG2     OF   PARM-SUSR2601-INOUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSR2601-ARG:"
      D    DISPLAY  CNS-PGM-ID":SPP/バッチ起動区分=["
      D             KIDOU-KBN              OF   PARM-SUSR2601-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SUSR2601-ARG2=["
      D             PARM-SUSR2601-ARG2     OF   PARM-SUSR2601-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSR2601 START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSR2601"             USING  PARM-SUSR2601-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSR2601 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSR2601)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GX残高データ生成単体チェック 正常 ***"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GX残高チェック パラメータエラー ***"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT8        TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *----------  ワーク業務エラーを編集
               MOVE  PARM-SUSR2601-ARG6 TO  WK-GYOMU-ERR-INFO
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-GYOMU-ERR
               PERFORM  END-RTN
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GX残高チェック システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークエラーパッケージを編集
               MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  ワークリターンコード
               MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-010          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GX残高データ生成単体チェック END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DAT-START-EXT.
           EXIT.
      ******************************************************************
      *    2）期間取得処理
      ******************************************************************
       KIKAN-GET-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  期間取得処理START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-KIKAN
           MOVE  I-KJN-YMD-FR             OF  WK-DENBUN-INFO
             TO  WK-KIKAN-FR              OF  WK-KIKAN
           MOVE  I-KJN-YMD-TO             OF  WK-DENBUN-INFO
             TO  WK-KIKAN-TO              OF  WK-KIKAN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":KJN-YMD-FR=["I-KJN-YMD-FR  OF
      D                                                WK-DENBUN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":KJN-YMD-TO=["I-KJN-YMD-TO  OF
      D                                                WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
      *----------  期間FROM取得処理
           INITIALIZE  PARM-SCZY1020-INOUT
                       PARM-RTNPKG
           IF   WK-KIKAN-FR  =  SPACE
           THEN
      *----------  機能区分
             MOVE  CNS-X-3
               TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *---------- 基準年月日1
             MOVE  WK-SHORI-YMD-9
               TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-ARG1
      *---------- 計算ベース区分
             MOVE  CNS-X-2
               TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *---------- 前後区分1
             MOVE  CNS-X-2
               TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *---------- 前後区分2
             MOVE  CNS-X-0
               TO  IXCAL-ZENGO-KBN-2      OF  PARM-SCZY1020-ARG1
      *---------- 単位区分
             MOVE  CNS-X-1
               TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *---------- 日数
             MOVE  CNS-1
               TO  IXCAL-DAYS             OF  PARM-SCZY1020-ARG1
             PERFORM   DATE-GET-RTN
             MOVE  WK-FROM1020-DATE       TO  WK-KIKAN-FR-9
           ELSE
             CONTINUE
           END-IF
      *----------  期間TO取得処理
           IF   WK-KIKAN-TO   =  SPACE
           THEN
      *----------  機能区分
             MOVE  CNS-X-3
               TO  IXCAL-FUNCTION         OF  PARM-SCZY1020-ARG1
      *---------- 基準年月日1
             MOVE  WK-SHORI-YMD-9
               TO  IXCAL-KJN-YMD1         OF  PARM-SCZY1020-ARG1
      *---------- 計算ベース区分
             MOVE  CNS-X-2
               TO  IXCAL-COMP-BASE        OF  PARM-SCZY1020-ARG1
      *---------- 前後区分1
             MOVE  CNS-X-2
               TO  IXCAL-ZENGO-KBN-1      OF  PARM-SCZY1020-ARG1
      *---------- 前後区分2
             MOVE  CNS-X-0
               TO  IXCAL-ZENGO-KBN-2      OF  PARM-SCZY1020-ARG1
      *---------- 単位区分
             MOVE  CNS-X-1
               TO  IXCAL-TANI-KBN         OF  PARM-SCZY1020-ARG1
      *---------- 日数
             MOVE  CNS-1
               TO  IXCAL-DAYS             OF  PARM-SCZY1020-ARG1
             PERFORM   DATE-GET-RTN
             MOVE  WK-FROM1020-DATE       TO  WK-KIKAN-TO-9
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-KIKAN-FR-9=["WK-KIKAN-FR-9"]"
      D    DISPLAY  CNS-PGM-ID":WK-KIKAN-TO-9=["WK-KIKAN-TO-9"]"
      D    DISPLAY  CNS-PGM-ID":***  期間取得処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KIKAN-GET-EXT.
           EXIT.
      ******************************************************************
      *    日付取得処理
      ******************************************************************
       DATE-GET-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 日付取得処理 START ***"
      D    DISPLAY  CNS-PGM-ID":機能区分      =["
      D             IXCAL-FUNCTION      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日1   =["
      D             IXCAL-KJN-YMD1      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":計算ベース区分=["
      D             IXCAL-COMP-BASE     OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":前後区分1     =["
      D             IXCAL-ZENGO-KBN-1   OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":前後区分2     =["
      D             IXCAL-ZENGO-KBN-2   OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":単位区分      =["
      D             IXCAL-TANI-KBN      OF  PARM-SCZY1020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":日数          =["
      D             IXCAL-DAYS          OF  PARM-SCZY1020-ARG1"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-FROM1020-DATE
           CALL  "SCZY1020"             USING  PARM-SCZY1020-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1020)            =["
      D             RTN-CD   OF PARM-RTNPKG( COUNTER OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF PARM-RTNPKG(COUNTER OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             MOVE  IXCAL-KJN-YMD-2      OF  PARM-SCZY1020-ARG1
               TO  WK-FROM1020-DATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":日付取得 正常"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":日付取得 異常"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-011          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 日付取得処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATE-GET-EXT.
           EXIT.
      ******************************************************************
      *    3) 期間チェック処理
      ******************************************************************
       KIKAN-CHECK-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 期間チェック処理START ***"
      D    DISPLAY  CNS-PGM-ID":WK-KIKAN-FR-9=["WK-KIKAN-FR-9"]"
      D    DISPLAY  CNS-PGM-ID":WK-KIKAN-TO-9=["WK-KIKAN-TO-9"]"
      *-----------------------------------------------------------------
           IF  WK-KIKAN-FR-9 > WK-KIKAN-TO-9
           THEN
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT8            TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
             INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
             MOVE  WK-KIKAN-FR
               TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
             MOVE  WK-KIKAN-TO
               TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
             MOVE  CNS-MSG-E000257
               TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
             MOVE  CNS-ZAN-KJN-TO
               TO  WK-GYOMU-TK-MOJI
               OF  WK-GYOMU-TIKAN-MOJI
               OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
             MOVE  CNS-ZAN-KJN-FROM
               TO  WK-GYOMU-TK-MOJI
               OF  WK-GYOMU-TIKAN-MOJI
               OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-2)
      *----------  後処理業務エラーフラグ
             MOVE  CNS-ON                 TO  FLG-GYOMU-ERR
      *----------  後処理
             PERFORM  END-RTN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 期間チェック処理END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KIKAN-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    4) 明細取得処理
      ******************************************************************
       PTF-DETAIL-GET-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 明細取得処理 START ***"
      *-----------------------------------------------------------------
      *-----------  ファンドコード取得処理
           PERFORM  SCZY4002-RTN
      *----------  実行状況管理明細インサート処理
           PERFORM  SCZY7050-RTN
      *----------  ＤＢコミット処理
           PERFORM  DB-COMMIT-RTN
      *----------  処理対象実行状況管理明細ＧＥＴルーチン
           PERFORM  SCZY7200-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 明細取得処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-DETAIL-GET-EXT.
           EXIT.
      ******************************************************************
      *    SCZY4002ポートフォリオ明細取得処理
      ******************************************************************
       SCZY4002-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオと有効期間取得処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4002-INOUT
                       PARM-RTNPKG
      *----------  LINK
           MOVE  WK-AIFA
             TO  WK-IN-AIFA             OF  PARM-SCZY4002-AIFA-HEADER
           MOVE  WK-HEADER
             TO  WK-IN-HEADER           OF  PARM-SCZY4002-AIFA-HEADER
      *----------  利用会社コー
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-COMPANY-CODE      OF  PARM-SCZY4002-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上り電文.ポートフォリオ区分=["
      D             I-PTF-SYORI-KBN     OF  WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
      *----------  オール指定1
           EVALUATE  I-PTF-SYORI-KBN    OF  WK-DENBUN-INFO
             WHEN  CNS-X-1
               MOVE  CNS-X-2
                 TO  ALL-SITEI-1        OF  PARM-SCZY4002-ARG1
             WHEN  CNS-X-2
               MOVE  CNS-X-1
                 TO  ALL-SITEI-1        OF  PARM-SCZY4002-ARG1
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *------------------ <連結障害211の対応 START>---------------------
           IF  I-PTF-SYORI-KBN  OF  WK-DENBUN-INFO   =  CNS-X-1
           THEN
             INITIALIZE  WK-COUNT-1
                         WK-IDX-K
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SCZY4002-RTN_1]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             PERFORM  VARYING  WK-IDX-K  FROM  CNS-1  BY  CNS-1
               UNTIL  WK-IDX-K > CNS-10
               COMPUTE  WK-COUNT-1 = WK-COUNT-1 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-K=["WK-IDX-K"]"
      D    DISPLAY  CNS-PGM-ID":WK-COUNT-1=["WK-COUNT-1"]"
      *-----------------------------------------------------------------
      *----------  ポートフォリオ区分
               MOVE  I-FUND-PTF-KBN     OF  WK-DENBUN-INFO(WK-IDX-K)
                 TO  PTF-KBN        OF  PARM-SCZY4002-ARG1(WK-COUNT-1)
      *----------  グループ又はファンドコード
               MOVE  I-FUND-CD          OF  WK-DENBUN-INFO(WK-IDX-K)
                 TO  GRP-FUND-CD    OF  PARM-SCZY4002-ARG1(WK-COUNT-1)
      *----------  ポートフォリオコード
               MOVE  I-PTF-CD           OF  WK-DENBUN-INFO(WK-IDX-K)
                 TO  PTF-CD         OF  PARM-SCZY4002-ARG1(WK-COUNT-1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PTF-KBN OF  PARM-SCZY4002-ARG1("
      D             WK-COUNT-1")=["
      D             PTF-KBN        OF  PARM-SCZY4002-ARG1(WK-COUNT-1)"]"
      D    DISPLAY  CNS-PGM-ID":GRP-FUND-CD  OF  PARM-SCZY4002-ARG1("
      D             WK-COUNT-1")=["
      D             GRP-FUND-CD    OF  PARM-SCZY4002-ARG1(WK-COUNT-1)"]"
      D    DISPLAY  CNS-PGM-ID":PTF-CD   OF  PARM-SCZY4002-ARG1("
      D             WK-COUNT-1")=["
      D             PTF-CD         OF  PARM-SCZY4002-ARG1(WK-COUNT-1)"]"
      *-----------------------------------------------------------------
             END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SCZY4002-RTN_1]"              GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           ELSE
             INITIALIZE  PTF-FUND-LIST  OF  PARM-SCZY4002-ARG1
           END-IF
      *------------------ <連結障害211の対応 END>-----------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上り電文.評価系列区分=["
      D             I-HYK-KRTU-KBN      OF  WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
      *----------  オール指定2
           EVALUATE  I-HYK-KRTU-KBN     OF  WK-DENBUN-INFO
             WHEN  CNS-X-1
               MOVE  CNS-X-3
                 TO  ALL-SITEI-2        OF  PARM-SCZY4002-ARG1
             WHEN  CNS-X-2
               MOVE  CNS-X-2
                 TO  ALL-SITEI-2        OF  PARM-SCZY4002-ARG1
             WHEN  CNS-X-3
               MOVE  CNS-X-1
                 TO  ALL-SITEI-2        OF  PARM-SCZY4002-ARG1
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *----------  評価系列
           IF  I-HYK-KRTU-KBN           OF  WK-DENBUN-INFO = CNS-X-1
           THEN
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SCZY4002-RTN_2]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             PERFORM                  VARYING  WK-IDX-K
               FROM  CNS-1  BY  CNS-1
               UNTIL  WK-IDX-K > CNS-10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-K=["WK-IDX-K"]"
      *-----------------------------------------------------------------
                 MOVE  I-HYK-KRTU-CD    OF  WK-DENBUN-INFO(WK-IDX-K)
                   TO  HYK-KRTU-CD      OF  PARM-SCZY4002-ARG1(WK-IDX-K)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":HYK-KRTU-CD("WK-IDX-K")=["
      D             HYK-KRTU-CD      OF  PARM-SCZY4002-ARG1(WK-IDX-K)"]"
      *-----------------------------------------------------------------
             END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SCZY4002-RTN_2]"              GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           ELSE
             INITIALIZE  HYK-KRTU       OF  PARM-SCZY4002-ARG1
           END-IF
      *----------  基準日FROM
           MOVE  WK-KIKAN-FR-9
             TO  KZYN-YMD-FROM          OF  PARM-SCZY4002-ARG1
      *----------  基準日TO
           MOVE  WK-KIKAN-TO-9
             TO  KZYN-YMD-TO            OF  PARM-SCZY4002-ARG1
      *---------- 権限チェック有無
           MOVE  CNS-X-1
             TO  KGN-CHK-UMU            OF  PARM-SCZY4002-ARG1
      *---------- メニューID
           MOVE  MENU-ID                OF  WK-DENBUN-INFO
             TO  MENU-ID                OF  PARM-SCZY4002-ARG1
      *---------- 画面アクション区分
           MOVE  CNS-KIDOU-KIRO-A
             TO  GAMEN-ACT-KBN          OF  PARM-SCZY4002-ARG1
      *---------- 業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY4002-ARG1
      *---------- 日中夜間区分
           MOVE  CNS-X-0
             TO  NCHU-YAKN-KBN          OF  PARM-SCZY4002-ARG1
      *---------- APL指定出力件数
           MOVE  ZERO
             TO  APL-OUT-CNT            OF  PARM-SCZY4002-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4002-ARG:"
      D    DISPLAY  CNS-PGM-ID":AIFA情報=["
      D             WK-IN-AIFA          OF  PARM-SCZY4002-AIFA-HEADER"]"
      D    DISPLAY  CNS-PGM-ID":共通ヘッダ=["
      D             WK-IN-HEADER        OF  PARM-SCZY4002-AIFA-HEADER"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-COMPANY-CODE   OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":オール指定1=["
      D             ALL-SITEI-1         OF  PARM-SCZY4002-ARG1"]"
      *------------------ <連結障害211の対応 START>---------------------
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ選択リスト=["
      D             PTF-FUND-LIST       OF  PARM-SCZY4002-ARG1"]"
      *------------------ <連結障害211の対応 END>-----------------------
      D    DISPLAY  CNS-PGM-ID":オール指定2=["
      D             ALL-SITEI-2         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列=["
      D             HYK-KRTU            OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KZYN-YMD-FROM       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日TO=["
      D             KZYN-YMD-TO         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":権限チェック有無=["
      D             KGN-CHK-UMU         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":メニューID=["
      D             MENU-ID             OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":画面アクション区分=["
      D             GAMEN-ACT-KBN       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":日中夜間区分=["
      D             NCHU-YAKN-KBN       OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":APL指定出力件数=["
      D             APL-OUT-CNT         OF  PARM-SCZY4002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4002 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4002"             USING  PARM-SCZY4002-AIFA-HEADER
                                               PARM-SCZY4002-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4002 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4002)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ポートフォリオと有効期間取得  正常"
      D    DISPLAY  CNS-PGM-ID":HIT-KENSU  OF  PARM-SCZY4002-ARG2=["
      D             HIT-KENSU  OF  PARM-SCZY4002-ARG2"]"
      *-----------------------------------------------------------------
               IF  HIT-KENSU  OF  PARM-SCZY4002-ARG2 = ZERO
               THEN
                 MOVE  CNS-RTN-BT8        TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 MOVE  WK-KIKAN-FR
                   TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
                 MOVE  WK-KIKAN-TO
                   TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
                 MOVE  CNS-MSG-E000217
                   TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  CNS-FUND-PTF
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
                 MOVE  CNS-ON             TO  FLG-GYOMU-ERR
                 PERFORM  END-RTN
               ELSE
                 MOVE  PARM-SCZY4002-ARG2 TO  WK-FUND-PTF-DETAIL
               END-IF
             WHEN  CNS-RTN-002
               MOVE  PARM-SCZY4002-ARG2   TO  WK-FUND-PTF-DETAIL
               MOVE  CNS-RTN-BT2          TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-W000309
                 TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
               PERFORM GYOMU-ERR-2-RTN
      *------------------ <残タスク159の対応 START>---------------------
             WHEN  CNS-RTN-130
      *------------------ <連結障害20090106の対応 START>----------------
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":HIT-KENSU  OF  PARM-SCZY4002-ARG2=["
      D             HIT-KENSU  OF  PARM-SCZY4002-ARG2"]"
      *-----------------------------------------------------------------
               IF  HIT-KENSU  OF  PARM-SCZY4002-ARG2 = ZERO
               THEN
                 MOVE  CNS-RTN-BT8        TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 MOVE  WK-KIKAN-FR
                   TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
                 MOVE  WK-KIKAN-TO
                   TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
                 MOVE  CNS-MSG-E000217
                   TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  CNS-FUND-PTF
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *---------- 基準日From
                 MOVE  WK-KIKAN-FR
                   TO  WK-GYOMU-KJN-YMD-FROM
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
      *---------- 基準日To
                 MOVE  WK-KIKAN-TO
                   TO  WK-GYOMU-KJN-YMD-TO
                     OF  WK-GYOMU-ERR-INFO(CNS-2)
      *---------- メッセージID
                 MOVE  CNS-MSG-E000534
                   TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-2)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-2,CNS-1)
                 MOVE  CNS-ON             TO  FLG-GYOMU-ERR
                 PERFORM  END-RTN
               ELSE
      *----------  ワークリターンコード
                 MOVE  CNS-RTN-BT4        TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
                 INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
                 MOVE  WK-KIKAN-FR
                   TO  WK-GYOMU-KJN-YMD-FROM OF WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
                 MOVE  WK-KIKAN-TO
                   TO  WK-GYOMU-KJN-YMD-TO   OF WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
                 MOVE  CNS-MSG-E000534
                   TO  WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI
                   OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.メッセージID=["
      D             WK-GYOMU-MSG-ID     OF  WK-GYOMU-ERR-INFO(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":W.置換文字=["WK-GYOMU-TK-MOJI
      D             OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)"]"
      *-----------------------------------------------------------------
                 PERFORM  GYOMU-ERR-2-RTN
                 MOVE  PARM-SCZY4002-ARG2 TO  WK-FUND-PTF-DETAIL
               END-IF
      *------------------ <連結障害20090106の対応 END>------------------
      *------------------ <残タスク159の対応 END>-----------------------
             WHEN  CNS-RTN-800
               MOVE  CNS-RTN-BT8          TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
                 MOVE  CNS-ON             TO  FLG-GYOMU-ERR
                 PERFORM  END-RTN
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ポートフォリオと有効期間取得  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-012          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオと有効期間取得処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4002-EXT.
           EXIT.
      ******************************************************************
      *    実行状況管理明細インサート処理
      ******************************************************************
       SCZY7050-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 実行状況管理明細インサート処理"
      D             " START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7050-IN
                         PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD              OF PARM-SCZY7050-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD                OF PARM-SCZY7050-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID                 OF PARM-SCZY7050-ARG1
      *---------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID         OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID            OF  PARM-SCZY7050-ARG1
      *---------  基準日From
           MOVE  WK-KIKAN-FR
             TO  KJN-YMD-FROM             OF  PARM-SCZY7050-ARG1
      *---------  基準日To
           MOVE  WK-KIKAN-TO
             TO  KJN-YMD-TO               OF  PARM-SCZY7050-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7050-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD           OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD             OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID              OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID         OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD               OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD                OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD           OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID                OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD            OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日From=["
      D             KJN-YMD-FROM          OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日To=["
      D             KJN-YMD-TO            OF  PARM-SCZY7050-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7050 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7050"             USING  PARM-SCZY7050-IN
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7050 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7050)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER               OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             CONTINUE
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況管理明細インサート処理  正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況管理明細インサート処理  エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16           TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG            TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID             TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-013            TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901            TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD                 OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0           TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                  TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 実行状況管理明細インサート処理"
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7050-EXT.
           EXIT.
      ******************************************************************
      *     実行状況更新処理1
      ******************************************************************
       STATUS-KOUSIN-1-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況更新処理1 START  ***"
      *----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7210-INOUT
                       PARM-RTNPKG
      *----------  セッション区分
           MOVE  CNS-X-0
             TO  SESSION-KBN            OF  PARM-SCZY7210-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7210-ARG2
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SCZY7210-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス
           MOVE  SPACE
             TO  JIKOU-STS              OF  PARM-SCZY7210-ARG2
      *----------  基準日FROM
           MOVE  WK-KIKAN-FR-9
             TO  KJN-YMD-FROM           OF  PARM-SCZY7210-ARG2
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7210-ARG:"
      D    DISPLAY  CNS-PGM-ID":SESSION-KBN   =["
      D             SESSION-KBN         OF  PARM-SCZY7210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD   =["
      D             RIYO-CMP-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":SYORI-YMD     =["
      D             SYORI-YMD           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":KIDOU-ID      =["
      D             KIDOU-ID            OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":JIKOU-STS     =["
      D             JIKOU-STS           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":KJN-YMD-FROM =["
      D             KJN-YMD-FROM        OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7210 START  ***"
      *----------------------------------------------------------------
           CALL  "SCZY7210"             USING  PARM-SCZY7210-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7210 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7210)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *--------------------<DEBSUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況更新処理1  正常"
      *----------------------------------------------------------------
      *----------  ＤＢコミット処理
             PERFORM  DB-COMMIT-RTN
      *--------------------<DEBSUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":CONTINUE-KBN   =["
      D             CONTINUE-KBN        OF  PARM-SCZY7210-ARG3"]"
      *----------------------------------------------------------------
      *----------  実行可能区分
             EVALUATE  CONTINUE-KBN OF PARM-SCZY7210-ARG3
               WHEN  CNS-X-0
                 CONTINUE
               WHEN  CNS-X-1
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況管理停止判断正常且つ一時停止"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
                 IF  WK-RTN-CODE < CNS-10
                 THEN
                   MOVE  CNS-10        TO  WK-RTN-CODE
                 ELSE
                   CONTINUE
                 END-IF
      *---------- ファンドコード
                 MOVE  SPACE
                   TO  WK-GYOMU-FUND-CD     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- ポートフォリオコード
                 MOVE  SPACE
                   TO  WK-GYOMU-PTF-CD      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 評価系列コード
                 MOVE  SPACE
                   TO  WK-GYOMU-HYK-KRTU-CD OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
                 MOVE  CNS-MSG-E000451
                   TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
      *---------- フリーメッセージ
                 MOVE  SPACE
                   TO  WK-GYOMU-FREE-MSG    OF  WK-GYOMU-ERR-INFO(CNS-1)
                 MOVE  CNS-ON               TO  FLG-GYOMU-ERR
      *----------  後処理
                 PERFORM  END-RTN
               WHEN  CNS-X-2
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況管理停止判断正常且つ強制停止"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
                 IF  WK-RTN-CODE < CNS-8
                 THEN
                   MOVE  CNS-8           TO  WK-RTN-CODE
                 ELSE
                   CONTINUE
                 END-IF
      *---------- ファンドコード
                 MOVE  SPACE
                   TO  WK-GYOMU-FUND-CD     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- ポートフォリオコード
                 MOVE  SPACE
                   TO  WK-GYOMU-PTF-CD      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 評価系列コード
               MOVE  SPACE
                 TO  WK-GYOMU-HYK-KRTU-CD   OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
                 MOVE  CNS-MSG-E000431
                   TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
      *---------- フリーメッセージ
                 MOVE  SPACE
                   TO  WK-GYOMU-FREE-MSG    OF  WK-GYOMU-ERR-INFO(CNS-1)
                 MOVE  CNS-ON               TO  FLG-GYOMU-ERR
      *----------  後処理
                 PERFORM  END-RTN
               WHEN  CNS-X-3
                 PERFORM  END-RTN
               WHEN OTHER
                 CONTINUE
             END-EVALUATE
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況更新処理1 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-014          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況更新処理1 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       STATUS-KOUSIN-1-EXT.
           EXIT.
      ******************************************************************
      *    3.2.3.１行目にヘッダーの出力処理
      ******************************************************************
       HEADER-OUT-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ヘッダーの出力処理START ***"
      *-----------------------------------------------------------------
      *------------------ <連結障害1077の対応 START>--------------------
      *----------  約定ファイルデータ出力処理
           IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
           THEN
      *------------------ <連結障害493の対応 START>---------------------
             INITIALIZE  DAT-REC
      *------------------ <連結障害493の対応 END>-----------------------
                         WK-HEADER-TITLE
             MOVE  WK-KIKAN-TO-9
               TO  WK-KJN-YMD                 OF  WK-HEADER-TITLE
             MOVE  CNS-X-0
               TO  WK-Y-U-FLG                 OF  WK-HEADER-TITLE
      *------------------ <連結障害493の対応 START>---------------------
             MOVE  WK-HEADER-TITLE            TO  DAT-REC
      *------------------ <連結障害493の対応 END>-----------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC = ["DAT-REC"]"
      *-----------------------------------------------------------------
             PERFORM  DATA-WRITE1-RTN
      *------------------ <連結障害493の対応 START>---------------------
             INITIALIZE  DAT-REC2
      *------------------ <連結障害493の対応 END>-----------------------
                         WK-HEADER-TITLE
             MOVE  WK-KIKAN-TO-9
               TO  WK-KJN-YMD                 OF  WK-HEADER-TITLE
             MOVE  CNS-X-1
               TO  WK-Y-U-FLG                 OF  WK-HEADER-TITLE
      *------------------ <連結障害493の対応 START>---------------------
             MOVE  WK-HEADER-TITLE            TO  DAT-REC2
      *------------------ <連結障害493の対応 END>-----------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC2 = ["DAT-REC2"]"
      *-----------------------------------------------------------------
             PERFORM  DATA-WRITE2-RTN
             INITIALIZE  DAT-REC5
                         WK-HEADER-TITLE
             MOVE  WK-KIKAN-TO-9
               TO  WK-KJN-YMD                 OF  WK-HEADER-TITLE
             MOVE  CNS-X-0
               TO  WK-Y-U-FLG                 OF  WK-HEADER-TITLE
             MOVE  WK-HEADER-TITLE            TO  DAT-REC5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC5 = ["DAT-REC5"]"
      *-----------------------------------------------------------------
             PERFORM  DATA-WRITE5-RTN
             INITIALIZE  DAT-REC6
                         WK-HEADER-TITLE
             MOVE  WK-KIKAN-TO-9
               TO  WK-KJN-YMD                 OF  WK-HEADER-TITLE
             MOVE  CNS-X-1
               TO  WK-Y-U-FLG                 OF  WK-HEADER-TITLE
             MOVE  WK-HEADER-TITLE            TO  DAT-REC6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC6 = ["DAT-REC6"]"
      *-----------------------------------------------------------------
             PERFORM  DATA-WRITE6-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  約定ファイルデータ03出力処理
           IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-1
           THEN
             INITIALIZE  DAT-REC3
                         WK-HEADER-TITLE
             MOVE  WK-KIKAN-TO-9
               TO  WK-KJN-YMD                 OF  WK-HEADER-TITLE
             MOVE  CNS-X-0
               TO  WK-Y-U-FLG                 OF  WK-HEADER-TITLE
             MOVE  WK-HEADER-TITLE            TO  DAT-REC3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC3 = ["DAT-REC3"]"
      *-----------------------------------------------------------------
             PERFORM  DATA-WRITE3-RTN
             INITIALIZE  DAT-REC4
                         WK-HEADER-TITLE
             MOVE  WK-KIKAN-TO-9
               TO  WK-KJN-YMD                 OF  WK-HEADER-TITLE
             MOVE  CNS-X-1
               TO  WK-Y-U-FLG                 OF  WK-HEADER-TITLE
             MOVE  WK-HEADER-TITLE            TO  DAT-REC4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC4 = ["DAT-REC4"]"
      *-----------------------------------------------------------------
             PERFORM  DATA-WRITE4-RTN
             INITIALIZE  DAT-REC7
                         WK-HEADER-TITLE
             MOVE  WK-KIKAN-TO-9
               TO  WK-KJN-YMD                 OF  WK-HEADER-TITLE
             MOVE  CNS-X-0
               TO  WK-Y-U-FLG                 OF  WK-HEADER-TITLE
             MOVE  WK-HEADER-TITLE            TO  DAT-REC7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC7 = ["DAT-REC7"]"
      *-----------------------------------------------------------------
             PERFORM  DATA-WRITE7-RTN
             INITIALIZE  DAT-REC8
                         WK-HEADER-TITLE
             MOVE  WK-KIKAN-TO-9
               TO  WK-KJN-YMD                 OF  WK-HEADER-TITLE
             MOVE  CNS-X-1
               TO  WK-Y-U-FLG                 OF  WK-HEADER-TITLE
             MOVE  WK-HEADER-TITLE            TO  DAT-REC8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC8 = ["DAT-REC8"]"
      *-----------------------------------------------------------------
             PERFORM  DATA-WRITE8-RTN
           ELSE
             CONTINUE
           END-IF
      *------------------ <連結障害1077の対応 END>----------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ヘッダーの出力処理END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       HEADER-OUT-EXT.
           EXIT.
      ******************************************************************
      *    フッターをダウンロードファイルに書き
      ******************************************************************
       FOOT-OUT-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** フッターをダウンロードファイルに"
      D             "書きSTART ***"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU:["WK-WRITE-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU2:["WK-WRITE-KENSUU2"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU3:["WK-WRITE-KENSUU3"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU4:["WK-WRITE-KENSUU4"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU5:["WK-WRITE-KENSUU5"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU6:["WK-WRITE-KENSUU6"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU7:["WK-WRITE-KENSUU7"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU8:["WK-WRITE-KENSUU8"]"
      D    DISPLAY  CNS-PGM-ID":WK-CASH-FLOW-KBN=["WK-CASH-FLOW-KBN"]"
      D    DISPLAY  CNS-PGM-ID":I-FLG-KEISAN:["
      D             I-FLG-KEISAN OF WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
      *------------------ <連結障害1077の対応 START>--------------------
      *----------  約定ファイルデータ出力処理
      *------------------ <連結障害493の対応 START>---------------------
           IF  WK-WRITE-KENSUU > ZERO OR WK-WRITE-KENSUU3 > ZERO
             OR  WK-WRITE-KENSUU5 > ZERO OR  WK-WRITE-KENSUU7 > ZERO
           THEN
             INITIALIZE  DAT-REC
                         DAT-REC3
                         DAT-REC5
                         DAT-REC7
      *------------------ <連結障害493の対応 END>-----------------------
                         WK-FOOT
                         WK-WRITE-TEMP
                         WK-WRITE-TEMP3
             IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
             THEN
               COMPUTE  WK-WRITE-TEMP = WK-WRITE-KENSUU - CNS-1
               COMPUTE  WK-WRITE-TEMP3 = WK-WRITE-KENSUU5 - CNS-1
             ELSE
               COMPUTE  WK-WRITE-TEMP = WK-WRITE-KENSUU3 - CNS-1
               COMPUTE  WK-WRITE-TEMP3 = WK-WRITE-KENSUU7 - CNS-1
             END-IF
             MOVE  WK-WRITE-TEMP
               TO  WK-18-18-X
             PERFORM  ZERO-COMPUTE-RTN
             COMPUTE  WK-NUM-LENGTH = 18 - WK-NUM-1
             MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
               TO  WK-FILE-KENSUU          OF  WK-FOOT
             IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
             THEN
      *------------------ <連結障害493の対応 START>---------------------
               MOVE  WK-FOOT                 TO  DAT-REC
      *------------------ <連結障害493の対応 END>-----------------------
               PERFORM  DATA-WRITE-RTN
             ELSE
               MOVE  WK-FOOT                 TO  DAT-REC3
               PERFORM  DATA-WRITE-3-RTN
             END-IF
             MOVE  WK-WRITE-TEMP3
               TO  WK-18-18-X
             PERFORM  ZERO-COMPUTE-RTN
             COMPUTE  WK-NUM-LENGTH = 18 - WK-NUM-1
             MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
               TO  WK-FILE-KENSUU          OF  WK-FOOT
             IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
             THEN
               MOVE  WK-FOOT                 TO  DAT-REC5
               PERFORM  DATA-WRITE-5-RTN
             ELSE
               MOVE  WK-FOOT                 TO  DAT-REC7
               PERFORM  DATA-WRITE-7-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC = ["DAT-REC"]"
      D    DISPLAY  CNS-PGM-ID":DAT-REC3 = ["DAT-REC3"]"
      D    DISPLAY  CNS-PGM-ID":DAT-REC5 = ["DAT-REC5"]"
      D    DISPLAY  CNS-PGM-ID":DAT-REC7 = ["DAT-REC7"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *----------  受渡ファイルデータ出力処理
      *------------------ <連結障害493の対応 START>---------------------
           IF  WK-WRITE-KENSUU2 > ZERO OR  WK-WRITE-KENSUU4 > ZERO
             OR  WK-WRITE-KENSUU6 > ZERO OR  WK-WRITE-KENSUU8 > ZERO
           THEN
             INITIALIZE  DAT-REC2
                         DAT-REC4
                         DAT-REC6
                         DAT-REC8
      *------------------ <連結障害493の対応 END>-----------------------
                         WK-FOOT
                         WK-WRITE-TEMP2
                         WK-WRITE-TEMP4
             IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
             THEN
               COMPUTE  WK-WRITE-TEMP2 = WK-WRITE-KENSUU2 - CNS-1
               COMPUTE  WK-WRITE-TEMP4 = WK-WRITE-KENSUU6 - CNS-1
             ELSE
               COMPUTE  WK-WRITE-TEMP2 = WK-WRITE-KENSUU4 - CNS-1
               COMPUTE  WK-WRITE-TEMP4 = WK-WRITE-KENSUU8 - CNS-1
             END-IF
             MOVE  WK-WRITE-TEMP2
               TO  WK-18-18-X
             PERFORM  ZERO-COMPUTE-RTN
             COMPUTE  WK-NUM-LENGTH = 18 - WK-NUM-1
             MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
               TO  WK-FILE-KENSUU          OF  WK-FOOT
             IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
             THEN
      *------------------ <連結障害493の対応 START>---------------------
                 MOVE  WK-FOOT                 TO  DAT-REC2
      *------------------ <連結障害493の対応 END>-----------------------
               PERFORM  DATA-WRITE-2-RTN
             ELSE
               MOVE  WK-FOOT                 TO  DAT-REC4
               PERFORM  DATA-WRITE-4-RTN
             END-IF
             MOVE  WK-WRITE-TEMP4
               TO  WK-18-18-X
             PERFORM  ZERO-COMPUTE-RTN
             COMPUTE  WK-NUM-LENGTH = 18 - WK-NUM-1
             MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
               TO  WK-FILE-KENSUU          OF  WK-FOOT
             IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
             THEN
               MOVE  WK-FOOT                 TO  DAT-REC6
               PERFORM  DATA-WRITE-6-RTN
             ELSE
               MOVE  WK-FOOT                 TO  DAT-REC8
               PERFORM  DATA-WRITE-8-RTN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC2 = ["DAT-REC2"]"
      D    DISPLAY  CNS-PGM-ID":DAT-REC4 = ["DAT-REC4"]"
      D    DISPLAY  CNS-PGM-ID":DAT-REC6 = ["DAT-REC6"]"
      D    DISPLAY  CNS-PGM-ID":DAT-REC8 = ["DAT-REC8"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *------------------ <連結障害1077の対応 END>----------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** フッターをダウンロードファイルに"
      D             "書き END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       FOOT-OUT-EXT.
           EXIT.
      ******************************************************************
      *     転送制御ファイル作成
      ******************************************************************
       SCZY7180-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  転送制御ファイル作成 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7180-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-ARGUMENT
             TO  RIYO-CMP-CD            OF  PARM-SCZY7180-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD           OF  WK-ARGUMENT
             TO  SYORI-YMD              OF  PARM-SCZY7180-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-ARGUMENT
             TO  KIDOU-ID               OF  PARM-SCZY7180-ARG1
      *----------  実行処理ID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  JIKOU-SYORI-ID         OF  PARM-SCZY7180-ARG1
      *----------  拠点サーバ区分
           MOVE  CNS-KYOTEN-KBN-02
             TO  KYOTEN-KBN             OF  PARM-SCZY7180-ARG1
      *----------  最大連番
           MOVE  CNS-SAIDAI-RBN-08
             TO  SAIDAI-RBN             OF  PARM-SCZY7180-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7180-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["
      D             RIYO-CMP-CD         OF  PARM-SCZY7180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D             SYORI-YMD           OF  PARM-SCZY7180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID =["
      D             KIDOU-ID            OF  PARM-SCZY7180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":実行処理ID=["
      D             JIKOU-SYORI-ID      OF  PARM-SCZY7180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":拠点サーバ区分=["
      D             KYOTEN-KBN          OF  PARM-SCZY7180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":最大連番=["
      D             SAIDAI-RBN          OF  PARM-SCZY7180-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7180 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7180"             USING  PARM-SCZY7180-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7180 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7180)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             = CNS-RTN-000
           THEN
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":転送制御ファイル作成  正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":転送制御ファイル作成  異常"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-015          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  転送制御ファイル作成 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7180-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.データ出力処理
      ******************************************************************
       DATA-OUT-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** データ出力処理START ***"
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSU=["WK-HIT-KENSU"]"
      *-----------------------------------------------------------------
      *----------  SQL作成(PREPARE)
           PERFORM  CR-PREPARE-2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
      *----------  カーソル作成(DECLARE，OPEN)
           IF  WK-STATUS < CNS-8
           THEN
             PERFORM  CR-OPEN-2-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソル作成しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-8
           THEN
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DATA-OUT-RTN]"                GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             PERFORM  UNTIL
               FLG-STOP-2 = CNS-ON  OR  WK-RTN-CODE = CNS-16
      *----------  カーソルFETCH
               PERFORM  CR-FETCH-2-RTN
      *
               INITIALIZE  HST-TBL-SELECT-2
                           WK-STATUS
                           WK-J
                           FLG-MEISAI-GYOMU-ERR
                           WK-GYOMU-ERR-INFO
                           FLG-FETCH-END2
             END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DATA-OUT-RTN]"                GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN2=["FLG-CR-OPEN2"]"
      *-----------------------------------------------------------------
      *----------  カーソルクローズ処理
           IF  FLG-CR-OPEN2 = CNS-ON
           THEN
             PERFORM  CR-CLOSE-3-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-J=["WK-IDX-J"]"
      D    DISPLAY  CNS-PGM-ID":*** データ出力処理END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-OUT-EXT.
           EXIT.
      ******************************************************************
      *    実行状況管理停止判断
      ******************************************************************
       SCZY7220-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 実行状況管理停止判断 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7220-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7220-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SCZY7220-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7220-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7220-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7220-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7220-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7220  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7220"             USING  PARM-SCZY7220-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7220  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7220)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SOKO-KANO-KBN =["
      D                         SOKO-KANO-KBN OF PARM-SCZY7220-ARG2 "]"
      *-----------------------------------------------------------------
      *----------  実行可能区分
             EVALUATE  SOKO-KANO-KBN OF PARM-SCZY7220-ARG2
               WHEN  CNS-X-0
                 MOVE  ZERO             TO  WK-STOP-KENSUU
               WHEN  CNS-X-1
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況管理停止判断正常且つ一時停止"
      *-----------------------------------------------------------------
                 MOVE  CNS-10              TO  WK-RTN-CODE
                 MOVE  CNS-10              TO  WK-1190-STATUS
                 MOVE  ZERO                TO  WK-J
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-1190-STATUS=["WK-1190-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
                   COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
                 MOVE  WK-FUND-CD-DETAIL   OF  WK-PTF-ATT-DATA(WK-IDX-J)
                   TO  WK-GYOMU-FUND-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
                 MOVE  WK-PTF-CD-DETAIL    OF  WK-PTF-ATT-DATA(WK-IDX-J)
                   TO  WK-GYOMU-PTF-CD     OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
                 MOVE  WK-DEFAUL-THYK-CD   OF  WK-PTF-ATT-DATA(WK-IDX-J)
                   TO  WK-GYOMU-HYK-KRTU-CD OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
                 MOVE  CNS-MSG-E000451
                   TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
                 MOVE  WK-KIKAN-FR
                   TO  WK-GYOMU-KJN-YMD-FROM
                                            OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
                 MOVE  WK-KIKAN-TO
                   TO  WK-GYOMU-KJN-YMD-TO  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
                 MOVE  SPACE
                   TO  WK-GYOMU-FREE-MSG    OF  WK-GYOMU-ERR-INFO(WK-J)
                 MOVE  CNS-ON               TO  FLG-GYOMU-ERR
      *----------  進捗管理ＩＮＳＵＰＤルーチン OLD.基準日
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             WK-GYOMU-TASK-ID       OF  WK-ARGUMENT"]"
      *-----------------------------------------------------------------
                 IF  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
                     =  CNS-TASK-T7080US
                 THEN
                   PERFORM  SUSC0405-OLD-RTN
      *----------  ＤＢ コミット処理
                   PERFORM  DB-COMMIT1-RTN
                 ELSE
                   CONTINUE
                 END-IF
      *----------  後処理
                 IF  WK-RTN-CODE NOT = CNS-RTN-BT16
                 THEN
      *----------  後処理
                   PERFORM  END-RTN
                 ELSE
      *----------  エラー処理
                   PERFORM  ERR-RTN
                 END-IF
               WHEN  CNS-X-2
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況管理停止判断正常且つ強制停止"
      *-----------------------------------------------------------------
                 MOVE  CNS-8               TO  WK-RTN-CODE
                 MOVE  CNS-8               TO  WK-1190-STATUS
                 MOVE  ZERO                TO  WK-J
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-1190-STATUS=["WK-1190-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
                   COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
                 MOVE  WK-FUND-CD-DETAIL   OF  WK-PTF-ATT-DATA(WK-IDX-J)
                   TO  WK-GYOMU-FUND-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
                 MOVE  WK-PTF-CD-DETAIL    OF  WK-PTF-ATT-DATA(WK-IDX-J)
                   TO  WK-GYOMU-PTF-CD     OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
                 MOVE  WK-DEFAUL-THYK-CD   OF  WK-PTF-ATT-DATA(WK-IDX-J)
                   TO  WK-GYOMU-HYK-KRTU-CD OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
                 MOVE  CNS-MSG-E000431
                   TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
                 MOVE  WK-KIKAN-FR
                   TO  WK-GYOMU-KJN-YMD-FROM
                                            OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
                 MOVE  WK-KIKAN-TO
                   TO  WK-GYOMU-KJN-YMD-TO  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
                 MOVE  SPACE
                   TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
                 MOVE  SPACE
                   TO  WK-GYOMU-FREE-MSG    OF  WK-GYOMU-ERR-INFO(WK-J)
                 MOVE  CNS-ON               TO  FLG-GYOMU-ERR
      *----------  進捗管理ＩＮＳＵＰＤルーチン OLD.基準日
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             WK-GYOMU-TASK-ID       OF  WK-ARGUMENT"]"
      *-----------------------------------------------------------------
                 IF  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
                     =  CNS-TASK-T7080US
                 THEN
                   PERFORM  SUSC0405-OLD-RTN
      *----------  ＤＢ コミット処理
                   PERFORM  DB-COMMIT1-RTN
                 ELSE
                   CONTINUE
                 END-IF
      *----------  後処理
                 IF  WK-RTN-CODE NOT = CNS-RTN-BT16
                 THEN
      *----------  後処理
                   PERFORM  END-RTN
                 ELSE
      *----------  エラー処理
                   PERFORM  ERR-RTN
                 END-IF
               WHEN OTHER
                 CONTINUE
             END-EVALUATE
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 実行状況管理停止判断 エラー ***"
      *-----------------------------------------------------------------
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
             PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-016          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD
               OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STOP-KENSUU=["WK-STOP-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":*** 実行状況管理停止判断  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7220-EXT.
           EXIT.
      ******************************************************************
      *    エラー1情報追加処理
      ******************************************************************
       ERR-INFO-ADD-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー1情報追加処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-ON                 TO  FLG-SYSTEM-ERR
      *---------- エラーリターンパッケージ
           INITIALIZE  PARM-SCZY1170-IN
           MOVE  WK-SYS-ERR-INFO        TO  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-ARG1              =["
      D             PARM-SCZY1170-ARG1                        "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  エラー1情報追加処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-INFO-ADD-EXT.
           EXIT.
      ******************************************************************
      *    SQL作成（PREPARE）
      ******************************************************************
       CR-PREPARE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL作成(PREPARE)  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT-S
                       HST-SELECT-WHERE
                       WK-SELECT-FREE-MSG
      *----------  テーブルTKUSZT01
           MOVE  WK-TBL-TKUSZT01
             TO  SQL-TBL-TKUSZT01       OF  SQL-SELECT
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-SELECT-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD-DETAIL      OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-SELECT-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD-DETAIL       OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-SELECT-WHERE
      *----------  テーマ2693対応
      *----------  期間FROM
           MOVE  WK-KZYN-YMD-FROM       OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-KIKAN-FR             OF  HST-SELECT-WHERE
      *----------  期間TO
           MOVE  WK-KZYN-YMD-TO         OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-KIKAN-TO             OF  HST-SELECT-WHERE
      *----------  テーマ2693対応
      *----------  評価系列コード
           MOVE  WK-DEFAUL-THYK-CD      OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-HYK-KRTU-CD          OF  HST-SELECT-WHERE
      *----------  残高日付
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT-2
             TO  H-ZANTK-YMD            OF  HST-SELECT-WHERE
           STRING  SQL-SELECT
                   DELIMITED BY SIZE
                   INTO SQLSTMT-S
           END-STRING
           STRING SQLSTMT-S(1:FUNCTION  LENGTH(SQL-SELECT))
                "[:V1="
                 H-RIYO-CMP-CD        OF  HST-SELECT-WHERE
                "][:V2="
                 H-FUND-CD            OF  HST-SELECT-WHERE
                "][:V3="
                 H-PTF-CD             OF  HST-SELECT-WHERE
                "][:V4="
                 H-KIKAN-FR           OF  HST-SELECT-WHERE
                "][:V5="
                 H-KIKAN-TO           OF  HST-SELECT-WHERE
                "][:V6="
                 H-HYK-KRTU-CD        OF  HST-SELECT-WHERE
                "][:V7="
                 H-ZANTK-YMD          OF  HST-SELECT-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-SELECT-FREE-MSG
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "テーブルTKUSZT01 =["
      D             SQL-TBL-TKUSZT01       OF  SQL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コードH-RIYO-CMP-CD =["
      D                 H-RIYO-CMP-CD      OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコードH-FUND-CD     =["
      D                 H-FUND-CD          OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコードH-PTF-CD      =["
      D                 H-PTF-CD           OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":残高日付FR H-KIKAN-FR      =["
      D                 H-KIKAN-FR         OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":残高日付TO H-KIKAN-TO      =["
      D                 H-KIKAN-TO         OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":評価系列コードH-HYK-KRTU-CD      =["
      D                 H-HYK-KRTU-CD      OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":残高日付H-ZANTK-YMD      =["
      D                 H-ZANTK-YMD        OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-S      =["SQLSTMT-S"]"
      D    DISPLAY  CNS-PGM-ID":WK-SELECT-FREE-MSG =["
      D             WK-SELECT-FREE-MSG"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  SS  FROM  :SQLSTMT-S
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
               MOVE  CNS-16             TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-017        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL作成(PREPARE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    カーソル作成（DECLARE，OPEN）
      ******************************************************************
       CR-OPEN-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カーソル作成(DECLARE，OPEN)  START  ***"
      *-----------------------------------------------------------------
      *----------DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR  CURSOR  FOR  SS
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------OPEN    CURSOR
           EXEC  SQL
             OPEN  CR
           USING  :HST-SELECT-WHERE.H-RIYO-CMP-CD,
                  :HST-SELECT-WHERE.H-FUND-CD,
                  :HST-SELECT-WHERE.H-PTF-CD,
                  :HST-SELECT-WHERE.H-KIKAN-FR,
                  :HST-SELECT-WHERE.H-KIKAN-TO,
                  :HST-SELECT-WHERE.H-HYK-KRTU-CD,
                  :HST-SELECT-WHERE.H-ZANTK-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR OPEN)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON               TO  FLG-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN =["FLG-CR-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-STOP =["FLG-STOP"]"
      *-----------------------------------------------------------------
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-018          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG   TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カーソル作成(DECLARE，OPEN)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソル（FETCH）
      ******************************************************************
       CR-FETCH-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(FETCH)  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  HST-TBL-SELECT
                       WK-REC
                       FLG-DATA-OUT
           MOVE  WK-YJ-UW-KBN-NEW     TO  WK-YJ-UW-KBN-OLD
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH CR
             INTO  :HST-TBL-SELECT.H-RIYO-CMP-CD,
                   :HST-TBL-SELECT.H-FUND-CD,
                   :HST-TBL-SELECT.H-PTF-CD,
                   :HST-TBL-SELECT.H-YJ-UW-KBN,
                   :HST-TBL-SELECT.H-ZANTK-YMD,
                   :HST-TBL-SELECT.H-KSN-YMD-DMN-KBN,
                   :HST-TBL-SELECT.H-HYK-KRTU-CD,
                   :HST-TBL-SELECT.H-SEC-SBT-CD,
                   :HST-TBL-SELECT.H-DEL-KBN,
                   :HST-TBL-SELECT.H-KT-KBN,
                   :HST-TBL-SELECT.H-TRHK-TUKA,
                   :HST-TBL-SELECT.H-KWS-TH-TUKA-CD,
                   :HST-TBL-SELECT.H-HAKO-CD,
                   :HST-TBL-SELECT.H-MEG-CD,
                   :HST-TBL-SELECT.H-TATE-FLG,
                   :HST-TBL-SELECT.H-TG-YKJ-YMD,
                   :HST-TBL-SELECT.H-KB-KANRI-ID,
                   :HST-TBL-SELECT.H-CAST-CD,
                   :HST-TBL-SELECT.H-HOU-SURYO,
                   :HST-TBL-SELECT.H-SURYO-TANI,
                   :HST-TBL-SELECT.H-THTK-ST-KNG,
                   :HST-TBL-SELECT.H-THTK-ST-TNK,
                   :HST-TBL-SELECT.H-CP-KRTU-CD,
                   :HST-TBL-SELECT.H-CP-SAIYO-YMD,
                   :HST-TBL-SELECT.H-CP-SAIYO-SIJO,
                   :HST-TBL-SELECT.H-THTK-HYK-KN,
                   :HST-TBL-SELECT.H-THTK-HYK-SNEKI,
                   :HST-TBL-SELECT.H-THTK-PPAYZN,
                   :HST-TBL-SELECT.H-THTK-KKRS,
                   :HST-TBL-SELECT.H-THTK-MS-EKI,
                   :HST-TBL-SELECT.H-HYK-KWS,
                   :HST-TBL-SELECT.H-KWS-SAIYO-YMD,
                   :HST-TBL-SELECT.H-KWS-SAIYO-SOURCE,
                   :HST-TBL-SELECT.H-UYTK-KWS-BOKAZN,
                   :HST-TBL-SELECT.H-SHTK-KN-LC,
                   :HST-TBL-SELECT.H-UYTK-ST-TNK,
                   :HST-TBL-SELECT.H-HYK-KN-LC,
                   :HST-TBL-SELECT.H-HYK-SNEKI-LC,
                   :HST-TBL-SELECT.H-UYTK-PPAY-ZN,
                   :HST-TBL-SELECT.H-KEKA-RSK-LC,
                   :HST-TBL-SELECT.H-UYTK-MS-EKI,
                   :HST-TBL-SELECT.H-BIKOU-1,
                   :HST-TBL-SELECT.H-BIKOU-2,
                   :HST-TBL-SELECT.H-BIKOU-3,
                   :HST-TBL-SELECT.H-BIKOU-4,
                   :HST-TBL-SELECT.H-BIKOU-5,
                   :HST-TBL-SELECT.H-BIKOU-6,
                   :HST-TBL-SELECT.H-BIKOU-7,
                   :HST-TBL-SELECT.H-BIKOU-8,
                   :HST-TBL-SELECT.H-BIKOU-9,
                   :HST-TBL-SELECT.H-TS-TARGET-KUNI,
                   :HST-TBL-SELECT.H-SJTK-MBHY-ZN,
                   :HST-TBL-SELECT.H-UYTK-MBHY-ZN,
                   :HST-TBL-SELECT.H-TGYOKU-KWS-RATE,
                   :HST-TBL-SELECT.H-THTK-TG-YJKN-ZN,
                   :HST-TBL-SELECT.H-UYTK-TG-YJKN-ZN,
                   :HST-TBL-SELECT.H-THTK-TG-TSR-ZN,
                   :HST-TBL-SELECT.H-UYTK-TG-TSR-ZN,
                   :HST-TBL-SELECT.H-THTK-TG-S-TAX-ZN,
                   :HST-TBL-SELECT.H-UYTK-TG-S-TAX-ZN,
                   :HST-TBL-SELECT.H-THTK-TG-ELS-HIYO-ZN,
                   :HST-TBL-SELECT.H-UYTK-TG-ELS-HIYO-ZN,
                   :HST-TBL-SELECT.H-THTK-TG-SSKG-ZN,
                   :HST-TBL-SELECT.H-UYTK-TG-SSKG-ZN,
                   :HST-TBL-SELECT.H-THTK-AREC-ZN,
                   :HST-TBL-SELECT.H-UYTK-AREC-ZN,
                   :HST-TBL-SELECT.H-THTK-SPAY-ZN,
                   :HST-TBL-SELECT.H-UYTK-SPAY-ZN,
                   :HST-TBL-SELECT.H-THTK-GSZ,
                   :HST-TBL-SELECT.H-GENSEN-TAX-LC,
                   :HST-TBL-SELECT.H-THTK-GSZKP-YT-ZN,
                   :HST-TBL-SELECT.H-UYTK-GSZKP-YT-ZN,
                   :HST-TBL-SELECT.H-BOKA-KWS,
                   :HST-TBL-SELECT.H-THTK-IKAN-HYK-SEZN,
                   :HST-TBL-SELECT.H-UYTK-IKAN-HYK-SEZN,
                   :HST-TBL-SELECT.H-SJTK-IKAN-MSSHEKI,
                   :HST-TBL-SELECT.H-UYTK-IKAN-MSSHEKI,
                   :HST-TBL-SELECT.H-UYTK-IKAN-PPHKZN,
                   :HST-TBL-SELECT.H-OP-TATE-FLG,
                   :HST-TBL-SELECT.H-JIKA-KRTU-CD,
                   :HST-TBL-SELECT.H-SKYU-UMU-FLG,
                   :HST-TBL-SELECT.H-JIKA-SHRU,
                   :HST-TBL-SELECT.H-SOURCE-KBN,
                   :HST-TBL-SELECT.H-UYTK-KPPAY-HYK-GK,
                   :HST-TBL-SELECT.H-UYTK-PPAY-SNEKI,
                   :HST-TBL-SELECT.H-MS-SHEKI-HYK-KWS,
                   :HST-TBL-SELECT.H-GENS-TAX-HYK-KWS,
                   :HST-TBL-SELECT.H-DATA-KBN,
                   :HST-TBL-SELECT.H-SYOHIN-KBN,
                   :HST-TBL-SELECT.H-REP-KBN,
                   :HST-TBL-SELECT.H-KODE-1,
                   :HST-TBL-SELECT.H-SUJI-11,
                   :HST-TBL-SELECT.H-SUJI-12,
                   :HST-TBL-SELECT.H-SUJI-13,
                   :HST-TBL-SELECT.H-KODE-2,
                   :HST-TBL-SELECT.H-SUJI-21,
                   :HST-TBL-SELECT.H-SUJI-22,
                   :HST-TBL-SELECT.H-SUJI-23,
                   :HST-TBL-SELECT.H-KODE-3,
                   :HST-TBL-SELECT.H-SUJI-31,
                   :HST-TBL-SELECT.H-SUJI-32,
                   :HST-TBL-SELECT.H-SUJI-33,
                   :HST-TBL-SELECT.H-YOBI1,
                   :HST-TBL-SELECT.H-YOBI2,
                   :HST-TBL-SELECT.H-SK-FLG,
                   :HST-TBL-SELECT.H-SK-GAMEN,
                   :HST-TBL-SELECT.H-SK-FILE,
                   :HST-TBL-SELECT.H-SK-DATE,
                   :HST-TBL-SELECT.H-SK-LOGIN-CMP-CD,
                   :HST-TBL-SELECT.H-SK-SID,
                   :HST-TBL-SELECT.H-SK-PGMID,
                   :HST-TBL-SELECT.H-UPD-FLG,
                   :HST-TBL-SELECT.H-UPD-GAMEN,
                   :HST-TBL-SELECT.H-UPD-FILE,
                   :HST-TBL-SELECT.H-UPD-DATE,
                   :HST-TBL-SELECT.H-UPD-LOGIN-CMP-CD,
                   :HST-TBL-SELECT.H-UPD-SID,
                   :HST-TBL-SELECT.H-UPD-PGMID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR FETCH)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               PERFORM  FETCH-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-FETCH-KENSUU =["WK-FETCH-KENSUU"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON                   TO  FLG-STOP
               IF  WK-SELECT-KENSUU NOT = ZERO
               THEN
                 PERFORM  BREAK3-RTN
                 PERFORM  BREAK2-RTN
                 PERFORM  BREAK2-2-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-019              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900              TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE                  TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG       TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(FETCH)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    FETCH-GET NORMAL
      ******************************************************************
       FETCH-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  FETCH-GET NORMAL  START  ***"
      *-----------------------------------------------------------------
           PERFORM  WORK-OPERATION-RTN
           IF  WK-STATUS < CNS-16
           THEN
      *------------------ <残タスク129の対応 END>-----------------------
      *---------- ワークブレイクキーNEW.基準日
             MOVE  H-SEC-SBT-CD
               TO  WK-SEC-SBT-CD-NEW
             MOVE  H-TRHK-TUKA            OF  HST-TBL-SELECT
               TO  WK-TRHK-TUKA-NEW
             MOVE  H-YJ-UW-KBN
               TO  WK-YJ-UW-KBN-NEW
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-SWK-KJN-PTN-CD= ["
      D             WK-SWK-KJN-PTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-YKJ-SYUGI-KAIKEI= ["
      D             WK-YKJ-SYUGI-KAIKEI"]"
      *-----------------------------------------------------------------
             IF  WK-SWK-KJN-PTN-CD(CNS-1:CNS-1)  =  CNS-TEXT-T
              AND  WK-YKJ-SYUGI-KAIKEI  NOT =  CNS-X-1
             THEN
               MOVE  H-MEG-CD             OF  HST-TBL-SELECT
                 TO  WK-MEG-CD-NEW
               MOVE  H-TATE-FLG           OF  HST-TBL-SELECT
                 TO  WK-TATE-FLG-NEW
             ELSE
               MOVE  SPACE
                 TO  WK-MEG-CD-NEW
               MOVE  SPACE
                 TO  WK-TATE-FLG-NEW
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-CD-NEW =["
      D             WK-SEC-SBT-CD-NEW "]"
      D    DISPLAY  CNS-PGM-ID":WK-TRHK-TUKA-NEW=[" WK-TRHK-TUKA-NEW "]"
      D    DISPLAY  CNS-PGM-ID":WK-MEG-CD-NEW=[" WK-MEG-CD-NEW "]"
      D    DISPLAY  CNS-PGM-ID":WK-TATE-FLG-NEW=[" WK-TATE-FLG-NEW "]"
      *-----------------------------------------------------------------
      *----------  ワーク取得件数
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-SELECT-KENSUU = ["WK-SELECT-KENSUU"]"
      *-----------------------------------------------------------------
             IF  WK-SELECT-KENSUU = CNS-1
             THEN
               MOVE  WK-SEC-SBT-CD-NEW    TO  WK-SEC-SBT-CD-OLD
               MOVE  WK-TRHK-TUKA-NEW     TO  WK-TRHK-TUKA-OLD
               MOVE  WK-MEG-CD-NEW        TO  WK-MEG-CD-OLD
               MOVE  WK-TATE-FLG-NEW      TO  WK-TATE-FLG-OLD
             ELSE
               CONTINUE
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-BREAK-KEY-NEW = ["WK-BREAK-KEY-NEW"]"
      D    DISPLAY  CNS-PGM-ID":WK-BREAK-KEY-OLD = ["WK-BREAK-KEY-OLD"]"
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-CD-OLD=["WK-SEC-SBT-CD-OLD"]"
      *-----------------------------------------------------------------
             IF  (WK-MEG-CD-OLD  NOT = WK-MEG-CD-NEW
              OR  WK-SEC-SBT-CD-OLD  NOT = WK-SEC-SBT-CD-NEW
              OR  WK-TRHK-TUKA-OLD  NOT = WK-TRHK-TUKA-NEW
              OR  WK-TATE-FLG-OLD  NOT =  WK-TATE-FLG-NEW)
             THEN
               PERFORM  BREAK3-RTN
             ELSE
               CONTINUE
             END-IF
             IF  (WK-TRHK-TUKA-OLD  NOT = WK-TRHK-TUKA-NEW
              OR  WK-SEC-SBT-CD-OLD  NOT = WK-SEC-SBT-CD-NEW)
             THEN
               PERFORM  BREAK2-RTN
             ELSE
               CONTINUE
             END-IF
             IF  (WK-TRHK-TUKA-OLD  NOT = WK-TRHK-TUKA-NEW)
             THEN
               PERFORM  BREAK2-2-RTN
             ELSE
               CONTINUE
             END-IF
             MOVE  WK-BREAK-KEY-NEW  TO  WK-BREAK-KEY-OLD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS = ["  WK-STATUS "]"
      D    DISPLAY  CNS-PGM-ID":WK-GYOMU-TASK-ID = ["
      D             WK-GYOMU-TASK-ID       OF  WK-ARGUMENT"]"
      *-----------------------------------------------------------------
             IF  WK-STATUS < CNS-8
             THEN
      *----------   ディテール行を編集する
               PERFORM  DATA-EDIT-RTN
               IF  WK-STATUS < CNS-4
               THEN
      *----------   未収金、未払金の処理
                 PERFORM  UYTK-SJTK-RTN
      *----------   未払費用の処理
                 PERFORM  SJTK-MBHY-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-YJ-UW-KBN = ["  H-YJ-UW-KBN "]"
      *-----------------------------------------------------------------
      *------------------ <連結障害841の対応 START>---------------------
                 IF  H-YJ-UW-KBN = SPACE  AND  FLG-DATA-OUT  =  CNS-OFF
                 THEN
      *----------  ワーク実行ステータス
                   IF  WK-STATUS  < CNS-4
                   THEN
                     MOVE  CNS-4            TO  WK-STATUS
                   ELSE
                     CONTINUE
                   END-IF
      *----------  1190実行ステータス
                   IF   WK-STATUS > WK-1190-STATUS
                   THEN
                     MOVE  WK-STATUS        TO  WK-1190-STATUS
                   ELSE
                     CONTINUE
                   END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
                   IF  WK-RTN-CODE < WK-STATUS
                   THEN
                     MOVE  WK-STATUS        TO  WK-RTN-CODE
                   ELSE
                     CONTINUE
                   END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
                   COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
                   MOVE  WK-FUND-CD-DETAIL OF  WK-PTF-ATT-DATA(WK-IDX-J)
                     TO  WK-GYOMU-FUND-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
                   MOVE  WK-PTF-CD-DETAIL  OF  WK-PTF-ATT-DATA(WK-IDX-J)
                     TO  WK-GYOMU-PTF-CD   OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
                   MOVE  WK-DEFAUL-THYK-CD OF  WK-PTF-ATT-DATA(WK-IDX-J)
                     TO  WK-GYOMU-HYK-KRTU-CD OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
                   MOVE  CNS-MSG-E000090
                     TO  WK-GYOMU-MSG-ID   OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
                   MOVE  WK-KIKAN-FR
                     TO  WK-GYOMU-KJN-YMD-FROM
                           OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
                   MOVE  WK-KIKAN-TO
                     TO  WK-GYOMU-KJN-YMD-TO
                           OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
                   MOVE  CNS-YAKU-UKE-KBN
                     TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
                   MOVE  SPACE
                     TO  WK-GYOMU-FREE-MSG OF  WK-GYOMU-ERR-INFO(WK-J)
                   MOVE  CNS-ON            TO  FLG-MEISAI-GYOMU-ERR
                   MOVE  CNS-ON            TO  FLG-DATA-OUT
                 ELSE
                   CONTINUE
                 END-IF
      *------------------ <連結障害841の対応 END>-----------------------
                 IF  FLG-DATA-OUT  =  CNS-OFF
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-YJ-UW-KBN=["H-YJ-UW-KBN"]"
      D    DISPLAY  CNS-PGM-ID":WK-CASH-FLOW-KBN=["WK-CASH-FLOW-KBN"]"
      D    DISPLAY  CNS-PGM-ID":I-FLG-KEISAN=["
      D             I-FLG-KEISAN          OF WK-DENBUN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":WK-HOU-SURYO=["WK-HOU-SURYO"]"
      D    DISPLAY  CNS-PGM-ID":WK-THTK-ST-KNG=["WK-THTK-ST-KNG"]"
      D    DISPLAY  CNS-PGM-ID":WK-THTK-HYK-KN=["WK-THTK-HYK-KN"]"
      D    DISPLAY  CNS-PGM-ID":H-THTK-HYK-SNEKI=["H-THTK-HYK-SNEKI"]"
      D    DISPLAY  CNS-PGM-ID":H-THTK-PPAYZN=["H-THTK-PPAYZN"]"
      D    DISPLAY  CNS-PGM-ID":H-THTK-KKRS=["H-THTK-KKRS"]"
      D    DISPLAY  CNS-PGM-ID":H-THTK-MS-EKI=["H-THTK-MS-EKI"]"
      D    DISPLAY  CNS-PGM-ID":H-SHTK-KN-LC=["H-SHTK-KN-LC"]"
      D    DISPLAY  CNS-PGM-ID":WK-HYK-KN-LC=["WK-HYK-KN-LC"]"
      D    DISPLAY  CNS-PGM-ID":H-HYK-SNEKI-LC=["H-HYK-SNEKI-LC"]"
      D    DISPLAY  CNS-PGM-ID":H-UYTK-PPAY-ZN=["H-UYTK-PPAY-ZN"]"
      D    DISPLAY  CNS-PGM-ID":H-KEKA-RSK-LC=["H-KEKA-RSK-LC"]"
      D    DISPLAY  CNS-PGM-ID":H-UYTK-MS-EKI=["H-UYTK-MS-EKI"]"
      D    DISPLAY  CNS-PGM-ID":WK-BIKOU-1=["WK-BIKOU-1"]"
      D    DISPLAY  CNS-PGM-ID":H-BIKOU-2=["H-BIKOU-2"]"
      D    DISPLAY  CNS-PGM-ID":H-BIKOU-3=["H-BIKOU-3"]"
      D    DISPLAY  CNS-PGM-ID":H-BIKOU-4=["H-BIKOU-4"]"
      D    DISPLAY  CNS-PGM-ID":H-BIKOU-5=["H-BIKOU-5"]"
      D    DISPLAY  CNS-PGM-ID":H-BIKOU-6=["H-BIKOU-6"]"
      D    DISPLAY  CNS-PGM-ID":H-BIKOU-7=["H-BIKOU-7"]"
      D    DISPLAY  CNS-PGM-ID":H-BIKOU-8=["H-BIKOU-8"]"
      D    DISPLAY  CNS-PGM-ID":H-BIKOU-9=["H-BIKOU-9"]"
      *-----------------------------------------------------------------
                   IF  WK-HOU-SURYO NOT = ZERO
                    OR WK-THTK-ST-KNG NOT = ZERO
                    OR WK-THTK-HYK-KN NOT = ZERO
                    OR H-THTK-HYK-SNEKI NOT = ZERO
                    OR H-THTK-PPAYZN NOT = ZERO
                    OR H-THTK-KKRS NOT = ZERO
                    OR H-THTK-MS-EKI NOT = ZERO
                    OR H-SHTK-KN-LC NOT = ZERO
                    OR WK-HYK-KN-LC NOT = ZERO
                    OR H-HYK-SNEKI-LC NOT = ZERO
                    OR H-UYTK-PPAY-ZN NOT = ZERO
                    OR H-KEKA-RSK-LC NOT = ZERO
                    OR H-UYTK-MS-EKI NOT = ZERO
                    OR (WK-BIKOU-1 NOT = ZERO
                     AND WK-BIKOU-1 NOT = SPACE)
                    OR (H-BIKOU-2 NOT = ZERO
                     AND H-BIKOU-2 NOT = SPACE)
                    OR (H-BIKOU-3 NOT = ZERO
                     AND H-BIKOU-3 NOT = SPACE)
                    OR (H-BIKOU-4 NOT = ZERO
                     AND H-BIKOU-4 NOT = SPACE)
                    OR H-BIKOU-5 NOT = ZERO
                    OR H-BIKOU-6 NOT = ZERO
                    OR H-BIKOU-7 NOT = ZERO
                    OR H-BIKOU-8 NOT = ZERO
                    OR H-BIKOU-9 NOT = ZERO
                  THEN
                     EVALUATE  H-YJ-UW-KBN
                       WHEN  CNS-X-1
                         IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                         THEN
                           IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                           THEN
      *------------------ <連結障害1077の対応 START>--------------------
                             INITIALIZE  DAT-REC
                             MOVE  WK-REC             TO  DAT-REC
      *------------------ <連結障害1077の対応 END>----------------------
                             PERFORM  DATA-WRITE-RTN
                           ELSE
                             INITIALIZE  DAT-REC3
                             MOVE  WK-REC             TO  DAT-REC3
                             PERFORM  DATA-WRITE-3-RTN
                           END-IF
                         ELSE
                           IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                           THEN
                             INITIALIZE  DAT-REC5
                             MOVE  WK-REC             TO  DAT-REC5
                             PERFORM  DATA-WRITE-5-RTN
                           ELSE
                             INITIALIZE  DAT-REC7
                             MOVE  WK-REC             TO  DAT-REC7
                             PERFORM  DATA-WRITE-7-RTN
                           END-IF
                         END-IF
                       WHEN  CNS-X-2
                         IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                         THEN
                           IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                           THEN
      *------------------ <連結障害1077の対応 START>--------------------
                             INITIALIZE  DAT-REC2
                             MOVE  WK-REC             TO  DAT-REC2
      *------------------ <連結障害1077の対応 END>----------------------
                             PERFORM  DATA-WRITE-2-RTN
                           ELSE
                             INITIALIZE  DAT-REC4
                             MOVE  WK-REC             TO  DAT-REC4
                             PERFORM  DATA-WRITE-4-RTN
                           END-IF
                         ELSE
                           IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                           THEN
                             INITIALIZE  DAT-REC6
                             MOVE  WK-REC             TO  DAT-REC6
                             PERFORM  DATA-WRITE-6-RTN
                           ELSE
                             INITIALIZE  DAT-REC8
                             MOVE  WK-REC             TO  DAT-REC8
                             PERFORM  DATA-WRITE-8-RTN
                           END-IF
                         END-IF
                       WHEN  OTHER
                         CONTINUE
                     END-EVALUATE
                   ELSE
                     CONTINUE
                   END-IF
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
                 CONTINUE
               END-IF
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** DBデータ編集しない ****"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-MEISAI-GYOMU-ERR = ["
      D                         FLG-MEISAI-GYOMU-ERR "]"
      *-----------------------------------------------------------------
      *----------  業務エラー1処理
           IF  FLG-MEISAI-GYOMU-ERR = CNS-ON
           THEN
             PERFORM  GYOMU-ERR-1-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 業務エラー1処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  FETCH-GET NORMAL  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       FETCH-GET-EXT.
           EXIT.
      ******************************************************************
      *    ワーク セット
      ******************************************************************
       WORK-OPERATION-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワーク セット  START  ***"
      *-----------------------------------------------------------------
      *---------- ワーク取得件数
           COMPUTE  WK-FETCH-KENSUU  = WK-FETCH-KENSUU  + CNS-1
           COMPUTE  WK-SELECT-KENSUU = WK-SELECT-KENSUU + CNS-1
           COMPUTE  WK-STOP-KENSUU = WK-STOP-KENSUU + CNS-1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STOP-KENSUU=["WK-STOP-KENSUU"]"
      *-----------------------------------------------------------------
           IF  WK-STOP-KENSUU >= CNS-100
           THEN
      *---------- 実行状況管理停止判断
             PERFORM  SCZY7220-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況管理停止  しない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *------------------ <残タスク129の対応 START>---------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "CALL SUSC0057  START"
      D    DISPLAY  CNS-PGM-ID":処理前の利用会社コード"
      D             "=["H-RIYO-CMP-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前のファンドコード"
      D             "=["H-FUND-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前のポートフォリオコード"
      D             "=["H-PTF-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の約定受渡区分"
      D             "=["H-YJ-UW-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の残高日付"
      D             "=["H-ZANTK-YMD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の決算日断面区分"
      D             "=["H-KSN-YMD-DMN-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の評価系列コード"
      D             "=["H-HYK-KRTU-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の証券種別コード"
      D             "=["H-SEC-SBT-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の取消フラグ"
      D             "=["H-DEL-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の確定フラグ"
      D             "=["H-KT-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の取引通貨"
      D             "=["H-TRHK-TUKA OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の為替取引決済通貨"
      D             "=["H-KWS-TH-TUKA-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の発行国コード"
      D             "=["H-HAKO-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の銘柄コード"
      D             "=["H-MEG-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の資産負債・買建売建フラグ"
      D             "=["H-TATE-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の個別建玉約定日"
      D             "=["H-TG-YKJ-YMD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の個別玉管理番号"
      D             "=["H-KB-KANRI-ID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前のカストディコード"
      D             "=["H-CAST-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の保有数量"
      D             "=["H-HOU-SURYO OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数量単位"
      D             "=["H-SURYO-TANI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の取得金額取引通貨"
      D             "=["H-THTK-ST-KNG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の取得単価取引通貨"
      D             "=["H-THTK-ST-TNK OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の時価取引通貨"
      D             "=["H-CP-KRTU-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の時価採用日付"
      D             "=["H-CP-SAIYO-YMD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の時価採用市場"
      D             "=["H-CP-SAIYO-SIJO OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の評価金額取引通貨"
      D             "=["H-THTK-HYK-KN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の評価損益取引通貨"
      D             "=["H-THTK-HYK-SNEKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の前払金残取引通貨"
      D             "=["H-THTK-PPAYZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の経過利息金額取引通貨"
      D             "=["H-THTK-KKRS   OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の未収収益取引通貨"
      D             "=["H-THTK-MS-EKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の評価為替レート"
      D             "=["H-HYK-KWS OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の為替採用日付"
      D             "=["H-KWS-SAIYO-YMD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の為替採用ソース"
      D             "=["H-KWS-SAIYO-SOURCE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の取得金額運用通貨為替換算額"
      D             "=["H-UYTK-KWS-BOKAZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の取得金額運用通貨"
      D             "=["H-SHTK-KN-LC OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の取得単価運用通貨"
      D             "=["H-UYTK-ST-TNK OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の評価金額運用通貨"
      D             "=["H-HYK-KN-LC OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の評価損益運用通貨"
      D             "=["H-HYK-SNEKI-LC OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の前払金残運用通貨"
      D             "=["H-UYTK-PPAY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の経過利息金額運用通貨"
      D             "=["H-KEKA-RSK-LC  OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の未収収益運用通貨"
      D             "=["H-UYTK-MS-EKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_１"
      D             "=["H-BIKOU-1 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_２"
      D             "=["H-BIKOU-2 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_３"
      D             "=["H-BIKOU-3 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_４"
      D             "=["H-BIKOU-4 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_５"
      D             "=["H-BIKOU-5 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_６"
      D             "=["H-BIKOU-6 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_７"
      D             "=["H-BIKOU-7 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_８"
      D             "=["H-BIKOU-8 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の備考_９"
      D             "=["H-BIKOU-9 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の投資対象国"
      D             "=["H-TS-TARGET-KUNI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の未払費用残取引通貨"
      D             "=["H-SJTK-MBHY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の未払費用残運用通貨"
      D             "=["H-UYTK-MBHY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉為替レート"
      D             "=["H-TGYOKU-KWS-RATE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉約定金額残取引通貨"
      D             "=["H-THTK-TG-YJKN-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉約定金額残運用通貨"
      D             "=["H-UYTK-TG-YJKN-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉手数料残取引通貨"
      D             "=["H-THTK-TG-TSR-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉手数料残運用通貨"
      D             "=["H-UYTK-TG-TSR-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉消費税残取引通貨"
      D             "=["H-THTK-TG-S-TAX-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉消費税残運用通貨"
      D             "=["H-UYTK-TG-S-TAX-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉その他費用残取引通貨"
      D             "=["H-THTK-TG-ELS-HIYO-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉その他費用残運用通貨"
      D             "=["H-UYTK-TG-ELS-HIYO-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉精算金額残取引通貨"
      D             "=["H-THTK-TG-SSKG-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の建玉精算金額残運用通貨"
      D             "=["H-UYTK-TG-SSKG-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の前受金残取引通貨"
      D             "=["H-THTK-AREC-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の前受金残運用通貨"
      D             "=["H-UYTK-AREC-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の仮払金残取引通貨"
      D             "=["H-THTK-SPAY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の仮払金残運用通貨"
      D             "=["H-UYTK-SPAY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の源泉税取引通貨"
      D             "=["H-THTK-GSZ OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の源泉税運用通貨"
      D             "=["H-GENSEN-TAX-LC OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の源泉税還付予定額残高取引通貨"
      D             "=["H-THTK-GSZKP-YT-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の源泉税還付予定額残高運用通貨"
      D             "=["H-UYTK-GSZKP-YT-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の簿価為替レート"
      D             "=["H-BOKA-KWS OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の移管評価損益残取引通貨"
      D             "=["H-THTK-IKAN-HYK-SEZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の移管評価損益残運用通貨"
      D             "=["H-UYTK-IKAN-HYK-SEZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の移管未収収益取引通貨"
      D             "=["H-SJTK-IKAN-MSSHEKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の移管未収収益運用通貨"
      D             "=["H-UYTK-IKAN-MSSHEKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の移管前払金評価損益残運用通貨"
      D             "=["H-UYTK-IKAN-PPHKZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前のＯＰ資産負債・買建売建フラグ"
      D             "=["H-OP-TATE-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の時価系列コード"
      D             "=["H-JIKA-KRTU-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の取得時遡及有無"
      D             "=["H-SKYU-UMU-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の時価種類"
      D             "=["H-JIKA-SHRU OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前のソース区分"
      D             "=["H-SOURCE-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の前払金評価額運用通貨"
      D             "=["H-UYTK-KPPAY-HYK-GK OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の前払金評価損益運用通貨"
      D             "=["H-UYTK-PPAY-SNEKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の未収収益評価為替レート"
      D             "=["H-MS-SHEKI-HYK-KWS OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の源泉税評価為替レート"
      D             "=["H-GENS-TAX-HYK-KWS OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前のデータ区分"
      D             "=["H-DATA-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の商品区分"
      D             "=["H-SYOHIN-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の帳票出力区分"
      D             "=["H-REP-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の項目コード１"
      D             "=["H-KODE-1 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値_１１"
      D             "=["H-SUJI-11 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値１２"
      D             "=["H-SUJI-12 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値１３"
      D             "=["H-SUJI-13 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の項目コード２"
      D             "=["H-KODE-2 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値２１"
      D             "=["H-SUJI-21 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値２２"
      D             "=["H-SUJI-22 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値２３"
      D             "=["H-SUJI-23 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の項目コード３"
      D             "=["H-KODE-3 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値３１"
      D             "=["H-SUJI-31 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値３２"
      D             "=["H-SUJI-32 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の数値３３"
      D             "=["H-SUJI-33 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の予備１"
      D             "=["H-YOBI1 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の予備２"
      D             "=["H-YOBI2 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の作成フラグ"
      D             "=["H-SK-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の作成画面ＩＤ"
      D             "=["H-SK-GAMEN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の作成ファイル名"
      D             "=["H-SK-FILE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の作成日時"
      D             "=["H-SK-DATE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の作成ログインユーザ会社コード"
      D             "=["H-SK-LOGIN-CMP-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の作成ユーザＩＤ"
      D             "=["H-SK-SID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の作成プログラムＩＤ"
      D             "=["H-SK-PGMID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の更新フラグ"
      D             "=["H-UPD-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の更新画面ＩＤ"
      D             "=["H-UPD-GAMEN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の更新ファイル名"
      D             "=["H-UPD-FILE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の更新日時"
      D    DISPLAY  CNS-PGM-ID":処理前の更新ログインユーザ会社コード"
      D             "=["H-UPD-LOGIN-CMP-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の更新ユーザＩＤ"
      D             "=["H-UPD-SID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理前の更新プログラムＩＤ"
      D             "=["H-UPD-PGMID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":H-CP-KRTU-CD"
      D             "=["H-CP-KRTU-CD"]"
      D    DISPLAY  CNS-PGM-ID":H-HOU-SURYO"
      D             "=["H-HOU-SURYO"]"
      D    DISPLAY  CNS-PGM-ID":H-THTK-ST-TNK"
      D             "=["H-THTK-ST-TNK"]"
      *-----------------------------------------------------------------
           IF  H-CP-KRTU-CD = CNS-18-10
             OR  H-CP-KRTU-CD = CNS-18-10-2
           THEN
             IF  H-HOU-SURYO NOT = ZERO
             THEN
               MOVE  H-THTK-ST-TNK
                 TO  H-CP-KRTU-CD
             ELSE
               MOVE  ZERO
                 TO  H-CP-KRTU-CD
             END-IF
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-CP-KRTU-CD"
      D             "=["H-CP-KRTU-CD"]"
      *-----------------------------------------------------------------
           MOVE  HST-TBL-SELECT         TO  PARM-SUSC0057-ARG1
               CALL  "SUSC0057"  USING  PARM-SUSC0057-INOUT
           MOVE  PARM-SUSC0057-ARG2     TO  HST-TBL-SELECT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":******************************"
      D    DISPLAY  CNS-PGM-ID":処理後の利用会社コード"
      D             "=["H-RIYO-CMP-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後のファンドコード"
      D             "=["H-FUND-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後のポートフォリオコード"
      D             "=["H-PTF-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の約定受渡区分"
      D             "=["H-YJ-UW-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の残高日付"
      D             "=["H-ZANTK-YMD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の決算日断面区分"
      D             "=["H-KSN-YMD-DMN-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の評価系列コード"
      D             "=["H-HYK-KRTU-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の証券種別コード"
      D             "=["H-SEC-SBT-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の取消フラグ"
      D             "=["H-DEL-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の確定フラグ"
      D             "=["H-KT-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の取引通貨"
      D             "=["H-TRHK-TUKA OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の為替取引決済通貨"
      D             "=["H-KWS-TH-TUKA-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の発行国コード"
      D             "=["H-HAKO-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の銘柄コード"
      D             "=["H-MEG-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の資産負債・買建売建フラグ"
      D             "=["H-TATE-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の個別建玉約定日"
      D             "=["H-TG-YKJ-YMD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の個別玉管理番号"
      D             "=["H-KB-KANRI-ID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後のカストディコード"
      D             "=["H-CAST-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の保有数量"
      D             "=["H-HOU-SURYO OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数量単位"
      D             "=["H-SURYO-TANI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の取得金額取引通貨"
      D             "=["H-THTK-ST-KNG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の取得単価取引通貨"
      D             "=["H-THTK-ST-TNK OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の時価取引通貨"
      D             "=["H-CP-KRTU-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の時価採用日付"
      D             "=["H-CP-SAIYO-YMD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の時価採用市場"
      D             "=["H-CP-SAIYO-SIJO OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の評価金額取引通貨"
      D             "=["H-THTK-HYK-KN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の評価損益取引通貨"
      D             "=["H-THTK-HYK-SNEKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の前払金残取引通貨"
      D             "=["H-THTK-PPAYZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の経過利息金額取引通貨"
      D             "=["H-THTK-KKRS   OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の未収収益取引通貨"
      D             "=["H-THTK-MS-EKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の評価為替レート"
      D             "=["H-HYK-KWS OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の為替採用日付"
      D             "=["H-KWS-SAIYO-YMD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の為替採用ソース"
      D             "=["H-KWS-SAIYO-SOURCE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の取得金額運用通貨為替換算額"
      D             "=["H-UYTK-KWS-BOKAZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の取得金額運用通貨"
      D             "=["H-SHTK-KN-LC OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の取得単価運用通貨"
      D             "=["H-UYTK-ST-TNK OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の評価金額運用通貨"
      D             "=["H-HYK-KN-LC OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の評価損益運用通貨"
      D             "=["H-HYK-SNEKI-LC OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の前払金残運用通貨"
      D             "=["H-UYTK-PPAY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の経過利息金額運用通貨"
      D             "=["H-KEKA-RSK-LC  OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の未収収益運用通貨"
      D             "=["H-UYTK-MS-EKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_１"
      D             "=["H-BIKOU-1 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_２"
      D             "=["H-BIKOU-2 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_３"
      D             "=["H-BIKOU-3 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_４"
      D             "=["H-BIKOU-4 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_５"
      D             "=["H-BIKOU-5 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_６"
      D             "=["H-BIKOU-6 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_７"
      D             "=["H-BIKOU-7 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_８"
      D             "=["H-BIKOU-8 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の備考_９"
      D             "=["H-BIKOU-9 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の投資対象国"
      D             "=["H-TS-TARGET-KUNI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の未払費用残取引通貨"
      D             "=["H-SJTK-MBHY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の未払費用残運用通貨"
      D             "=["H-UYTK-MBHY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉為替レート"
      D             "=["H-TGYOKU-KWS-RATE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉約定金額残取引通貨"
      D             "=["H-THTK-TG-YJKN-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉約定金額残運用通貨"
      D             "=["H-UYTK-TG-YJKN-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉手数料残取引通貨"
      D             "=["H-THTK-TG-TSR-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉手数料残運用通貨"
      D             "=["H-UYTK-TG-TSR-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉消費税残取引通貨"
      D             "=["H-THTK-TG-S-TAX-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉消費税残運用通貨"
      D             "=["H-UYTK-TG-S-TAX-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉その他費用残取引通貨"
      D             "=["H-THTK-TG-ELS-HIYO-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉その他費用残運用通貨"
      D             "=["H-UYTK-TG-ELS-HIYO-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉精算金額残取引通貨"
      D             "=["H-THTK-TG-SSKG-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の建玉精算金額残運用通貨"
      D             "=["H-UYTK-TG-SSKG-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の前受金残取引通貨"
      D             "=["H-THTK-AREC-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の前受金残運用通貨"
      D             "=["H-UYTK-AREC-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の仮払金残取引通貨"
      D             "=["H-THTK-SPAY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の仮払金残運用通貨"
      D             "=["H-UYTK-SPAY-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の源泉税取引通貨"
      D             "=["H-THTK-GSZ OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の源泉税運用通貨"
      D             "=["H-GENSEN-TAX-LC OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の源泉税還付予定額残高取引通貨"
      D             "=["H-THTK-GSZKP-YT-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の源泉税還付予定額残高運用通貨"
      D             "=["H-UYTK-GSZKP-YT-ZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の簿価為替レート"
      D             "=["H-BOKA-KWS OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の移管評価損益残取引通貨"
      D             "=["H-THTK-IKAN-HYK-SEZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の移管評価損益残運用通貨"
      D             "=["H-UYTK-IKAN-HYK-SEZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の移管未収収益取引通貨"
      D             "=["H-SJTK-IKAN-MSSHEKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の移管未収収益運用通貨"
      D             "=["H-UYTK-IKAN-MSSHEKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の移管前払金評価損益残運用通貨"
      D             "=["H-UYTK-IKAN-PPHKZN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後のＯＰ資産負債・買建売建フラグ"
      D             "=["H-OP-TATE-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の時価系列コード"
      D             "=["H-JIKA-KRTU-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の取得時遡及有無"
      D             "=["H-SKYU-UMU-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の時価種類"
      D             "=["H-JIKA-SHRU OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後のソース区分"
      D             "=["H-SOURCE-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の前払金評価額運用通貨"
      D             "=["H-UYTK-KPPAY-HYK-GK OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の前払金評価損益運用通貨"
      D             "=["H-UYTK-PPAY-SNEKI OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の未収収益評価為替レート"
      D             "=["H-MS-SHEKI-HYK-KWS OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の源泉税評価為替レート"
      D             "=["H-GENS-TAX-HYK-KWS OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後のデータ区分"
      D             "=["H-DATA-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の商品区分"
      D             "=["H-SYOHIN-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の帳票出力区分"
      D             "=["H-REP-KBN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の項目コード１"
      D             "=["H-KODE-1 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値_１１"
      D             "=["H-SUJI-11 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値１２"
      D             "=["H-SUJI-12 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値１３"
      D             "=["H-SUJI-13 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の項目コード２"
      D             "=["H-KODE-2 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値２１"
      D             "=["H-SUJI-21 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値２２"
      D             "=["H-SUJI-22 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値２３"
      D             "=["H-SUJI-23 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の項目コード３"
      D             "=["H-KODE-3 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値３１"
      D             "=["H-SUJI-31 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値３２"
      D             "=["H-SUJI-32 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の数値３３"
      D             "=["H-SUJI-33 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の予備１"
      D             "=["H-YOBI1 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の予備２"
      D             "=["H-YOBI2 OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の作成フラグ"
      D             "=["H-SK-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の作成画面ＩＤ"
      D             "=["H-SK-GAMEN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の作成ファイル名"
      D             "=["H-SK-FILE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の作成日時"
      D             "=["H-SK-DATE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の作成ログインユーザ会社コード"
      D             "=["H-SK-LOGIN-CMP-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の作成ユーザＩＤ"
      D             "=["H-SK-SID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の作成プログラムＩＤ"
      D             "=["H-SK-PGMID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の更新フラグ"
      D             "=["H-UPD-FLG OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の更新画面ＩＤ"
      D             "=["H-UPD-GAMEN OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の更新ファイル名"
      D             "=["H-UPD-FILE OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の更新日時"
      D    DISPLAY  CNS-PGM-ID":処理後の更新ログインユーザ会社コード"
      D             "=["H-UPD-LOGIN-CMP-CD OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の更新ユーザＩＤ"
      D             "=["H-UPD-SID OF HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":処理後の更新プログラムＩＤ"
      D             "=["H-UPD-PGMID OF HST-TBL-SELECT"]"
      D    DISPLAY  "CALL SUSC0057  END"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワーク セット  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WORK-OPERATION-EXT.
           EXIT.
      ******************************************************************
      *    進捗管理ＩＮＳＵＰＤ処理1
      ******************************************************************
       SUSC0405-NEW-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗管理ＩＮＳＵＰＤ処理1 START ***"
      *-----------------------------------------------------------------
      *----------  ワーク進捗フラグ
           MOVE  CNS-ON                 TO  FLG-UPD
           INITIALIZE  PARM-SUSC0405-INOUT
                       PARM-RTNPKG
                       WK-1190-STATUS
      *----------  セッション区分←"0":先頭セッション
           MOVE  CNS-X-0
             TO  SESION-KBN             OF  PARM-SUSC0405-ARG1
      *----------  OL/BT区分←"BT":バッチ用
           MOVE  CNS-BT
             TO  OLBT-KBN               OF  PARM-SUSC0405-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0405-ARG2
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SUSC0405-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SUSC0405-ARG2
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SUSC0405-ARG2
      *----------  基準年月日/基準年月
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT-2
             TO  KJN-YMD                OF  PARM-SUSC0405-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0405-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD-DETAIL       OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0405-ARG2
      *----------  評価系列コード
           MOVE  WK-DEFAUL-THYK-CD      OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0405-ARG2
      *----------  基準日FROM
      *----------  テーマ2693対応START
           MOVE  WK-KZYN-YMD-FROM       OF  WK-PTF-ATT-DATA(WK-IDX-J)
      *----------  テーマ2693対応END
             TO  KJN-YMD-FROM           OF  PARM-SUSC0405-ARG2
      *----------  実行ステータス
           MOVE  CNS-SHINTK-STS-600
             TO  JIKOU-STS              OF  PARM-SUSC0405-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":セッション区分=["
      D             SESION-KBN          OF  PARM-SUSC0405-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":OL/BT区分=["
      D             OLBT-KBN            OF  PARM-SUSC0405-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日/基準年月=["
      D             KJN-YMD             OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":最終処理基準日=["
      D             SS-SYORI-YMD        OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ベビー未処理フラグ=["
      D             BABY-MISYORI-FLG    OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス=["
      D             JIKOU-STS           OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0405  START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0405"             USING  PARM-SUSC0405-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0405  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0405)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *----------  ポートフォリオ実行可能区分
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ実行可能区分=["
      D             PTF-JIKOU-KBN       OF  PARM-SUSC0405-ARG3"]"
      *-----------------------------------------------------------------
      *----------  ＤＢ コミット処理
               PERFORM  DB-COMMIT1-RTN
      *----------  ポートフォリオ実行可能区分
               EVALUATE  PTF-JIKOU-KBN OF PARM-SUSC0405-ARG3
                 WHEN  CNS-X-0
                   CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗管理ＩＮＳＵＰＤ処理1 正常  ***"
      *-----------------------------------------------------------------
                 WHEN  CNS-X-1
                   MOVE  CNS-OFF           TO  FLG-UPD
                 WHEN  OTHER
                   MOVE  CNS-OFF           TO  FLG-UPD
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ポートフォリオ実行可能区分'2':停止の時"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
                   IF  WK-RTN-CODE < CNS-10
                   THEN
                     MOVE  CNS-10          TO  WK-RTN-CODE
                   ELSE
                     CONTINUE
                   END-IF
      *----------  後処理
                   PERFORM  END-RTN
               END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":進捗フラグFLG-UPD =[" FLG-UPD"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-113
               MOVE  CNS-OFF          TO  FLG-UPD
      *----------
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000217
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-DATA-TEXT
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
            WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗管理ＩＮＳＵＰＤ処理1エラー ***"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               MOVE  CNS-OFF              TO  FLG-UPD
               MOVE  CNS-16               TO  WK-STATUS
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-020          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗管理ＩＮＳＵＰＤ処理1  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0405-NEW-EXT.
           EXIT.
      ******************************************************************
      *    進捗管理ＩＮＳＵＰＤ処理
      ******************************************************************
       SUSC0405-OLD-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗管理ＩＮＳＵＰＤ処理2 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0405-INOUT
                       PARM-RTNPKG
           MOVE  CNS-OFF                TO  FLG-UPD
      *----------  セッション区分←"1":最終セッション
           MOVE  CNS-X-1
             TO  SESION-KBN             OF  PARM-SUSC0405-ARG1
      *----------  OL/BT区分←"BT":バッチ用
           MOVE  CNS-BT
             TO  OLBT-KBN               OF  PARM-SUSC0405-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SUSC0405-ARG2
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SUSC0405-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SUSC0405-ARG2
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SUSC0405-ARG2
      *----------  基準日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT-2
             TO  KJN-YMD                OF  PARM-SUSC0405-ARG2
      *----------  ファンドコード
           MOVE  WK-FUND-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SUSC0405-ARG2
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD-DETAIL       OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SUSC0405-ARG2
      *----------  評価系列コード
           MOVE  WK-DEFAUL-THYK-CD      OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SUSC0405-ARG2
      *----------  基準日FROM
      *----------  テーマ2693対応START
           MOVE  WK-KZYN-YMD-FROM       OF  WK-PTF-ATT-DATA(WK-IDX-J)
      *----------  テーマ2693対応END
             TO  KJN-YMD-FROM           OF  PARM-SUSC0405-ARG2
      *----------  実行ステータス
           EVALUATE  WK-1190-STATUS
             WHEN  ZERO
      *----------  実行ステータス0(正常終了)
               MOVE  CNS-STS-100
                 TO  JIKOU-STS          OF  PARM-SUSC0405-ARG2
             WHEN  CNS-2
      *----------  実行ステータス2(警告終了)
               MOVE  CNS-STS-200
                 TO  JIKOU-STS          OF  PARM-SUSC0405-ARG2
      *----------  実行ステータス4(業務エラー(続行可能))
             WHEN  CNS-4
               MOVE  CNS-STS-270
                 TO  JIKOU-STS          OF  PARM-SUSC0405-ARG2
             WHEN  CNS-6
      *----------  実行ステータス6
               MOVE  CNS-STS-275
                 TO  JIKOU-STS          OF  PARM-SUSC0405-ARG2
             WHEN  CNS-8
      *----------  実行ステータス8 (業務エラー(明細続行不可))
               MOVE  CNS-STS-277
                 TO  JIKOU-STS          OF  PARM-SUSC0405-ARG2
             WHEN  CNS-10
      *----------  実行ステータス10
               MOVE  CNS-STS-375
                 TO  JIKOU-STS          OF  PARM-SUSC0405-ARG2
             WHEN  OTHER
      *----------  実行ステータス16(システムエラー)
               MOVE  CNS-STS-400
                 TO  JIKOU-STS          OF  PARM-SUSC0405-ARG2
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-1190-STATUS=["     WK-1190-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス=["
      D             JIKOU-STS          OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARGUEMENT OF SUSC0405"
      D    DISPLAY  CNS-PGM-ID":セッション区分=["
      D             SESION-KBN          OF  PARM-SUSC0405-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":OL/BT区分=["
      D             OLBT-KBN            OF  PARM-SUSC0405-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準年月日/基準年月=["
      D             KJN-YMD             OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":最終処理基準日=["
      D             SS-SYORI-YMD        OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ベビー未処理フラグ=["
      D             BABY-MISYORI-FLG    OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             FUND-CD             OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード=["
      D             HYK-KRTU-CD         OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":帳票任意コード=["
      D             REP-ANY-CD          OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日FROM=["
      D             KJN-YMD-FROM        OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":進捗ステータス=["
      D             JIKOU-STS           OF  PARM-SUSC0405-ARG2"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0405  START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0405"             USING  PARM-SUSC0405-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SUSC0405  END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG       =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0405)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗管理ＩＮＳＵＰＤ処理2 正常  ***"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-113
      *----------
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000217
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-DATA-TEXT
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-MEISAI-GYOMU-ERR =["
      D             FLG-MEISAI-GYOMU-ERR"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***進捗管理ＩＮＳＵＰＤ処理2 エラー ***"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-021          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                              (COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理ＩＮＳＵＰＤ処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0405-OLD-EXT.
           EXIT.
      ******************************************************************
      *    カーソル(CLOSE)
      ******************************************************************
       CR-CLOSE-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR CLOSE)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN           =["FLG-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
             MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-022          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  WK-SELECT-FREE-MSG   TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    カーソル(CLOSE)
      ******************************************************************
       CR-CLOSE-2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR CLOSE)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CR-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN           =["FLG-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ワークリターンコード
             MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-088          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  WK-SELECT-FREE-MSG   TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-CLOSE-2-EXT.
           EXIT.
      ******************************************************************
      *    SQL作成（PREPARE）
      ******************************************************************
       CR-PREPARE-2-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL作成(PREPARE2)  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT-S2
                       HST-SELECT-WHERE
                       WK-SELECT-FREE-MSG2
      *----------  テーブルTKUSZT01
           MOVE  WK-TBL-TKUSZT01
             TO  SQL-TBL-TKUSZT01       OF  SQL-SELECT-2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-SELECT-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD-DETAIL      OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-SELECT-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD-DETAIL       OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-SELECT-WHERE
      *----------  テーマ2693対応
      *----------  期間FROM
           MOVE  WK-KZYN-YMD-FROM       OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-KIKAN-FR             OF  HST-SELECT-WHERE
      *----------  期間TO
           MOVE  WK-KZYN-YMD-TO         OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-KIKAN-TO             OF  HST-SELECT-WHERE
      *----------  テーマ2693対応
      *----------  評価系列コード
           MOVE  WK-DEFAUL-THYK-CD      OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-HYK-KRTU-CD          OF  HST-SELECT-WHERE
           STRING  SQL-SELECT-2
                   DELIMITED BY SIZE
                   INTO SQLSTMT-S2
           END-STRING
           STRING SQLSTMT-S2(1:FUNCTION  LENGTH(SQL-SELECT-2))
                "[:V1="
                 H-RIYO-CMP-CD        OF  HST-SELECT-WHERE
                "][:V2="
                 H-FUND-CD            OF  HST-SELECT-WHERE
                "][:V3="
                 H-PTF-CD             OF  HST-SELECT-WHERE
                "][:V4="
                 H-KIKAN-FR           OF  HST-SELECT-WHERE
                "][:V5="
                 H-KIKAN-TO           OF  HST-SELECT-WHERE
                "][:V6="
                 H-HYK-KRTU-CD        OF  HST-SELECT-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-SELECT-FREE-MSG2
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "テーブルTKUSZT01 =["
      D             SQL-TBL-TKUSZT01       OF  SQL-SELECT-2"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コードH-RIYO-CMP-CD =["
      D                 H-RIYO-CMP-CD      OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコードH-FUND-CD     =["
      D                 H-FUND-CD          OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコードH-PTF-CD      =["
      D                 H-PTF-CD           OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":残高日付FR H-KIKAN-FR      =["
      D                 H-KIKAN-FR         OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":残高日付TO H-KIKAN-TO      =["
      D                 H-KIKAN-TO         OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":評価系列コードH-HYK-KRTU-CD      =["
      D                 H-HYK-KRTU-CD      OF  HST-SELECT-WHERE "]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-S2      =["SQLSTMT-S2"]"
      D    DISPLAY  CNS-PGM-ID":WK-SELECT-FREE-MSG2 =["
      D             WK-SELECT-FREE-MSG2"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  SS2  FROM  :SQLSTMT-S2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE2)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-068        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG2
                 TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL作成(PREPARE2)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-PREPARE-2-EXT.
           EXIT.
      ******************************************************************
      *    カーソル作成（DECLARE，OPEN）
      ******************************************************************
       CR-OPEN-2-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カーソル作成(DECLARE，OPEN2)  START  ***"
      *-----------------------------------------------------------------
      *----------DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR2  CURSOR  FOR  SS2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR2 DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------OPEN    CURSOR
           EXEC  SQL
             OPEN  CR2
           USING  :HST-SELECT-WHERE.H-RIYO-CMP-CD,
                  :HST-SELECT-WHERE.H-FUND-CD,
                  :HST-SELECT-WHERE.H-PTF-CD,
                  :HST-SELECT-WHERE.H-KIKAN-FR,
                  :HST-SELECT-WHERE.H-KIKAN-TO,
                  :HST-SELECT-WHERE.H-HYK-KRTU-CD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR2 OPEN)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON               TO  FLG-CR-OPEN2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN2 =["FLG-CR-OPEN2"]"
      D    DISPLAY  CNS-PGM-ID":FLG-STOP-2 =["FLG-STOP-2"]"
      *-----------------------------------------------------------------
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-069          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG2  TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カーソル作成(DECLARE，OPEN2)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-OPEN-2-EXT.
           EXIT.
      ******************************************************************
      *    ディテール行を編集する
      ******************************************************************
       DATA-EDIT-RTN          SECTION.
      *------------------ <残タスク135の対応 START>---------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-4156=["WK-SEC-SBT-4156"]"
      *-----------------------------------------------------------------
      *----------  商品属性全項目取得
           IF  H-SEC-SBT-CD NOT = SPACE
           THEN
             IF  WK-SEC-SBT-4156
               NOT =  H-SEC-SBT-CD
             THEN
               PERFORM  SCZY4156-RTN
             ELSE
               IF  WK-RTN-4156 = CNS-RTN-110
               THEN
      *----------  ワーク実行ステータス
                 IF  WK-STATUS  < CNS-4
                 THEN
                   MOVE  CNS-4            TO  WK-STATUS
                 ELSE
                   CONTINUE
                 END-IF
      *----------  1190実行ステータス
                 IF   WK-STATUS > WK-1190-STATUS
                 THEN
                   MOVE  WK-STATUS        TO  WK-1190-STATUS
                 ELSE
                   CONTINUE
                 END-IF
      *----------  ワークリターンコード
                 IF  WK-RTN-CODE < WK-STATUS
                 THEN
                   MOVE  WK-STATUS        TO  WK-RTN-CODE
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             INITIALIZE  WK-SYOHIN-KBN
                         WK-KANRI-SURYO-TANI
                         WK-SEC-SBT-4156
      *------------------ <連結障害841の対応 START>---------------------
      *----------  ワーク実行ステータス
             IF  WK-STATUS  < CNS-4
             THEN
               MOVE  CNS-4            TO  WK-STATUS
             ELSE
               CONTINUE
             END-IF
      *----------  1190実行ステータス
             IF   WK-STATUS > WK-1190-STATUS
             THEN
               MOVE  WK-STATUS        TO  WK-1190-STATUS
             ELSE
               CONTINUE
             END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             IF  WK-RTN-CODE < WK-STATUS
             THEN
               MOVE  WK-STATUS        TO  WK-RTN-CODE
             ELSE
               CONTINUE
             END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
             COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
             MOVE  WK-FUND-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
               TO  WK-GYOMU-FUND-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
             MOVE  WK-PTF-CD-DETAIL       OF  WK-PTF-ATT-DATA(WK-IDX-J)
               TO  WK-GYOMU-PTF-CD        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
             MOVE  WK-DEFAUL-THYK-CD      OF  WK-PTF-ATT-DATA(WK-IDX-J)
               TO  WK-GYOMU-HYK-KRTU-CD   OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
             MOVE  CNS-MSG-E000090
               TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
             MOVE  WK-KIKAN-FR
               TO  WK-GYOMU-KJN-YMD-FROM
                       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
             MOVE  WK-KIKAN-TO
               TO  WK-GYOMU-KJN-YMD-TO
                       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
             MOVE  CNS-SEC-SBT-CD
               TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
             MOVE  WK-TEMP-MSG
               TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
             MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
      *------------------ <連結障害841の対応 END>-----------------------
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-SYOHIN-KBN=["WK-SYOHIN-KBN"]"
      D    DISPLAY  CNS-PGM-ID":取引通貨=["
      D             H-TRHK-TUKA                OF  HST-TBL-SELECT"]"
      D    DISPLAY  CNS-PGM-ID":為替決済通貨=["
      D             H-KWS-TH-TUKA-CD           OF  HST-TBL-SELECT"]"
      *-----------------------------------------------------------------
      *----------  1)取引通貨と為替決済通貨の編集取得
           IF  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-22
           THEN
             MOVE  H-KWS-TH-TUKA-CD     OF  HST-TBL-SELECT
               TO  WK-TRHK-TUKA
             MOVE  H-TRHK-TUKA          OF  HST-TBL-SELECT
               TO  WK-KWS-TH-TUKA-CD
           ELSE
             MOVE  H-TRHK-TUKA          OF  HST-TBL-SELECT
               TO  WK-TRHK-TUKA
             MOVE  H-KWS-TH-TUKA-CD     OF  HST-TBL-SELECT
               TO  WK-KWS-TH-TUKA-CD
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引通貨=["WK-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID":為替決済通貨=["WK-KWS-TH-TUKA-CD"]"
      *-----------------------------------------------------------------
      *------------------ <連結障害841の対応 START>---------------------
           IF  WK-TRHK-TUKA  = SPACE
           THEN
      *----------  ワーク実行ステータス
             IF  WK-STATUS  < CNS-4
             THEN
               MOVE  CNS-4            TO  WK-STATUS
             ELSE
               CONTINUE
             END-IF
      *----------  1190実行ステータス
             IF   WK-STATUS > WK-1190-STATUS
             THEN
               MOVE  WK-STATUS        TO  WK-1190-STATUS
             ELSE
               CONTINUE
             END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             IF  WK-RTN-CODE < WK-STATUS
             THEN
               MOVE  WK-STATUS        TO  WK-RTN-CODE
             ELSE
               CONTINUE
             END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
             COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
             MOVE  WK-FUND-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
               TO  WK-GYOMU-FUND-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
             MOVE  WK-PTF-CD-DETAIL       OF  WK-PTF-ATT-DATA(WK-IDX-J)
               TO  WK-GYOMU-PTF-CD        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
             MOVE  WK-DEFAUL-THYK-CD      OF  WK-PTF-ATT-DATA(WK-IDX-J)
               TO  WK-GYOMU-HYK-KRTU-CD   OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
             MOVE  CNS-MSG-E000090
               TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
             MOVE  WK-KIKAN-FR
               TO  WK-GYOMU-KJN-YMD-FROM
                       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
             MOVE  WK-KIKAN-TO
               TO  WK-GYOMU-KJN-YMD-TO
                       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
             MOVE  CNS-TRHK-TUKA
               TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
             MOVE  WK-TEMP-MSG
               TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
             MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
           ELSE
             CONTINUE
           END-IF
      *------------------ <連結障害841の対応 END>-----------------------
      *------------------ <残タスク135の対応 END>-----------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["
      D             WK-STATUS"]"
      *-----------------------------------------------------------------
      *----------  2)外部銘柄コード変換ルーチンをコール
           IF  WK-STATUS < CNS-16
           THEN
      *------------------ <連結障害841の対応 START>---------------------
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-MEG-CD=["
      D             H-MEG-CD            OF  HST-TBL-SELECT"]"
      *-----------------------------------------------------------------
             IF  H-MEG-CD               OF  HST-TBL-SELECT
               NOT = SPACE
             THEN
               IF  WK-MEG-CD-3002 NOT = H-MEG-CD  OF  HST-TBL-SELECT
                OR  WK-SEC-SBT-3002 NOT = H-SEC-SBT-CD
               THEN
                 PERFORM  SCZY3002-CHAN-RTN
               ELSE
                 EVALUATE  WK-RTN-3002
                   WHEN  CNS-RTN-002
                   WHEN  CNS-RTN-110
                     EVALUATE  WK-RTN-3002-2
                       WHEN  CNS-RTN-000
                       WHEN  CNS-RTN-002
                       WHEN  CNS-RTN-110
                       WHEN  CNS-RTN-800
      *----------  ワーク実行ステータス
                         IF  WK-STATUS  < CNS-4
                         THEN
                           MOVE  CNS-4            TO  WK-STATUS
                         ELSE
                           CONTINUE
                         END-IF
      *----------  1190実行ステータス
                         IF   WK-STATUS > WK-1190-STATUS
                         THEN
                           MOVE  WK-STATUS        TO  WK-1190-STATUS
                         ELSE
                           CONTINUE
                         END-IF
      *----------  ワークリターンコード
                         IF  WK-RTN-CODE < WK-STATUS
                         THEN
                           MOVE  WK-STATUS        TO  WK-RTN-CODE
                         ELSE
                           CONTINUE
                         END-IF
                       WHEN  OTHER
                         CONTINUE
                     END-EVALUATE
                   WHEN  CNS-RTN-800
      *----------  ワーク実行ステータス
                     IF  WK-STATUS  < CNS-4
                     THEN
                       MOVE  CNS-4            TO  WK-STATUS
                     ELSE
                       CONTINUE
                     END-IF
      *----------  1190実行ステータス
                     IF   WK-STATUS > WK-1190-STATUS
                     THEN
                       MOVE  WK-STATUS        TO  WK-1190-STATUS
                     ELSE
                       CONTINUE
                     END-IF
      *----------  ワークリターンコード
                     IF  WK-RTN-CODE < WK-STATUS
                     THEN
                       MOVE  WK-STATUS        TO  WK-RTN-CODE
                     ELSE
                       CONTINUE
                     END-IF
                   WHEN  OTHER
                     CONTINUE
                 END-EVALUATE
               END-IF
             ELSE
               INITIALIZE  WK-GAIBU-MEG-CD
                           WK-CD-REF-KRTU-CD
                           WK-JS-CD-FLG
                           WK-SEC-SBT-CD
                           WK-HAKO-CD
                           WK-TS-TARGET-KUNI
                           WK-MEG-CD-3002
                           WK-SEC-SBT-3002
      *----------  ワーク実行ステータス
               IF  WK-STATUS  < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF   WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-MEG-CD
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             END-IF
      *------------------ <連結障害841の対応 END>-----------------------
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部銘柄コード=["WK-GAIBU-MEG-CD"]"
      *-----------------------------------------------------------------
      *
           IF  WK-STATUS < CNS-16
           THEN
             IF  I-CD-REF-KRTU-CD OF WK-DENBUN-INFO NOT = CNS-D001
               AND H-MEG-CD NOT = SPACE
               AND WK-GAIBU-MEG-CD  NOT =  SPACE
             THEN
               IF  WK-MEG-CD-3002-3 NOT = H-MEG-CD  OF  HST-TBL-SELECT
                OR  WK-SEC-SBT-3002-3 NOT = H-SEC-SBT-CD
               THEN
                 PERFORM  SCZY3002-CHAN-2-RTN
               ELSE
                 IF  WK-RTN-3002-3 = CNS-RTN-800
                 THEN
      *----------  ワーク実行ステータス
                   IF  WK-STATUS  < CNS-4
                   THEN
                     MOVE  CNS-4            TO  WK-STATUS
                   ELSE
                     CONTINUE
                   END-IF
      *----------  1190実行ステータス
                   IF   WK-STATUS > WK-1190-STATUS
                   THEN
                     MOVE  WK-STATUS        TO  WK-1190-STATUS
                   ELSE
                     CONTINUE
                   END-IF
      *----------  ワークリターンコード
                   IF  WK-RTN-CODE < WK-STATUS
                   THEN
                     MOVE  WK-STATUS        TO  WK-RTN-CODE
                   ELSE
                     CONTINUE
                   END-IF
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
             ELSE
               INITIALIZE  WK-MEG-CD-3002-3
                           WK-SEC-SBT-3002-3
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":I-CD-REF-KRTU-CD=["
      D             I-CD-REF-KRTU-CD  OF  WK-DENBUN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":H-MEG-CD=["H-MEG-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-GAIBU-MEG-CD=["WK-GAIBU-MEG-CD"]"
      *-----------------------------------------------------------------
               IF  I-CD-REF-KRTU-CD  OF  WK-DENBUN-INFO  =  CNS-D001
               THEN
                 MOVE  CNS-1        TO  FLG-DEFAULT-KRTU-CD
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-DEFAULT-KRTU-CD=["
      D             FLG-DEFAULT-KRTU-CD"]"
      *-----------------------------------------------------------------
               ELSE
                 IF  H-MEG-CD  = SPACE
                   OR  WK-GAIBU-MEG-CD  =  SPACE
                 THEN
                   MOVE  ZERO         TO  FLG-DEFAULT-KRTU-CD
                 ELSE
                   MOVE  CNS-1        TO  FLG-DEFAULT-KRTU-CD
                 END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-DEFAULT-KRTU-CD=["
      D             FLG-DEFAULT-KRTU-CD"]"
      *-----------------------------------------------------------------
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF  WK-STATUS < CNS-16
           THEN
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部銘柄コード=["WK-GAIBU-MEG-CD"]"
      *-----------------------------------------------------------------
             IF  WK-GAIBU-MEG-CD  =  SPACE
             THEN
               INITIALIZE  WK-MEG-CD-3002
                           WK-SEC-SBT-3002
      *---------- 外部銘柄コード
               MOVE  H-MEG-CD                 OF  HST-TBL-SELECT
                 TO  WK-GAIBU-MEG-CD
      *---------- 証券種別コード
               MOVE  H-SEC-SBT-CD
                 TO  WK-SEC-SBT-CD
      *---------- 発行体国コード
               MOVE  H-HAKO-CD                OF  HST-TBL-SELECT
                 TO  WK-HAKO-CD
      *---------- 投資対象国コード
               MOVE  H-TS-TARGET-KUNI         OF  HST-TBL-SELECT
                 TO  WK-TS-TARGET-KUNI
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部銘柄コード=["WK-GAIBU-MEG-CD"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":発行体国コード=["WK-HAKO-CD"]"
      D    DISPLAY  CNS-PGM-ID":投資対象国コード=["WK-TS-TARGET-KUNI"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["
      D             WK-STATUS"]"
      *-----------------------------------------------------------------
      *----------  6)銘柄情報を取得
           IF  WK-STATUS < CNS-16
           THEN
      *------------------ <連結障害841の対応 START>---------------------
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-MEG-CD=["
      D             H-MEG-CD            OF  HST-TBL-SELECT"]"
      *-----------------------------------------------------------------
             IF  H-MEG-CD               OF  HST-TBL-SELECT
               NOT = SPACE
             THEN
               IF  WK-MEG-CD-3004 NOT = H-MEG-CD  OF  HST-TBL-SELECT
               THEN
                 PERFORM  SCZY3004-CHAN-RTN
               ELSE
                 IF  WK-RTN-3004 = CNS-RTN-800
                 THEN
      *----------  ワーク実行ステータス
                   IF  WK-STATUS  < CNS-4
                   THEN
                     MOVE  CNS-4            TO  WK-STATUS
                   ELSE
                     CONTINUE
                   END-IF
      *----------  1190実行ステータス
                   IF   WK-STATUS > WK-1190-STATUS
                   THEN
                     MOVE  WK-STATUS        TO  WK-1190-STATUS
                   ELSE
                     CONTINUE
                   END-IF
      *----------  ワークリターンコード
                   IF  WK-RTN-CODE < WK-STATUS
                   THEN
                     MOVE  WK-STATUS        TO  WK-RTN-CODE
                   ELSE
                     CONTINUE
                   END-IF
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
             ELSE
               INITIALIZE  WK-MEG-CD-3004
                           WK-MEG-MEI-JP
                           WK-MEG-MEI-EN
                           WK-SAKEN-KP-KBN
                           WK-SAKEN-SK-YMD
                           WK-SISAN-BUNRUI-CD
                           WK-CALL-PUT-KBN
                           WK-RF-KABU-SBT
      *----------  ワーク実行ステータス
               IF  WK-STATUS  < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF   WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-MEG-CD
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             END-IF
      *------------------ <連結障害841の対応 END>-----------------------
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID": WK-RF-KABU-SBT =["WK-RF-KABU-SBT "]"
      D    DISPLAY  CNS-PGM-ID": FLG-DEFAULT-KRTU-CD =["
      D             FLG-DEFAULT-KRTU-CD "]"
      D    DISPLAY  CNS-PGM-ID": 国 =["WK-HAKO-CD "]"
      D    DISPLAY  CNS-PGM-ID": H-SEC-SBT-CD=["H-SEC-SBT-CD "]"
      D    DISPLAY  CNS-PGM-ID": H-DATA-KBN =["H-DATA-KBN "]"
      *-----------------------------------------------------------------
           IF  H-SEC-SBT-CD  =  CNS-SKSBT-PRI
           THEN
             MOVE  CNS-PRI-J  TO  WK-MEG-MEI-JP
             MOVE  CNS-PRI-E  TO  WK-MEG-MEI-EN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄名称(日本語)=["WK-MEG-MEI-JP"]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(英語)=["WK-MEG-MEI-EN"]"
      *-----------------------------------------------------------------
      *------------------ <連結障害841の対応 START>---------------------
      *----------  内部⇒外部コード(証券種別)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID": 証券種別 =["WK-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":H-DATA-KBN=["H-DATA-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-16
           THEN
             IF  WK-SEC-SBT-CD NOT = SPACE
             THEN
               IF  H-DATA-KBN NOT = CNS-X-1
                 AND H-SEC-SBT-CD NOT = CNS-SKSBT-CASH
               THEN
                 IF  WK-SEC-SBT-4182-2 NOT = WK-SEC-SBT-CD
                 THEN
                   PERFORM  SEC-SBT-CD-RTN
                 ELSE
                   EVALUATE  WK-RTN-4182-2
                     WHEN  CNS-RTN-110
                     WHEN  CNS-RTN-800
      *----------  ワーク実行ステータス
                       IF  WK-STATUS  < CNS-4
                       THEN
                         MOVE  CNS-4            TO  WK-STATUS
                       ELSE
                         CONTINUE
                       END-IF
      *----------  1190実行ステータス
                       IF   WK-STATUS > WK-1190-STATUS
                       THEN
                         MOVE  WK-STATUS        TO  WK-1190-STATUS
                       ELSE
                         CONTINUE
                       END-IF
      *----------  ワークリターンコード
                       IF  WK-RTN-CODE < WK-STATUS
                       THEN
                         MOVE  WK-STATUS        TO  WK-RTN-CODE
                       ELSE
                         CONTINUE
                       END-IF
                     WHEN  OTHER
                       CONTINUE
                   END-EVALUATE
                 END-IF
                 MOVE  WK-GAIBU-CD
                   TO  WK-SEC-SBT-CD-2
               ELSE
                 IF  H-SEC-SBT-CD = CNS-SKSBT-CASH
                 THEN
                   IF  H-TRHK-TUKA = WK-CAPITAL-TUKA-CD
                   THEN
                     MOVE  CNS-SKSBT-CASH
                       TO  WK-SEC-SBT-CD-2
                   ELSE
                     MOVE  CNS-SKSBT-EX
                       TO  WK-SEC-SBT-CD-2
                   END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID": WK-SEC-SBT-CD-2 =["WK-SEC-SBT-CD-2"]"
      *-----------------------------------------------------------------
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
             ELSE
               INITIALIZE  WK-SEC-SBT-4182-2
                           WK-SEC-SBT-CD-2
      *----------  ワーク実行ステータス
               IF  WK-STATUS  < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF   WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-SEC-SBT-CD
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             END-IF
           ELSE
             CONTINUE
           END-IF
      *------------------ <連結障害841の対応 END>-----------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
      *----------  ＧＸ用証券種別コード変換ルーチン
           IF  WK-STATUS < CNS-16
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-DATA-KBN=["H-DATA-KBN"]"
      *-----------------------------------------------------------------
             IF H-SEC-SBT-CD NOT = CNS-SKSBT-CASH
             THEN
               IF  H-DATA-KBN = CNS-X-1
               THEN
                 MOVE  H-SEC-SBT-CD
                   TO  WK-SEC-SBT-CD-3
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-CD-3=["WK-SEC-SBT-CD-3"]"
      *-----------------------------------------------------------------
               ELSE
                 PERFORM  SUSC0603-RTN
               END-IF
             ELSE
               MOVE  WK-SEC-SBT-CD-2
                 TO  WK-SEC-SBT-CD-3
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF  WK-STATUS < CNS-16
           THEN
             PERFORM  SCZY3026-RTN
           ELSE
             CONTINUE
           END-IF
           MOVE  H-CAST-CD              OF  HST-TBL-SELECT
             TO  WK-CAST-CD-2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CAST-CD-2=["WK-CAST-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-CD-3=["WK-SEC-SBT-CD-3"]"
      D    DISPLAY  CNS-PGM-ID":WK-TRHK-TUKA=["WK-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID":WK-CAPITAL-TUKA-CD=["
      D             WK-CAPITAL-TUKA-CD"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-16
           THEN
             IF  (WK-SEC-SBT-CD-3  = CNS-SKSBT-FBMS
               OR  WK-SEC-SBT-CD-3  = CNS-SKSBT-FSMS
               OR  WK-SEC-SBT-CD-3  = CNS-SKSBT-CBMS
               OR  WK-SEC-SBT-CD-3  = CNS-SKSBT-OOET)
               AND WK-TRHK-TUKA = WK-CAPITAL-TUKA-CD
             THEN
               INITIALIZE  WK-HAKO-CD-4102
               MOVE  CNS-SPACE-99
                 TO  WK-HAKO-CD-2
             ELSE
      *----------  4)国全項目取得
               IF  WK-HAKO-CD NOT = SPACE
                 AND  WK-HAKO-CD NOT = CNS-OTHR
                 AND  H-SEC-SBT-CD NOT = CNS-SKSBT-FDAL
                 AND  H-SEC-SBT-CD NOT = CNS-SKSBT-PRI
                 AND  H-SEC-SBT-CD NOT = CNS-SKSBT-CASH
                 AND  WK-SYOHIN-KBN NOT = CNS-SYOHIN-KBN-17
                 AND  WK-SYOHIN-KBN NOT = CNS-SYOHIN-KBN-22
                 AND  (H-DATA-KBN NOT = CNS-X-1
                   OR  WK-TRHK-TUKA NOT = WK-CAPITAL-TUKA-CD)
               THEN
                 IF  WK-HAKO-CD-4102 NOT = WK-HAKO-CD
                 THEN
                   PERFORM  SCZY4102-RTN
                 ELSE
                   EVALUATE  WK-RTN-4102
                     WHEN  CNS-RTN-110
                     WHEN  CNS-RTN-800
      *----------  ワーク実行ステータス
                       IF  WK-STATUS  < CNS-4
                       THEN
                         MOVE  CNS-4            TO  WK-STATUS
                       ELSE
                         CONTINUE
                       END-IF
      *----------  1190実行ステータス
                       IF   WK-STATUS > WK-1190-STATUS
                       THEN
                         MOVE  WK-STATUS        TO  WK-1190-STATUS
                       ELSE
                         CONTINUE
                       END-IF
      *----------  ワークリターンコード
                       IF  WK-RTN-CODE < WK-STATUS
                       THEN
                         MOVE  WK-STATUS        TO  WK-RTN-CODE
                       ELSE
                         CONTINUE
                       END-IF
                     WHEN  OTHER
                       CONTINUE
                   END-EVALUATE
                 END-IF
               ELSE
                 INITIALIZE  WK-HAKO-CD-4102
                 MOVE  CNS-SPACE-99
                   TO  WK-HAKO-CD-2
                 IF  H-SEC-SBT-CD = CNS-SKSBT-FDAL
                   OR  H-SEC-SBT-CD = CNS-SKSBT-PRI
                   OR  H-SEC-SBT-CD = CNS-SKSBT-CASH
                   OR  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-17
                   OR  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-22
                 THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-KUNI-FLG =["WK-KUNI-FLG"]"
      D    DISPLAY  CNS-PGM-ID":WK-TRHK-TUKA-0604=["WK-TRHK-TUKA-0604"]"
      *-----------------------------------------------------------------
                   IF  WK-KUNI-FLG = CNS-OFF
                     OR WK-TRHK-TUKA-0604 NOT = WK-TRHK-TUKA
                   THEN
                     PERFORM  SUSC0604-RTN
                   ELSE
                     IF  WK-RTN-0604 = CNS-RTN-110
                     THEN
                       IF  WK-1190-STATUS < CNS-4
                       THEN
                         MOVE  CNS-4          TO  WK-1190-STATUS
                       ELSE
                         CONTINUE
                       END-IF
                       IF  WK-STATUS < CNS-4
                       THEN
                         MOVE  CNS-4          TO  WK-STATUS
                       ELSE
                         CONTINUE
                       END-IF
                       IF  WK-RTN-CODE < CNS-4
                       THEN
                         MOVE  CNS-4          TO  WK-RTN-CODE
                       ELSE
                         CONTINUE
                       END-IF
                     ELSE
                       CONTINUE
                     END-IF
                   END-IF
                   MOVE  WK-KUNI-CD-RYAKU
                     TO  WK-HAKO-CD-2
                 ELSE
                   CONTINUE
                 END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":国コード_略式=["WK-HAKO-CD-2"]"
      *-----------------------------------------------------------------
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-HYK-EX-FLG=["WK-HYK-EX-FLG"]"
      *-----------------------------------------------------------------
      *---------- 乗除区分を取得
           IF  WK-STATUS < CNS-16
           THEN
             IF  WK-HYK-EX-FLG = CNS-OFF
             THEN
               PERFORM  SCZY4009-RTN
             ELSE
               IF  WK-RTN-4009 = CNS-RTN-110
               THEN
      *----------  ワーク実行ステータス
                 IF  WK-STATUS  < CNS-4
                 THEN
                   MOVE  CNS-4            TO  WK-STATUS
                 ELSE
                   CONTINUE
                 END-IF
      *----------  1190実行ステータス
                 IF   WK-STATUS > WK-1190-STATUS
                 THEN
                   MOVE  WK-STATUS        TO  WK-1190-STATUS
                 ELSE
                   CONTINUE
                 END-IF
      *----------  ワークリターンコード
                 IF  WK-RTN-CODE < WK-STATUS
                 THEN
                   MOVE  WK-STATUS        TO  WK-RTN-CODE
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
           IF  WK-STATUS < CNS-16
           THEN
             IF  WK-PRIO-1-FLG = CNS-OFF
              OR  WK-TRHK-TUKA-4012 NOT = H-TRHK-TUKA OF HST-TBL-SELECT
             THEN
               PERFORM  SCZY4012-RTN
             ELSE
               IF  WK-RTN-4012 = CNS-RTN-110
               THEN
      *----------  ワーク実行ステータス
                 IF  WK-STATUS  < CNS-4
                 THEN
                   MOVE  CNS-4            TO  WK-STATUS
                 ELSE
                   CONTINUE
                 END-IF
      *----------  1190実行ステータス
                 IF   WK-STATUS > WK-1190-STATUS
                 THEN
                   MOVE  WK-STATUS        TO  WK-1190-STATUS
                 ELSE
                   CONTINUE
                 END-IF
      *----------  ワークリターンコード
                 IF  WK-RTN-CODE < WK-STATUS
                 THEN
                   MOVE  WK-STATUS        TO  WK-RTN-CODE
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
                 CONTINUE
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク取引運用乗除区分フラグ=["
      D             WK-KWS-ZYOUHO-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク約定為替換算時採用系列_3017=["
      D             WK-PRIO-3017"]"
      D    DISPLAY  CNS-PGM-ID":ワークベース通貨コード_3017=["
      D             WK-TRHK-TUKA-3017"]"
      D    DISPLAY  CNS-PGM-ID":ワーク目的通貨コード_3017=["
      D             WK-CAPITAL-TUKA-3017"]"
      D    DISPLAY  CNS-PGM-ID":ワーク約定為替換算時採用系列=["
      D             WK-PRIO-1-EX-KRTU"]"
      D    DISPLAY  CNS-PGM-ID":DBから取得した取引通貨=["H-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID":ワーク運用通貨コード=["
      D             WK-CAPITAL-TUKA-CD"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-16
           THEN
             IF  WK-KWS-ZYOUHO-FLG = CNS-OFF
              OR  WK-PRIO-3017 NOT = WK-PRIO-1-EX-KRTU
              OR  WK-TRHK-TUKA-3017 NOT = H-TRHK-TUKA
              OR  WK-CAPITAL-TUKA-3017 NOT = WK-CAPITAL-TUKA-CD
             THEN
               PERFORM  SCZY3017-RTN
             ELSE
               EVALUATE  WK-RTN-3017
                 WHEN  CNS-RTN-110
                 WHEN  CNS-RTN-800
      *----------  ワーク実行ステータス
                   IF  WK-STATUS  < CNS-4
                   THEN
                     MOVE  CNS-4            TO  WK-STATUS
                   ELSE
                     CONTINUE
                   END-IF
      *----------  1190実行ステータス
                   IF   WK-STATUS > WK-1190-STATUS
                   THEN
                     MOVE  WK-STATUS        TO  WK-1190-STATUS
                   ELSE
                     CONTINUE
                   END-IF
      *----------  ワークリターンコード
                   IF  WK-RTN-CODE < WK-STATUS
                   THEN
                     MOVE  WK-STATUS        TO  WK-RTN-CODE
                   ELSE
                     CONTINUE
                   END-IF
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *******              テーマ3422         修正  開始        ********
      *----------ワーク商品区分＝"22"(為替予約)の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク商品区分=["WK-SYOHIN-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-22
             THEN
             IF  WK-STATUS < CNS-16
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク取引決済乗除区分フラグ=["
      D             WK-TH-ZYOUHO-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク約定為替換算時採用系列_時価(取引"
      D             "通貨)用=["WK-PRIO-CP"]"
      D    DISPLAY  CNS-PGM-ID":ワークベース通貨コード_時価(取引通貨)用"
      D             " =["WK-BASE-TUKA-CP"]"
      D    DISPLAY  CNS-PGM-ID":ワーク目的通貨コード_時価(取引通貨)用=["
      D             WK-MOKU-TUKA-CP"]"
      D    DISPLAY  CNS-PGM-ID":ワーク約定為替換算時採用系列=["
      D             WK-PRIO-1-EX-KRTU"]"
      D    DISPLAY  CNS-PGM-ID":DBから取得した為替決済通貨=["
      D             H-KWS-TH-TUKA-CD"]"
      D    DISPLAY  CNS-PGM-ID":DBから取得した取引通貨=["
      D             H-TRHK-TUKA"]"
      *-----------------------------------------------------------------
                 IF  WK-TH-ZYOUHO-FLG = CNS-OFF
                  OR  WK-PRIO-CP  NOT = WK-PRIO-1-EX-KRTU
                  OR  WK-BASE-TUKA-CP    NOT = H-KWS-TH-TUKA-CD
                  OR  WK-MOKU-TUKA-CP    NOT = H-TRHK-TUKA
                 THEN
                   PERFORM  SCZY3017-2-RTN
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード_時価(取引通貨)=["
      D             WK-RTN-3017-2"]"
      *-----------------------------------------------------------------
                   EVALUATE  WK-RTN-3017-2
                     WHEN  CNS-RTN-110
                     WHEN  CNS-RTN-800
      *--------------  ワーク実行ステータス
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク実行ステータス=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-1190-STATUS=["WK-1190-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
                       IF  WK-STATUS  < CNS-4
                       THEN
                         MOVE  CNS-4            TO  WK-STATUS
                       ELSE
                         CONTINUE
                       END-IF
      *--------------  1190実行ステータス
                       IF   WK-STATUS > WK-1190-STATUS
                       THEN
                         MOVE  WK-STATUS        TO  WK-1190-STATUS
                       ELSE
                         CONTINUE
                       END-IF
      *--------------  ワークリターンコード
                       IF  WK-RTN-CODE < WK-STATUS
                       THEN
                         MOVE  WK-STATUS        TO  WK-RTN-CODE
                       ELSE
                         CONTINUE
                       END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク実行ステータス=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-1190-STATUS=["WK-1190-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
                     WHEN  OTHER
                       CONTINUE
                   END-EVALUATE
                 END-IF
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *******              テーマ3422         修正  終了        ********
      *------------------ <連結障害1532の対応 START>--------------------
      *---------- 時価（取引通貨）編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク商品区分=["WK-SYOHIN-KBN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク乗除区分2（時価（取引通貨）用）"
      D             "=["WK-KWS-ZYOUHO-JZS-2"]"
      D    DISPLAY  CNS-PGM-ID":運用成果残高.時価(取引通貨)=["
      D             H-CP-KRTU-CD"]"
      *-----------------------------------------------------------------
             IF  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-22
             THEN
               IF  WK-KWS-ZYOUHO-JZS-2 = CNS-X-2
               THEN
                 IF   H-CP-KRTU-CD NOT = ZERO
                 THEN
                    COMPUTE  WK-CP-KRTU-CD
                          =  CNS-1
                          /  H-CP-KRTU-CD
                 ELSE
                   MOVE  CNS-0
                     TO  WK-CP-KRTU-CD
                 END-IF
               ELSE
                 MOVE  H-CP-KRTU-CD  TO  WK-CP-KRTU-CD
               END-IF
             ELSE
               MOVE  H-CP-KRTU-CD  TO  WK-CP-KRTU-CD
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":時価（取引通貨) =["WK-CP-KRTU-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-SYOHIN-KBN=["WK-SYOHIN-KBN"]"
      D    DISPLAY  CNS-PGM-ID":WK-KWS-ZYOUHO-JZS-2=["
      D             WK-KWS-ZYOUHO-JZS-2"]"
      *-----------------------------------------------------------------
      *---------- 評価為替レート編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク乗除区分1（評価為替レート用）"
      D             "=["WK-KWS-ZYOUHO-JZS"]"
      D    DISPLAY  CNS-PGM-ID":運用成果残高.評価為替レート=["
      D             H-HYK-KWS"]"
      *-----------------------------------------------------------------
             IF  WK-KWS-ZYOUHO-JZS = CNS-X-2
             THEN
               IF  H-HYK-KWS NOT = ZERO
               THEN
                 COMPUTE  WK-HYK-KWS
                       =  CNS-1
                       /  H-HYK-KWS
               ELSE
                 MOVE  CNS-0
                   TO  WK-HYK-KWS
               END-IF
             ELSE
               MOVE  H-HYK-KWS         TO  WK-HYK-KWS
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":評価為替レート編集=["WK-HYK-KWS"]"
      D    DISPLAY  CNS-PGM-ID":WK-KWS-ZYOUHO-JZS=["WK-KWS-ZYOUHO-JZS"]"
      D    DISPLAY  CNS-PGM-ID":WK-KANRI-SURYO-TANI=["
      D             WK-KANRI-SURYO-TANI"]"
      D    DISPLAY  CNS-PGM-ID":H-SEC-SBT-CD=["H-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":H-THTK-ST-KNG=["H-THTK-ST-KNG"]"
      D    DISPLAY  CNS-PGM-ID":H-HOU-SURYO=["H-HOU-SURYO"]"
      *-----------------------------------------------------------------
      *------------------ <連結障害1532の対応 END  >--------------------
      *---------- 取得単価(取引通貨)編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク商品区分=["WK-SYOHIN-KBN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク乗除区分2（時価（取引通貨）用）"
      D             "=["WK-KWS-ZYOUHO-JZS-2"]"
      D    DISPLAY  CNS-PGM-ID":運用成果残高.取得単価(取引通貨)=["
      D             H-THTK-ST-TNK   OF  HST-TBL-SELECT"]"
      *-----------------------------------------------------------------
             IF  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-22
             THEN
               IF  WK-KWS-ZYOUHO-JZS-2 = CNS-X-2
               THEN
                 IF   H-THTK-ST-TNK   OF  HST-TBL-SELECT  NOT = ZERO
                 THEN
                    COMPUTE  WK-THTK-ST-TNK
                          =  CNS-1
                          /  H-THTK-ST-TNK   OF  HST-TBL-SELECT
                 ELSE
                   MOVE  CNS-0
                     TO  WK-THTK-ST-TNK
                 END-IF
               ELSE
                 MOVE  H-THTK-ST-TNK   OF  HST-TBL-SELECT
                   TO  WK-THTK-ST-TNK
               END-IF
             ELSE
               MOVE  H-THTK-ST-TNK   OF  HST-TBL-SELECT
                 TO  WK-THTK-ST-TNK
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得単価(取引通貨)編集後=["
      D             WK-THTK-ST-TNK"]"
      *-----------------------------------------------------------------
      *---------- 保有数量編集
             IF  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-22
               OR  H-SEC-SBT-CD = CNS-SKSBT-PRI
             THEN
               MOVE  H-THTK-ST-KNG     TO  WK-HOU-SURYO
             ELSE
               COMPUTE  WK-HOU-SURYO
                     =  H-HOU-SURYO  *  WK-KANRI-SURYO-TANI
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":保有数量編集=["WK-HOU-SURYO"]"
      *-----------------------------------------------------------------
      *----------  取得金額(取引通貨)編集
             IF  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-22
             THEN
               COMPUTE  WK-THTK-ST-KNG
                     =  H-HOU-SURYO  *  WK-KANRI-SURYO-TANI
             ELSE
               MOVE  H-THTK-ST-KNG     TO  WK-THTK-ST-KNG
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得金額(取引通貨)=["WK-THTK-ST-KNG"]"
      D    DISPLAY  CNS-PGM-ID":ワーク商品区分=["WK-SYOHIN-KBN"]"
      D    DISPLAY  CNS-PGM-ID":H-SEC-SBT-CD=["H-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":H-OP-TATE-FLG=["H-OP-TATE-FLG"]"
      D    DISPLAY  CNS-PGM-ID":H-THTK-HYK-SNEKI=["H-THTK-HYK-SNEKI"]"
      D    DISPLAY  CNS-PGM-ID":H-THTK-ST-KNG=["H-THTK-ST-KNG"]"
      *-----------------------------------------------------------------
      *----------  評価金額(取引通貨)編集
             IF  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-20
               OR  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-24
               OR  H-SEC-SBT-CD = CNS-SKSBT-XMFF
               OR  H-SEC-SBT-CD = CNS-SKSBT-TBA
             THEN
               EVALUATE  H-OP-TATE-FLG
                 WHEN  CNS-TATE-FLG-L
                   COMPUTE  WK-THTK-HYK-KN
                         =  H-THTK-HYK-SNEKI + H-THTK-ST-KNG
                 WHEN  CNS-TATE-FLG-S
                   COMPUTE  WK-THTK-HYK-KN
                         =  H-THTK-HYK-SNEKI - H-THTK-ST-KNG
                 WHEN  OTHER
                   MOVE  H-THTK-HYK-SNEKI  TO  WK-THTK-HYK-KN
               END-EVALUATE
             ELSE
               MOVE  H-THTK-HYK-KN     TO  WK-THTK-HYK-KN
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":評価金額(取引通貨)=["WK-THTK-HYK-KN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク商品区分=["WK-SYOHIN-KBN"]"
      D    DISPLAY  CNS-PGM-ID":H-SEC-SBT-CD=["H-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":H-OP-TATE-FLG=["H-OP-TATE-FLG"]"
      D    DISPLAY  CNS-PGM-ID":H-HYK-SNEKI-LC=["H-HYK-SNEKI-LC"]"
      D    DISPLAY  CNS-PGM-ID":H-SHTK-KN-LC=["H-SHTK-KN-LC"]"
      *-----------------------------------------------------------------
      *----------  評価金額(運用通貨)
             IF  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-20
               OR  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-24
               OR  H-SEC-SBT-CD = CNS-SKSBT-XMFF
               OR  H-SEC-SBT-CD = CNS-SKSBT-TBA
             THEN
               EVALUATE  H-OP-TATE-FLG
                 WHEN  CNS-TATE-FLG-L
                   COMPUTE  WK-HYK-KN-LC
                         =  H-HYK-SNEKI-LC + H-SHTK-KN-LC
                 WHEN  CNS-TATE-FLG-S
                   COMPUTE  WK-HYK-KN-LC
                         =  H-HYK-SNEKI-LC - H-SHTK-KN-LC
                 WHEN  OTHER
                   MOVE  H-HYK-SNEKI-LC    TO  WK-HYK-KN-LC
               END-EVALUATE
             ELSE
               MOVE  H-HYK-KN-LC       TO  WK-HYK-KN-LC
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":評価金額(運用通貨)=["WK-HYK-KN-LC"]"
      *-----------------------------------------------------------------
      *----------  備考_１
           IF  WK-STATUS < CNS-16
           THEN
             IF  H-BIKOU-1 = SPACE
             THEN
               MOVE  H-BIKOU-1         TO  WK-BIKOU-1
               INITIALIZE  WK-BIKOU-FLG
                           WK-BIKOU-4116
             ELSE
               IF  WK-BIKOU-FLG = CNS-OFF
                OR  WK-BIKOU-4116 NOT = H-BIKOU-1
               THEN
                 PERFORM  SCZY4116-RTN
               ELSE
                 EVALUATE  WK-RTN-4116
                   WHEN  CNS-RTN-110
                   WHEN  CNS-RTN-800
      *----------  ワーク実行ステータス
                     IF  WK-STATUS  < CNS-4
                     THEN
                       MOVE  CNS-4            TO  WK-STATUS
                     ELSE
                       CONTINUE
                     END-IF
      *----------  1190実行ステータス
                     IF   WK-STATUS > WK-1190-STATUS
                     THEN
                       MOVE  WK-STATUS        TO  WK-1190-STATUS
                     ELSE
                       CONTINUE
                     END-IF
      *----------  ワークリターンコード
                     IF  WK-RTN-CODE < WK-STATUS
                     THEN
                       MOVE  WK-STATUS        TO  WK-RTN-CODE
                     ELSE
                       CONTINUE
                     END-IF
                   WHEN  OTHER
                     CONTINUE
                 END-EVALUATE
               END-IF
             END-IF
           ELSE
             CONTINUE
           END-IF
      *----------  データ明細編輯
      *------------------ <残タスク157の対応 START>---------------------
           IF  WK-STATUS < CNS-4
           THEN
             PERFORM  DATA-RTN
           ELSE
             CONTINUE
           END-IF
      *------------------ <残タスク157の対応 END>-----------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  データ編集処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-EDIT-EXT.
           EXIT.
      *------------------ <残タスク135の対応 START>---------------------
      ******************************************************************
      *    商品属性全項目取得
      ******************************************************************
       SCZY4156-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***SCZY4156商品属性全項目取得 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4156-INOUT
                       PARM-RTNPKG
                       WK-SYOHIN-KBN
                       WK-KANRI-SURYO-TANI
                       WK-SEC-SBT-4156
                       WK-RTN-4156
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4156-ARG1
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD
             TO  SEC-SBT-CD             OF  PARM-SCZY4156-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4156-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             SEC-SBT-CD          OF  PARM-SCZY4156-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY4156  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4156"             USING  PARM-SCZY4156-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY4156  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4156) =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-RTNPKG    =["
      D                         COUNTER OF  PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG    =["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           MOVE  H-SEC-SBT-CD
             TO  WK-SEC-SBT-4156
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-4156
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
      *----------  ワーク商品区分
               MOVE  SYOHIN-KBN          OF    PARM-SCZY4156-ARG2
                 TO  WK-SYOHIN-KBN
      *----------  ワーク管理数量単位
               MOVE  KANRI-SURYO-TANI    OF    PARM-SCZY4156-ARG2
                 TO  WK-KANRI-SURYO-TANI
      *----------  異常
             WHEN  CNS-RTN-110
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4             TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-1190-STATUS < WK-STATUS
               THEN
                 MOVE  WK-STATUS    TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < WK-STATUS
               THEN
                 MOVE  WK-STATUS    TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
             COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               STRING  CNS-SEC-SBT-CD
                       H-SEC-SBT-CD
                       DELIMITED BY SPACE
                       INTO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
               END-STRING
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
      *----------  上記以外
             WHEN  OTHER
      *----------  WK-STATUS
               MOVE  CNS-16              TO  WK-STATUS
      *----------  1190実行ステータス
               MOVE  CNS-16              TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16              TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
               PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID          TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-023         TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901         TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD
                 OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                         TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0        TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE               TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":商品区分=["WK-SYOHIN-KBN"]"
      D    DISPLAY  CNS-PGM-ID":管理数量単位=["WK-KANRI-SURYO-TANI"]"
      D    DISPLAY  CNS-PGM-ID":***SCZY4156商品属性全項目取得 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4156-EXT.
           EXIT.
      *------------------ <残タスク135の対応 END>-----------------------
      ******************************************************************
      *    データ明細編輯する
      ******************************************************************
       DATA-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  データ明細編輯 START  ***"
      *-----------------------------------------------------------------
      *----------  (メッセージコード)
           MOVE  CNS-BL0001
             TO  MSG-CODE          OF  WK-REC
      *----------  自社コード(出力側)
           MOVE  CNS-RS
             TO  ZISYA-CODE        OF  WK-REC
      *******         テーマ3406     20130117 修正  開始        ********
      *----------  ポートフォリオコード
      *------ ワーク業務タスクID＝"T6820US"(ＳＢＡ残高データ接続)の場合
           IF  WK-GYOMU-TASK-ID     OF  WK-ARGUMENT
               =  CNS-SBA-ZANDAKA-SETUZOKU
           THEN
      *------------  運用成果残高.ファンドコード
             STRING  H-FUND-CD        OF HST-TBL-SELECT
      *------------  運用成果残高.ポートフォリオコード
                     H-PTF-CD         OF HST-TBL-SELECT
      *------------  運用成果残高.評価系列コード
                     H-HYK-KRTU-CD    OF  HST-TBL-SELECT
             DELIMITED                BY  SIZE
             INTO  PTF-CD             OF  WK-REC
             END-STRING
           ELSE
             MOVE  WK-TEMP-PTF-CD     TO  PTF-CD
                                      OF  WK-REC
           END-IF
      *******         テーマ3406     20130117 修正  終了        ********
      *----------  約定/受渡区分
           MOVE  H-YJ-UW-KBN       OF  HST-TBL-SELECT
             TO  YJ-UW-KBN         OF  WK-REC
      *----------  残高日付
           MOVE  H-ZANTK-YMD       OF  HST-TBL-SELECT
             TO  ZANTK-YMD         OF  WK-REC
      *----------  証券種別
      *----------　テーマ3276対応開始
           IF    WK-RIYO-CMP-CD  =  CNS-CMP-1054
             AND WK-GAIBU-MEG-CD =  CNS-MEG-RES1
             AND WK-SEC-SBT-CD   =  CNS-SEC-XMOS
           THEN
             MOVE  CNS-SEC-S
               TO  SEC-SBT-CD      OF  WK-REC
           ELSE
      *------------------ <連結障害841の対応 START>---------------------
             MOVE  WK-SEC-SBT-CD-3
      *------------------ <連結障害841の対応 END>-----------------------
               TO  SEC-SBT-CD      OF  WK-REC
           END-IF
      *----------　テーマ3276対応終了
      *----------  取消フラグ
           IF  H-DEL-KBN NOT = SPACE
           THEN
             MOVE  H-DEL-KBN       OF  HST-TBL-SELECT
               TO  DEL-KBN         OF  WK-REC
           ELSE
             MOVE  CNS-X-0
               TO  DEL-KBN         OF  WK-REC
           END-IF
      *----------  確定フラグ
           MOVE  H-KT-KBN          OF  HST-TBL-SELECT
             TO  KT-KBN            OF  WK-REC
      *----------  取引通貨
      *------------------ <残タスク135の対応 START>---------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TRHK-TUKA=["WK-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-CD-3=["WK-SEC-SBT-CD-3"]"
      D    DISPLAY  CNS-PGM-ID":WK-TRHK-TUKA=["WK-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID":WK-CAPITAL-TUKA-CD=["
      D             WK-CAPITAL-TUKA-CD"]"
      *-----------------------------------------------------------------
           IF  (WK-SEC-SBT-CD-3  = CNS-SKSBT-FBMS
               OR  WK-SEC-SBT-CD-3  = CNS-SKSBT-FSMS
               OR  WK-SEC-SBT-CD-3  = CNS-SKSBT-CBMS
               OR  WK-SEC-SBT-CD-3  = CNS-SKSBT-OOET)
               AND WK-TRHK-TUKA = WK-CAPITAL-TUKA-CD
           THEN
             MOVE  CNS-TEXT-OTH
               TO  TRHK-TUKA                 OF  WK-REC
           ELSE
             EVALUATE  WK-TRHK-TUKA
               WHEN  CNS-TEXT-OTHR
                 MOVE  CNS-TEXT-OTH
                   TO  TRHK-TUKA             OF  WK-REC
               WHEN   CNS-TEXT-WR
                 MOVE  CNS-TEXT-WRD
                   TO  TRHK-TUKA             OF  WK-REC
               WHEN   CNS-TEXT-SUPN
                 MOVE  CNS-TEXT-SUP
                   TO  TRHK-TUKA             OF  WK-REC
               WHEN  OTHER
                 MOVE  WK-TRHK-TUKA
                   TO  TRHK-TUKA             OF  WK-REC
             END-EVALUATE
           END-IF
      *------------------ <残タスク135の対応 END>-----------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引通貨=["TRHK-TUKA    OF  WK-REC"]"
      *-----------------------------------------------------------------
      *----------  為替決済通貨
      *------------------ <残タスク135の対応 START>---------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-KWS-TH-TUKA-CD=["
      D             WK-KWS-TH-TUKA-CD"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-KWS-TH-TUKA-CD
             WHEN  CNS-TEXT-OTHR
               MOVE  CNS-TEXT-OTH
                 TO  KWS-TH-TUKA-CD        OF  WK-REC
             WHEN  CNS-TEXT-WR
               MOVE  CNS-TEXT-WRD
                 TO  KWS-TH-TUKA-CD        OF  WK-REC
             WHEN  CNS-TEXT-SUPN
               MOVE  CNS-TEXT-SUP
                 TO  KWS-TH-TUKA-CD        OF  WK-REC
             WHEN  OTHER
               MOVE  WK-KWS-TH-TUKA-CD
                 TO  KWS-TH-TUKA-CD        OF  WK-REC
           END-EVALUATE
      *------------------ <残タスク135の対応 END>-----------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":為替決済通貨=["
      D             KWS-TH-TUKA-CD        OF  WK-REC"]"
      *-----------------------------------------------------------------
      *----------  証券発行元の所属する国
           MOVE  WK-HAKO-CD-2
             TO  HAKO-CD           OF  WK-REC
      *----------  銘柄コード体系
           IF  FLG-DEFAULT-KRTU-CD = CNS-1
           THEN
             MOVE  CNS-R
               TO  MEG-CD-GRP           OF  WK-REC
           ELSE
             MOVE  WK-CD-REF-KRTU-CD
               TO  MEG-CD-GRP           OF  WK-REC
           END-IF
      *----------  銘柄コード
           MOVE  CNS-1             TO  WK-IDX-C
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DATA-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM                 VARYING  WK-IDX-D
             FROM  CNS-1 BY CNS-1  UNTIL  WK-IDX-D > CNS-20
             IF  WK-GAIBU-MEG-CD1(WK-IDX-D:CNS-1) NOT = SPACE
             THEN
               MOVE  WK-GAIBU-MEG-CD1(WK-IDX-D:CNS-1)
                 TO  MEG-CD   OF  WK-REC(WK-IDX-C:CNS-1)
               COMPUTE  WK-IDX-C = WK-IDX-C  +  CNS-1
             ELSE
               CONTINUE
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DATA-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------

      *----------  買建/売建フラグ
           MOVE  H-TATE-FLG        OF  HST-TBL-SELECT
             TO  TATE-FLG          OF  WK-REC
      *----------  作成/更新年月日
           MOVE  WK-SHORI-YMD-9
             TO  UPD-YMD           OF  WK-REC
      *----------  作成/更新時刻
           MOVE  WK-MAC-DATE-TIME(9:6)
             TO  WK-UPD-TIME
           MOVE  WK-UPD-TIME-9
             TO  UPD-TIME          OF  WK-REC
      *----------  約定日
           MOVE  H-TG-YKJ-YMD      OF  HST-TBL-SELECT
             TO  YAKU-NITI         OF  WK-REC
      *----------  建玉/約定番号
           MOVE  H-KB-KANRI-ID     OF  HST-TBL-SELECT
             TO  KB-KANRI-ID
                                   OF  WK-REC
      *----------  カストディコード
           MOVE  WK-CAST-CD-2
             TO  CAST-CD           OF  WK-REC
      *----------  保有数量
           MOVE  WK-HOU-SURYO
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HOU-SURYO         OF  WK-REC
      *----------  数量単位
      *----------　テーマ3276対応開始
           IF    WK-RIYO-CMP-CD  =  CNS-CMP-1054
             AND WK-GAIBU-MEG-CD =  CNS-MEG-RES1
             AND WK-SEC-SBT-CD   =  CNS-SEC-XMOS
           THEN
             COMPUTE  WK-SURYO-TANI
                 =  H-SURYO-TANI   OF  HST-TBL-SELECT
                 /  WK-KANRI-SURYO-TANI  /  CNS-10
           ELSE
             COMPUTE  WK-SURYO-TANI
                 =  H-SURYO-TANI   OF  HST-TBL-SELECT
                 /  WK-KANRI-SURYO-TANI
           END-IF
      *----------　テーマ3276対応終了
           MOVE  WK-SURYO-TANI
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SURYO-TANI        OF  WK-REC
      *----------  取得金額(取引通貨)
           MOVE  WK-THTK-ST-KNG
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-ST-KNG       OF  WK-REC
      *----------  取得単価(取引通貨)
      *----------　テーマ3276対応開始
           IF    WK-RIYO-CMP-CD  =  CNS-CMP-1054
             AND WK-GAIBU-MEG-CD =  CNS-MEG-RES1
             AND WK-SEC-SBT-CD   =  CNS-SEC-XMOS
           THEN
             COMPUTE  WK-ITIOKU-TNK =
                   H-THTK-ST-TNK   OF  HST-TBL-SELECT  *  CNS-10
             MOVE  WK-ITIOKU-TNK
               TO  WK-18-18-X
           ELSE
             MOVE  WK-THTK-ST-TNK
               TO  WK-18-18-X
           END-IF
      *----------　テーマ3276対応終了
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 29 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-ST-TNK       OF  WK-REC
      *----------  時価(取引通貨)
      *----------　テーマ3276対応開始
           IF    WK-RIYO-CMP-CD  =  CNS-CMP-1054
             AND WK-GAIBU-MEG-CD =  CNS-MEG-RES1
             AND WK-SEC-SBT-CD   =  CNS-SEC-XMOS
           THEN
             COMPUTE  WK-ITIOKU-CP = WK-CP-KRTU-CD * CNS-10
             MOVE  WK-ITIOKU-CP
               TO  WK-18-18-X
           ELSE
             MOVE  WK-CP-KRTU-CD
               TO  WK-18-18-X
           END-IF
      *----------　テーマ3276対応終了
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 29 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  CP-KRTU-CD        OF  WK-REC
      *----------  時価採用日付
           MOVE  H-CP-SAIYO-YMD    OF  HST-TBL-SELECT
             TO  CP-SAIYO-YMD      OF  WK-REC
      *----------  時価採用市場
           MOVE  H-CP-SAIYO-SIJO   OF  HST-TBL-SELECT
             TO  CP-SAIYO-SIJO     OF  WK-REC
      *----------  評価金額(取引通貨)
           MOVE  WK-THTK-HYK-KN
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-KN       OF  WK-REC
      *----------  評価損益(取引通貨)
           MOVE  H-THTK-HYK-SNEKI  OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-SNEKI    OF  WK-REC
      *----------  前払金残(取引通貨)
           MOVE  H-THTK-PPAYZN     OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-PPAYZN       OF  WK-REC
      *----------  経過利息金額(取引通貨)
           MOVE  H-THTK-KKRS       OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-KKRS         OF  WK-REC
      *----------  未収収益(取引通貨)
      *----------　テーマ3344対応開始
           IF    ( WK-SYOHIN-KBN = CNS-SYOHIN-KBN-11
             OR    WK-SYOHIN-KBN = CNS-SYOHIN-KBN-24 )
             AND   TATE-FLG        OF  WK-REC = CNS-TATE-FLG-S
           THEN
             COMPUTE  WK-THTK-MS-EKI
                   =  H-THTK-MS-EKI  OF  HST-TBL-SELECT * (-1)
             MOVE  WK-THTK-MS-EKI  TO  WK-18-18-X
           ELSE
             MOVE  H-THTK-MS-EKI   OF  HST-TBL-SELECT
               TO  WK-18-18-X
           END-IF
      *----------　テーマ3344対応終了
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-MS-EKI       OF  WK-REC
      *----------  評価為替レート
           MOVE  WK-HYK-KWS
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 29 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-KWS           OF  WK-REC
      *----------  為替採用日付
           MOVE  H-KWS-SAIYO-YMD   OF  HST-TBL-SELECT
             TO  KWS-SAIYO-YMD     OF  WK-REC
      *----------  為替採用ソース
           MOVE  H-KWS-SAIYO-SOURCE
                                   OF  HST-TBL-SELECT
             TO  KWS-SAIYO-SOURCE  OF  WK-REC
      *----------  取得金額(運用通貨)
           MOVE  H-SHTK-KN-LC      OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SHTK-KN-LC        OF  WK-REC
      *----------  取得金額(運用通貨為替換算額)
           MOVE  SHTK-KN-LC        OF  WK-REC
             TO  UYTK-KWS-BOKAZN   OF  WK-REC
      *----------  取得単価(運用通貨)
      *----------　テーマ3276対応開始
           IF    WK-RIYO-CMP-CD  =  CNS-CMP-1054
             AND WK-GAIBU-MEG-CD =  CNS-MEG-RES1
             AND WK-SEC-SBT-CD   =  CNS-SEC-XMOS
           THEN
             COMPUTE  WK-ITIOKU-ST-TNK =
                   H-UYTK-ST-TNK   OF  HST-TBL-SELECT * CNS-10
             MOVE  WK-ITIOKU-ST-TNK
               TO  WK-18-18-X
           ELSE
             MOVE  H-UYTK-ST-TNK   OF  HST-TBL-SELECT
               TO  WK-18-18-X
           END-IF
      *----------　テーマ3276対応終了
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 29 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  UYTK-ST-TNK       OF  WK-REC
      *----------  評価金額(運用通貨)
           MOVE  WK-HYK-KN-LC
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-KN-LC         OF  WK-REC
      *----------  評価損益(運用通貨)
           MOVE  H-HYK-SNEKI-LC    OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-SNEKI-LC      OF  WK-REC
      *----------  前払金残(運用通貨)
           MOVE  H-UYTK-PPAY-ZN    OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  UYTK-PPAY-ZN      OF  WK-REC
      *----------  経過利息金額(運用通貨)
           MOVE  H-KEKA-RSK-LC     OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  KEKA-RSK-LC       OF  WK-REC
      *----------  未収収益(運用通貨)
      *----------　テーマ3344対応開始
           IF    ( WK-SYOHIN-KBN = CNS-SYOHIN-KBN-11
             OR    WK-SYOHIN-KBN = CNS-SYOHIN-KBN-24 )
             AND   TATE-FLG        OF  WK-REC = CNS-TATE-FLG-S
           THEN
             COMPUTE  WK-UYTK-MS-EKI
                   =  H-UYTK-MS-EKI  OF  HST-TBL-SELECT * (-1)
             MOVE  WK-UYTK-MS-EKI  TO  WK-18-18-X
           ELSE
             MOVE  H-UYTK-MS-EKI   OF  HST-TBL-SELECT
               TO  WK-18-18-X
           END-IF
      *----------　テーマ3344対応終了
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  UYTK-MS-EKI       OF  WK-REC
      *----------  送付側銘柄コード
           MOVE  MEG-CD            OF  WK-REC
             TO  SEND-MEG-CD       OF  WK-REC
      *----------  銘柄名称(日本語)
           MOVE  WK-MEG-MEI-JP
             TO  MEG-MEI-JP        OF  WK-REC
      *----------  銘柄名称(英語)
           MOVE  WK-MEG-MEI-EN
             TO  MEG-MEI-EN        OF  WK-REC
      *----------  債券ｸｰﾎﾟﾝ
           MOVE  WK-SAKEN-KP-KBN
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SK-KP             OF  WK-REC
      *----------  債券償還日
           MOVE  WK-SAKEN-SK-YMD
             TO  SHOKAN-YMD        OF  WK-REC
      *----------  備考１
           MOVE  WK-BIKOU-1
             TO  BIKOU-1           OF  WK-REC
      *----------  備考２
           MOVE  H-BIKOU-2         OF  HST-TBL-SELECT
             TO  BIKOU-2           OF  WK-REC
      *----------  備考３
           MOVE  H-BIKOU-3         OF  HST-TBL-SELECT
             TO  BIKOU-3           OF  WK-REC
      *----------  備考４
           MOVE  H-BIKOU-4         OF  HST-TBL-SELECT
             TO  BIKOU-4           OF  WK-REC
      *----------  備考５
           MOVE  H-BIKOU-5         OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  BIKOU-5           OF  WK-REC
      *----------  備考６
           MOVE  H-BIKOU-6         OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  BIKOU-6           OF  WK-REC
      *----------  備考７
           MOVE  H-BIKOU-7         OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  BIKOU-7           OF  WK-REC
      *----------  備考８
           MOVE  H-BIKOU-8         OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 29 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  BIKOU-8           OF  WK-REC
      *----------  備考９
           MOVE  H-BIKOU-9         OF  HST-TBL-SELECT
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  BIKOU-9           OF  WK-REC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":(メッセージコード)=["MSG-CODE  OF
      D                                                  WK-REC"]"
      D    DISPLAY  CNS-PGM-ID":自社コード(出力側)=["ZISYA-CODE  OF
      D                                                  WK-REC"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["PTF-CD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":約定/受渡区分=["YJ-UW-KBN
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":残高日付=["ZANTK-YMD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":証券種別=["SEC-SBT-CD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":取消フラグ=["DEL-KBN
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":確定フラグ=["KT-KBN
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":取引通貨=["TRHK-TUKA
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":為替決済通貨=["KWS-TH-TUKA-CD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":証券発行元の所属する国=["HAKO-CD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード体系=["MEG-CD-GRP
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["MEG-CD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":買建/売建フラグ=["TATE-FLG
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":作成/更新年月日=["UPD-YMD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":作成/更新時刻=["UPD-TIME
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":約定日=["YAKU-NITI
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":建玉/約定番号=["KB-KANRI-ID
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":カストディコード=["CAST-CD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":保有数量=["HOU-SURYO
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":数量単位=["SURYO-TANI
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":取得金額(取引通貨)=["THTK-ST-KNG
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":取得単価(取引通貨)=["THTK-ST-TNK
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":時価(取引通貨)=["CP-KRTU-CD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":時価採用日付=["CP-SAIYO-YMD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":時価採用市場=["CP-SAIYO-SIJO
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":評価金額(取引通貨)=["THTK-HYK-KN
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":評価損益(取引通貨)="
      D                                         "["THTK-HYK-SNEKI
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":前払金残(取引通貨)=["THTK-PPAYZN
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":経過利息(取引通貨)=["THTK-KKRS
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":未収収益(取引通貨)=["THTK-MS-EKI
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":評価為替レート=["HYK-KWS
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":為替採用日付=["KWS-SAIYO-YMD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":為替採用ソース=["KWS-SAIYO-SOURCE
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨為替換算額)="
      D                                     "["UYTK-KWS-BOKAZN
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨)=["SHTK-KN-LC
      D                                 OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":取得単価(運用通貨)=["UYTK-ST-TNK
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":評価金額(運用通貨)=["HYK-KN-LC
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":評価損益(運用通貨)=["HYK-SNEKI-LC
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":前払金残(運用通貨)=["UYTK-PPAY-ZN
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":経過利息(運用通貨)=["KEKA-RSK-LC
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":未収収益(運用通貨)=["UYTK-MS-EKI
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":送付側銘柄コード=["SEND-MEG-CD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(日本語)=["MEG-MEI-JP
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(英語)=["MEG-MEI-EN
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":債券ｸｰﾎﾟﾝ=[" SK-KP
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":債券償還日=["SHOKAN-YMD
      D                                  OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考１=["BIKOU-1   OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考２=["BIKOU-2   OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考３=["BIKOU-3   OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考４=["BIKOU-4   OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考５=["BIKOU-5   OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考６=["BIKOU-6   OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考７=["BIKOU-7   OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考８=["BIKOU-8   OF  WK-REC "]"
      D    DISPLAY  CNS-PGM-ID":備考９=["BIKOU-9   OF  WK-REC "]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** データ明細編輯 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-EXT.
           EXIT.
      *****************************************************************
      *   外部コード取得処理
      *****************************************************************
       GAIBU-PTF-CD-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  外部コード取得処理  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4182-INOUT
                       PARM-RTNPKG
                       WK-TEMP-PTF-CD
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4182-ARG1
      *----------  コード種類
           MOVE  CNS-X-10
             TO  CD-SHRU                OF  PARM-SCZY4182-ARG1
      *----------  コードリファレンス系列コード
           MOVE  CNS-D001
             TO  CD-REF-KRTU-CD         OF  PARM-SCZY4182-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SCZY4182-ARG1
      *----------  変換元コード
           STRING  WK-FUND-CD-DETAIL    OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                   WK-PTF-CD-DETAIL     OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                   WK-DEFAUL-THYK-CD    OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             INTO  NAIBU-CD             OF  PARM-SCZY4182-ARG1
           END-STRING
      *----------  基準日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT-2
             TO  KJN-YMD                OF  PARM-SCZY4182-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FUND-CD=["
      D          WK-FUND-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":PTF-CD=["
      D          WK-PTF-CD-DETAIL    OF  WK-FUND-PTF-DETAIL(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY4182-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":コード種類=["
      D             CD-SHRU             OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":コードリファレンス系列コード=["
      D             CD-REF-KRTU-CD      OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":変換元コード=["
      D             NAIBU-CD            OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4182 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4182"             USING  PARM-SCZY4182-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4182 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4182)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
             WHEN  CNS-RTN-002
               MOVE  GAIBU-CD           OF  SAKI-AREA(CNS-1)(1:20)
                 TO  WK-TEMP-PTF-CD
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード         =["WK-TEMP-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理  正常"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
               MOVE  CNS-ON           TO  FLG-FETCH-END2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-END2   =["FLG-FETCH-END2"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理  業務エラー"
      *-----------------------------------------------------------------
               MOVE  CNS-ON           TO  FLG-FETCH-END2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-END2   =["FLG-FETCH-END2"]"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  WK-STATUS
             MOVE  CNS-16               TO  WK-STATUS
      *----------  1190実行ステータス
             MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワークリターンコード
             MOVE  CNS-16               TO  WK-RTN-CODE
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-024          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  外部コード取得処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GAIBU-PTF-CD-EXT.
           EXIT.
      ******************************************************************
      *    銘柄属性取得処理
      ******************************************************************
       SCZY3004-CHAN-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  銘柄属性取得処理"
      D             " START  ***"
      *----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3004-INOUT
                       PARM-RTNPKG
                       WK-MEG-MEI-JP
                       WK-MEG-MEI-EN
                       WK-SAKEN-KP-KBN
                       WK-SAKEN-SK-YMD
                       WK-SISAN-BUNRUI-CD
                       WK-CALL-PUT-KBN
                       WK-MEG-CD-3004
                       WK-RTN-3004
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-ARGUMENT
             TO  RIYO-CMP-CD            OF  PARM-SCZY3004-ARG1
      *----------  内部銘柄コード
           MOVE  H-MEG-CD               OF  HST-TBL-SELECT
             TO  NAIBU-MEG-CD           OF  PARM-SCZY3004-ARG1
      *---------- 商品分類コード
      *---------- 元証券種別コード
      *--------------------テーマ2185対応-------------------------------
      *----------  銘柄リファレンス系列コード
      *    MOVE  I-CD-REF-KRTU-CD         OF  WK-DENBUN-INFO
      *      TO  KEIRETU-CD             OF  PARM-SCZY3004-ARG1
      *----------  業務タスクID
      *    MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
      *      TO  GYOUMU-TASKU-CD        OF  PARM-SCZY3004-ARG1
      *--------------------テーマ2185対応-------------------------------
      *----------  基本属性取得用基準日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT
             TO  KIHON-KIJYUN-BI        OF  PARM-SCZY3004-ARG1
      *----------  付加属性取得用基準日
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD=["
      D             RIYO-CMP-CD         OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":NAIBU-MEG-CD=["
      D             NAIBU-MEG-CD        OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SYOUHIN-CD=["
      D             SYOUHIN-CD          OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SYOUKEN-CD=["
      D             SYOUKEN-CD          OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":GEN-SYOUKEN-CD=["
      D             GEN-SYOUKEN-CD      OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":MEIGAR-TUKA-CD=["
      D             MEIGAR-TUKA-CD      OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":KEIRETU-CD=["
      D             KEIRETU-CD          OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":GYOUMU-TASKU-CD=["
      D             GYOUMU-TASKU-CD     OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":KIHON-KIJYUN-BI=["
      D             KIHON-KIJYUN-BI     OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FUKA-KIJYUN-BI=["
      D             FUKA-KIJYUN-BI      OF  PARM-SCZY3004-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3004 START  ***"
      *----------------------------------------------------------------
           CALL  "SCZY3004"             USING  PARM-SCZY3004-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3004 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY3004)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *----------------------------------------------------------------
           MOVE  H-MEG-CD               OF  HST-TBL-SELECT
             TO  WK-MEG-CD-3004
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-3004
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
             WHEN  CNS-RTN-111
             WHEN  CNS-RTN-112
      *---------- 銘柄名称(日本語)
               MOVE  MEG-NAME-J         OF  PARM-SCZY3004-ARG2
                 TO  WK-MEG-MEI-JP
      *---------- 銘柄名称(英語)
               MOVE  MEG-NAME-E         OF  PARM-SCZY3004-ARG2
                 TO  WK-MEG-MEI-EN
      *---------- 債券ｸｰﾎﾟﾝ
               MOVE  RRT-WARI-RT        OF  PARM-SCZY3004-ARG2
                 TO  WK-SAKEN-KP-KBN
      *---------- 債券償還日
               MOVE  SHOKAN-YMD         OF  PARM-SCZY3004-ARG2
                 TO  WK-SAKEN-SK-YMD
               IF  WK-SAKEN-SK-YMD  =  ZERO
               THEN
      *---------- 満期日
                 MOVE  MNK-YMD          OF  PARM-SCZY3004-ARG2
                   TO  WK-SAKEN-SK-YMD
               ELSE
                 CONTINUE
               END-IF
      *---------- 資産分類コード
               MOVE  SISAN-BUNRUI-CD    OF  PARM-SCZY3004-ARG2
                 TO  WK-SISAN-BUNRUI-CD
      *---------- コールプット区分
               MOVE  CALL-PUT-KBN       OF  PARM-SCZY3004-ARG2
                 TO  WK-CALL-PUT-KBN
      *---------- 株式種別
               MOVE  RF-KABU-SBT        OF  PARM-SCZY3004-ARG2
                 TO  WK-RF-KABU-SBT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄属性取得処理 正常"
      *-----------------------------------------------------------------
      *----------  異常
             WHEN  CNS-RTN-110
      *---------- 銘柄名称(日本語)
               MOVE  SPACE
                 TO  WK-MEG-MEI-JP
      *---------- 銘柄名称(英語)
               MOVE  SPACE
                 TO  WK-MEG-MEI-EN
      *---------- 債券ｸｰﾎﾟﾝ
               MOVE  ZERO
                 TO  WK-SAKEN-KP-KBN
      *---------- 債券償還日
               MOVE  ZERO
                 TO  WK-SAKEN-SK-YMD
      *---------- 資産分類コード
               MOVE  SPACE
                 TO  WK-SISAN-BUNRUI-CD
      *---------- コールプット区分
               MOVE  SPACE
                 TO  WK-CALL-PUT-KBN
      *---------- 株式種別
               MOVE  SPACE
                 TO  WK-RF-KABU-SBT
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理  業務エラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *----------  上記以外
             WHEN  OTHER
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄属性取得処理  エラー"
      *----------------------------------------------------------------
      *----------  WK-STATUS
               MOVE  CNS-16              TO  WK-STATUS
      *----------  1190実行ステータス
               MOVE  CNS-16              TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16              TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-025        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                        (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄名称(日本語)=["WK-MEG-MEI-JP"]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(英語)=["WK-MEG-MEI-EN"]"
      D    DISPLAY  CNS-PGM-ID":債券ｸｰﾎﾟﾝ=["WK-SAKEN-KP-KBN"]"
      D    DISPLAY  CNS-PGM-ID":債券償還日=["WK-SAKEN-SK-YMD"]"
      D    DISPLAY  CNS-PGM-ID":資産分類コード=["WK-SISAN-BUNRUI-CD"]"
      D    DISPLAY  CNS-PGM-ID":コールプット区分=["WK-CALL-PUT-KBN"]"
      D    DISPLAY  CNS-PGM-ID":***  銘柄属性取得処理"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY3004-CHAN-EXT.
           EXIT.
      ******************************************************************
      *    内部⇒外部銘柄コード変換処理
      ******************************************************************
       SCZY3002-CHAN-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  内部⇒外部銘柄コード変換処理"
      D             " START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3002-INOUT
                       PARM-RTNPKG
                       WK-GAIBU-MEG-CD
                       WK-CD-REF-KRTU-CD
                       WK-JS-CD-FLG
                       WK-SEC-SBT-CD
                       WK-HAKO-CD
                       WK-TS-TARGET-KUNI
                       WK-MEG-CD-3002
                       WK-SEC-SBT-3002
                       WK-RTN-3002
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-ARGUMENT
             TO  RIYO-CMP-CD            OF  PARM-SCZY3002-ARG1
      *----------  内部銘柄コード
           MOVE  H-MEG-CD               OF  HST-TBL-SELECT
             TO  NAIBU-MEG-CD           OF  PARM-SCZY3002-ARG1
      *---------- 商品分類コード
           MOVE  SPACE
             TO  SYOHIN-BUNRUI-CD       OF  PARM-SCZY3002-ARG1
      *---------- 証券種別コード
           IF  H-DATA-KBN  =  CNS-X-1
           THEN
             MOVE  SPACE
               TO  SEC-SBT-CD           OF  PARM-SCZY3002-ARG1
           ELSE
             MOVE  H-SEC-SBT-CD
               TO  SEC-SBT-CD           OF  PARM-SCZY3002-ARG1
           END-IF
      *---------- 元証券種別コード
           MOVE  SPACE
             TO  MOTO-SEC-SBT-CD        OF  PARM-SCZY3002-ARG1
      *----------  銘柄リファレンス系列コード
           MOVE  I-CD-REF-KRTU-CD       OF  WK-DENBUN-INFO
             TO  CD-REF-KRTU-CD         OF  PARM-SCZY3002-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY3002-ARG1
      *----------  基準日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT
             TO  KJN-YMD                OF  PARM-SCZY3002-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD=["
      D             RIYO-CMP-CD         OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":NAIBU-MEG-CD=["
      D             NAIBU-MEG-CD        OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SYOHIN-BUNRUI-CD=["
      D             SYOHIN-BUNRUI-CD    OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":テータ区分=["
      D             H-DATA-KBN "]"
      D    DISPLAY  CNS-PGM-ID":SEC-SBT-CD=["
      D             SEC-SBT-CD          OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":MOTO-SEC-SBT-CD=["
      D             MOTO-SEC-SBT-CD     OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":MEG-TUKA-CD=["
      D             MEG-TUKA-CD         OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":CD-REF-KRTU-CD=["
      D             CD-REF-KRTU-CD      OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":KJN-YMD=["
      D             KJN-YMD             OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":GYOMU-TASK-ID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3002 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY3002"             USING  PARM-SCZY3002-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3002 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY3002)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           MOVE  H-MEG-CD               OF  HST-TBL-SELECT
             TO  WK-MEG-CD-3002
           MOVE  H-SEC-SBT-CD
             TO  WK-SEC-SBT-3002
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-3002
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
      *---------- 外部銘柄コード
               MOVE  GAIBU-MEG-CD          OF  PARM-SCZY3002-ARG2
                 TO  WK-GAIBU-MEG-CD
      *---------- コードリファレンス系列コード
               MOVE  CD-REF-KRTU-CD        OF  PARM-SCZY3002-ARG2
                 TO  WK-CD-REF-KRTU-CD
      *---------- 自社コードフラグ
               MOVE  JS-CD-FLG             OF  PARM-SCZY3002-ARG2
                 TO  WK-JS-CD-FLG
      *---------- 証券種別コード
               MOVE  SEC-SBT-CD            OF  PARM-SCZY3002-ARG2
                 TO  WK-SEC-SBT-CD
      *---------- 発行体国コード
               MOVE  HAKKO-TAI-KUNI-CD     OF  PARM-SCZY3002-ARG2
                 TO  WK-HAKO-CD
      *---------- 投資対象国コード
               MOVE  TOUSI-TARGET-KUNI-CD  OF  PARM-SCZY3002-ARG2
                 TO  WK-TS-TARGET-KUNI
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部銘柄コード=["WK-GAIBU-MEG-CD"]"
      D    DISPLAY  CNS-PGM-ID":コードリファレンス系列コード=["
      D             WK-CD-REF-KRTU-CD"]"
      D    DISPLAY  CNS-PGM-ID":自社コードフラグ=["WK-JS-CD-FLG"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":発行体国コード=["WK-HAKO-CD"]"
      D    DISPLAY  CNS-PGM-ID":投資対象国コード=["WK-TS-TARGET-KUNI"]"
      D    DISPLAY  CNS-PGM-ID
      D          ":外部銘柄コード変換ルーチンをコールする  正常"
      *-----------------------------------------------------------------
      *----------  異常
             WHEN  CNS-RTN-110
             WHEN  CNS-RTN-002
               PERFORM  SCZY3002-CHAN-3-RTN
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理  業務エラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *----------  上記以外
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":内部⇒外部銘柄コード変換処理  エラー"
      *-----------------------------------------------------------------
      *----------  WK-STATUS
               MOVE  CNS-16              TO  WK-STATUS
      *----------  1190実行ステータス
               MOVE  CNS-16              TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16              TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-026        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                        (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  内部⇒外部銘柄コード変換処理"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY3002-CHAN-EXT.
           EXIT.
      ******************************************************************
      *    国全項目取得
      ******************************************************************
       SCZY4102-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  国全項目取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4102-INOUT
                       PARM-RTNPKG
                       WK-HAKO-CD-2
                       WK-HAKO-CD-4102
                       WK-RTN-4102
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-ARGUMENT
             TO  RIYO-CMP-CD            OF  PARM-SCZY4102-ARG1
      *----------  国コード
           MOVE  WK-HAKO-CD
             TO  KUNI-CD                OF  PARM-SCZY4102-ARG1
      *---------- 適用開始日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT
             TO  TEKIYO-FROM            OF  PARM-SCZY4102-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4102-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":国コード=["
      D             KUNI-CD             OF  PARM-SCZY4102-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日=["
      D             TEKIYO-FROM         OF  PARM-SCZY4102-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4102 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4102"             USING  PARM-SCZY4102-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4102 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4102)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           MOVE  WK-HAKO-CD
             TO  WK-HAKO-CD-4102
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-4102
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
      *---------- 国コード_略式
               MOVE  KUNI-CD-RYAKU         OF  PARM-SCZY4102-ARG2
                 TO  WK-HAKO-CD-2
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":国コード_略式=["WK-HAKO-CD-2"]"
      D    DISPLAY  CNS-PGM-ID":国全項目取得  正常"
      *-----------------------------------------------------------------
      *----------  異常
             WHEN  CNS-RTN-110
      *----------  ワーク実行ステータス
      *------------------ <残タスク157の対応 START>---------------------
               IF   WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4              TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *------------------ <残タスク157の対応 END>-----------------------
      *----------  1190実行ステータス
               IF   WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD   OF
                                        WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD    OF
                                        WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                                        OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                                        OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID    OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               STRING  CNS-HAKO
                       WK-HAKO-CD
                       DELIMITED BY SPACE
                       INTO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
               END-STRING
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG  OF WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理  業務エラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *----------  上記以外
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":国全項目取得  エラー"
      *-----------------------------------------------------------------
      *----------  WK-STATUS
               MOVE  CNS-16              TO  WK-STATUS
      *----------  1190実行ステータス
               MOVE  CNS-16              TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16              TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-027        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                        (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  国全項目取得 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4102-EXT.
           EXIT.
      *------------------ <連結障害841の対応 START>---------------------
      *****************************************************************
      *   外部コード取得処理3
      *****************************************************************
       SEC-SBT-CD-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  外部コード取得処理3  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4182-INOUT
                       PARM-RTNPKG
                       WK-GAIBU-CD
                       WK-SEC-SBT-4182-2
                       WK-RTN-4182-2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4182-ARG1
      *----------  コード種類
           MOVE  CNS-X-01
             TO  CD-SHRU                OF  PARM-SCZY4182-ARG1
      *----------  コードリファレンス系列コード
           MOVE  CNS-D001
             TO  CD-REF-KRTU-CD         OF  PARM-SCZY4182-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SCZY4182-ARG1
      *----------  変換元コード
           MOVE  WK-SEC-SBT-CD
             TO  NAIBU-CD               OF  PARM-SCZY4182-ARG1
      *----------  基準日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT
             TO  KJN-YMD                OF  PARM-SCZY4182-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FUND-CD=["
      D          WK-FUND-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":PTF-CD=["
      D          WK-PTF-CD-DETAIL    OF  WK-FUND-PTF-DETAIL(WK-IDX-J)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY4182-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":コード種類=["
      D             CD-SHRU             OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":コードリファレンス系列コード=["
      D             CD-REF-KRTU-CD      OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":変換元コード=["
      D             NAIBU-CD            OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SCZY4182-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4182 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4182"             USING  PARM-SCZY4182-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4182 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4182)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           MOVE  WK-SEC-SBT-CD
             TO  WK-SEC-SBT-4182-2
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-4182-2
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
             WHEN  CNS-RTN-002
      *----------  外部コード
               MOVE  GAIBU-CD           OF  SAKI-AREA(CNS-1)
                 TO  WK-GAIBU-CD
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク変換先コード=["WK-GAIBU-CD"]"
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理  正常"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理3  業務エラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4             TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               STRING  CNS-SEC-SBT-GAIBU-CD
                       WK-SEC-SBT-CD
                       DELIMITED BY SPACE
                       INTO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
               END-STRING
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理  業務エラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理3 システムエラー"
      *-----------------------------------------------------------------
      *----------  WK-STATUS
               MOVE  CNS-16              TO  WK-STATUS
      *----------  1190実行ステータス
               MOVE  CNS-16              TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16              TO  WK-RTN-CODE
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-029          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  外部コード取得処理3 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SEC-SBT-CD-EXT.
           EXIT.
      *------------------ <連結障害841の対応 END>-----------------------
      ******************************************************************
      *    データ出力処理
      ******************************************************************
       DATA-WRITE-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC=["DAT-REC"]"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS=[" WK-FILE-STATUS "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU=["WK-WRITE-KENSUU"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU = WK-WRITE-KENSUU + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU=["WK-WRITE-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-030              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理1
      ******************************************************************
       DATA-WRITE1-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H1 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC=["DAT-REC"]"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS=[" WK-FILE-STATUS "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU=["WK-WRITE-KENSUU"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU = WK-WRITE-KENSUU + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU=["WK-WRITE-KENSUU"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-071              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H1  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE1-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理2
      ******************************************************************
       DATA-WRITE-2-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理2 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC2=["DAT-REC2"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-2=[" WK-FILE-STATUS-2 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-2
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU2=["WK-WRITE-KENSUU2"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU2 = WK-WRITE-KENSUU2 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU2=["WK-WRITE-KENSUU2"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理2正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理2エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-031              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-2)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-2
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理2  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE-2-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理2
      ******************************************************************
       DATA-WRITE2-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H2 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC2=["DAT-REC2"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-2=[" WK-FILE-STATUS-2 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-2
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU2=["WK-WRITE-KENSUU2"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU2 = WK-WRITE-KENSUU2 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU2=["WK-WRITE-KENSUU2"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理2正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理2エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-072              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-2)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-2
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H2  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE2-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理3
      ******************************************************************
       DATA-WRITE-3-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理3 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC3=["DAT-REC3"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-3=[" WK-FILE-STATUS-3 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-3
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU3=["WK-WRITE-KENSUU3"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU3 = WK-WRITE-KENSUU3 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU3=["WK-WRITE-KENSUU3"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理3正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理3エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-032              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-3)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-3
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理3  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE-3-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理3
      ******************************************************************
       DATA-WRITE3-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H3 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC3=["DAT-REC3"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-3=[" WK-FILE-STATUS-3 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-3
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU3=["WK-WRITE-KENSUU3"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU3 = WK-WRITE-KENSUU3 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU3=["WK-WRITE-KENSUU3"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理3正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理3エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-073              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-3)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-3
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H3  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE3-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理4
      ******************************************************************
       DATA-WRITE-4-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理4 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC4=["DAT-REC4"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-4=[" WK-FILE-STATUS-4 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-4
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU4=["WK-WRITE-KENSUU4"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU4 = WK-WRITE-KENSUU4 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU4=["WK-WRITE-KENSUU4"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理4正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理4エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-033              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-4)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-4
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理4  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE-4-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理4
      ******************************************************************
       DATA-WRITE4-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H4 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC4=["DAT-REC4"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-4=[" WK-FILE-STATUS-4 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-4
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU4=["WK-WRITE-KENSUU4"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU4 = WK-WRITE-KENSUU4 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU4=["WK-WRITE-KENSUU4"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理4正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理4エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-074              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-4)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-4
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H4  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE4-EXT.
           EXIT.
      ******************************************************************
      *    6) 業務エラー1処理
      ******************************************************************
       GYOMU-ERR-1-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー1処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7080-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7080-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7080-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7080-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY7080-ARG1
      *----------  メッセージエリア
           MOVE  WK-GYOMU-ERR-INFO      TO  PARM-SCZY7080-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":メッセージエリア=["
      D             PARM-SCZY7080-ARG2"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7080"             USING  PARM-SCZY7080-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7080)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             PERFORM  DB-COMMIT1-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー1処理  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー1処理  エラー  ***"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  1190実行ステータス
             MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             PERFORM  SUB-ERR-MSG-RTN
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-034          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー1処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GYOMU-ERR-1-EXT.
           EXIT.
      *------------------ <連結障害1077の対応 START>--------------------
      ******************************************************************
      *       ファイル出力件数処理
      ******************************************************************
       WRITE-KENSUU-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル出力件数処理 START ***"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-TEMP=["WK-WRITE-TEMP"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-TEMP2=["WK-WRITE-TEMP2"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-TEMP3=["WK-WRITE-TEMP3"]"
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-TEMP4=["WK-WRITE-TEMP4"]"
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
           IF  WK-WRITE-TEMP = ZERO  AND  WK-WRITE-TEMP2 = ZERO
             AND  WK-WRITE-TEMP3 = ZERO  AND  WK-WRITE-TEMP4 = ZERO
           THEN
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-I000653
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  CNS-GX-ZANKO
                 TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
             PERFORM  GYOMU-ERR-1-RTN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":*** ファイル出力件数処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WRITE-KENSUU-EXT.
           EXIT.
      *------------------ <連結障害1077の対応 END>----------------------
      ******************************************************************
      *       実行状況更新処理2
      ******************************************************************
       STATUS-KOUSIN-2-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況更新処理2 START  ***"
      *----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7210-INOUT
                       PARM-RTNPKG
      *----------  セッション区分
           MOVE  CNS-X-1
             TO  SESSION-KBN            OF  PARM-SCZY7210-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7210-ARG2
      *----------  処理実行日
           MOVE  WK-SHORI-YMD-9
             TO  SYORI-YMD              OF  PARM-SCZY7210-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7210-ARG2
      *----------  基準日FROM
           MOVE  WK-KIKAN-FR-9
             TO  KJN-YMD-FROM           OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス
           EVALUATE  WK-RTN-CODE
             WHEN  ZERO
      *----------  実行ステータス0(正常終了)
               MOVE  CNS-STS-100
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  CNS-2
      *----------  実行ステータス2(警告終了)
               MOVE  CNS-STS-200
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス4(業務エラー(続行可能))
             WHEN  CNS-4
               MOVE  CNS-STS-270
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス6
             WHEN  CNS-6
               MOVE  CNS-STS-275
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス8(業務エラー(明細続行不可))
             WHEN  CNS-8
               MOVE  CNS-STS-277
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
      *----------  実行ステータス10
             WHEN  CNS-10
               MOVE  CNS-STS-375
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
             WHEN  OTHER
      *----------  実行ステータス16(システムエラー)
               MOVE  CNS-STS-400
                 TO  JIKOU-STS          OF  PARM-SCZY7210-ARG2
           END-EVALUATE
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE   =[" WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID":JIKOU-STS     =["
      D             JIKOU-STS           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7210-ARG:"
      D    DISPLAY  CNS-PGM-ID":SESSION-KBN   =["
      D             SESSION-KBN         OF  PARM-SCZY7210-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD   =["
      D             RIYO-CMP-CD         OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":SYORI-YMD     =["
      D             SYORI-YMD           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":KIDOU-ID      =["
      D             KIDOU-ID            OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":JIKOU-STS     =["
      D             JIKOU-STS           OF  PARM-SCZY7210-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7210 START  ***"
      *----------------------------------------------------------------
           CALL  "SCZY7210"             USING  PARM-SCZY7210-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7210 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7210)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *--------------------<DEBSUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況更新処理2  正常"
      *----------------------------------------------------------------
      *----------  ＤＢコミット処理
             PERFORM  DB-COMMIT-RTN
           ELSE
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":実行状況更新処理2 システムエラー"
      *----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-035          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  実行状況更新処理1 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       STATUS-KOUSIN-2-EXT.
           EXIT.
      *******         テーマ2693     20100404 修正  開始        ********
      ******************************************************************
      *    SQL作成（PREPARE）
      ******************************************************************
       CR-PREPARE-3-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL作成(PREPARE3)  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT-S3
                       HST-SELECT-3-WHERE
                       WK-SELECT-FREE-MSG3
      *----------  テーブルTKDYAA40
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TBL-TKDYAA40       OF  SQL-SELECT-3
      *----------  テーブルTKPFZK04
           MOVE  WK-TBL-TKPFZK04
             TO  SQL-TBL-TKPFZK04       OF  SQL-SELECT-3
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD-1        OF  HST-SELECT-3-WHERE
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD-2        OF  HST-SELECT-3-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD-DETAIL      OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-SELECT-3-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD-DETAIL       OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-SELECT-3-WHERE
      *----------  進捗タスクID
           MOVE  CNS-ST01100
             TO  H-SHINTK-TASK-ID       OF  HST-SELECT-3-WHERE
      *----------  期間FROM
           MOVE  WK-KIKAN-FR-9
             TO  H-KIKAN-FR             OF  HST-SELECT-3-WHERE
      *----------  期間TO
           MOVE  WK-KIKAN-TO-9
             TO  H-KIKAN-TO             OF  HST-SELECT-3-WHERE
           STRING  SQL-SELECT-3
                   DELIMITED BY SIZE
                   INTO SQLSTMT-S3
           END-STRING
           STRING SQLSTMT-S3(1:FUNCTION  LENGTH(SQL-SELECT-3))
                "[:V1="
                 H-RIYO-CMP-CD-1      OF  HST-SELECT-3-WHERE
                "][:V2="
                 H-RIYO-CMP-CD-2      OF  HST-SELECT-3-WHERE
                "][:V3="
                 H-FUND-CD            OF  HST-SELECT-3-WHERE
                "][:V4="
                 H-PTF-CD             OF  HST-SELECT-3-WHERE
                "][:V6="
                 H-SHINTK-TASK-ID     OF  HST-SELECT-3-WHERE
                "][:V7="
                 H-KIKAN-FR           OF  HST-SELECT-3-WHERE
                "][:V8="
                 H-KIKAN-TO           OF  HST-SELECT-3-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-SELECT-FREE-MSG3
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "テーブルTKDYAA40 =["
      D             SQL-TBL-TKDYAA40       OF  SQL-SELECT-3"]"
      D    DISPLAY  CNS-PGM-ID "テーブルTKPFZK04 =["
      D             SQL-TBL-TKPFZK04       OF  SQL-SELECT-3"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コードH-RIYO-CMP-CD-1 =["
      D                 H-RIYO-CMP-CD-1    OF  HST-SELECT-3-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コードH-RIYO-CMP-CD-2 =["
      D                 H-RIYO-CMP-CD-2    OF  HST-SELECT-3-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコードH-FUND-CD     =["
      D                 H-FUND-CD          OF  HST-SELECT-3-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコードH-PTF-CD      =["
      D                 H-PTF-CD           OF  HST-SELECT-3-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":進捗タスクID H-SHINTK-TASK-ID     =["
      D                 H-SHINTK-TASK-ID   OF  HST-SELECT-3-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":期間FROM H-KIKAN-FR      =["
      D                 H-KIKAN-FR         OF  HST-SELECT-3-WHERE "]"
      D    DISPLAY  CNS-PGM-ID ":期間TO H-KIKAN-TO      =["
      D                 H-KIKAN-TO         OF  HST-SELECT-3-WHERE "]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-S3      =["SQLSTMT-S3"]"
      D    DISPLAY  CNS-PGM-ID":WK-SELECT-FREE-MSG3 =["
      D                 WK-SELECT-FREE-MSG3"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  SS3  FROM  :SQLSTMT-S3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE3)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16             TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS          TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-079        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE            TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG3
                 TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SQL作成(PREPARE3)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-PREPARE-3-EXT.
           EXIT.
      ******************************************************************
      *    カーソル作成（DECLARE，OPEN）
      ******************************************************************
       CR-OPEN-3-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カーソル作成(DECLARE，OPEN3)  START  ***"
      *-----------------------------------------------------------------
      *----------DECLARE CURSOR
           EXEC  SQL
             DECLARE  CR3  CURSOR  FOR  SS3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR3 DECLARE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------OPEN    CURSOR
           EXEC  SQL
             OPEN  CR3
           USING  :HST-SELECT-3-WHERE
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR3 OPEN)   =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON               TO  FLG-CR-OPEN3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN3 =["FLG-CR-OPEN3"]"
      *-----------------------------------------------------------------
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-080          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG3  TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カーソル作成(DECLARE，OPEN3)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-OPEN-3-EXT.
           EXIT.
      ******************************************************************
      *    カーソル（FETCH）
      ******************************************************************
       CR-FETCH-3-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル3(FETCH)  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  HST-TBL-SELECT-3
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH CR3
             INTO  :HST-TBL-SELECT-3.H-TEKIYO-FR
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR3 FETCH)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  次のto年月日へ進む
               MOVE  CNS-ON             TO  FLG-NEXT-MEISAI
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL    OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD    OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-E000355
                 TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  WK-GYOMU-FREE-MSG    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *----------  業務エラー1処理
               PERFORM  GYOMU-ERR-1-RTN
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-081          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG3  TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":= ["WK-TEMP-MSG"]"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-FETCH-3-EXT.
           EXIT.
      *******         テーマ2693     20100404 修正  終了        ********
      ******************************************************************
      *    3.3.後処理
      ******************************************************************
       END-RTN                SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *******    連結障害対応No.362      20081104 修正  開始    ********
      *----------   転送制御ファイル作成
           PERFORM  SCZY7180-RTN
      *******    連結障害対応No.362      20081104 修正  終了    ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-GYOMU-ERR=["FLG-GYOMU-ERR"]"
      *-----------------------------------------------------------------
      *----------  3.3.1.業務エラー2処理
           IF  FLG-GYOMU-ERR = CNS-ON
           THEN
             PERFORM  GYOMU-ERR-2-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 業務エラー2処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-CR-OPEN = CNS-ON
           THEN
             PERFORM  CR-CLOSE-2-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-CR-OPEN2 = CNS-ON
           THEN
             PERFORM  CR-CLOSE-4-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理2しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *******         テーマ2693     20100404 修正  開始        ********
           IF  FLG-CR-OPEN3 = CNS-ON
           THEN
             PERFORM  CR-CLOSE-6-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理3しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *******         テーマ2693     20100404 修正  終了        ********
      *----------  3.3.2.ダウンロードファイル1をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN=["FLG-FILE-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN = CNS-ON
           THEN
             PERFORM  CLOSE-FILE-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル1をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  3.3.2.ダウンロードファイル2をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-2=["FLG-FILE-OPEN-2"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-2 = CNS-ON
           THEN
             PERFORM  CLOSE-FILE-2-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル2をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル3をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-3=["FLG-FILE-OPEN-3"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-3 = CNS-ON
           THEN
             PERFORM  CLOSE-FILE-3-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル3をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル4をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-4=["FLG-FILE-OPEN-4"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-4 = CNS-ON
           THEN
             PERFORM  CLOSE-FILE-4-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル4をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル5をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-5=["FLG-FILE-OPEN-5"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-5 = CNS-ON
           THEN
             PERFORM  CLOSE-FILE-5-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル5をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル6をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-6=["FLG-FILE-OPEN-6"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-6 = CNS-ON
           THEN
             PERFORM  CLOSE-FILE-6-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル6をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル7をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-7=["FLG-FILE-OPEN-7"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-7 = CNS-ON
           THEN
             PERFORM  CLOSE-FILE-7-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル7をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル8をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-8=["FLG-FILE-OPEN-8"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-8 = CNS-ON
           THEN
             PERFORM  CLOSE-FILE-8-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル8をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  3.3.3.ＤＢコミットリリース処理
           PERFORM  COMMIT-ORA-REL-RTN
      *----------  3.3.4.処理件数メッセージ出力処理
           PERFORM  SYORI-CNT-MSG-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  3.3.5.終了メッセージ出力処理
           IF  WK-RTN-CODE >= CNS-RTN-BT4
           THEN
             MOVE  CNS-U                TO  WK-ERR-SYUBETU
           ELSE
             MOVE  CNS-N                TO  WK-ERR-SYUBETU
           END-IF
           PERFORM  END-MSG-OUT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  END  ***"
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           STOP RUN  WK-RTN-CODE.
      ******************************************************************
      *    3.4.エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-SYSTEM-ERR=["FLG-SYSTEM-ERR"]"
      *-----------------------------------------------------------------
      *----------  3.4.1.ダウンロードファイルをクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN=["FLG-FILE-OPEN"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN = CNS-ON
           THEN
             MOVE  CNS-OFF                 TO  FLG-FILE-OPEN
             CLOSE  OUT-FILE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル1をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS=[" WK-FILE-STATUS "]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル1をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  3.4.2.ダウンロードファイル2をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-2=["FLG-FILE-OPEN-2"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-2 = CNS-ON
           THEN
             MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-2
             CLOSE  OUT-FILE-2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル2をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-2=[" WK-FILE-STATUS-2 "]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル2をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル3をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-3=["FLG-FILE-OPEN-3"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-3 = CNS-ON
           THEN
             MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-3
             CLOSE  OUT-FILE-3
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル3をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-3=[" WK-FILE-STATUS-3 "]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル3をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル4をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-4=["FLG-FILE-OPEN-4"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-4 = CNS-ON
           THEN
             MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-4
             CLOSE  OUT-FILE-4
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル4をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-4=[" WK-FILE-STATUS-4 "]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル4をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル5をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-5=["FLG-FILE-OPEN-5"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-5 = CNS-ON
           THEN
             MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-5
             CLOSE  OUT-FILE-5
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル5をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-5=[" WK-FILE-STATUS-5 "]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル5をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル6をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-6=["FLG-FILE-OPEN-6"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-6 = CNS-ON
           THEN
             MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-6
             CLOSE  OUT-FILE-6
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル6をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-6=[" WK-FILE-STATUS-6 "]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル6をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル7をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-7=["FLG-FILE-OPEN-7"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-7 = CNS-ON
           THEN
             MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-7
             CLOSE  OUT-FILE-7
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル7をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-7=[" WK-FILE-STATUS-7 "]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル7をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------   ダウンロードファイル8をクローズ
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE-OPEN-8=["FLG-FILE-OPEN-8"]"
      *-----------------------------------------------------------------
           IF  FLG-FILE-OPEN-8 = CNS-ON
           THEN
             MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-8
             CLOSE  OUT-FILE-8
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル8をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-8=[" WK-FILE-STATUS-8 "]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイル8をクローズしない  ***"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-CR-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CR
             END-EXEC
             MOVE  CNS-OFF                TO  FLG-CR-OPEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カーソルクローズをクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN=[" FLG-CR-OPEN "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
           IF  FLG-CR-OPEN2 = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CR2
             END-EXEC
             MOVE  CNS-OFF                TO  FLG-CR-OPEN2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カーソルクローズ2をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN2=[" FLG-CR-OPEN2 "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理2しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *******         テーマ2693     20100404 修正  開始        ********
           IF  FLG-CR-OPEN3 = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CR3
             END-EXEC
             MOVE  CNS-OFF                TO  FLG-CR-OPEN3
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** カーソルクローズ3をクローズ  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN3=[" FLG-CR-OPEN3 "]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理3しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *******         テーマ2693     20100404 修正  終了        ********
      *----------  3.4.3.エラー2情報追加処理
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-SYSTEM-ERR=["FLG-SYSTEM-ERR"]"
      *-----------------------------------------------------------------
           IF  FLG-SYSTEM-ERR = CNS-OFF
           THEN
             PERFORM  ERR-MSG-OUT-RTN
           ELSE
             MOVE  CNS-OFF              TO  FLG-SYSTEM-ERR
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** エラー2情報追加処理しない ****"
      *-----------------------------------------------------------------
           END-IF
      *----------  3.4.3.ＤＢロールバックリリース処理
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
           IF  FLG-ORA-CONNECT         =  CNS-ON
           THEN
             PERFORM  ROLLBACK-ORA-REL-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** ＤＢロールバックリリース処理"
      D            "しない****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  3.4.4.処理件数メッセージ出力処理
           PERFORM  SYORI-CNT-MSG-RTN
      *----------  3.4.5.終了メッセージ出力処理
           MOVE  CNS-S                  TO  WK-ERR-SYUBETU
           PERFORM  END-MSG-OUT-RTN
      *----------  3.4.6.プログラム終了(リターンコード=16)
           MOVE  CNS-RTN-BT16           TO  WK-RTN-CODE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CODE "]"
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           STOP RUN  WK-RTN-CODE.
      ******************************************************************
      *    業務エラー2処理
      ******************************************************************
       GYOMU-ERR-2-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー2処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7080-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7080-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7080-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7080-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY7080-ARG1
      *----------  メッセージエリア
           MOVE  WK-GYOMU-ERR-INFO      TO  PARM-SCZY7080-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":メッセージエリア=["
      D             PARM-SCZY7080-ARG2"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7080"             USING  PARM-SCZY7080-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7080)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             PERFORM  DB-COMMIT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー2処理  正常  ***"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー2処理  エラー  ***"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-16            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-036          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  業務エラー2処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GYOMU-ERR-2-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミットリリース処理
      ******************************************************************
       COMMIT-ORA-REL-RTN     SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミットリリース処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT RELEASE
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT RELEASE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF                   TO  FLG-ORA-CONNECT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミットリリース処理 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミットリリース処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16              TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID                TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-037               TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900               TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE                   TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1              TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-COM-RELEASE-ERR       TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミットリリース処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       COMMIT-ORA-REL-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢロールバックリリース処理
      ******************************************************************
       ROLLBACK-ORA-REL-RTN   SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢロールバックリリース処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                     TO  FLG-ORA-CONNECT
      *----------  ROLLBACK
           EXEC SQL
               ROLLBACK RELEASE
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(ROLLBACK RELEASE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢロールバックリリース処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢロールバックリリース処理"
      D             " システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16              TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID                TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-038               TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900               TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE                   TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1              TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-ROLLBACK-ERR          TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢロールバックリリース処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ROLLBACK-ORA-REL-EXT.
           EXIT.
      ******************************************************************
      *    処理件数メッセージ出力処理
      ******************************************************************
       SYORI-CNT-MSG-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  処理件数メッセージ出力処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7040-IN
      *----------  接続用パラメータの設定
      *----------  テーブル・ファイル数
           MOVE  CNS-5
             TO  TABLE-FILE-NUM         OF  PARM-SCZY7040-IN
      *----------  識別子(1)
           MOVE  WK-TBL-TKUSZT01
             TO  IDENT-ID               OF  PARM-SCZY7040-IN(1)
      *----------  対象処理(1)
           MOVE  CNS-FETCH
             TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(1)
      *----------  取得件数(1)
           MOVE  WK-FETCH-KENSUU
             TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(1)
           IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
           THEN
      *----------  識別子(2)
             MOVE  WK-PSACT-DAT-FILE
               TO  IDENT-ID               OF  PARM-SCZY7040-IN(2)
      *----------  対象処理(2)
             MOVE  CNS-WRITE
               TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(2)
      *----------  取得件数(2)
             MOVE  WK-WRITE-KENSUU
               TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(2)
      *----------  識別子(3)
             MOVE  WK-PSACT-DAT-FILE-2
               TO  IDENT-ID               OF  PARM-SCZY7040-IN(3)
      *----------  対象処理(3)
             MOVE  CNS-WRITE
               TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(3)
      *----------  取得件数(3)
             MOVE  WK-WRITE-KENSUU2
               TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(3)
      *----------  識別子(4)
             MOVE  WK-PSACT-DAT-FILE-5
               TO  IDENT-ID               OF  PARM-SCZY7040-IN(4)
      *----------  対象処理(4)
             MOVE  CNS-WRITE
               TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(4)
      *----------  取得件数(4)
             MOVE  WK-WRITE-KENSUU5
               TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(4)
      *----------  識別子(5)
             MOVE  WK-PSACT-DAT-FILE-6
               TO  IDENT-ID               OF  PARM-SCZY7040-IN(5)
      *----------  対象処理(5)
             MOVE  CNS-WRITE
               TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(5)
      *----------  取得件数(5)
             MOVE  WK-WRITE-KENSUU6
               TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(5)
           ELSE
      *----------  識別子(2)
             MOVE  WK-PSACT-DAT-FILE-3
               TO  IDENT-ID               OF  PARM-SCZY7040-IN(2)
      *----------  対象処理(2)
             MOVE  CNS-WRITE
               TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(2)
      *----------  取得件数(2)
             MOVE  WK-WRITE-KENSUU3
               TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(2)
      *----------  識別子(3)
             MOVE  WK-PSACT-DAT-FILE-4
               TO  IDENT-ID               OF  PARM-SCZY7040-IN(3)
      *----------  対象処理(3)
             MOVE  CNS-WRITE
               TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(3)
      *----------  取得件数(3)
             MOVE  WK-WRITE-KENSUU4
               TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(3)
      *----------  識別子(4)
             MOVE  WK-PSACT-DAT-FILE-7
               TO  IDENT-ID               OF  PARM-SCZY7040-IN(4)
      *----------  対象処理(4)
             MOVE  CNS-WRITE
               TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(4)
      *----------  取得件数(4)
             MOVE  WK-WRITE-KENSUU7
               TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(4)
      *----------  識別子(5)
             MOVE  WK-PSACT-DAT-FILE-8
               TO  IDENT-ID               OF  PARM-SCZY7040-IN(5)
      *----------  対象処理(5)
             MOVE  CNS-WRITE
               TO  OBJECT-DISPOSAL        OF  PARM-SCZY7040-IN(5)
      *----------  取得件数(5)
             MOVE  WK-WRITE-KENSUU8
               TO  DISPOSAL-NUM           OF  PARM-SCZY7040-IN(5)
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7040-ARG:"
      D    DISPLAY  CNS-PGM-ID":テーブル・ファイル数=["
      D             TABLE-FILE-NUM      OF  PARM-SCZY7040-IN   "]"
      D    DISPLAY  CNS-PGM-ID":識別子(1)           =["
      D             IDENT-ID            OF  PARM-SCZY7040-IN(1)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(1)         =["
      D             OBJECT-DISPOSAL     OF  PARM-SCZY7040-IN(1)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(1)         =["
      D             DISPOSAL-NUM        OF  PARM-SCZY7040-IN(1)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(2)           =["
      D             IDENT-ID            OF  PARM-SCZY7040-IN(2)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(2)         =["
      D             OBJECT-DISPOSAL     OF  PARM-SCZY7040-IN(2)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(2)         =["
      D             DISPOSAL-NUM        OF  PARM-SCZY7040-IN(2)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(3)           =["
      D             IDENT-ID            OF  PARM-SCZY7040-IN(3)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(3)         =["
      D             OBJECT-DISPOSAL     OF  PARM-SCZY7040-IN(3)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(3)         =["
      D             DISPOSAL-NUM        OF  PARM-SCZY7040-IN(3)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(4)           =["
      D             IDENT-ID            OF  PARM-SCZY7040-IN(4)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(4)         =["
      D             OBJECT-DISPOSAL     OF  PARM-SCZY7040-IN(4)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(4)         =["
      D             DISPOSAL-NUM        OF  PARM-SCZY7040-IN(4)"]"
      D    DISPLAY  CNS-PGM-ID":識別子(5)           =["
      D             IDENT-ID            OF  PARM-SCZY7040-IN(5)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(5)         =["
      D             OBJECT-DISPOSAL     OF  PARM-SCZY7040-IN(5)"]"
      D    DISPLAY  CNS-PGM-ID":処理件数(5)         =["
      D             DISPOSAL-NUM        OF  PARM-SCZY7040-IN(5)"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7040 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7040"             USING  PARM-SCZY7040-IN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7040 END  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  処理件数メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SYORI-CNT-MSG-EXT.
           EXIT.
      ******************************************************************
      *    エラー2情報追加処理
      ******************************************************************
       ERR-MSG-OUT-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー2情報追加処理  START  ***"
      *-----------------------------------------------------------------
      *---------- エラーリターンパッケージ
           INITIALIZE  PARM-SCZY1170-IN
           MOVE  WK-SYS-ERR-INFO        TO  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG            =["
      D             PARM-SCZY1170-RTNPKG                      "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
           CALL   "SCZY1170"            USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  エラー2情報追加処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-MSG-OUT-EXT.
           EXIT.
      ******************************************************************
      *    終了メッセージ出力処理
      ******************************************************************
       END-MSG-OUT-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  終了メッセージ出力処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":WK-ERR-SYUBETU=["WK-ERR-SYUBETU"]"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7020-INOUT
                       PARM-RTNPKG
      *----------  エラー種別
           MOVE  WK-ERR-SYUBETU
             TO  ERR-SYUBETU            OF  PARM-SCZY7020-ARG1
      *----------  プログラムID
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7020-ARG2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7020-ARG2
      *----------  基準日
           MOVE  WK-SHORI-YMD
             TO  KJN-YMD                OF  PARM-SCZY7020-ARG2
      *----------  実行処理ID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  JIKOU-SYORI-ID         OF  PARM-SCZY7020-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7020-ARG2
      *---------- リターンパッケージをセットする
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7020-ARG:"
      D    DISPLAY  CNS-PGM-ID":エラー種別    =["
      D             ERR-SYUBETU         OF  PARM-SCZY7020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":プログラムID  =["
      D             PGM-ID              OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":実行処理ID    =["
      D             JIKOU-SYORI-ID      OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日        =["
      D             KJN-YMD             OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID        =["
      D             KIDOU-ID            OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["
      D             PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7020"             USING  PARM-SCZY7020-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  終了メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-MSG-OUT-EXT.
           EXIT.
      ******************************************************************
      *    DATファイルクローズ処理
      ******************************************************************
       CLOSE-FILE-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****DATファイルクローズ処理  "
      D             "START  *****"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-OFF                 TO  FLG-FILE-OPEN
           CLOSE  OUT-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":FILE-STATUS=[" WK-FILE-STATUS "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイルクローズ処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイルクローズ処理エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-16                  TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID              TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-039             TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-230             TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS)
                                             TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0            TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE
                       "]クローズエラー"
               DELIMITED BY SPACE           INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ファイルオープンフラグ=["FLG-FILE-OPEN"]"
      D    DISPLAY CNS-PGM-ID":*****DATファイルクローズ処理 END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-FILE-EXT.
           EXIT.
      ******************************************************************
      *    DATファイル2クローズ処理
      ******************************************************************
       CLOSE-FILE-2-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****DATファイル2クローズ処理  "
      D             "START  *****"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-2
           CLOSE  OUT-FILE-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":FILE-STATUS-2=[" WK-FILE-STATUS-2 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-2
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル2クローズ処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル2クローズ処理エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-16                  TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID              TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-040             TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-230             TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-2)
                                             TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0            TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-2
                       "]クローズエラー"
               DELIMITED BY SPACE           INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ファイル2オープンフラグ=["
      D            FLG-FILE-OPEN-2"]"
      D    DISPLAY CNS-PGM-ID":*****DATファイル2クローズ処理 END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-FILE-2-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミット処理
      ******************************************************************
       DB-COMMIT-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミット処理  START  ***"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-041          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-COMMIT-ERR       TO  WK-FREE-MSG
             MOVE  CNS-OFF              TO  FLG-SYSTEM-ERR
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT-EXT.
           EXIT.
      ******************************************************************
      *    ポートフォリオ明細2取得処理
      ******************************************************************
       SCZY7200-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ明細2取得処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7200-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7200-ARG1
      *----------  処理実行日
           MOVE  WK-SHORI-YMD
             TO  SYORI-YMD              OF  PARM-SCZY7200-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7200-ARG1
      *----------  帳票ID
           MOVE  SPACE
             TO  REP-ID                 OF  PARM-SCZY7200-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7200-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID=["
      D             KIDOU-ID            OF  PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":帳票ID=["
      D             REP-ID              OF  PARM-SCZY7200-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7200 START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY7200"            USING  PARM-SCZY7200-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7200 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7200)=["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                    ":***  ポートフォリオ明細2取得処理 正常  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク取得件数=["
      D                               GET-KENSU OF PARM-SCZY7200-ARG2"]"
      *-----------------------------------------------------------------
             IF  GET-KENSU OF PARM-SCZY7200-ARG2 = ZERO
             THEN
      *----------  ワークリターンコード
               MOVE  CNS-RTN-BT8          TO  WK-RTN-CODE
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-E000217
                 TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字(1)
               MOVE  CNS-TEXT-1
                 TO  WK-GYOMU-TK-MOJI
                 OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":メッセージID(1)=["
      D    WK-GYOMU-MSG-ID    OF  WK-GYOMU-ERR-INFO(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":置換文字(1)=["
      D    WK-GYOMU-TK-MOJI OF  WK-GYOMU-ERR-INFO(CNS-1,CNS-1)"]"
      *-----------------------------------------------------------------
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON               TO  FLG-GYOMU-ERR
               PERFORM  END-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                    ":***  ポートフォリオ明細2取得処理 異常  ***"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-042          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ポートフォリオ明細2取得処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY7200-EXT.
           EXIT.
      ******************************************************************
      *    ＤＢコミット処理
      ******************************************************************
       DB-COMMIT1-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミット処理  START  ***"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミット処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
             MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-043          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  CNS-COMMIT-ERR       TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢコミット処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DB-COMMIT1-EXT.
           EXIT.
      ******************************************************************
      *    サブエラーメッセージ出力処理
      ******************************************************************
       SUB-ERR-MSG-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  サブエラーメッセージ出力処理"
      D             "  START  ***"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-ERR-CNT
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SUB-ERR-MSG-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM                  VARYING  WK-ERR-CNT
             FROM  CNS-1 BY CNS-1
             UNTIL WK-ERR-CNT > COUNTER OF PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-ERR-CNT=["WK-ERR-CNT"]"
      *-----------------------------------------------------------------
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  ERR-PGM-ID           OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  ERR-POS              OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  DETAIL-RTN-CD        OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  DETAIL-RTN-CD-FLG    OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  FREE-MSG             OF  PARM-RTNPKG(WK-ERR-CNT)
               TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [SUB-ERR-MSG-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  サブエラーメッセージ出力処理"
      D             "  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUB-ERR-MSG-EXT.
           EXIT.
      ******************************************************************
      *    数値去0処理
      ******************************************************************
       ZERO-COMPUTE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":数値去0処理（18-18）START"
      D    DISPLAY  CNS-PGM-ID":処理前=["WK-18-18-X"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-NUM-1
                       WK-NUM-FROM
                       WK-NUM-LENGTH
           INSPECT  WK-18-18-X
                    TALLYING WK-NUM-1 FOR LEADING SPACE
           COMPUTE  WK-NUM-FROM   = WK-NUM-1 + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":数値去0処理（18-18）END"
      *-----------------------------------------------------------------
           CONTINUE.
       ZERO-COMPUTE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.13.約定ファイル03名作成処理
      ******************************************************************
       GET-FILE-3-NAME-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定ファイル03名作成処理  START "
      *-----------------------------------------------------------------
           STRING  CNS-RX-TEXT               DELIMITED BY SPACE
                   WK-RIYO-CMP-CD            DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-SHORI-YMD              DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-KIDOU-ID               DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-GYOMU-TASK-ID          DELIMITED BY SPACE
                   "_03"                     DELIMITED BY SPACE
                                             INTO  WK-FILE-3-NAME
           END-STRING
           STRING  WK-FILE-PASS              DELIMITED BY SPACE
                   "/"                       DELIMITED BY SPACE
                   WK-FILE-3-NAME            DELIMITED BY SPACE
                                             INTO  WK-PSACT-DAT-FILE-3
           END-STRING
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.約定ファイル名03=["WK-FILE-3-NAME"]"
      D    DISPLAY  CNS-PGM-ID":ファイルパス=["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":パス付けDAT約定ファイル03=["
      D             WK-PSACT-DAT-FILE-3"]"
      D    DISPLAY  CNS-PGM-ID":約定ファイル03名作成処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-3-NAME-EXT.
           EXIT.
      ******************************************************************
      *    3.1.14.約定ファイル03オープン
      ******************************************************************
       OPEN-FILE-3-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-3-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY   CNS-PGM-ID":約定ファイル03オープン処理  START "
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                     TO  FLG-FILE-OPEN-3
           MOVE  WK-PSACT-DAT-FILE-3         TO  OUTFILE-3
           OPEN  OUTPUT OUT-FILE-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-3=[" WK-FILE-STATUS-3 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-3
             WHEN  CNS-FILE-NORMAL
               MOVE  CNS-ON                  TO  FLG-FILE-OPEN-3
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT約定ファイル03オープン正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT約定ファイル03オープンエラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-044          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-200          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-3)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
             MOVE  SPACE                TO  WK-FREE-MSG
             STRING  "ファイル:["
                     WK-PSACT-DAT-FILE-3
                     "]オープンエラー"
               DELIMITED BY SIZE         INTO  WK-FREE-MSG
             END-STRING
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT約定ファイル03オープンフラグ=["
      D             FLG-FILE-OPEN-3 "]"
      D    DISPLAY  CNS-PGM-ID":DAT約定ファイル03オープン処理  END "
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-3-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-FILE-3-EXT.
           EXIT.
      ******************************************************************
      *    3.1.15.受渡ファイル04名作成処理
      ******************************************************************
       GET-FILE-4-NAME-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡ファイル04名作成処理  START "
      *-----------------------------------------------------------------
           STRING  CNS-RX-TEXT               DELIMITED BY SPACE
                   WK-RIYO-CMP-CD            DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-SHORI-YMD              DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-KIDOU-ID               DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-GYOMU-TASK-ID          DELIMITED BY SPACE
                   "_04"                     DELIMITED BY SPACE
                                             INTO  WK-FILE-4-NAME
           END-STRING
           STRING  WK-FILE-PASS              DELIMITED BY SPACE
                   "/"                       DELIMITED BY SPACE
                   WK-FILE-4-NAME            DELIMITED BY SPACE
                                             INTO  WK-PSACT-DAT-FILE-4
           END-STRING
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.受渡ファイル04名=["WK-FILE-4-NAME"]"
      D    DISPLAY  CNS-PGM-ID":受渡ファイルパス=["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":パス付けDAT受渡ファイル04=["
      D             WK-PSACT-DAT-FILE-4"]"
      D    DISPLAY  CNS-PGM-ID": 受渡ファイル名04作成処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-4-NAME-EXT.
           EXIT.
      ******************************************************************
      *    3.1.16.受渡ファイル04オープン
      ******************************************************************
       OPEN-FILE-4-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-4-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY   CNS-PGM-ID":受渡ファイル04オープン処理  START "
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                     TO  FLG-FILE-OPEN-4
           MOVE  WK-PSACT-DAT-FILE-4         TO  OUTFILE-4
           OPEN  OUTPUT OUT-FILE-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-4=[" WK-FILE-STATUS-4 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-4
             WHEN  CNS-FILE-NORMAL
               MOVE  CNS-ON                  TO  FLG-FILE-OPEN-4
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT受渡ファイル04オープン正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT受渡ファイル04オープンエラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-045          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-200          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-4)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
             MOVE  SPACE                TO  WK-FREE-MSG
             STRING  "ファイル:["
                     WK-PSACT-DAT-FILE-4
                     "]オープンエラー"
               DELIMITED BY SIZE         INTO  WK-FREE-MSG
             END-STRING
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡ファイル04オープンフラグ=["
      D             FLG-FILE-OPEN-4 "]"
      D    DISPLAY  CNS-PGM-ID":受渡ファイル04オープン処理  END "
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-4-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-FILE-4-EXT.
           EXIT.
      ******************************************************************
      *    ポートフォリオ属性テーブルからデータを取得
      ******************************************************************
       SCZY4007-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** 、ポートフォリオ属性テーブ"
      D             "ルからデータを取得  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4007-INOUT
                       PARM-RTNPKG
                       WK-CAPITAL-TUKA-CD
                       WK-YKJ-SYUGI-KAIKEI
                       WK-SWK-KJN-PTN-CD
                       FLG-FETCH-END2
                       WK-CASH-FLOW-KBN
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-ARGUMENT
             TO  RIYO-CMP-CD            OF  PARM-SCZY4007-ARG1
      *----------  ファンドコード
           MOVE  WK-FUND-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  FUND-CD                OF  PARM-SCZY4007-ARG1
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD-DETAIL       OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  PTF-CD                 OF  PARM-SCZY4007-ARG1
      *----------  適用開始日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT-2
             TO  TEKIYO-FROM            OF  PARM-SCZY4007-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY4007-ARG1:"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード=["
      D             FUND-CD             OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード=["
      D             PTF-CD              OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":適用開始日=["
      D             TEKIYO-FROM         OF  PARM-SCZY4007-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":***  CALL SCZY4007  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4007"             USING  PARM-SCZY4007-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  CALL SCZY4007  END  ***"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY4007 =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****   ポートフォリオ属性テーブ"
      D             "ルからデータを取得正常   *****"
      *--------------------<DEBUG>--------------------------------------
      *----------  運用通貨コード
               MOVE  CAPITAL-TUKA-CD    OF  PARM-SCZY4007-ARG2
                 TO  WK-CAPITAL-TUKA-CD
      *----------  約定主義会計フラグ
               MOVE  YKJ-SYUGI-KAIKEI   OF  PARM-SCZY4007-ARG2
                 TO  WK-YKJ-SYUGI-KAIKEI
      *----------  仕訳基準パタンコード
               MOVE  SWK-KJN-PTN-CD     OF  PARM-SCZY4007-ARG2
                 TO  WK-SWK-KJN-PTN-CD
      *----------  ＧＸ債券キャッシュフロー
               MOVE  CASH-FLOW-KBN      OF  PARM-SCZY4007-ARG2
                 TO  WK-CASH-FLOW-KBN
             WHEN  CNS-RTN-110
               MOVE  CNS-ON           TO  FLG-FETCH-END2
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-TEXT-TK1
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             WHEN  CNS-RTN-800
               MOVE  CNS-ON           TO  FLG-FETCH-END2
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****   ポートフォリオ属性を"
      D             "取得エラー  *****"
      *--------------------<DEBUG>--------------------------------------
      *----------  進捗管理フラグ
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
               PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-046          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD
                 OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CAPITAL-TUKA-CD =["
      D              WK-CAPITAL-TUKA-CD"]"
      D    DISPLAY  CNS-PGM-ID":約定主義会計フラグ =["
      D              WK-YKJ-SYUGI-KAIKEI"]"
      D    DISPLAY  CNS-PGM-ID":WK-SWK-KJN-PTN-CD =["
      D              WK-SWK-KJN-PTN-CD"]"
      D    DISPLAY  CNS-PGM-ID ":*** 、ポートフォリオ属性テーブ"
      D             "ルからデータを取得  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4007-EXT.
           EXIT.
      ******************************************************************
      *    為替換算情報を取得  評価為替レート用の場合
      ******************************************************************
       SCZY3017-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***   為替換算情報を取得   START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3017-INOUT
                       PARM-RTNPKG
                       WK-KWS-ZYOUHO-JZS
                       WK-KWS-ZYOUHO-FLG
                       WK-PRIO-3017
                       WK-TRHK-TUKA-3017
                       WK-CAPITAL-TUKA-3017
                       WK-RTN-3017
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD       OF  WK-ARGUMENT
             TO  RIYO-CMP-CD          OF  PARM-SCZY3017-ARG1
      *----------  為替系列コード
           MOVE  WK-PRIO-1-EX-KRTU
             TO  KWS-KRTU-CD          OF  PARM-SCZY3017-ARG1
      *---------- ベース通貨コード
           MOVE  H-TRHK-TUKA
             TO  BASE-TUKA-CD         OF  PARM-SCZY3017-ARG1
      *---------- 目的通貨コード
           MOVE  WK-CAPITAL-TUKA-CD
             TO  MOKUTEKI-TUKA-CD     OF  PARM-SCZY3017-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク利用会社コード=["
      D             WK-RIYO-CMP-CD       OF  WK-ARGUMENT"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク為替系列コード=["
      D             WK-PRIO-1-EX-KRTU"]"
      D    DISPLAY  CNS-PGM-ID ":DBから取得した取引通貨=["
      D             H-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク運用通貨=["
      D             WK-CAPITAL-TUKA-CD"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY3017-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD          OF  PARM-SCZY3017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":為替系列コード=["
      D             KWS-KRTU-CD          OF  PARM-SCZY3017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ベース通貨コード=["
      D             BASE-TUKA-CD         OF  PARM-SCZY3017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":目的通貨コード=["
      D             MOKUTEKI-TUKA-CD     OF  PARM-SCZY3017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":***  CALL SCZY3017  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY3017"             USING  PARM-SCZY3017-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  CALL SCZY3017  END  ***"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY3017 =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":DBから取得した取引通貨=["
      D             H-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID ":ワークベース通貨コード_3017=["
      D             WK-TRHK-TUKA-3017"]"
      *-----------------------------------------------------------------
           MOVE  CNS-ON
             TO  WK-KWS-ZYOUHO-FLG
           MOVE  WK-PRIO-1-EX-KRTU
             TO  WK-PRIO-3017
           MOVE  H-TRHK-TUKA
             TO  WK-TRHK-TUKA-3017
           MOVE  WK-CAPITAL-TUKA-CD
             TO  WK-CAPITAL-TUKA-3017
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-3017
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワークベース通貨コード_3017=["
      D             WK-TRHK-TUKA-3017"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****   為替換算情報を取得正常   *****"
      D    DISPLAY  CNS-PGM-ID ":【SUSC3017】.ARG2.為替乗算／除算区分=["
      D             JZ-JS-KBN         OF  PARM-SCZY3017-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク乗除区分１（評価為替レート用）=["
      D             WK-KWS-ZYOUHO-JZS"]"
      *-----------------------------------------------------------------
      *----------  為替乗算/除算区分
               MOVE  JZ-JS-KBN        OF  PARM-SCZY3017-ARG2
                 TO  WK-KWS-ZYOUHO-JZS
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク乗除区分１（評価為替レート用）=["
      D             WK-KWS-ZYOUHO-JZS"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
      *----------
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-TR-UN
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             WHEN  CNS-RTN-800
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****   為替換算情報を取得"
      D             " エラー  *****"
      *--------------------<DEBUG>--------------------------------------
      *----------  進捗管理フラグ
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
               PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-047          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD
                 OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":為替乗算/除算区分=["WK-KWS-ZYOUHO-JZS"]"
      D    DISPLAY  CNS-PGM-ID ":*** 為替換算情報を取得   END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY3017-EXT.
           EXIT.
      *******              テーマ3422         修正  開始        ********
      ******************************************************************
      *    為替換算情報を取得    時価(取引通貨)用の場合
      ******************************************************************
       SCZY3017-2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***   為替換算情報を取得2   START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3017-INOUT
                       PARM-RTNPKG
                       WK-KWS-ZYOUHO-JZS-2
                       WK-TH-ZYOUHO-FLG
                       WK-PRIO-CP
                       WK-BASE-TUKA-CP
                       WK-MOKU-TUKA-CP
                       WK-RTN-3017-2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD       OF  WK-ARGUMENT
             TO  RIYO-CMP-CD          OF  PARM-SCZY3017-ARG1
      *----------  為替系列コード
           MOVE  WK-PRIO-1-EX-KRTU
             TO  KWS-KRTU-CD          OF  PARM-SCZY3017-ARG1
      *---------- ベース通貨コード
           MOVE  H-KWS-TH-TUKA-CD
             TO  BASE-TUKA-CD         OF  PARM-SCZY3017-ARG1
      *---------- 目的通貨コード
           MOVE  H-TRHK-TUKA
             TO  MOKUTEKI-TUKA-CD     OF  PARM-SCZY3017-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク利用会社コード=["
      D             WK-RIYO-CMP-CD       OF  WK-ARGUMENT"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク為替系列コード=["
      D             WK-PRIO-1-EX-KRTU"]"
      D    DISPLAY  CNS-PGM-ID ":DBから取得した為替決済通貨=["
      D             H-KWS-TH-TUKA-CD"]"
      D    DISPLAY  CNS-PGM-ID ":DBから取得した取引通貨=["
      D             H-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY3017-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD          OF  PARM-SCZY3017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":為替系列コード=["
      D             KWS-KRTU-CD          OF  PARM-SCZY3017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ベース通貨コード=["
      D             BASE-TUKA-CD         OF  PARM-SCZY3017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":目的通貨コード=["
      D             MOKUTEKI-TUKA-CD     OF  PARM-SCZY3017-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":***  CALL SCZY3017  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY3017"             USING  PARM-SCZY3017-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  CALL SCZY3017  END  ***"
      D    DISPLAY  CNS-PGM-ID ":ワーク約定為替換算時採用系列=["
      D             WK-PRIO-1-EX-KRTU"]"
      D    DISPLAY  CNS-PGM-ID ":DBから取得した為替決済通貨=["
      D             H-KWS-TH-TUKA-CD"]"
      D    DISPLAY  CNS-PGM-ID ":DBから取得した取引通貨=["
      D             H-TRHK-TUKA"]"
      *-----------------------------------------------------------------
           MOVE  CNS-ON
             TO  WK-TH-ZYOUHO-FLG
           MOVE  WK-PRIO-1-EX-KRTU
             TO  WK-PRIO-CP
           MOVE  H-KWS-TH-TUKA-CD
             TO  WK-BASE-TUKA-CP
           MOVE  H-TRHK-TUKA
             TO  WK-MOKU-TUKA-CP
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-3017-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク取引決済乗除区分フラグ=["
      D             WK-TH-ZYOUHO-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク約定為替換算時採用系列_時価"
      D             "(取引通貨)用=["WK-PRIO-CP"]"
      D    DISPLAY  CNS-PGM-ID ":ワークベース通貨コード_時価(取引通貨)"
      D             "用=["WK-BASE-TUKA-CP"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク目的通貨コード_時価(取引通貨)用"
      D             "=["WK-MOKU-TUKA-CP"]"
      D    DISPLAY  CNS-PGM-ID ":ワークリターンコード_時価(取引通貨)用"
      D             "=["WK-RTN-3017-2"]"
      D    DISPLAY  CNS-PGM-ID ":RTN-CD OF SCZY3017 =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****   為替換算情報を取得2正常  *****"
      D    DISPLAY  CNS-PGM-ID ":【SUSC3017】.ARG2.為替乗算／除算区分=["
      D             JZ-JS-KBN         OF  PARM-SCZY3017-ARG2"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク乗除区分2（時価（取引通貨）用）"
      D             "=["WK-KWS-ZYOUHO-JZS-2"]"
      *-----------------------------------------------------------------
      *----------  為替乗算/除算区分
               MOVE  JZ-JS-KBN        OF  PARM-SCZY3017-ARG2
                 TO  WK-KWS-ZYOUHO-JZS-2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ワーク乗除区分2（時価（取引通貨）用）"
      D             "=["WK-KWS-ZYOUHO-JZS-2"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
      *----------
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-KS-UN
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":1190実行ステータス=["WK-1190-STATUS"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク実行ステータス=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID ":ワークリターンコード=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード=["
      D             WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード=["
      D             WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":評価系列コード=["
      D             WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":帳票ID=["
      D             WK-GYOMU-REP-ID       OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":帳票任意コード=["
      D             WK-GYOMU-REP-ANY-CD   OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":基準日From=["
      D             WK-GYOMU-KJN-YMD-FROM OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":基準日To=["
      D             WK-GYOMU-KJN-YMD-TO   OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":メッセージID=["
      D             WK-GYOMU-MSG-ID       OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":置換文字=["
      D             WK-GYOMU-TK-MOJI(WK-J,CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID ":フリーメッセージ=["
      D             WK-GYOMU-FREE-MSG     OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-800
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":1190実行ステータス=["WK-1190-STATUS"]"
      D    DISPLAY  CNS-PGM-ID ":ワーク実行ステータス=["WK-STATUS"]"
      D    DISPLAY  CNS-PGM-ID ":ワークリターンコード=["WK-RTN-CODE"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード=["
      D             WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード=["
      D             WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":評価系列コード=["
      D             WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":帳票ID=["
      D             WK-GYOMU-REP-ID       OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":帳票任意コード=["
      D             WK-GYOMU-REP-ANY-CD   OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":基準日From=["
      D             WK-GYOMU-KJN-YMD-FROM OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":基準日To=["
      D             WK-GYOMU-KJN-YMD-TO   OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":メッセージID=["
      D             WK-GYOMU-MSG-ID       OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      D    DISPLAY  CNS-PGM-ID ":置換文字=["
      D             WK-GYOMU-TK-MOJI(WK-J,CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID ":フリーメッセージ=["
      D             WK-GYOMU-FREE-MSG     OF  WK-GYOMU-ERR-INFO(WK-J)"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*****   為替換算情報を取得2"
      D             " エラー  *****"
      *-----------------------------------------------------------------
      *----------  進捗管理フラグ
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
               PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-084          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD
                 OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":為替乗算/除算区分=["
      D             WK-KWS-ZYOUHO-JZS-2"]"
      D    DISPLAY  CNS-PGM-ID ":*** 為替換算情報を取得2   END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY3017-2-EXT.
           EXIT.
      *******              テーマ3422         修正  終了        ********
      ******************************************************************
      *    カウンターパーティ名取得処理
      ******************************************************************
       SCZY4116-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カウンターパーティ名取得処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["WK-RIYO-CMP-CD"]"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4116-INOUT
                       PARM-RTNPKG
                       WK-BIKOU-FLG
                       WK-BIKOU-4116
                       WK-RTN-4116
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4116-ARG1
      *----------  カウンターパーティ分類
           MOVE  CNS-X-1
             TO  COUNTER-PARTY-BUNRUI   OF  PARM-SCZY4116-ARG1
      *----------  適用開始日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT
             TO  TEKIYO-FROM            OF  PARM-SCZY4116-ARG1
      *----------  カウンターパーティコード
           MOVE  H-BIKOU-1
             TO  COUNTER-PARTY-CD       OF  PARM-SCZY4116-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4116-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4116-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":カウンターパーティ分類=["
      D             COUNTER-PARTY-BUNRUI
      D                                 OF  PARM-SCZY4116-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日=["
      D             TEKIYO-FROM         OF  PARM-SCZY4116-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":カウンターパーティコード=["
      D             COUNTER-PARTY-CD    OF  PARM-SCZY4116-ARG1"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY4116  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4116"             USING  PARM-SCZY4116-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY4116  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4116)=["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF  PARM-RTNPKG=["
      D                         COUNTER OF  PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           MOVE  CNS-ON
             TO  WK-BIKOU-FLG
           MOVE  H-BIKOU-1
             TO  WK-BIKOU-4116
           MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-4116
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
      *----------  証券会社
               MOVE  COUNT-PTY-AB-NAME-J   OF  PARM-SCZY4116-ARG2
                 TO  WK-BIKOU-1
      *----------  データなし
             WHEN  CNS-RTN-110
      *----------
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-BIKKOU-1
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             WHEN  CNS-RTN-800
      *----------
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
      *----------  上記以外
             WHEN  OTHER
      *----------  進捗管理フラグ
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
               PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-048          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD
                 OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":備考_１=["WK-BIKOU-1"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  カウンターパーティ名取得処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4116-EXT.
           EXIT.
      ******************************************************************
      *    内部⇒外部銘柄コード変換処理2
      ******************************************************************
       SCZY3002-CHAN-2-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  内部⇒外部銘柄コード変換処理2"
      D             " START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3002-INOUT
                       PARM-RTNPKG
                       FLG-DEFAULT-KRTU-CD
                       WK-DEFAULT-KRTU-CD
                       WK-MEG-CD-3002-3
                       WK-SEC-SBT-3002-3
                       WK-RTN-3002-3
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-ARGUMENT
             TO  RIYO-CMP-CD            OF  PARM-SCZY3002-ARG1
      *----------  内部銘柄コード
           MOVE  H-MEG-CD               OF  HST-TBL-SELECT
             TO  NAIBU-MEG-CD           OF  PARM-SCZY3002-ARG1
      *---------- 商品分類コード
           MOVE  SPACE
             TO  SYOHIN-BUNRUI-CD       OF  PARM-SCZY3002-ARG1
      *---------- 証券種別コード
           IF  H-DATA-KBN  =  CNS-X-1
           THEN
             MOVE  SPACE
               TO  SEC-SBT-CD           OF  PARM-SCZY3002-ARG1
           ELSE
             MOVE  H-SEC-SBT-CD
               TO  SEC-SBT-CD           OF  PARM-SCZY3002-ARG1
           END-IF
      *---------- 元証券種別コード
           MOVE  SPACE
             TO  MOTO-SEC-SBT-CD        OF  PARM-SCZY3002-ARG1
      *----------  銘柄リファレンス系列コード
           MOVE  SPACE
             TO  CD-REF-KRTU-CD         OF  PARM-SCZY3002-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
             TO  GYOMU-TASK-ID          OF  PARM-SCZY3002-ARG1
      *----------  基準日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT
             TO  KJN-YMD                OF  PARM-SCZY3002-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD=["
      D             RIYO-CMP-CD         OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":NAIBU-MEG-CD=["
      D             NAIBU-MEG-CD        OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SYOHIN-BUNRUI-CD=["
      D             SYOHIN-BUNRUI-CD    OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":テータ区分=["
      D             H-DATA-KBN "]"
      D    DISPLAY  CNS-PGM-ID":SEC-SBT-CD=["
      D             SEC-SBT-CD          OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":MOTO-SEC-SBT-CD=["
      D             MOTO-SEC-SBT-CD     OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":MEG-TUKA-CD=["
      D             MEG-TUKA-CD         OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":CD-REF-KRTU-CD=["
      D             CD-REF-KRTU-CD      OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":KJN-YMD=["
      D             KJN-YMD             OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":GYOMU-TASK-ID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3002 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY3002"             USING  PARM-SCZY3002-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3002 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY3002)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           MOVE  H-MEG-CD               OF  HST-TBL-SELECT
             TO  WK-MEG-CD-3002-3
           MOVE  H-SEC-SBT-CD
             TO  WK-SEC-SBT-3002-3
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-3002-3
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
      *---------- デフォルトリファレンスコード
               MOVE  CD-REF-KRTU-CD        OF  PARM-SCZY3002-ARG2
                 TO  WK-DEFAULT-KRTU-CD
               IF  WK-DEFAULT-KRTU-CD =  WK-CD-REF-KRTU-CD
               THEN
                 MOVE  CNS-1               TO  FLG-DEFAULT-KRTU-CD
               ELSE
                 MOVE  ZERO                TO  FLG-DEFAULT-KRTU-CD
               END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":デフォルトリファレンスコード=["
      D             WK-DEFAULT-KRTU-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワークコードリファレンス系列コード=["
      D             WK-CD-REF-KRTU-CD"]"
      D    DISPLAY  CNS-PGM-ID":デフォルトリファレンスコードフラグ=["
      D             FLG-DEFAULT-KRTU-CD"]"
      *-----------------------------------------------------------------
      *----------  異常
             WHEN  CNS-RTN-110
             WHEN  CNS-RTN-002
      *----------  ワーク実行ステータス
               MOVE  ZERO               TO  FLG-DEFAULT-KRTU-CD
               MOVE  SPACE              TO  WK-DEFAULT-KRTU-CD
             WHEN  CNS-RTN-800
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理2  業務エラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *----------  上記以外
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":内部⇒外部銘柄コード変換処理2  エラー"
      *-----------------------------------------------------------------
      *----------  WK-STATUS
               MOVE  CNS-16              TO  WK-STATUS
      *----------  1190実行ステータス
               MOVE  CNS-16              TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16              TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-049        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                        (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  内部⇒外部銘柄コード変換処理2"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY3002-CHAN-2-EXT.
           EXIT.
      ******************************************************************
      *    合計レコードを編集1
      ******************************************************************
       GENKIN-GOUKEI-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":合計レコードを編集1  START "
      D    DISPLAY  CNS-PGM-ID":H-KB-KANRI-ID=["H-KB-KANRI-ID"]"
      *-----------------------------------------------------------------
      *----------  保有数量
           IF ( H-KB-KANRI-ID = CNS-MEG-PAYLC
              OR H-KB-KANRI-ID = CNS-MEG-PAYBC
              OR H-KB-KANRI-ID = CNS-MEG-ACPAYLC
              OR H-KB-KANRI-ID = CNS-MEG-MAPAYLC
              OR H-KB-KANRI-ID = CNS-MEG-MAPAYBC )
           THEN
             COMPUTE  WK-HOU-SURYO-SUM
                   =  WK-HOU-SURYO-SUM
                   -  H-HOU-SURYO
           ELSE
             COMPUTE  WK-HOU-SURYO-SUM
                   =  WK-HOU-SURYO-SUM
                   +  H-HOU-SURYO
           END-IF
      *----------  取得金額(取引通貨)
           COMPUTE  WK-THTK-ST-KNG-SUM
                 =  WK-THTK-ST-KNG-SUM
                 +  H-THTK-ST-KNG
      *----------  評価金額(取引通貨)
           COMPUTE  WK-THTK-HYK-KN-SUM
                 =  WK-THTK-HYK-KN-SUM
                 +  H-THTK-HYK-KN
      *----------  評価損益(取引通貨)
             COMPUTE  WK-THTK-HYK-SNEKI-SUM
                   =  WK-THTK-HYK-SNEKI-SUM
                   +  H-THTK-HYK-SNEKI
      *----------  取得金額(運用通貨為替換算額)
           COMPUTE  WK-UYTK-KWS-BOKAZN-SUM
                 =  WK-UYTK-KWS-BOKAZN-SUM
                 +  H-SHTK-KN-LC
      *----------  取得金額(運用通貨)
           COMPUTE  WK-SHTK-KN-LC-SUM
                 =  WK-SHTK-KN-LC-SUM
                 +  H-SHTK-KN-LC
      *----------  評価金額(運用通貨)
           COMPUTE  WK-HYK-KN-LC-SUM
                 =  WK-HYK-KN-LC-SUM
                 +  H-HYK-KN-LC
      *----------  評価損益(運用通貨)
           COMPUTE  WK-HYK-SNEKI-LC-SUM
                 =  WK-HYK-SNEKI-LC-SUM
                 +  H-HYK-SNEKI-LC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":保有数量=["WK-HOU-SURYO-SUM "]"
      D    DISPLAY  CNS-PGM-ID":取得金額(取引通貨)=["
      D             WK-THTK-ST-KNG-SUM"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(取引通貨)=["
      D             WK-THTK-HYK-KN-SUM"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(取引通貨)=["
      D             WK-THTK-HYK-SNEKI-SUM"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨為替換算額)=["
      D             WK-UYTK-KWS-BOKAZN-SUM"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨)=["
      D             WK-SHTK-KN-LC-SUM"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(運用通貨)=["
      D             WK-HYK-KN-LC-SUM"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(運用通貨)=["
      D             WK-HYK-SNEKI-LC-SUM"]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT=["WK-GENKIN-OUT"]"
      D    DISPLAY  CNS-PGM-ID":H-SEC-SBT-CD=["H-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-TRHK-TUKA=["WK-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID":WK-CAPITAL-TUKA-CD=["
      D             WK-CAPITAL-TUKA-CD"]"
      *-----------------------------------------------------------------
           IF  WK-GENKIN-OUT  =  SPACE
           THEN
             MOVE  CNS-X-1         TO  WK-GENKIN-OUT
             MOVE  WK-REC          TO  WK-REC2
             IF  H-SEC-SBT-CD = CNS-SKSBT-CASH
             THEN
               IF  WK-TRHK-TUKA  =  WK-CAPITAL-TUKA-CD
               THEN
                 MOVE  CNS-SKSBT-CASH
                   TO  SEC-SBT-CD  OF  WK-REC2
               ELSE
                 MOVE  CNS-SKSBT-EX
                   TO  SEC-SBT-CD  OF  WK-REC2
               END-IF
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
           MOVE  CNS-ON            TO  FLG-DATA-OUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SEC-SBT-CD=["SEC-SBT-CD  OF  WK-REC2"]"
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT=["WK-GENKIN-OUT"]"
      D    DISPLAY  CNS-PGM-ID":FLG-DATA-OUT=["FLG-DATA-OUT"]"
      D    DISPLAY  CNS-PGM-ID":合計レコードを編集1  END "
      *-----------------------------------------------------------------
           CONTINUE.
       GENKIN-GOUKEI-EXT.
           EXIT.
      ******************************************************************
      *    データ合計編輯3する
      ******************************************************************
       DATA-3-RTN             SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  データ合計編輯3 START  ***"
      *-----------------------------------------------------------------
      *----------  証券発行元の所属する国
           MOVE  WK-HAKO-CD-CD-2(WK-IDX-M)
             TO  HAKO-CD           OF  WK-REC-REC(WK-IDX-M)
      *----------  銘柄コード
           MOVE  WK-MEG-CD-2(WK-IDX-M)
             TO  MEG-CD            OF  WK-REC-REC(WK-IDX-M)
      *----------  送付側銘柄コード
           MOVE  WK-MEG-CD-2(WK-IDX-M)
             TO  SEND-MEG-CD       OF  WK-REC-REC(WK-IDX-M)
      *----------  保有数量
           MOVE  WK-HOU-SURYO-SUM-2(WK-IDX-M)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HOU-SURYO         OF  WK-REC-REC(WK-IDX-M)
      *----------  取得金額(取引通貨)
           MOVE  WK-THTK-ST-KNG-SUM-2(WK-IDX-M)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-ST-KNG       OF  WK-REC-REC(WK-IDX-M)
      *----------  評価金額(取引通貨)
           MOVE  WK-THTK-HYK-KN-SUM-2(WK-IDX-M)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-KN       OF  WK-REC-REC(WK-IDX-M)
      *----------  評価損益(取引通貨)
           MOVE  WK-THTK-HYK-SNEKI-SUM-2(WK-IDX-M)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-SNEKI    OF  WK-REC-REC(WK-IDX-M)
      *----------  取得金額(運用通貨為替換算額)
           MOVE  WK-UYTK-KWS-BOKAZN-SUM-2(WK-IDX-M)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  UYTK-KWS-BOKAZN   OF  WK-REC-REC(WK-IDX-M)
      *----------  取得金額(運用通貨)
           MOVE  WK-SHTK-KN-LC-SUM-2(WK-IDX-M)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SHTK-KN-LC        OF  WK-REC-REC(WK-IDX-M)
      *----------  評価金額(運用通貨)
           MOVE  WK-HYK-KN-LC-SUM-2(WK-IDX-M)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-KN-LC         OF  WK-REC-REC(WK-IDX-M)
      *----------  評価損益(運用通貨)
           MOVE  WK-HYK-SNEKI-LC-SUM-2(WK-IDX-M)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-SNEKI-LC      OF  WK-REC-REC(WK-IDX-M)
      *----------  銘柄名称(日本語)
           MOVE  WK-MEG-MEI-JP-2(WK-IDX-M)
             TO  MEG-MEI-JP        OF  WK-REC-REC(WK-IDX-M)
      *----------  銘柄名称(英語)
           MOVE  WK-MEG-MEI-EN-2(WK-IDX-M)
             TO  MEG-MEI-EN        OF  WK-REC-REC(WK-IDX-M)
      *----------  債券ｸｰﾎﾟﾝ
           MOVE  ZERO
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SK-KP             OF  WK-REC-REC(WK-IDX-M)
      *----------  債券償還日
           MOVE  ZERO
             TO  SHOKAN-YMD        OF  WK-REC-REC(WK-IDX-M)
      *----------  建玉/約定番号
           MOVE  ZERO
             TO  KB-KANRI-ID       OF  WK-REC-REC(WK-IDX-M)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券発行元の所属する国=["HAKO-CD
      D                                  OF  WK-REC-REC(WK-IDX-M) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["MEG-CD
      D                                  OF  WK-REC-REC(WK-IDX-M) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(日本語)=["MEG-MEI-JP
      D                                  OF  WK-REC-REC(WK-IDX-M) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(英語)=["MEG-MEI-EN
      D                                  OF  WK-REC-REC(WK-IDX-M) "]"
      D    DISPLAY  CNS-PGM-ID":債券ｸｰﾎﾟﾝ=[" SK-KP
      D                                  OF  WK-REC-REC(WK-IDX-M) "]"
      D    DISPLAY  CNS-PGM-ID":債券償還日=["SHOKAN-YMD
      D                                  OF  WK-REC-REC(WK-IDX-M) "]"
      D    DISPLAY  CNS-PGM-ID":建玉/約定番号=["KB-KANRI-ID
      D                                  OF  WK-REC-REC(WK-IDX-M) "]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** データ合計編輯3 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-3-EXT.
           EXIT.
      ******************************************************************
      *    DATファイル3クローズ処理
      ******************************************************************
       CLOSE-FILE-3-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****DATファイル3クローズ処理  "
      D             "START  *****"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-3
           CLOSE  OUT-FILE-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":FILE-STATUS-3=[" WK-FILE-STATUS-3 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-3
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル3クローズ処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル3クローズ処理エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-16                  TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID              TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-050             TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-230             TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-3)
                                             TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0            TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-3
                       "]クローズエラー"
               DELIMITED BY SPACE           INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ファイル3オープンフラグ=["
      D            FLG-FILE-OPEN-3"]"
      D    DISPLAY CNS-PGM-ID":*****DATファイル3クローズ処理 END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-FILE-3-EXT.
           EXIT.
      ******************************************************************
      *    DATファイル4クローズ処理
      ******************************************************************
       CLOSE-FILE-4-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****DATファイル4クローズ処理  "
      D             "START  *****"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-4
           CLOSE  OUT-FILE-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":FILE-STATUS-4=[" WK-FILE-STATUS-4 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-4
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル4クローズ処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル4クローズ処理エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-16                  TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID              TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-051             TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-230             TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-4)
                                             TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0            TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-4
                       "]クローズエラー"
               DELIMITED BY SPACE           INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ファイル4オープンフラグ=["
      D            FLG-FILE-OPEN-4"]"
      D    DISPLAY CNS-PGM-ID":*****DATファイル4クローズ処理 END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-FILE-4-EXT.
           EXIT.
      ******************************************************************
      *    データ合計編輯2する
      ******************************************************************
       DATA-2-RTN             SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  データ合計編輯2 START  ***"
      D    DISPLAY  CNS-PGM-ID":保有数量=["WK-HOU-SURYO-SUM"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(取引通貨)=["
      D             WK-THTK-ST-KNG-SUM"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(取引通貨)=["
      D             WK-THTK-HYK-KN-SUM"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(取引通貨)=["
      D             WK-THTK-HYK-SNEKI-SUM"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨為替換算額)=["
      D             WK-UYTK-KWS-BOKAZN-SUM"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨)=["
      D             WK-SHTK-KN-LC-SUM"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(運用通貨)=["
      D             WK-HYK-KN-LC-SUM"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(運用通貨)=["
      D             WK-HYK-SNEKI-LC-SUM"]"
      *-----------------------------------------------------------------
      *----------  保有数量
           MOVE  WK-HOU-SURYO-SUM
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HOU-SURYO         OF  WK-REC2
      *----------  取得金額(取引通貨)
           MOVE  WK-THTK-ST-KNG-SUM
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-ST-KNG       OF  WK-REC2
      *----------  評価金額(取引通貨)
           MOVE  WK-THTK-HYK-KN-SUM
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-KN       OF  WK-REC2
      *----------  評価損益(取引通貨)
           MOVE  WK-THTK-HYK-SNEKI-SUM
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-SNEKI    OF  WK-REC2
      *----------  取得金額(運用通貨為替換算額)
           MOVE  WK-UYTK-KWS-BOKAZN-SUM
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  UYTK-KWS-BOKAZN   OF  WK-REC2
      *----------  取得金額(運用通貨)
           MOVE  WK-SHTK-KN-LC-SUM
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SHTK-KN-LC        OF  WK-REC2
      *----------  評価金額(運用通貨)
           MOVE  WK-HYK-KN-LC-SUM
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-KN-LC         OF  WK-REC2
      *----------  評価損益(運用通貨)
           MOVE  WK-HYK-SNEKI-LC-SUM
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-SNEKI-LC      OF  WK-REC2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":保有数量=["
      D             HOU-SURYO         OF  WK-REC2 "]"
      D    DISPLAY  CNS-PGM-ID":取得金額(取引通貨)=["
      D             THTK-ST-KNG       OF  WK-REC2"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(取引通貨)=["
      D             THTK-HYK-KN       OF  WK-REC2"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(取引通貨)=["
      D             THTK-HYK-SNEKI    OF  WK-REC2"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨為替換算額)=["
      D             UYTK-KWS-BOKAZN   OF  WK-REC2"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨)=["
      D             SHTK-KN-LC        OF  WK-REC2"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(運用通貨)=["
      D             HYK-KN-LC         OF  WK-REC2"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(運用通貨)=["
      D             HYK-SNEKI-LC      OF  WK-REC2"]"
      D    DISPLAY  CNS-PGM-ID":*** データ合計編輯2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-2-EXT.
           EXIT.
      ******************************************************************
      *    ブレイク処理3
      ******************************************************************
       BREAK3-RTN             SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ブレイク処理3  START  ***"
      D    DISPLAY  CNS-PGM-ID":現金集計出力フラグ=["WK-GENKIN-OUT "]"
      *-----------------------------------------------------------------
           IF  WK-GENKIN-OUT = CNS-X-1
           THEN
             PERFORM  DATA-2-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定受渡区分:["WK-YJ-UW-KBN-OLD"]"
      D    DISPLAY  CNS-PGM-ID":WK-CASH-FLOW-KBN=["WK-CASH-FLOW-KBN"]"
      D    DISPLAY  CNS-PGM-ID":I-FLG-KEISAN=["
      D             I-FLG-KEISAN          OF WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
             EVALUATE  WK-YJ-UW-KBN-OLD
               WHEN  CNS-X-1
                 IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                 THEN
                   IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                   THEN
                     INITIALIZE  DAT-REC
                     MOVE  WK-REC2             TO  DAT-REC
                     PERFORM  DATA-WRITE-RTN
                   ELSE
                     INITIALIZE  DAT-REC3
                     MOVE  WK-REC2             TO  DAT-REC3
                     PERFORM  DATA-WRITE-3-RTN
                   END-IF
                 ELSE
                   IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                   THEN
                     INITIALIZE  DAT-REC5
                     MOVE  WK-REC2             TO  DAT-REC5
                     PERFORM  DATA-WRITE-5-RTN
                   ELSE
                     INITIALIZE  DAT-REC7
                     MOVE  WK-REC2             TO  DAT-REC7
                     PERFORM  DATA-WRITE-7-RTN
                   END-IF
                 END-IF
               WHEN  CNS-X-2
                 IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                 THEN
                   IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                   THEN
                     INITIALIZE  DAT-REC2
                     MOVE  WK-REC2             TO  DAT-REC2
                     PERFORM  DATA-WRITE-2-RTN
                   ELSE
                     INITIALIZE  DAT-REC4
                     MOVE  WK-REC2             TO  DAT-REC4
                     PERFORM  DATA-WRITE-4-RTN
                   END-IF
                 ELSE
                   IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                   THEN
                     INITIALIZE  DAT-REC6
                     MOVE  WK-REC2             TO  DAT-REC6
                     PERFORM  DATA-WRITE-6-RTN
                   ELSE
                     INITIALIZE  DAT-REC8
                     MOVE  WK-REC2             TO  DAT-REC8
                     PERFORM  DATA-WRITE-8-RTN
                   END-IF
                 END-IF
               WHEN  OTHER
                 CONTINUE
             END-EVALUATE
           ELSE
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA出力しない"
      *-----------------------------------------------------------------
           END-IF
      *
           INITIALIZE        WK-SUM-DATA
                             WK-REC2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ブレイク処理3  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BREAK3-EXT.
           EXIT.
      ******************************************************************
      *    GXファイルをオープンする
      ******************************************************************
       GX-FILE-OPEN-RTN       SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [GX-FILE-OPEN-RTN]"            GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GXファイルをオープンする START ***"
      D    DISPLAY  CNS-PGM-ID":I-FLG-KEISAN=["
      D             I-FLG-KEISAN OF WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
           IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
           THEN
      *----------  3.1.9.ファイル名作成処理
             PERFORM  GET-FILE-NAME-RTN
      *----------  3.1.10.ファイルオープン
             PERFORM  OPEN-FILE-RTN
      *----------  3.1.11.受渡ファイル名作成処理
             PERFORM  GET-FILE-2-NAME-RTN
      *----------  3.1.12.受渡ファイルオープン
             PERFORM  OPEN-FILE-2-RTN
      *----------  約定ファイル05名作成処理
             PERFORM  GET-FILE-5-NAME-RTN
      *----------  約定ファイル05オープン
             PERFORM  OPEN-FILE-5-RTN
      *----------  受渡ファイル06名作成処理
             PERFORM  GET-FILE-6-NAME-RTN
      *----------  受渡ファイル06オープン
             PERFORM  OPEN-FILE-6-RTN
      *----------  3.2.3.１行目にヘッダーの出力処理
             PERFORM  HEADER-OUT-RTN
           ELSE
      *----------  3.1.13.ファイル名作成処理
             PERFORM  GET-FILE-3-NAME-RTN
      *----------  3.1.14.ファイルオープン
             PERFORM  OPEN-FILE-3-RTN
      *----------  3.1.15.ファイル名作成処理
             PERFORM  GET-FILE-4-NAME-RTN
      *----------  3.1.16.ファイルオープン
             PERFORM  OPEN-FILE-4-RTN
      *----------  約定ファイル07名作成処理
             PERFORM  GET-FILE-7-NAME-RTN
      *----------  約定ファイル07オープン
             PERFORM  OPEN-FILE-7-RTN
      *----------  受渡ファイル08名作成処理
             PERFORM  GET-FILE-8-NAME-RTN
      *----------  受渡ファイル08オープン
             PERFORM  OPEN-FILE-8-RTN
      *----------  3.2.3.１行目にヘッダーの出力処理
             PERFORM  HEADER-OUT-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":GXファイルをオープンする END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [GX-FILE-OPEN-RTN]"            GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       GX-FILE-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    未収金、未払金の処理
      ******************************************************************
       UYTK-SJTK-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未収金、未払金の処理 START ***"
      D    DISPLAY  CNS-PGM-ID":WK-SWK-KJN-PTN-CD=["WK-SWK-KJN-PTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-YKJ-SYUGI-KAIKEI=["
      D             WK-YKJ-SYUGI-KAIKEI"]"
      D    DISPLAY  CNS-PGM-ID":H-SEC-SBT-CD=["
      D             H-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":H-KB-KANRI-ID=["H-KB-KANRI-ID"]"
      D    DISPLAY  CNS-PGM-ID":WK-SYOHIN-KBN=["WK-SYOHIN-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-SWK-KJN-PTN-CD(CNS-1:CNS-1) = CNS-TEXT-T
             AND  WK-YKJ-SYUGI-KAIKEI NOT = CNS-X-1
             AND  ( H-SEC-SBT-CD = CNS-SKSBT-CASH
                 OR  WK-SYOHIN-KBN = CNS-SYOHIN-KBN-17 )
           THEN
             PERFORM  GENKIN-GOUKEI-RTN
           ELSE
             CONTINUE
           END-IF
           IF  WK-SWK-KJN-PTN-CD(CNS-1:CNS-1) = CNS-TEXT-T
             AND  WK-YKJ-SYUGI-KAIKEI = CNS-X-1
             AND  ( H-SEC-SBT-CD = CNS-SKSBT-CASH
                 AND  ( H-KB-KANRI-ID = CNS-MEG-RECVLC
                   OR  H-KB-KANRI-ID = CNS-MEG-RECVBC
                   OR  H-KB-KANRI-ID = CNS-MEG-PAYLC
                   OR  H-KB-KANRI-ID = CNS-MEG-PAYBC
                   OR  H-KB-KANRI-ID = CNS-MEG-ACRECVLC
                   OR  H-KB-KANRI-ID = CNS-MEG-ACPAYLC ))
             OR  ( WK-SYOHIN-KBN = CNS-SYOHIN-KBN-17
               AND  ( H-KB-KANRI-ID = CNS-MEG-MARECVLC
                 OR  H-KB-KANRI-ID = CNS-MEG-MARECVBC
                 OR  H-KB-KANRI-ID = CNS-MEG-MAPAYLC
                 OR  H-KB-KANRI-ID = CNS-MEG-MAPAYBC ))
           THEN
             PERFORM  GENKIN-GOUKEI-2-RTN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未収金、未払金の処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UYTK-SJTK-EXT.
           EXIT.
      ******************************************************************
      *    合計レコードを編集2
      ******************************************************************
       GENKIN-GOUKEI-2-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":合計レコードを編集2  START "
      D    DISPLAY  CNS-PGM-ID":H-KB-KANRI-ID=["H-KB-KANRI-ID"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-IDX-I
           EVALUATE  H-KB-KANRI-ID
             WHEN  CNS-MEG-RECVLC
               MOVE  CNS-1    TO  WK-IDX-I
             WHEN  CNS-MEG-RECVBC
               MOVE  CNS-2    TO  WK-IDX-I
             WHEN  CNS-MEG-ACRECVLC
               MOVE  CNS-3    TO  WK-IDX-I
             WHEN  CNS-MEG-PAYLC
               MOVE  CNS-4    TO  WK-IDX-I
             WHEN  CNS-MEG-PAYBC
               MOVE  CNS-5    TO  WK-IDX-I
             WHEN  CNS-MEG-ACPAYLC
               MOVE  CNS-6    TO  WK-IDX-I
             WHEN  CNS-MEG-MARECVLC
               MOVE  CNS-7    TO  WK-IDX-I
             WHEN  CNS-MEG-MARECVBC
               MOVE  CNS-8    TO  WK-IDX-I
             WHEN  CNS-MEG-MAPAYLC
               MOVE  CNS-9    TO  WK-IDX-I
             WHEN  CNS-MEG-MAPAYBC
               MOVE  CNS-10   TO  WK-IDX-I
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-I=["WK-IDX-I"]"
      *-----------------------------------------------------------------
      *----------  保有数量
           IF ( H-KB-KANRI-ID = CNS-MEG-RECVLC
              OR H-KB-KANRI-ID = CNS-MEG-RECVBC
              OR H-KB-KANRI-ID = CNS-MEG-ACRECVLC
              OR H-KB-KANRI-ID = CNS-MEG-MARECVLC
              OR H-KB-KANRI-ID = CNS-MEG-MARECVBC)
           THEN
             COMPUTE  WK-HOU-SURYO-SUM-2(WK-IDX-I)
                   =  WK-HOU-SURYO-SUM-2(WK-IDX-I)
                   +  H-HOU-SURYO
           ELSE
             CONTINUE
           END-IF
           IF ( H-KB-KANRI-ID = CNS-MEG-PAYLC
              OR H-KB-KANRI-ID = CNS-MEG-PAYBC
              OR H-KB-KANRI-ID = CNS-MEG-ACPAYLC
              OR H-KB-KANRI-ID = CNS-MEG-MAPAYLC
              OR H-KB-KANRI-ID = CNS-MEG-MAPAYBC)
           THEN
             COMPUTE  WK-HOU-SURYO-SUM-2(WK-IDX-I)
                   =  WK-HOU-SURYO-SUM-2(WK-IDX-I)
                   -  H-HOU-SURYO
           ELSE
             CONTINUE
           END-IF
      *----------  取得金額(取引通貨)
           COMPUTE  WK-THTK-ST-KNG-SUM-2(WK-IDX-I)
                 =  WK-THTK-ST-KNG-SUM-2(WK-IDX-I)
                 +  H-THTK-ST-KNG
      *----------  評価金額(取引通貨)
           COMPUTE  WK-THTK-HYK-KN-SUM-2(WK-IDX-I)
                 =  WK-THTK-HYK-KN-SUM-2(WK-IDX-I)
                 +  H-THTK-HYK-KN
      *----------  評価損益(取引通貨)
           COMPUTE  WK-THTK-HYK-SNEKI-SUM-2(WK-IDX-I)
                 =  WK-THTK-HYK-SNEKI-SUM-2(WK-IDX-I)
                 +  H-THTK-HYK-SNEKI
      *----------  取得金額(運用通貨為替換算額)
           COMPUTE  WK-UYTK-KWS-BOKAZN-SUM-2(WK-IDX-I)
                 =  WK-UYTK-KWS-BOKAZN-SUM-2(WK-IDX-I)
                 +  H-SHTK-KN-LC
      *----------  取得金額(運用通貨)
           COMPUTE  WK-SHTK-KN-LC-SUM-2(WK-IDX-I)
                 =  WK-SHTK-KN-LC-SUM-2(WK-IDX-I)
                 +  H-SHTK-KN-LC
      *----------  評価金額(運用通貨)
           COMPUTE  WK-HYK-KN-LC-SUM-2(WK-IDX-I)
                 =  WK-HYK-KN-LC-SUM-2(WK-IDX-I)
                 +  H-HYK-KN-LC
      *----------  評価損益(運用通貨)
           COMPUTE  WK-HYK-SNEKI-LC-SUM-2(WK-IDX-I)
                 =  WK-HYK-SNEKI-LC-SUM-2(WK-IDX-I)
                 +  H-HYK-SNEKI-LC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":保有数量("WK-IDX-I")=["
      D             WK-HOU-SURYO-SUM-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(取引通貨)("WK-IDX-I")=["
      D             WK-THTK-ST-KNG-SUM-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(取引通貨)("WK-IDX-I")=["
      D             WK-THTK-HYK-KN-SUM-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(取引通貨)("WK-IDX-I")=["
      D             WK-THTK-HYK-SNEKI-SUM-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨為替換算額)("WK-IDX-I
      D             ")=["WK-UYTK-KWS-BOKAZN-SUM-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨)("WK-IDX-I")=["
      D             WK-SHTK-KN-LC-SUM-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(運用通貨)("WK-IDX-I")=["
      D             WK-HYK-KN-LC-SUM-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(運用通貨)("WK-IDX-I")=["
      D             WK-HYK-SNEKI-LC-SUM-2(WK-IDX-I)"]"
      *-----------------------------------------------------------------
           IF  WK-HOU-SURYO-SUM-2(WK-IDX-I)  NOT =  ZERO
             OR  WK-THTK-ST-KNG-SUM-2(WK-IDX-I)  NOT =  ZERO
             OR  WK-THTK-HYK-KN-SUM-2(WK-IDX-I)  NOT =  ZERO
             OR  WK-THTK-HYK-SNEKI-SUM-2(WK-IDX-I)  NOT =  ZERO
             OR  WK-UYTK-KWS-BOKAZN-SUM-2(WK-IDX-I)  NOT =  ZERO
             OR  WK-SHTK-KN-LC-SUM-2(WK-IDX-I)  NOT =  ZERO
             OR  WK-HYK-KN-LC-SUM-2(WK-IDX-I)  NOT =  ZERO
             OR  WK-HYK-SNEKI-LC-SUM-2(WK-IDX-I)  NOT =  ZERO
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-2("WK-IDX-I")=["
      D             WK-GENKIN-OUT-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":H-SEC-SBT-CD=["H-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-TRHK-TUKA=["WK-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID":WK-CAPITAL-TUKA-CD=["
      D             WK-CAPITAL-TUKA-CD"]"
      *-----------------------------------------------------------------
             IF  WK-GENKIN-OUT-2(WK-IDX-I)  =  SPACE
             THEN
               MOVE  WK-REC          TO  WK-REC-REC(WK-IDX-I)
               IF  H-SEC-SBT-CD = CNS-SKSBT-CASH
               THEN
                 IF  WK-TRHK-TUKA  =  WK-CAPITAL-TUKA-CD
                 THEN
                   MOVE  CNS-SKSBT-CASH
                     TO  SEC-SBT-CD  OF  WK-REC-REC(WK-IDX-I)
                 ELSE
                   MOVE  CNS-SKSBT-EX
                     TO  SEC-SBT-CD  OF  WK-REC-REC(WK-IDX-I)
                 END-IF
               ELSE
                 CONTINUE
               END-IF
               MOVE  H-KB-KANRI-ID
                 TO  WK-MEG-CD-2(WK-IDX-I)
               IF  WK-KUNI-FLG = CNS-OFF
                OR WK-TRHK-TUKA-0604 NOT = WK-TRHK-TUKA
               THEN
                 PERFORM  SUSC0604-RTN
               ELSE
                 IF  WK-RTN-0604 = CNS-RTN-110
                 THEN
                   IF  WK-1190-STATUS < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-1190-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   IF  WK-STATUS < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   IF  WK-RTN-CODE < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-RTN-CODE
                   ELSE
                     CONTINUE
                   END-IF
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
               MOVE  WK-KUNI-CD-RYAKU
                 TO  WK-HAKO-CD-CD-2(WK-IDX-I)
               IF    H-KB-KANRI-ID  =  CNS-MEG-RECVLC
                 OR  H-KB-KANRI-ID  =  CNS-MEG-ACRECVLC
                 OR  H-KB-KANRI-ID  =  CNS-MEG-MARECVLC
               THEN
                 MOVE  CNS-MISYU-GAIKA-J
                   TO  WK-MEG-MEI-JP-2(WK-IDX-I)
                 MOVE  CNS-MISYU-GAIKA-E
                   TO  WK-MEG-MEI-EN-2(WK-IDX-I)
               ELSE
                 CONTINUE
               END-IF
               IF    H-KB-KANRI-ID  =  CNS-MEG-RECVBC
                 OR  H-KB-KANRI-ID  =  CNS-MEG-MARECVBC
               THEN
                 MOVE  CNS-MISYU-UNYO-J
                   TO  WK-MEG-MEI-JP-2(WK-IDX-I)
                 MOVE  CNS-MISYU-UNYO-E
                   TO  WK-MEG-MEI-EN-2(WK-IDX-I)
               ELSE
                 CONTINUE
               END-IF
               IF    H-KB-KANRI-ID  =  CNS-MEG-PAYLC
                 OR  H-KB-KANRI-ID  =  CNS-MEG-ACPAYLC
                 OR  H-KB-KANRI-ID  =  CNS-MEG-MAPAYLC
               THEN
                 MOVE  CNS-MIBARAI-GAIKA-J
                   TO  WK-MEG-MEI-JP-2(WK-IDX-I)
                 MOVE  CNS-MIBARAI-GAIKA-E
                   TO  WK-MEG-MEI-EN-2(WK-IDX-I)
               ELSE
                 CONTINUE
               END-IF
               IF    H-KB-KANRI-ID  =  CNS-MEG-PAYBC
                 OR  H-KB-KANRI-ID  =  CNS-MEG-MAPAYBC
               THEN
                 MOVE  CNS-MIBARAI-UNYO-J
                   TO  WK-MEG-MEI-JP-2(WK-IDX-I)
                 MOVE  CNS-MIBARAI-UNYO-E
                   TO  WK-MEG-MEI-EN-2(WK-IDX-I)
               ELSE
                 CONTINUE
               END-IF
               MOVE  CNS-X-1
                 TO  WK-GENKIN-OUT-2(WK-IDX-I)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MEG-CD-2("WK-IDX-I")=["
      D             WK-MEG-CD-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":WK-HAKO-CD-CD-2("WK-IDX-I")=["
      D             WK-HAKO-CD-CD-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MEG-MEI-JP-2("WK-IDX-I")=["
      D             WK-MEG-MEI-JP-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MEG-MEI-EN-2("WK-IDX-I")=["
      D             WK-MEG-MEI-EN-2(WK-IDX-I)"]"
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-2("WK-IDX-I")=["
      D             WK-GENKIN-OUT-2(WK-IDX-I)"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SEC-SBT-CD=["
      D             SEC-SBT-CD  OF  WK-REC-REC(WK-IDX-I)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
           MOVE  CNS-ON            TO  FLG-DATA-OUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-DATA-OUT=["FLG-DATA-OUT"]"
      D    DISPLAY  CNS-PGM-ID":合計レコードを編集2  END "
      *-----------------------------------------------------------------
           CONTINUE.
       GENKIN-GOUKEI-2-EXT.
           EXIT.
      ******************************************************************
      *    未払費用の処理
      ******************************************************************
       SJTK-MBHY-RTN          SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未払費用の処理 START ***"
      D    DISPLAY  CNS-PGM-ID":WK-SWK-KJN-PTN-CD=["WK-SWK-KJN-PTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-YKJ-SYUGI-KAIKEI=["
      D             WK-YKJ-SYUGI-KAIKEI"]"
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-CD=["WK-SEC-SBT-CD"]"
      D    DISPLAY  CNS-PGM-ID":H-MEG-CD=["H-MEG-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-CAPITAL-TUKA-CD=["
      D             WK-CAPITAL-TUKA-CD"]"
      *-----------------------------------------------------------------
           IF  WK-SWK-KJN-PTN-CD(CNS-1:CNS-1) = CNS-TEXT-T
             AND  WK-YKJ-SYUGI-KAIKEI = CNS-X-1
             AND  H-SEC-SBT-CD = CNS-SKSBT-FDAL
             AND  ((H-MEG-CD(CNS-1:CNS-4)  =  CNS-ACSU
               OR  H-MEG-CD(CNS-1:CNS-4)  =  CNS-CFEU
               OR  H-MEG-CD(CNS-1:CNS-4)  =  CNS-CSOU
               OR  H-MEG-CD(CNS-1:CNS-4)  =  CNS-CSTU
               OR  H-MEG-CD(CNS-1:CNS-4)  =  CNS-STXU
               OR  H-MEG-CD(CNS-1:CNS-4)  =  CNS-TSTU)
               AND  H-MEG-CD(CNS-5:CNS-11)  =  WK-TRHK-TUKA)
           THEN
             IF  H-MEG-CD(CNS-1:CNS-4)  NOT =  CNS-CSTU
               AND  H-MEG-CD(CNS-1:CNS-4)  NOT =  CNS-CFEU
             THEN
               MOVE  CNS-1         TO  WK-IDX-P
             ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引通貨=["
      D             WK-TRHK-TUKA    "]"
      *-----------------------------------------------------------------
               IF  WK-TRHK-TUKA
                 =  WK-CAPITAL-TUKA-CD
               THEN
                 MOVE  CNS-2       TO  WK-IDX-P
               ELSE
                 MOVE  CNS-3       TO  WK-IDX-P
               END-IF
             END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-P=["WK-IDX-P"]"
      *-----------------------------------------------------------------
             PERFORM  GENKIN-GOUKEI-3-RTN
           ELSE
             CONTINUE
           END-IF
           IF  WK-SWK-KJN-PTN-CD(CNS-1:CNS-1) = CNS-TEXT-T
            AND H-SEC-SBT-CD NOT = CNS-SKSBT-FDAL
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":取引通貨=["
      D             WK-TRHK-TUKA    "]"
      *-----------------------------------------------------------------
             IF  WK-TRHK-TUKA  =  WK-CAPITAL-TUKA-CD
             THEN
               MOVE  CNS-1         TO  WK-IDX-Q
             ELSE
               MOVE  CNS-2         TO  WK-IDX-Q
             END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-Q=["WK-IDX-Q"]"
      *-----------------------------------------------------------------
             PERFORM  GENKIN-GOUKEI-4-RTN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 未払費用の処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SJTK-MBHY-EXT.
           EXIT.
      ******************************************************************
      *    合計レコードを編集3
      ******************************************************************
       GENKIN-GOUKEI-3-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":合計レコードを編集3  START "
      *-----------------------------------------------------------------
      *----------  保有数量
           COMPUTE  WK-HOU-SURYO-SUM-3(WK-IDX-P)
                 =  WK-HOU-SURYO-SUM-3(WK-IDX-P)
                 -  H-SJTK-MBHY-ZN
      *----------  取得金額(取引通貨)
           COMPUTE  WK-THTK-ST-KNG-SUM-3(WK-IDX-P)
                 =  WK-THTK-ST-KNG-SUM-3(WK-IDX-P)
                 -  H-SJTK-MBHY-ZN
      *----------  評価金額(取引通貨)
           COMPUTE  WK-THTK-HYK-KN-SUM-3(WK-IDX-P)
                 =  WK-THTK-HYK-KN-SUM-3(WK-IDX-P)
                 -  H-SJTK-MBHY-ZN
      *----------  評価損益(取引通貨)
           MOVE  ZERO              TO  WK-THTK-HYK-SNEKI-SUM-3(WK-IDX-P)
      *----------  取得金額(運用通貨為替換算額)
           COMPUTE  WK-UYTK-KWS-BOKAZN-SUM-3(WK-IDX-P)
                 =  WK-UYTK-KWS-BOKAZN-SUM-3(WK-IDX-P)
                 -  H-UYTK-MBHY-ZN
      *----------  取得金額(運用通貨)
           COMPUTE  WK-SHTK-KN-LC-SUM-3(WK-IDX-P)
                 =  WK-SHTK-KN-LC-SUM-3(WK-IDX-P)
                 -  H-UYTK-MBHY-ZN
      *----------  評価金額(運用通貨)
           COMPUTE  WK-HYK-KN-LC-SUM-3(WK-IDX-P)
                 =  WK-HYK-KN-LC-SUM-3(WK-IDX-P)
                 -  H-SUJI-12
      *----------  評価損益(運用通貨)
           COMPUTE  WK-HYK-SNEKI-LC-SUM-3(WK-IDX-P)
                 =  WK-HYK-SNEKI-LC-SUM-3(WK-IDX-P)
                 +  H-UYTK-MBHY-ZN
                 -  H-SUJI-12
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":保有数量=["
      D             WK-HOU-SURYO-SUM-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(取引通貨)=["
      D             WK-THTK-ST-KNG-SUM-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(取引通貨)=["
      D             WK-THTK-HYK-KN-SUM-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(取引通貨)=["
      D             WK-THTK-HYK-SNEKI-SUM-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨為替換算額)=["
      D             WK-UYTK-KWS-BOKAZN-SUM-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨)=["
      D             WK-SHTK-KN-LC-SUM-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(運用通貨)=["
      D             WK-HYK-KN-LC-SUM-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(運用通貨)=["
      D             WK-HYK-SNEKI-LC-SUM-3(WK-IDX-P)"]"
      *-----------------------------------------------------------------
           IF  WK-HOU-SURYO-SUM-3(WK-IDX-P)  NOT =  ZERO
             OR  WK-THTK-ST-KNG-SUM-3(WK-IDX-P)  NOT =  ZERO
             OR  WK-THTK-HYK-KN-SUM-3(WK-IDX-P)  NOT =  ZERO
             OR  WK-THTK-HYK-SNEKI-SUM-3(WK-IDX-P)  NOT =  ZERO
             OR  WK-UYTK-KWS-BOKAZN-SUM-3(WK-IDX-P)  NOT =  ZERO
             OR  WK-SHTK-KN-LC-SUM-3(WK-IDX-P)  NOT =  ZERO
             OR  WK-HYK-KN-LC-SUM-3(WK-IDX-P)  NOT =  ZERO
             OR  WK-HYK-SNEKI-LC-SUM-3(WK-IDX-P)  NOT =  ZERO
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-3("WK-IDX-P")=["
      D             WK-GENKIN-OUT-3(WK-IDX-P)"]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-TRHK-TUKA=["WK-TRHK-TUKA"]"
      D    DISPLAY  CNS-PGM-ID":WK-CAPITAL-TUKA-CD=["
      D             WK-CAPITAL-TUKA-CD"]"
      *-----------------------------------------------------------------
             IF  WK-GENKIN-OUT-3(WK-IDX-P)  =  SPACE
             THEN
               MOVE  WK-REC          TO  WK-REC-REC4(WK-IDX-P)
               IF  WK-TRHK-TUKA  =  WK-CAPITAL-TUKA-CD
               THEN
                 MOVE  CNS-SKSBT-CASH
                   TO  SEC-SBT-CD  OF  WK-REC-REC4(WK-IDX-P)
               ELSE
                 MOVE  CNS-SKSBT-EX
                   TO  SEC-SBT-CD  OF  WK-REC-REC4(WK-IDX-P)
               END-IF
               EVALUATE  WK-IDX-P
                 WHEN  CNS-1
                   MOVE  CNS-UNPAIDCOST
                     TO  WK-MEG-CD-3(WK-IDX-P)
                   MOVE  CNS-MEG-SJTK-J
                     TO  WK-MEG-MEI-JP-3(WK-IDX-P)
                   MOVE  CNS-SJTK
                     TO  WK-MEG-MEI-EN-3(WK-IDX-P)
                 WHEN  CNS-2
                   MOVE  CNS-MEG-PAYBC3
                     TO  WK-MEG-CD-3(WK-IDX-P)
                   MOVE  CNS-MIBARAI-UNYO-J
                     TO  WK-MEG-MEI-JP-3(WK-IDX-P)
                   MOVE  CNS-MIBARAI-UNYO-E
                     TO  WK-MEG-MEI-EN-3(WK-IDX-P)
                 WHEN  CNS-3
                   MOVE  CNS-MEG-PAYLC3
                     TO  WK-MEG-CD-3(WK-IDX-P)
                   MOVE  CNS-MIBARAI-GAIKA-J
                     TO  WK-MEG-MEI-JP-3(WK-IDX-P)
                   MOVE  CNS-MIBARAI-GAIKA-E
                     TO  WK-MEG-MEI-EN-3(WK-IDX-P)
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
               IF  WK-KUNI-FLG = CNS-OFF
                OR WK-TRHK-TUKA-0604 NOT = WK-TRHK-TUKA
               THEN
                 PERFORM  SUSC0604-RTN
               ELSE
                 IF  WK-RTN-0604 = CNS-RTN-110
                 THEN
                   IF  WK-1190-STATUS < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-1190-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   IF  WK-STATUS < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   IF  WK-RTN-CODE < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-RTN-CODE
                   ELSE
                     CONTINUE
                   END-IF
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
               MOVE  WK-KUNI-CD-RYAKU
                 TO  WK-HAKO-CD-3(WK-IDX-P)
               MOVE  CNS-X-1
                 TO  WK-GENKIN-OUT-3(WK-IDX-P)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MEG-CD-3("WK-IDX-P")=["
      D             WK-MEG-CD-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":WK-HAKO-CD-3("WK-IDX-P")=["
      D             WK-HAKO-CD-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MEG-MEI-JP-3("WK-IDX-P")=["
      D             WK-MEG-MEI-JP-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MEG-MEI-EN-3("WK-IDX-P")=["
      D             WK-MEG-MEI-EN-3(WK-IDX-P)"]"
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-3("WK-IDX-P")=["
      D             WK-GENKIN-OUT-3(WK-IDX-P)"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SEC-SBT-CD=["
      D             SEC-SBT-CD  OF  WK-REC-REC4(WK-IDX-P)"]"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":合計レコードを編集3  END "
      *-----------------------------------------------------------------
           CONTINUE.
       GENKIN-GOUKEI-3-EXT.
           EXIT.
      ******************************************************************
      *    合計レコードを編集4
      ******************************************************************
       GENKIN-GOUKEI-4-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":合計レコードを編集4  START "
      *-----------------------------------------------------------------
      *----------  保有数量
           COMPUTE  WK-HOU-SURYO-SUM-4(WK-IDX-Q)
                 =  WK-HOU-SURYO-SUM-4(WK-IDX-Q)
                 -  H-SJTK-MBHY-ZN
      *----------  取得金額(取引通貨)
           COMPUTE  WK-THTK-ST-KNG-SUM-4(WK-IDX-Q)
                 =  WK-THTK-ST-KNG-SUM-4(WK-IDX-Q)
                 -  H-SJTK-MBHY-ZN
      *----------  評価金額(取引通貨)
           COMPUTE  WK-THTK-HYK-KN-SUM-4(WK-IDX-Q)
                 =  WK-THTK-HYK-KN-SUM-4(WK-IDX-Q)
                 -  H-SJTK-MBHY-ZN
      *----------  評価損益(取引通貨)
           MOVE  ZERO              TO  WK-THTK-HYK-SNEKI-SUM-4(WK-IDX-Q)
      *----------  取得金額(運用通貨為替換算額)
           COMPUTE  WK-UYTK-KWS-BOKAZN-SUM-4(WK-IDX-Q)
                 =  WK-UYTK-KWS-BOKAZN-SUM-4(WK-IDX-Q)
                 -  H-UYTK-MBHY-ZN
      *----------  取得金額(運用通貨)
           COMPUTE  WK-SHTK-KN-LC-SUM-4(WK-IDX-Q)
                 =  WK-SHTK-KN-LC-SUM-4(WK-IDX-Q)
                 -  H-UYTK-MBHY-ZN
      *----------  評価金額(運用通貨)
           COMPUTE  WK-HYK-KN-LC-SUM-4(WK-IDX-Q)
                 =  WK-HYK-KN-LC-SUM-4(WK-IDX-Q)
                 -  H-SUJI-12
      *----------  評価損益(運用通貨)
           COMPUTE  WK-HYK-SNEKI-LC-SUM-4(WK-IDX-Q)
                 =  WK-HYK-SNEKI-LC-SUM-4(WK-IDX-Q)
                 +  H-UYTK-MBHY-ZN
                 -  H-SUJI-12
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":保有数量("WK-IDX-Q")=["
      D             WK-HOU-SURYO-SUM-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(取引通貨)("WK-IDX-Q")=["
      D             WK-THTK-ST-KNG-SUM-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(取引通貨)("WK-IDX-Q")=["
      D             WK-THTK-HYK-KN-SUM-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(取引通貨)("WK-IDX-Q")=["
      D             WK-THTK-HYK-SNEKI-SUM-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨為替換算額)("WK-IDX-Q
      D             ")=["WK-UYTK-KWS-BOKAZN-SUM-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":取得金額(運用通貨)("WK-IDX-Q")=["
      D             WK-SHTK-KN-LC-SUM-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":評価金額(運用通貨)("WK-IDX-Q")=["
      D             WK-HYK-KN-LC-SUM-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":評価損益(運用通貨)("WK-IDX-Q")=["
      D             WK-HYK-SNEKI-LC-SUM-4(WK-IDX-Q)"]"
      *-----------------------------------------------------------------
           IF  WK-HOU-SURYO-SUM-4(WK-IDX-Q)  NOT =  ZERO
             OR  WK-THTK-ST-KNG-SUM-4(WK-IDX-Q)  NOT =  ZERO
             OR  WK-THTK-HYK-KN-SUM-4(WK-IDX-Q)  NOT =  ZERO
             OR  WK-THTK-HYK-SNEKI-SUM-4(WK-IDX-Q)  NOT =  ZERO
             OR  WK-UYTK-KWS-BOKAZN-SUM-4(WK-IDX-Q)  NOT =  ZERO
             OR  WK-SHTK-KN-LC-SUM-4(WK-IDX-Q)  NOT =  ZERO
             OR  WK-HYK-KN-LC-SUM-4(WK-IDX-Q)  NOT =  ZERO
             OR  WK-HYK-SNEKI-LC-SUM-4(WK-IDX-Q)  NOT =  ZERO
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-4("WK-IDX-Q")=["
      D             WK-GENKIN-OUT-4(WK-IDX-Q)"]"
      *-----------------------------------------------------------------
             IF  WK-GENKIN-OUT-4(WK-IDX-Q)  =  SPACE
             THEN
               MOVE  WK-REC          TO  WK-REC-REC5(WK-IDX-Q)
               IF  WK-IDX-Q  =  CNS-1
               THEN
                 MOVE  CNS-CASH
                   TO  WK-SEC-SBT-CD-4(WK-IDX-Q)
                 MOVE  CNS-MEG-PAYBC2
                   TO  WK-MEG-CD-4(WK-IDX-Q)
                 MOVE  CNS-MIBARAI-UNYO-J
                   TO  WK-MEG-MEI-JP-4(WK-IDX-Q)
                 MOVE  CNS-MIBARAI-UNYO-E
                   TO  WK-MEG-MEI-EN-4(WK-IDX-Q)
               ELSE
                 MOVE  CNS-EX
                   TO  WK-SEC-SBT-CD-4(WK-IDX-Q)
                 MOVE  CNS-MEG-PAYLC2
                   TO  WK-MEG-CD-4(WK-IDX-Q)
                 MOVE  CNS-MIBARAI-GAIKA-J
                   TO  WK-MEG-MEI-JP-4(WK-IDX-Q)
                 MOVE  CNS-MIBARAI-GAIKA-E
                   TO  WK-MEG-MEI-EN-4(WK-IDX-Q)
               END-IF
               IF  WK-KUNI-FLG = CNS-OFF
                OR WK-TRHK-TUKA-0604 NOT = WK-TRHK-TUKA
               THEN
                 PERFORM  SUSC0604-RTN
               ELSE
                 IF  WK-RTN-0604 = CNS-RTN-110
                 THEN
                   IF  WK-1190-STATUS < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-1190-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   IF  WK-STATUS < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-STATUS
                   ELSE
                     CONTINUE
                   END-IF
                   IF  WK-RTN-CODE < CNS-4
                   THEN
                     MOVE  CNS-4          TO  WK-RTN-CODE
                   ELSE
                     CONTINUE
                   END-IF
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
               MOVE  WK-KUNI-CD-RYAKU
                 TO  WK-HAKO-CD-4(WK-IDX-Q)
               MOVE  CNS-X-1
                 TO  WK-GENKIN-OUT-4(WK-IDX-Q)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-CD-4("WK-IDX-Q")=["
      D             WK-SEC-SBT-CD-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MEG-CD-4("WK-IDX-Q")=["
      D             WK-MEG-CD-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":WK-HAKO-CD-4("WK-IDX-Q")=["
      D             WK-HAKO-CD-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MEG-MEI-JP-4("WK-IDX-Q")=["
      D             WK-MEG-MEI-JP-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MEG-MEI-EN-4("WK-IDX-Q")=["
      D             WK-MEG-MEI-EN-4(WK-IDX-Q)"]"
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-4("WK-IDX-Q")=["
      D             WK-GENKIN-OUT-4(WK-IDX-Q)"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":合計レコードを編集4  END "
      *-----------------------------------------------------------------
           CONTINUE.
       GENKIN-GOUKEI-4-EXT.
           EXIT.
      ******************************************************************
      *    ブレイク処理2
      ******************************************************************
       BREAK2-RTN             SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ブレイク処理2  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-IDX-M
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BREAK2-RTN_1]"                GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  VARYING  WK-IDX-M  FROM  CNS-1  BY  CNS-1
             UNTIL  WK-IDX-M > CNS-10
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-2("WK-IDX-M")=["
      D             WK-GENKIN-OUT-2(WK-IDX-M)"]"
      *-----------------------------------------------------------------
             IF  WK-GENKIN-OUT-2(WK-IDX-M) = CNS-X-1
             THEN
               PERFORM  DATA-3-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定受渡区分=["WK-YJ-UW-KBN-OLD"]"
      D    DISPLAY  CNS-PGM-ID":WK-CASH-FLOW-KBN=["WK-CASH-FLOW-KBN"]"
      D    DISPLAY  CNS-PGM-ID":I-FLG-KEISAN=["
      D             I-FLG-KEISAN          OF WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
               EVALUATE  WK-YJ-UW-KBN-OLD
                 WHEN  CNS-X-1
                   IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                   THEN
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                     THEN
                       INITIALIZE  DAT-REC
                       MOVE  WK-REC-REC(WK-IDX-M)   TO  DAT-REC
                       PERFORM  DATA-WRITE-RTN
                     ELSE
                       INITIALIZE  DAT-REC3
                       MOVE  WK-REC-REC(WK-IDX-M)   TO  DAT-REC3
                       PERFORM  DATA-WRITE-3-RTN
                     END-IF
                   ELSE
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                     THEN
                       INITIALIZE  DAT-REC5
                       MOVE  WK-REC-REC(WK-IDX-M)   TO  DAT-REC5
                       PERFORM  DATA-WRITE-5-RTN
                     ELSE
                       INITIALIZE  DAT-REC7
                       MOVE  WK-REC-REC(WK-IDX-M)   TO  DAT-REC7
                       PERFORM  DATA-WRITE-7-RTN
                     END-IF
                   END-IF
                 WHEN  CNS-X-2
                   IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                   THEN
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                     THEN
                       INITIALIZE  DAT-REC2
                       MOVE  WK-REC-REC(WK-IDX-M)   TO  DAT-REC2
                       PERFORM  DATA-WRITE-2-RTN
                     ELSE
                       INITIALIZE  DAT-REC4
                       MOVE  WK-REC-REC(WK-IDX-M)   TO  DAT-REC4
                       PERFORM  DATA-WRITE-4-RTN
                     END-IF
                   ELSE
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                     THEN
                       INITIALIZE  DAT-REC6
                       MOVE  WK-REC-REC(WK-IDX-M)   TO  DAT-REC6
                       PERFORM  DATA-WRITE-6-RTN
                     ELSE
                       INITIALIZE  DAT-REC8
                       MOVE  WK-REC-REC(WK-IDX-M)   TO  DAT-REC8
                       PERFORM  DATA-WRITE-8-RTN
                     END-IF
                   END-IF
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA出力しない"
      *-----------------------------------------------------------------
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BREAK2-RTN_1]"                GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BREAK2-RTN_2]"                GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  VARYING  WK-IDX-X  FROM  CNS-1  BY  CNS-1
             UNTIL  WK-IDX-X > CNS-3
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-3("WK-IDX-X")=["
      D             WK-GENKIN-OUT-3(WK-IDX-X)"]"
      *-----------------------------------------------------------------
             IF  WK-GENKIN-OUT-3(WK-IDX-X) = CNS-X-1
             THEN
               PERFORM  DATA-4-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定受渡区分=["WK-YJ-UW-KBN-OLD"]"
      D    DISPLAY  CNS-PGM-ID":WK-CASH-FLOW-KBN=["WK-CASH-FLOW-KBN"]"
      D    DISPLAY  CNS-PGM-ID":I-FLG-KEISAN=["
      D             I-FLG-KEISAN          OF WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
               EVALUATE  WK-YJ-UW-KBN-OLD
                 WHEN  CNS-X-1
                   IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                   THEN
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                     THEN
                       INITIALIZE  DAT-REC
                       MOVE  WK-REC-REC4(WK-IDX-X)
                         TO  DAT-REC
                       PERFORM  DATA-WRITE-RTN
                     ELSE
                       INITIALIZE  DAT-REC3
                       MOVE  WK-REC-REC4(WK-IDX-X)
                         TO  DAT-REC3
                       PERFORM  DATA-WRITE-3-RTN
                     END-IF
                   ELSE
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                     THEN
                       INITIALIZE  DAT-REC5
                       MOVE  WK-REC-REC4(WK-IDX-X)
                         TO  DAT-REC5
                       PERFORM  DATA-WRITE-5-RTN
                     ELSE
                       INITIALIZE  DAT-REC7
                       MOVE  WK-REC-REC4(WK-IDX-X)
                         TO  DAT-REC7
                       PERFORM  DATA-WRITE-7-RTN
                     END-IF
                   END-IF
                 WHEN  CNS-X-2
                   IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                   THEN
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                     THEN
                       INITIALIZE  DAT-REC2
                       MOVE  WK-REC-REC4(WK-IDX-X)
                         TO  DAT-REC2
                       PERFORM  DATA-WRITE-2-RTN
                     ELSE
                       INITIALIZE  DAT-REC4
                       MOVE  WK-REC-REC4(WK-IDX-X)
                         TO  DAT-REC4
                       PERFORM  DATA-WRITE-4-RTN
                     END-IF
                   ELSE
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                     THEN
                       INITIALIZE  DAT-REC6
                       MOVE  WK-REC-REC4(WK-IDX-X)
                         TO  DAT-REC6
                       PERFORM  DATA-WRITE-6-RTN
                     ELSE
                       INITIALIZE  DAT-REC8
                       MOVE  WK-REC-REC4(WK-IDX-X)
                         TO  DAT-REC8
                       PERFORM  DATA-WRITE-8-RTN
                     END-IF
                   END-IF
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA出力しない"
      *-----------------------------------------------------------------
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BREAK2-RTN_2]"                GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *
           INITIALIZE        WK-SUM-DATA-2
                             WK-SUM-DATA-3
                             WK-REC3
                             WK-REC4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ブレイク処理2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BREAK2-EXT.
           EXIT.
      ******************************************************************
      *    ブレイク処理2
      ******************************************************************
       BREAK2-2-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ブレイク処理2-2  START  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BREAK2-2-RTN]"                GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  VARYING  WK-IDX-Y  FROM  CNS-1  BY  CNS-1
             UNTIL  WK-IDX-Y > CNS-2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GENKIN-OUT-4("WK-IDX-Y")=["
      D             WK-GENKIN-OUT-4(WK-IDX-Y)"]"
      *-----------------------------------------------------------------
             IF  WK-GENKIN-OUT-4(WK-IDX-Y) = CNS-X-1
             THEN
               PERFORM  DATA-5-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定受渡区分=["WK-YJ-UW-KBN-OLD"]"
      D    DISPLAY  CNS-PGM-ID":WK-CASH-FLOW-KBN=["WK-CASH-FLOW-KBN"]"
      D    DISPLAY  CNS-PGM-ID":I-FLG-KEISAN=["
      D             I-FLG-KEISAN          OF WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
               EVALUATE  WK-YJ-UW-KBN-OLD
                 WHEN  CNS-X-1
                   IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                   THEN
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                     THEN
                       INITIALIZE  DAT-REC
                       MOVE  WK-REC-REC5(WK-IDX-Y)
                         TO  DAT-REC
                       PERFORM  DATA-WRITE-RTN
                     ELSE
                       INITIALIZE  DAT-REC3
                       MOVE  WK-REC-REC5(WK-IDX-Y)
                         TO  DAT-REC3
                       PERFORM  DATA-WRITE-3-RTN
                     END-IF
                   ELSE
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO  = CNS-0
                     THEN
                       INITIALIZE  DAT-REC5
                       MOVE  WK-REC-REC5(WK-IDX-Y)
                         TO  DAT-REC5
                       PERFORM  DATA-WRITE-5-RTN
                     ELSE
                       INITIALIZE  DAT-REC7
                       MOVE  WK-REC-REC5(WK-IDX-Y)
                         TO  DAT-REC7
                       PERFORM  DATA-WRITE-7-RTN
                     END-IF
                   END-IF
                 WHEN  CNS-X-2
                   IF  WK-CASH-FLOW-KBN  =  CNS-X-2
                   THEN
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                     THEN
                       INITIALIZE  DAT-REC2
                       MOVE  WK-REC-REC5(WK-IDX-Y)
                         TO  DAT-REC2
                       PERFORM  DATA-WRITE-2-RTN
                     ELSE
                       INITIALIZE  DAT-REC4
                       MOVE  WK-REC-REC5(WK-IDX-Y)
                         TO  DAT-REC4
                       PERFORM  DATA-WRITE-4-RTN
                     END-IF
                   ELSE
                     IF  I-FLG-KEISAN OF WK-DENBUN-INFO = CNS-0
                     THEN
                       INITIALIZE  DAT-REC6
                       MOVE  WK-REC-REC5(WK-IDX-Y)
                         TO  DAT-REC6
                       PERFORM  DATA-WRITE-6-RTN
                     ELSE
                       INITIALIZE  DAT-REC8
                       MOVE  WK-REC-REC5(WK-IDX-Y)
                         TO  DAT-REC8
                       PERFORM  DATA-WRITE-8-RTN
                     END-IF
                   END-IF
                 WHEN  OTHER
                   CONTINUE
               END-EVALUATE
             ELSE
               CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA出力しない"
      *-----------------------------------------------------------------
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BREAK2-2-RTN]"                GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *
           INITIALIZE        WK-SUM-DATA-4
                             WK-REC5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ブレイク処理2-2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       BREAK2-2-EXT.
           EXIT.
      ******************************************************************
      *    データ合計編輯4する
      ******************************************************************
       DATA-4-RTN             SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  データ合計編輯4 START  ***"
      *-----------------------------------------------------------------
      *----------  証券発行元の所属する国
           MOVE  WK-HAKO-CD-3(WK-IDX-X)
             TO  HAKO-CD           OF  WK-REC-REC4(WK-IDX-X)
      *----------  銘柄コード
           MOVE  WK-MEG-CD-3(WK-IDX-X)
             TO  MEG-CD            OF  WK-REC-REC4(WK-IDX-X)
      *----------  送付側銘柄コード
           MOVE  WK-MEG-CD-3(WK-IDX-X)
             TO  SEND-MEG-CD       OF  WK-REC-REC4(WK-IDX-X)
      *----------  保有数量
           MOVE  WK-HOU-SURYO-SUM-3(WK-IDX-X)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HOU-SURYO         OF  WK-REC-REC4(WK-IDX-X)
      *----------  取得金額(取引通貨)
           MOVE  WK-THTK-ST-KNG-SUM-3(WK-IDX-X)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-ST-KNG       OF  WK-REC-REC4(WK-IDX-X)
      *----------  評価金額(取引通貨)
           MOVE  WK-THTK-HYK-KN-SUM-3(WK-IDX-X)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-KN       OF  WK-REC-REC4(WK-IDX-X)
      *----------  評価損益(取引通貨)
           MOVE  WK-THTK-HYK-SNEKI-SUM-3(WK-IDX-X)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-SNEKI    OF  WK-REC-REC4(WK-IDX-X)
      *----------  取得金額(運用通貨為替換算額)
           MOVE  WK-UYTK-KWS-BOKAZN-SUM-3(WK-IDX-X)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  UYTK-KWS-BOKAZN   OF  WK-REC-REC4(WK-IDX-X)
      *----------  取得金額(運用通貨)
           MOVE  WK-SHTK-KN-LC-SUM-3(WK-IDX-X)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SHTK-KN-LC        OF  WK-REC-REC4(WK-IDX-X)
      *----------  評価金額(運用通貨)
           MOVE  WK-HYK-KN-LC-SUM-3(WK-IDX-X)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-KN-LC         OF  WK-REC-REC4(WK-IDX-X)
      *----------  評価損益(運用通貨)
           MOVE  WK-HYK-SNEKI-LC-SUM-3(WK-IDX-X)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-SNEKI-LC      OF  WK-REC-REC4(WK-IDX-X)
      *----------  銘柄名称(日本語)
           MOVE  WK-MEG-MEI-JP-3(WK-IDX-X)
             TO  MEG-MEI-JP        OF  WK-REC-REC4(WK-IDX-X)
      *----------  銘柄名称(英語)
           MOVE  WK-MEG-MEI-EN-3(WK-IDX-X)
             TO  MEG-MEI-EN        OF  WK-REC-REC4(WK-IDX-X)
      *----------  債券ｸｰﾎﾟﾝ
           MOVE  ZERO
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SK-KP             OF  WK-REC-REC4(WK-IDX-X)
      *----------  債券償還日
           MOVE  ZERO
             TO  SHOKAN-YMD        OF  WK-REC-REC4(WK-IDX-X)
      *----------  建玉/約定番号
           MOVE  ZERO
             TO  KB-KANRI-ID       OF  WK-REC-REC4(WK-IDX-X)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券発行元の所属する国=["HAKO-CD
      D                                  OF  WK-REC-REC4(WK-IDX-X) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["MEG-CD
      D                                  OF  WK-REC-REC4(WK-IDX-X) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(日本語)=["MEG-MEI-JP
      D                                  OF  WK-REC-REC4(WK-IDX-X) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(英語)=["MEG-MEI-EN
      D                                  OF  WK-REC-REC4(WK-IDX-X) "]"
      D    DISPLAY  CNS-PGM-ID":債券ｸｰﾎﾟﾝ=[" SK-KP
      D                                  OF  WK-REC-REC4(WK-IDX-X) "]"
      D    DISPLAY  CNS-PGM-ID":債券償還日=["SHOKAN-YMD
      D                                  OF  WK-REC-REC4(WK-IDX-X) "]"
      D    DISPLAY  CNS-PGM-ID":建玉/約定番号=["KB-KANRI-ID
      D                                  OF  WK-REC-REC4(WK-IDX-X) "]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** データ合計編輯4 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-4-EXT.
           EXIT.
      ******************************************************************
      *    データ合計編輯5する
      ******************************************************************
       DATA-5-RTN             SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  データ合計編輯5 START  ***"
      *-----------------------------------------------------------------
      *----------  証券種別
           MOVE  WK-SEC-SBT-CD-4(WK-IDX-Y)
             TO  SEC-SBT-CD        OF  WK-REC-REC5(WK-IDX-Y)
      *----------  証券発行元の所属する国
           MOVE  WK-HAKO-CD-4(WK-IDX-Y)
             TO  HAKO-CD           OF  WK-REC-REC5(WK-IDX-Y)
      *----------  銘柄コード
           MOVE  WK-MEG-CD-4(WK-IDX-Y)
             TO  MEG-CD            OF  WK-REC-REC5(WK-IDX-Y)
      *----------  送付側銘柄コード
           MOVE  WK-MEG-CD-4(WK-IDX-Y)
             TO  SEND-MEG-CD       OF  WK-REC-REC5(WK-IDX-Y)
      *----------  保有数量
           MOVE  WK-HOU-SURYO-SUM-4(WK-IDX-Y)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HOU-SURYO         OF  WK-REC-REC5(WK-IDX-Y)
      *----------  取得金額(取引通貨)
           MOVE  WK-THTK-ST-KNG-SUM-4(WK-IDX-Y)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-ST-KNG       OF  WK-REC-REC5(WK-IDX-Y)
      *----------  評価金額(取引通貨)
           MOVE  WK-THTK-HYK-KN-SUM-4(WK-IDX-Y)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-KN       OF  WK-REC-REC5(WK-IDX-Y)
      *----------  評価損益(取引通貨)
           MOVE  WK-THTK-HYK-SNEKI-SUM-4(WK-IDX-Y)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  THTK-HYK-SNEKI    OF  WK-REC-REC5(WK-IDX-Y)
      *----------  取得金額(運用通貨為替換算額)
           MOVE  WK-UYTK-KWS-BOKAZN-SUM-4(WK-IDX-Y)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  UYTK-KWS-BOKAZN   OF  WK-REC-REC5(WK-IDX-Y)
      *----------  取得金額(運用通貨)
           MOVE  WK-SHTK-KN-LC-SUM-4(WK-IDX-Y)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SHTK-KN-LC        OF  WK-REC-REC5(WK-IDX-Y)
      *----------  評価金額(運用通貨)
           MOVE  WK-HYK-KN-LC-SUM-4(WK-IDX-Y)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-KN-LC         OF  WK-REC-REC5(WK-IDX-Y)
      *----------  評価損益(運用通貨)
           MOVE  WK-HYK-SNEKI-LC-SUM-4(WK-IDX-Y)
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 22 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  HYK-SNEKI-LC      OF  WK-REC-REC5(WK-IDX-Y)
      *----------  銘柄名称(日本語)
           MOVE  WK-MEG-MEI-JP-4(WK-IDX-Y)
             TO  MEG-MEI-JP        OF  WK-REC-REC5(WK-IDX-Y)
      *----------  銘柄名称(英語)
           MOVE  WK-MEG-MEI-EN-4(WK-IDX-Y)
             TO  MEG-MEI-EN        OF  WK-REC-REC5(WK-IDX-Y)
      *----------  債券ｸｰﾎﾟﾝ
           MOVE  ZERO
             TO  WK-18-18-X
           PERFORM  ZERO-COMPUTE-RTN
           COMPUTE  WK-NUM-LENGTH = 25 - WK-NUM-1
           MOVE  WK-18-18-X(WK-NUM-FROM:WK-NUM-LENGTH)
             TO  SK-KP             OF  WK-REC-REC5(WK-IDX-Y)
      *----------  債券償還日
           MOVE  ZERO
             TO  SHOKAN-YMD        OF  WK-REC-REC5(WK-IDX-Y)
      *----------  建玉/約定番号
           MOVE  ZERO
             TO  KB-KANRI-ID       OF  WK-REC-REC5(WK-IDX-Y)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券発行元の所属する国=["HAKO-CD
      D                                  OF  WK-REC-REC5(WK-IDX-Y) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["MEG-CD
      D                                  OF  WK-REC-REC5(WK-IDX-Y) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(日本語)=["MEG-MEI-JP
      D                                  OF  WK-REC-REC5(WK-IDX-Y) "]"
      D    DISPLAY  CNS-PGM-ID":銘柄名称(英語)=["MEG-MEI-EN
      D                                  OF  WK-REC-REC5(WK-IDX-Y) "]"
      D    DISPLAY  CNS-PGM-ID":債券ｸｰﾎﾟﾝ=[" SK-KP
      D                                  OF  WK-REC-REC5(WK-IDX-Y) "]"
      D    DISPLAY  CNS-PGM-ID":債券償還日=["SHOKAN-YMD
      D                                  OF  WK-REC-REC5(WK-IDX-Y) "]"
      D    DISPLAY  CNS-PGM-ID":建玉/約定番号=["KB-KANRI-ID
      D                                  OF  WK-REC-REC5(WK-IDX-Y) "]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** データ合計編輯5 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-5-EXT.
           EXIT.
      ******************************************************************
      *    評価系列取得ルーチン
      ******************************************************************
       SCZY4009-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***   評価系列取得ルーチン   START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4009-INOUT
                       PARM-RTNPKG
                       WK-HYK-EX-SHTK-PTN-CD
                       WK-HYK-EX-FLG
                       WK-RTN-4009
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4009-ARG1
      *----------  評価系列コード
           MOVE  WK-DEFAUL-THYK-CD      OF  WK-PTF-ATT-DATA(WK-IDX-J)
             TO  HYK-KRTU-CD            OF  PARM-SCZY4009-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4009-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["
      D             RIYO-CMP-CD              OF  PARM-SCZY4009-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価系列コード      =["
      D             HYK-KRTU-CD              OF  PARM-SCZY4009-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY4009"              USING  PARM-SCZY4009-INOUT
                                                 PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4009) =["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           MOVE  CNS-ON
             TO  WK-HYK-EX-FLG
           MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             TO  WK-RTN-4009
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *----------  取得した評価為替取得方法コード
               MOVE  HYK-EX-SHTK-PTN-CD  OF  PARM-SCZY4009-INOUT
                 TO  WK-HYK-EX-SHTK-PTN-CD
             WHEN  CNS-RTN-110
      *----------
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-HYK-EX
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             WHEN  OTHER
      *----------  進捗管理フラグ
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
               PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-052          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD
                 OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-HYK-EX-SHTK-PTN-CD=["
      D             WK-HYK-EX-SHTK-PTN-CD"]"
      D    DISPLAY  CNS-PGM-ID ":*** 評価系列取得ルーチン   END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4009-EXT.
           EXIT.
      ******************************************************************
      *    評価為替取得方法パターン取得ルーチン
      ******************************************************************
       SCZY4012-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***   評価為替取得方法パターン取得"
      D             "ルーチン   START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY4012-INOUT
                       PARM-RTNPKG
                       WK-PRIO-1-EX-KRTU
                       WK-PRIO-1-FLG
                       WK-TRHK-TUKA-4012
                       WK-RTN-4012
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD                 OF  PARM-SCZY4012-ARG1
      *----------  評価為替取得方法コード
           MOVE  WK-HYK-EX-SHTK-PTN-CD
             TO  HYK-EX-SHTK-PTN-CD          OF  PARM-SCZY4012-ARG1
      *----------  取引通貨コード
           MOVE  H-TRHK-TUKA                 OF  HST-TBL-SELECT
             TO  SIJO-TUKA-CD                OF  PARM-SCZY4012-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4012-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["
      D             RIYO-CMP-CD              OF  PARM-SCZY4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":評価為替取得方法コード  =["
      D             HYK-EX-SHTK-PTN-CD       OF  PARM-SCZY4012-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":取引通貨コード      =["
      D             SIJO-TUKA-CD             OF  PARM-SCZY4012-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SCZY4012"              USING  PARM-SCZY4012-INOUT
                                                 PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4012) =["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           MOVE  CNS-ON
             TO  WK-PRIO-1-FLG
           MOVE  H-TRHK-TUKA                 OF  HST-TBL-SELECT
             TO  WK-TRHK-TUKA-4012
           MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             TO  WK-RTN-4012
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *----------  取得した優先順位１為替系列
               MOVE  PRIO-1-EX-KRTU           OF  PARM-SCZY4012-INOUT
                 TO  WK-PRIO-1-EX-KRTU
             WHEN  CNS-RTN-110
      *----------
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-EX-KRTU
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG      OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             WHEN  OTHER
      *----------  進捗管理フラグ
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
               PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-053          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD
                 OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-PRIO-1-EX-KRTU=["
      D             WK-PRIO-1-EX-KRTU"]"
      D    DISPLAY  CNS-PGM-ID ":***  評価為替取得方法パターン取得"
      D             "ルーチン   END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY4012-EXT.
           EXIT.
      *****************************************************************
      *   ＧＸ用証券種別コード変換
      *****************************************************************
       SUSC0603-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＧＸ用証券種別コード変換  START***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0603-INOUT
                       PARM-RTNPKG
                       WK-SEC-SBT-CD-3
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD-2
             TO  SEC-SBT-CD             OF  PARM-SUSC0603-ARG1
      *----------  資産分類コード
           MOVE  WK-SISAN-BUNRUI-CD
             TO  ASSETS-KBN-CD          OF  PARM-SUSC0603-ARG1
      *----------  コールプット区分
           MOVE  WK-CALL-PUT-KBN
             TO  CP-KBN                 OF  PARM-SUSC0603-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SUSC0603-ARG:"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             SEC-SBT-CD          OF  PARM-SUSC0603-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":資産分類コード=["
      D             ASSETS-KBN-CD       OF  PARM-SUSC0603-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":コールプット区分=["
      D             CP-KBN              OF  PARM-SUSC0603-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSC0603 START  ***"
      *-----------------------------------------------------------------
           CALL  "SUSC0603"             USING  PARM-SUSC0603-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SUSC0603 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0603)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
               MOVE  GX-SEC-SBT-CD      OF  PARM-SUSC0603-ARG2
                 TO  WK-SEC-SBT-CD-3
             WHEN  CNS-RTN-100
               IF   WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4              TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF   WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD   OF
                                        WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD    OF
                                        WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                                        OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                                        OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
      *------------------ <残タスク157の対応 START>---------------------
               MOVE  CNS-MSG-E000564
                 TO  WK-GYOMU-MSG-ID    OF WK-GYOMU-ERR-INFO(WK-J)
      *------------------ <残タスク157の対応 END>-----------------------
      *---------- 置換文字
               STRING  CNS-SEC-SBT-GAIBU-CD
                       WK-SEC-SBT-CD-2
                       DELIMITED BY SPACE
                       INTO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG  OF WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
             WHEN  CNS-RTN-110
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部コード取得処理  業務エラー"
      *-----------------------------------------------------------------
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               STRING  CNS-SEC-SBT-GAIBU-CD
                       WK-SEC-SBT-CD-2
                       DELIMITED BY SPACE
                       INTO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
               END-STRING
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-SEC-SBT-CD-3=["WK-SEC-SBT-CD-3"]"
      D    DISPLAY  CNS-PGM-ID":***  ＧＸ用証券種別コード変換 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0603-EXT.
           EXIT.
      ******************************************************************
      *    ＧＸ用通貨コード→国コード変換ルーチン
      ******************************************************************
       SUSC0604-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***   ＧＸ用通貨コード→国コード変換"
      D             "ルーチン   START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SUSC0604-INOUT
                       PARM-RTNPKG
                       WK-KUNI-CD-RYAKU
                       WK-KUNI-FLG
                       WK-TRHK-TUKA-0604
                       WK-RTN-0604
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD                 OF  PARM-SUSC0604-ARG1
      *----------  適用開始日
           MOVE  H-ZANTK-YMD                 OF  HST-TBL-SELECT
             TO  TEKIYO-FROM                 OF  PARM-SUSC0604-ARG1
      *----------  通貨コード
           MOVE  WK-TRHK-TUKA
             TO  TUKA-CD                     OF  PARM-SUSC0604-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SUSC0604-ARG1:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["
      D             RIYO-CMP-CD              OF  PARM-SUSC0604-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":適用開始日  =["
      D             TEKIYO-FROM              OF  PARM-SUSC0604-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":通貨コード      =["
      D             TUKA-CD                  OF  PARM-SUSC0604-ARG1"]"
      *-----------------------------------------------------------------
           CALL   "SUSC0604"              USING  PARM-SUSC0604-INOUT
                                                 PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SUSC0604) =["
      D             RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           MOVE  CNS-ON
             TO  WK-KUNI-FLG
           MOVE  WK-TRHK-TUKA
             TO  WK-TRHK-TUKA-0604
           MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             TO  WK-RTN-0604
           EVALUATE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *----------  国コード-略式
               MOVE  KUNI-CD-RYAKU           OF  PARM-SUSC0604-ARG2
                 TO  WK-KUNI-CD-RYAKU
             WHEN  CNS-RTN-110
      *----------
               IF  WK-1190-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-RTN-CODE < CNS-4
               THEN
                 MOVE  CNS-4          TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  ワーク業務エラーパッケージを編集
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + 1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J =[" WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD      OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL      OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD       OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票ID
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 帳票任意コード
               MOVE  SPACE
                 TO  WK-GYOMU-REP-ANY-CD    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO    OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID        OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-KUNI-CD-RYAKU
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               STRING  CNS-TRHK-TUKA-CD
                       WK-TRHK-TUKA
                       CNS-KZYN-YMD
                       H-ZANTK-YMD          OF  HST-TBL-SELECT
                       DELIMITED BY SPACE
                       INTO WK-GYOMU-FREE-MSG OF WK-GYOMU-ERR-INFO(WK-J)
               END-STRING
      *----------  後処理業務エラーフラグ
               MOVE  CNS-ON                 TO  FLG-MEISAI-GYOMU-ERR
             WHEN  OTHER
      *----------  進捗管理フラグ
               MOVE  CNS-16               TO  WK-1190-STATUS
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  サブエラーメッセージ出力処理
               PERFORM  SUB-ERR-MSG-RTN
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-054          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD
                 OF  PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
                                          TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE                TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-KUNI-CD-RYAKU=["
      D             WK-KUNI-CD-RYAKU"]"
      D    DISPLAY  CNS-PGM-ID ":***  ＧＸ用通貨コード→国コード変換"
      D             "ルーチン   END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SUSC0604-EXT.
           EXIT.
      ******************************************************************
      *    外部銘柄コード変換ルーチン
      ******************************************************************
       SCZY3002-CHAN-3-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  外部銘柄コード変換ルーチン"
      D             " START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3002-INOUT
                       PARM-RTNPKG
                       WK-RTN-3002-2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-ARGUMENT
             TO  RIYO-CMP-CD            OF  PARM-SCZY3002-ARG1
      *----------  内部銘柄コード
           MOVE  H-MEG-CD               OF  HST-TBL-SELECT
             TO  NAIBU-MEG-CD           OF  PARM-SCZY3002-ARG1
      *---------- 商品分類コード
           MOVE  SPACE
             TO  SYOHIN-BUNRUI-CD       OF  PARM-SCZY3002-ARG1
      *---------- 証券種別コード
           IF  H-DATA-KBN  =  CNS-X-1
           THEN
             MOVE  SPACE
               TO  SEC-SBT-CD           OF  PARM-SCZY3002-ARG1
           ELSE
             MOVE  H-SEC-SBT-CD
               TO  SEC-SBT-CD           OF  PARM-SCZY3002-ARG1
           END-IF
      *---------- 元証券種別コード
           MOVE  SPACE
             TO  MOTO-SEC-SBT-CD        OF  PARM-SCZY3002-ARG1
      *----------  基準日
           MOVE  H-ZANTK-YMD            OF  HST-TBL-SELECT
             TO  KJN-YMD                OF  PARM-SCZY3002-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD=["
      D             RIYO-CMP-CD         OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":NAIBU-MEG-CD=["
      D             NAIBU-MEG-CD        OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SYOHIN-BUNRUI-CD=["
      D             SYOHIN-BUNRUI-CD    OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":テータ区分=["
      D             H-DATA-KBN "]"
      D    DISPLAY  CNS-PGM-ID":SEC-SBT-CD=["
      D             SEC-SBT-CD          OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":MOTO-SEC-SBT-CD=["
      D             MOTO-SEC-SBT-CD     OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":MEG-TUKA-CD=["
      D             MEG-TUKA-CD         OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":CD-REF-KRTU-CD=["
      D             CD-REF-KRTU-CD      OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":KJN-YMD=["
      D             KJN-YMD             OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":GYOMU-TASK-ID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3002 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY3002"             USING  PARM-SCZY3002-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3002 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY3002)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *-----------------------------------------------------------------
           MOVE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             TO  WK-RTN-3002-2
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
      *----------  ワーク実行ステータス
               IF   WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4              TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF   WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD   OF
                                        WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD    OF
                                        WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                                        OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                                        OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID    OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-MEG-CD-AIFA
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               STRING  CNS-YKJ
                       H-ZANTK-YMD      OF  HST-TBL-SELECT
                       CNS-GAIBU-CD
                       GAIBU-MEG-CD     OF  PARM-SCZY3002-ARG2
                       DELIMITED BY SIZE
                       INTO WK-GYOMU-FREE-MSG OF WK-GYOMU-ERR-INFO(WK-J)
               END-STRING
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *----------  異常
             WHEN  CNS-RTN-110
             WHEN  CNS-RTN-002
      *----------  ワーク実行ステータス
               IF   WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4              TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF   WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD   OF
                                        WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD    OF
                                        WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                                        OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                                        OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000090
                 TO  WK-GYOMU-MSG-ID    OF WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  CNS-MEG-CD-AIFA
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG  OF WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
             WHEN  CNS-RTN-800
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               MOVE  WK-TEMP-MSG
                 TO  WK-GYOMU-FREE-MSG
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *----------  上記以外
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部銘柄コード変換ルーチン  エラー"
      *-----------------------------------------------------------------
      *----------  WK-STATUS
               MOVE  CNS-16              TO  WK-STATUS
      *----------  1190実行ステータス
               MOVE  CNS-16              TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  CNS-16              TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               PERFORM  SUB-ERR-MSG-RTN
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID         TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-055        TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-901        TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  RTN-CD             OF  PARM-RTNPKG
                                        (COUNTER OF PARM-RTNPKG)
                                        TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0       TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  SPACE              TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  外部銘柄コード変換ルーチン"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY3002-CHAN-3-EXT.
           EXIT.
      ******************************************************************
      *    約定ファイル05名作成処理
      ******************************************************************
       GET-FILE-5-NAME-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定ファイル05名作成処理  START "
      *-----------------------------------------------------------------
           STRING  CNS-RX-TEXT               DELIMITED BY SPACE
                   WK-RIYO-CMP-CD            DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-SHORI-YMD              DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-KIDOU-ID               DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-GYOMU-TASK-ID          DELIMITED BY SPACE
                   "_05"                     DELIMITED BY SPACE
                                             INTO  WK-FILE-5-NAME
           END-STRING
           STRING  WK-FILE-PASS              DELIMITED BY SPACE
                   "/"                       DELIMITED BY SPACE
                   WK-FILE-5-NAME            DELIMITED BY SPACE
                                             INTO  WK-PSACT-DAT-FILE-5
           END-STRING
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.約定ファイル名=["WK-FILE-5-NAME"]"
      D    DISPLAY  CNS-PGM-ID":約定ファイルパス=["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":パス付けDAT約定ファイル=["
      D             WK-PSACT-DAT-FILE-5"]"
      D    DISPLAY  CNS-PGM-ID": 約定ファイル名作成処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-5-NAME-EXT.
           EXIT.
      ******************************************************************
      *    約定ファイル05オープン
      ******************************************************************
       OPEN-FILE-5-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-5-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY   CNS-PGM-ID":約定ファイル05オープン  START "
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                     TO  FLG-FILE-OPEN-5
           MOVE  WK-PSACT-DAT-FILE-5         TO  OUTFILE-5
           OPEN  OUTPUT OUT-FILE-5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-5=[" WK-FILE-STATUS-5 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-5
             WHEN  CNS-FILE-NORMAL
               MOVE  CNS-ON                  TO  FLG-FILE-OPEN-5
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT約定ファイル05オープン正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT約定ファイル05オープンエラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-056          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-200          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-5)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
             MOVE  SPACE                TO  WK-FREE-MSG
             STRING  "ファイル:["
                     WK-PSACT-DAT-FILE-5
                     "]オープンエラー"
               DELIMITED BY SIZE         INTO  WK-FREE-MSG
             END-STRING
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定ファイル05オープンフラグ=["
      D             FLG-FILE-OPEN-5 "]"
      D    DISPLAY  CNS-PGM-ID":約定ファイル05オープン処理  END "
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-5-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-FILE-5-EXT.
           EXIT.
      ******************************************************************
      *    受渡ファイル06名作成処理
      ******************************************************************
       GET-FILE-6-NAME-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡ファイル06名作成処理  START "
      *-----------------------------------------------------------------
           STRING  CNS-RX-TEXT               DELIMITED BY SPACE
                   WK-RIYO-CMP-CD            DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-SHORI-YMD              DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-KIDOU-ID               DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-GYOMU-TASK-ID          DELIMITED BY SPACE
                   "_06"                     DELIMITED BY SPACE
                                             INTO  WK-FILE-6-NAME
           END-STRING
           STRING  WK-FILE-PASS              DELIMITED BY SPACE
                   "/"                       DELIMITED BY SPACE
                   WK-FILE-6-NAME            DELIMITED BY SPACE
                                             INTO  WK-PSACT-DAT-FILE-6
           END-STRING
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.受渡ファイル名=["WK-FILE-6-NAME"]"
      D    DISPLAY  CNS-PGM-ID":受渡ファイルパス=["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":パス付けDAT受渡ファイル=["
      D             WK-PSACT-DAT-FILE-6"]"
      D    DISPLAY  CNS-PGM-ID": 受渡ファイル名作成処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-6-NAME-EXT.
           EXIT.
      ******************************************************************
      *    受渡ファイル06オープン
      ******************************************************************
       OPEN-FILE-6-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-6-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY   CNS-PGM-ID":受渡ファイル06オープン  START "
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                     TO  FLG-FILE-OPEN-6
           MOVE  WK-PSACT-DAT-FILE-6         TO  OUTFILE-6
           OPEN  OUTPUT OUT-FILE-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-6=[" WK-FILE-STATUS-6 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-6
             WHEN  CNS-FILE-NORMAL
               MOVE  CNS-ON                  TO  FLG-FILE-OPEN-6
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT受渡ファイル06オープン正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT受渡ファイル06オープンエラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-057          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-200          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-6)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
             MOVE  SPACE                TO  WK-FREE-MSG
             STRING  "ファイル:["
                     WK-PSACT-DAT-FILE-6
                     "]オープンエラー"
               DELIMITED BY SIZE         INTO  WK-FREE-MSG
             END-STRING
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡ファイル06オープンフラグ=["
      D             FLG-FILE-OPEN-6 "]"
      D    DISPLAY  CNS-PGM-ID":受渡ファイル06オープン処理  END "
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-6-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-FILE-6-EXT.
           EXIT.
      ******************************************************************
      *    約定ファイル07名作成処理
      ******************************************************************
       GET-FILE-7-NAME-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定ファイル07名作成処理  START "
      *-----------------------------------------------------------------
           STRING  CNS-RX-TEXT               DELIMITED BY SPACE
                   WK-RIYO-CMP-CD            DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-SHORI-YMD              DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-KIDOU-ID               DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-GYOMU-TASK-ID          DELIMITED BY SPACE
                   "_07"                     DELIMITED BY SPACE
                                             INTO  WK-FILE-7-NAME
           END-STRING
           STRING  WK-FILE-PASS              DELIMITED BY SPACE
                   "/"                       DELIMITED BY SPACE
                   WK-FILE-7-NAME            DELIMITED BY SPACE
                                             INTO  WK-PSACT-DAT-FILE-7
           END-STRING
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.約定ファイル名=["WK-FILE-7-NAME"]"
      D    DISPLAY  CNS-PGM-ID":約定ファイルパス=["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":パス付けDAT約定ファイル=["
      D             WK-PSACT-DAT-FILE-7"]"
      D    DISPLAY  CNS-PGM-ID": 約定ファイル名作成処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-7-NAME-EXT.
           EXIT.
      ******************************************************************
      *    約定ファイル07オープン
      ******************************************************************
       OPEN-FILE-7-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-7-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY   CNS-PGM-ID":約定ファイル07オープン  START "
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                     TO  FLG-FILE-OPEN-7
           MOVE  WK-PSACT-DAT-FILE-7         TO  OUTFILE-7
           OPEN  OUTPUT OUT-FILE-7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-7=[" WK-FILE-STATUS-7 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-7
             WHEN  CNS-FILE-NORMAL
               MOVE  CNS-ON                  TO  FLG-FILE-OPEN-7
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT約定ファイル07オープン正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT約定ファイル07オープンエラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-058          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-200          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-7)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
             MOVE  SPACE                TO  WK-FREE-MSG
             STRING  "ファイル:["
                     WK-PSACT-DAT-FILE-7
                     "]オープンエラー"
               DELIMITED BY SIZE         INTO  WK-FREE-MSG
             END-STRING
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":約定ファイル07オープンフラグ=["
      D             FLG-FILE-OPEN-7 "]"
      D    DISPLAY  CNS-PGM-ID":約定ファイル07オープン処理  END "
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-7-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-FILE-7-EXT.
           EXIT.
      ******************************************************************
      *    受渡ファイル08名作成処理
      ******************************************************************
       GET-FILE-8-NAME-RTN    SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡ファイル08名作成処理  START "
      *-----------------------------------------------------------------
           STRING  CNS-RX-TEXT               DELIMITED BY SPACE
                   WK-RIYO-CMP-CD            DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-SHORI-YMD              DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-KIDOU-ID               DELIMITED BY SPACE
                   "_"                       DELIMITED BY SPACE
                   WK-GYOMU-TASK-ID          DELIMITED BY SPACE
                   "_08"                     DELIMITED BY SPACE
                                             INTO  WK-FILE-8-NAME
           END-STRING
           STRING  WK-FILE-PASS              DELIMITED BY SPACE
                   "/"                       DELIMITED BY SPACE
                   WK-FILE-8-NAME            DELIMITED BY SPACE
                                             INTO  WK-PSACT-DAT-FILE-8
           END-STRING
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":W.受渡ファイル名=["WK-FILE-8-NAME"]"
      D    DISPLAY  CNS-PGM-ID":受渡ファイルパス=["WK-FILE-PASS"]"
      D    DISPLAY  CNS-PGM-ID":パス付けDAT受渡ファイル=["
      D             WK-PSACT-DAT-FILE-8"]"
      D    DISPLAY  CNS-PGM-ID": 受渡ファイル名作成処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-8-NAME-EXT.
           EXIT.
      ******************************************************************
      *    受渡ファイル08オープン
      ******************************************************************
       OPEN-FILE-8-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-8-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY   CNS-PGM-ID":受渡ファイル08オープン  START "
      *-----------------------------------------------------------------
           MOVE  CNS-OFF                     TO  FLG-FILE-OPEN-6
           MOVE  WK-PSACT-DAT-FILE-8         TO  OUTFILE-8
           OPEN  OUTPUT OUT-FILE-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FILE-STATUS-8=[" WK-FILE-STATUS-8 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-8
             WHEN  CNS-FILE-NORMAL
               MOVE  CNS-ON                  TO  FLG-FILE-OPEN-8
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT受渡ファイル08オープン正常"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT受渡ファイル08オープンエラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワークリターンコード
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CODE
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-059          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-200          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-8)
               TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0         TO  WK-DETAIL-RTN-CD-FLG
             MOVE  SPACE                TO  WK-FREE-MSG
             STRING  "ファイル:["
                     WK-PSACT-DAT-FILE-8
                     "]オープンエラー"
               DELIMITED BY SIZE         INTO  WK-FREE-MSG
             END-STRING
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":受渡ファイル08オープンフラグ=["
      D             FLG-FILE-OPEN-8 "]"
      D    DISPLAY  CNS-PGM-ID":受渡ファイル08オープン処理  END "
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [OPEN-FILE-8-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       OPEN-FILE-8-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理5
      ******************************************************************
       DATA-WRITE-5-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理5 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC5=["DAT-REC5"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-5=[" WK-FILE-STATUS-5 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-5
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU5=["WK-WRITE-KENSUU5"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU5 = WK-WRITE-KENSUU5 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU5=["WK-WRITE-KENSUU5"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理5正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理5エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-060              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-5)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-5
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理5  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE-5-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理5
      ******************************************************************
       DATA-WRITE5-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H5 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC5=["DAT-REC5"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-5=[" WK-FILE-STATUS-5 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-5
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU5=["WK-WRITE-KENSUU5"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU5 = WK-WRITE-KENSUU5 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU5=["WK-WRITE-KENSUU5"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理5正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理5エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-075              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-5)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-5
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H5  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE5-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理6
      ******************************************************************
       DATA-WRITE-6-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理6 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC6=["DAT-REC6"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-6=[" WK-FILE-STATUS-6 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-6
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU6=["WK-WRITE-KENSUU6"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU6 = WK-WRITE-KENSUU6 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU6=["WK-WRITE-KENSUU6"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理6正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理6エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-061              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-6)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-6
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理6  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE-6-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理6
      ******************************************************************
       DATA-WRITE6-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H6 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC6=["DAT-REC6"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-6=[" WK-FILE-STATUS-6 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-6
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU6=["WK-WRITE-KENSUU6"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU6 = WK-WRITE-KENSUU6 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU6=["WK-WRITE-KENSUU6"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理6正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理6エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-076              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-6)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-6
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H6  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE6-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理7
      ******************************************************************
       DATA-WRITE-7-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理7 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC7=["DAT-REC7"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-7=[" WK-FILE-STATUS-7 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-7
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU7=["WK-WRITE-KENSUU7"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU7 = WK-WRITE-KENSUU7 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU7=["WK-WRITE-KENSUU7"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理7正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理7エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-062              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-7)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-7
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理7  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE-7-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理7
      ******************************************************************
       DATA-WRITE7-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H7 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC7=["DAT-REC7"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-7=[" WK-FILE-STATUS-7 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-7
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU7=["WK-WRITE-KENSUU7"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU7 = WK-WRITE-KENSUU7 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU7=["WK-WRITE-KENSUU7"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理7正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理7エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-077              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-7)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-7
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H7  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE7-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理8
      ******************************************************************
       DATA-WRITE-8-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理8 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC8=["DAT-REC8"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-8=[" WK-FILE-STATUS-8 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-8
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU8=["WK-WRITE-KENSUU8"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU8 = WK-WRITE-KENSUU8 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU8=["WK-WRITE-KENSUU8"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理8正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理8エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
               MOVE  CNS-16                   TO  WK-1190-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-063              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-8)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-8
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理8  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE-8-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理8
      ******************************************************************
       DATA-WRITE8-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H8 START  *****"
      *-----------------------------------------------------------------
           WRITE  DAT-REC8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":DAT-REC8=["DAT-REC8"]"
      D    DISPLAY  CNS-PGM-ID":WK-FILE-STATUS-8=[" WK-FILE-STATUS-8 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-8
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU8=["WK-WRITE-KENSUU8"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-WRITE-KENSUU8 = WK-WRITE-KENSUU8 + 1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-WRITE-KENSUU8=["WK-WRITE-KENSUU8"]"
      D    DISPLAY  CNS-PGM-ID":データ出力処理8正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":データ出力処理8エラー"
      *-----------------------------------------------------------------
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-078              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-220              TO  WK-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-8)
                                              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-8
                       "]書き込むエラー"
                DELIMITED BY SPACE            INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***** データ出力処理H8  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-WRITE8-EXT.
           EXIT.
      ******************************************************************
      *    DATファイル5クローズ処理
      ******************************************************************
       CLOSE-FILE-5-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****DATファイル5クローズ処理  "
      D             "START  *****"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-5
           CLOSE  OUT-FILE-5
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":FILE-STATUS-5=[" WK-FILE-STATUS-5 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-5
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル5クローズ処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル5クローズ処理エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-16                  TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID              TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-064             TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-230             TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-5)
                                             TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0            TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-5
                       "]クローズエラー"
               DELIMITED BY SPACE           INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ファイル5オープンフラグ=["
      D            FLG-FILE-OPEN-5"]"
      D    DISPLAY CNS-PGM-ID":*****DATファイル5クローズ処理 END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-FILE-5-EXT.
           EXIT.
      ******************************************************************
      *    DATファイル6クローズ処理
      ******************************************************************
       CLOSE-FILE-6-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****DATファイル6クローズ処理  "
      D             "START  *****"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-6
           CLOSE  OUT-FILE-6
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":FILE-STATUS-6=[" WK-FILE-STATUS-6 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-6
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル6クローズ処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル6クローズ処理エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-16                  TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID              TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-065             TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-230             TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-6)
                                             TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0            TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-6
                       "]クローズエラー"
               DELIMITED BY SPACE           INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ファイル6オープンフラグ=["
      D            FLG-FILE-OPEN-6"]"
      D    DISPLAY CNS-PGM-ID":*****DATファイル6クローズ処理 END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-FILE-6-EXT.
           EXIT.
      ******************************************************************
      *    DATファイル7クローズ処理
      ******************************************************************
       CLOSE-FILE-7-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****DATファイル7クローズ処理  "
      D             "START  *****"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-7
           CLOSE  OUT-FILE-7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":FILE-STATUS-7=[" WK-FILE-STATUS-7 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-7
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル7クローズ処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル7クローズ処理エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-16                  TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID              TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-066             TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-230             TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-7)
                                             TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0            TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-7
                       "]クローズエラー"
               DELIMITED BY SPACE           INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ファイル7オープンフラグ=["
      D            FLG-FILE-OPEN-7"]"
      D    DISPLAY CNS-PGM-ID":*****DATファイル7クローズ処理 END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-FILE-7-EXT.
           EXIT.
      ******************************************************************
      *    DATファイル8クローズ処理
      ******************************************************************
       CLOSE-FILE-8-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****DATファイル8クローズ処理  "
      D             "START  *****"
      *--------------------<DEBUG>--------------------------------------
           MOVE  CNS-OFF                 TO  FLG-FILE-OPEN-8
           CLOSE  OUT-FILE-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY   CNS-PGM-ID":FILE-STATUS-8=[" WK-FILE-STATUS-8 "]"
      *-----------------------------------------------------------------
           EVALUATE  WK-FILE-STATUS-8
             WHEN  CNS-FILE-NORMAL
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル8クローズ処理正常"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATファイル8クローズ処理エラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-16                  TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID              TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-067             TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-230             TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(WK-FILE-STATUS-8)
                                             TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0            TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               STRING  "ファイル:["
                       WK-PSACT-DAT-FILE-8
                       "]クローズエラー"
               DELIMITED BY SPACE           INTO  WK-FREE-MSG
               END-STRING
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY CNS-PGM-ID":ファイル8オープンフラグ=["
      D            FLG-FILE-OPEN-8"]"
      D    DISPLAY CNS-PGM-ID":*****DATファイル8クローズ処理 END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CLOSE-FILE-8-EXT.
           EXIT.
      ******************************************************************
      *    カーソル（FETCH）
      ******************************************************************
       CR-FETCH-2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2(FETCH)  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  HST-TBL-SELECT-2
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH CR2
             INTO  :HST-TBL-SELECT-2.H-ZANTK-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR2 FETCH)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  進捗管理ＩＮＳＵＰＤルーチン NEW.基準日
               MOVE  CNS-YKJ
                 TO  WK-TEMP-MSG-TEXT
               MOVE  H-ZANTK-YMD              OF  HST-TBL-SELECT-2
                 TO  WK-TEMP-MSG-YKJ
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":= ["WK-TEMP-MSG"]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             WK-GYOMU-TASK-ID       OF  WK-ARGUMENT"]"
      *-----------------------------------------------------------------
               IF  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
                 =  CNS-TASK-T7080US
               THEN
                 PERFORM  SUSC0405-NEW-RTN
               ELSE
                 CONTINUE
               END-IF
               INITIALIZE  WK-SEC-SBT-4156
                           WK-MEG-CD-3002
                           WK-SEC-SBT-3002
                           WK-MEG-CD-3002-3
                           WK-SEC-SBT-3002-3
                           WK-MEG-CD-3004
                           WK-HAKO-CD-4102
                           WK-SEC-SBT-4182-2
                           WK-TRHK-TUKA-4012
                           WK-PRIO-3017
                           WK-TRHK-TUKA-3017
                           WK-CAPITAL-TUKA-3017
                           WK-BIKOU-4116
                           WK-TRHK-TUKA-0604
                           WK-HYK-EX-FLG
                           WK-PRIO-1-FLG
                           WK-KWS-ZYOUHO-FLG
                           WK-BIKOU-FLG
                           WK-KUNI-FLG
      *******         テーマ3422              修正  開始        ********
                           WK-TH-ZYOUHO-FLG
                           WK-PRIO-CP
                           WK-BASE-TUKA-CP
                           WK-MOKU-TUKA-CP
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク取引決済乗除区分フラグ= ["
      D             WK-TH-ZYOUHO-FLG"]"
      D    DISPLAY  CNS-PGM-ID":ーク約定為替換算時採用系列_時価(取引"
      D             "通貨)用= ["WK-PRIO-CP"]"
      D    DISPLAY  CNS-PGM-ID":ワークベース通貨コード_時価(取引通貨)用"
      D             "= ["WK-BASE-TUKA-CP "]"
      D    DISPLAY  CNS-PGM-ID":ワーク目的通貨コード_時価(取引通貨)用"
      D             "= ["WK-MOKU-TUKA-CP"]"
      *-----------------------------------------------------------------
      *******         テーマ3422              修正  終了        ********
      *---------- 運用通貨コード,仕訳基準パタンコードを取得
               IF  WK-STATUS < CNS-16
                 AND  (FLG-UPD NOT = CNS-OFF
                       OR  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
                       NOT=  CNS-TASK-T7080US)
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-ZANTK-YMD:= ["
      D             H-ZANTK-YMD         OF  HST-TBL-SELECT-2"]"
      *-----------------------------------------------------------------
                 PERFORM  SCZY4007-RTN
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-END2 = [" FLG-FETCH-END2 "]"
      D    DISPLAY  CNS-PGM-ID":WK-STATUS = [" WK-STATUS "]"
      *-----------------------------------------------------------------
      *----------  1)外部コード取得処理
               IF  WK-STATUS < CNS-16  AND  FLG-FETCH-END2 = CNS-OFF
                 AND  (FLG-UPD NOT = CNS-OFF
                       OR  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
                       NOT=  CNS-TASK-T7080US)
               THEN
      *------------------ <連結障害841の対応 START>---------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-PTF-CD-DETAIL=["
      D             WK-PTF-CD-DETAIL    OF  WK-PTF-ATT-DATA(WK-IDX-J)"]"
      *-----------------------------------------------------------------
                   IF  WK-PTF-CD-DETAIL  OF  WK-PTF-ATT-DATA(WK-IDX-J)
                                         NOT = SPACE
                   THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-ZANTK-YMD:= ["
      D             H-ZANTK-YMD         OF  HST-TBL-SELECT-2"]"
      *-----------------------------------------------------------------
      *******         テーマ3406     20130117 修正  開始        ********
                       IF  WK-GYOMU-TASK-ID
                                      OF  WK-ARGUMENT
                                      NOT = CNS-SBA-ZANDAKA-SETUZOKU
                       THEN
                           PERFORM  GAIBU-PTF-CD-RTN
                       ELSE
                           CONTINUE
                       END-IF
      *******         テーマ3406     20130117 修正  終了        ********
                   ELSE
                       MOVE  CNS-ON           TO  FLG-STOP-2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-STOP-2   =["FLG-STOP-2"]"
      *-----------------------------------------------------------------
                   END-IF
      *------------------ <連結障害841の対応 END>-----------------------
               ELSE
                   CONTINUE
               END-IF
      *----------  3)GAMMA残高データ出力処理
               IF  WK-STATUS = CNS-0  AND  FLG-FETCH-END2 = CNS-OFF
                 AND  (FLG-UPD NOT = CNS-OFF
                       OR  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
                       NOT=  CNS-TASK-T7080US)
               THEN
                 PERFORM  DATA-OUT-2-RTN
               ELSE
                 CONTINUE
               END-IF
      *----------  初期化
               INITIALIZE  WK-STATUS
                           WK-SELECT-KENSUU
                           FLG-STOP
               IF  FLG-UPD NOT = CNS-OFF
               THEN
      *----------  進捗管理ＩＮＳＵＰＤルーチン OLD.基準日
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             WK-GYOMU-TASK-ID       OF  WK-ARGUMENT"]"
      *-----------------------------------------------------------------
                 IF  WK-GYOMU-TASK-ID       OF  WK-ARGUMENT
                   =  CNS-TASK-T7080US
                 THEN
                   PERFORM  SUSC0405-OLD-RTN
      *----------  ＤＢ コミット処理
                   PERFORM  DB-COMMIT1-RTN
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 進捗管理ＩＮＳＵＰＤ処理なし  ***"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-MEISAI-GYOMU-ERR = ["
      D                         FLG-MEISAI-GYOMU-ERR "]"
      *-----------------------------------------------------------------
      *----------  業務エラー1処理
               IF  FLG-MEISAI-GYOMU-ERR = CNS-ON
               THEN
                 PERFORM  GYOMU-ERR-1-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** 業務エラー1処理しない ****"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON                   TO  FLG-STOP-2
             WHEN  OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16                   TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS                TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID               TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-070              TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900              TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE                  TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1             TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SELECT-FREE-MSG2      TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2(FETCH)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-FETCH-2-EXT.
           EXIT.
      ******************************************************************
      *    データ出力処理
      ******************************************************************
       DATA-OUT-2-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** データ出力処理START ***"
      D    DISPLAY  CNS-PGM-ID":WK-HIT-KENSU=["WK-HIT-KENSU"]"
      *-----------------------------------------------------------------
      *----------  SQL作成(PREPARE)
           PERFORM  CR-PREPARE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
      *----------  カーソル作成(DECLARE，OPEN)
           IF  WK-STATUS < CNS-8
           THEN
             PERFORM  CR-OPEN-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソル作成しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-8
           THEN
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DATA-OUT-2-RTN]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
             PERFORM  UNTIL
               FLG-STOP = CNS-ON  OR  WK-RTN-CODE = CNS-16
      *----------  カーソルFETCH
               PERFORM  CR-FETCH-RTN
      *
               INITIALIZE  HST-TBL-SELECT
                           WK-STATUS
                           WK-J
                           FLG-MEISAI-GYOMU-ERR
                           WK-GYOMU-ERR-INFO
             END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DATA-OUT-2-RTN]"              GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN=["FLG-CR-OPEN"]"
      *-----------------------------------------------------------------
      *----------  カーソルクローズ処理
           IF  FLG-CR-OPEN = CNS-ON
           THEN
             PERFORM  CR-CLOSE-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IDX-J=["WK-IDX-J"]"
      D    DISPLAY  CNS-PGM-ID":*** データ出力処理END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-OUT-2-EXT.
           EXIT.
      ******************************************************************
      *    カーソル(CLOSE)
      ******************************************************************
       CR-CLOSE-3-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2(CLOSE)  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR2 CLOSE)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CR-OPEN2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN2          =["FLG-CR-OPEN2"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-089          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  WK-SELECT-FREE-MSG2  TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル2(CLOSE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-CLOSE-3-EXT.
           EXIT.
      ******************************************************************
      *    カーソル(CLOSE)
      ******************************************************************
       CR-CLOSE-4-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)2  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR CLOSE)2  =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CR-OPEN2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN2          =["FLG-CR-OPEN2"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ワークリターンコード
             MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-090          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  WK-SELECT-FREE-MSG2  TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)2  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-CLOSE-4-EXT.
           EXIT.
      ******************************************************************
      *    GX接続用銘柄コード編集ルーチン
      ******************************************************************
       SCZY3026-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  GX接続用銘柄コード編集"
      D             " START  ***"
      *----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3026-INOUT
                       PARM-RTNPKG
      *----------  銘柄コード
           MOVE  WK-GAIBU-MEG-CD
             TO  MEG-CD                 OF  PARM-SCZY3026-ARG1
      *----------  銘柄通貨
           MOVE  WK-TRHK-TUKA
             TO  MEG-TUKA-CD            OF  PARM-SCZY3026-ARG1
      *---------- 証券種別
           MOVE  WK-SEC-SBT-CD-3
             TO  SEC-SBT-CD             OF  PARM-SCZY3026-ARG1
      *---------- 株式種別
           MOVE  WK-RF-KABU-SBT
             TO  KABU-SBT               OF  PARM-SCZY3026-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コ=["
      D             MEG-CD                 OF  PARM-SCZY3026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄通貨=["
      D             MEG-TUKA-CD            OF  PARM-SCZY3026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別=["
      D             SEC-SBT-CD             OF  PARM-SCZY3026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":株式種別=["
      D             KABU-SBT               OF  PARM-SCZY3026-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3026 START  ***"
      *----------------------------------------------------------------
           CALL  "SCZY3026"             USING  PARM-SCZY3026-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY3026 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY3026)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      *----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  正常
             WHEN  CNS-RTN-000
      *---------- 銘柄コード
               MOVE  MEG-CD        OF  PARM-SCZY3026-ARG2
                 TO  WK-GAIBU-MEG-CD1
             WHEN  CNS-RTN-800
      *----------  ワーク実行ステータス
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4                 TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS           TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *----------  1190実行ステータス
               IF  WK-STATUS > WK-1190-STATUS
               THEN
                 MOVE  WK-STATUS      TO  WK-1190-STATUS
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-J = WK-J + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-J=["WK-J"]"
      *-----------------------------------------------------------------
      *----------  明細業務エラーフラグ
               MOVE  CNS-ON             TO  FLG-MEISAI-GYOMU-ERR
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL   OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD  OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
                  TO  WK-GYOMU-HYK-KRTU-CD
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- メッセージID
               MOVE  CNS-MSG-E000189
                 TO  WK-GYOMU-MSG-ID
                         OF  WK-GYOMU-ERR-INFO(WK-J)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(WK-J,CNS-1)
      *---------- フリーメッセージ
               STRING  CNS-MEG-TEXT     DELIMITED BY SPACE
                       WK-GAIBU-MEG-CD  DELIMITED BY SIZE
                       CNS-TUK-TEXT     DELIMITED BY SPACE
                       WK-TRHK-TUKA     DELIMITED BY SPACE
                       CNS-SEC-TEXT     DELIMITED BY SPACE
                       WK-SEC-SBT-CD-3  DELIMITED BY SPACE
                       CNS-SSE-TEXT     DELIMITED BY SPACE
                       WK-RF-KABU-SBT   DELIMITED BY SPACE
                  INTO   WK-GYOMU-FREE-MSG  OF  WK-GYOMU-ERR-INFO(WK-J)
               END-STRING
      *----------  上記以外
             WHEN  OTHER
               CONTINUE
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-GAIBU-MEG-CD1=["WK-GAIBU-MEG-CD1"]"
      D    DISPLAY  CNS-PGM-ID":***  GX接続用銘柄コード編集"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY3026-EXT.
           EXIT.
      ******************************************************************
      *    3) 締めチェック処理
      ******************************************************************
      *******         テーマ2682     20100404 修正  開始        ********
       SINU-CHECK-RTN         SECTION.
      *******         テーマ2682     20100404 修正  終了        ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  締めチェック処理 START  ***"
      D    DISPLAY  CNS-PGM-ID":I-HYK-KRTU-KBN=[" I-HYK-KRTU-KBN
      D                                 OF  WK-DENBUN-INFO"]"
      *-----------------------------------------------------------------
      *******         テーマ2693     20100404 修正  開始        ********
           IF  I-HYK-KRTU-KBN           OF  WK-DENBUN-INFO = CNS-X-2
           THEN
             PERFORM  SELECT-KAKUTE-RTN
           ELSE
      *******         テーマ2693     20100404 修正  終了        ********
      *----------  進捗管理テーブル基準日取得2
             PERFORM  SELECT-KIJUN-2-RTN
      *******         テーマ2693     20100404 修正  開始        ********
           END-IF
      *******         テーマ2693     20100404 修正  終了        ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  締めチェック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SINU-CHECK-EXT.
           EXIT.
      *******         テーマ2693     20100404 修正  開始        ********
      ******************************************************************
      *    デフォルト評価系列で締めチェック処理
      ******************************************************************
       SELECT-KAKUTE-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D        ":***  締めチェック処理（デフォルト評価系列） START  ***"
      *-----------------------------------------------------------------
      *----------  デフォルト評価系列で締めチェック処理カーソルPREPARE
           PERFORM  CR-PREPARE-3-RTN
      *----------  デフォルト評価系列で締めチェック処理カーソルOPEN
           PERFORM  CR-OPEN-3-RTN
      *----------  デフォルト評価系列で締めチェック処理カーソルETCH
           PERFORM  CR-FETCH-3-RTN
      *----------  カーソルクローズ処理
           IF  FLG-CR-OPEN3 = CNS-ON
           THEN
             PERFORM  CR-CLOSE-5-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** カーソルクローズ処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D        ":***  締めチェック処理（デフォルト評価系列） END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-KAKUTE-EXT.
           EXIT.
      *******         テーマ2693     20100404 修正  終了        ********
      ******************************************************************
      *    進捗管理テーブル基準日取得処理2
      ******************************************************************
      *******         テーマ2682     20100404 修正  開始        ********
       SELECT-KIJUN-2-RTN     SECTION.
      *******         テーマ2682     20100404 修正  終了        ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理テーブル基準日取得処理2"
      D             " START  ***"
      *-----------------------------------------------------------------
      *----------  SEL-KJN-2-SQL作成(PREPARE)
           PERFORM  SEL-KJN-2-PRE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
      *----------  SEL-KJN-2-SQL作成(EXECUTE)
           IF  WK-STATUS < CNS-16
           THEN
             PERFORM  SEL-KJN-2-EXE-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** SEL-KJN-2(EXECUTE)処理しない ****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-STATUS=["WK-STATUS"]"
      *-----------------------------------------------------------------
           IF  WK-STATUS < CNS-16
           THEN
      *----------  日付の判断処理
             PERFORM  DATE-CHECK-RTN
           ELSE
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":日付の判断処理しない"
      *-----------------------------------------------------------------
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  進捗管理テーブル基準日取得処理2"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-KIJUN-2-EXT.
           EXIT.
      ******************************************************************
      *    SEL-KJN-2-SQL作成(PREPARE)
      ******************************************************************
      *******         テーマ2682     20100404 修正  開始        ********
       SEL-KJN-2-PRE-RTN      SECTION.
      *******         テーマ2682     20100404 修正  終了        ********
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SEL-KJN-2-SQL作成(PREPARE)START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT-S-TKDYAA40
                       HST-TBL-TKDYAA40-SELECT
                       HST-SEL-TKDYAA40-WHERE
                       WK-SEL-TKDYAA40-FREE-MSG
      *----------  テーブルTKDYAA40
           MOVE  WK-TBL-TKDYAA40
             TO  SQL-TBL-TKDYAA40       OF  SQL-SELECT-TKDYAA40
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  HST-SEL-TKDYAA40-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD-DETAIL      OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-FUND-CD              OF  HST-SEL-TKDYAA40-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD-DETAIL       OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-PTF-CD               OF  HST-SEL-TKDYAA40-WHERE
      *----------  評価系列コード
           MOVE  WK-DEFAUL-THYK-CD      OF  WK-FUND-PTF-DETAIL(WK-IDX-J)
             TO  H-HYK-KRTU-CD          OF  HST-SEL-TKDYAA40-WHERE
      *----------  進捗タスクID←GX残高データ接続
           MOVE  CNS-ST01100
             TO  H-SHINTK-TASK-ID       OF  HST-SEL-TKDYAA40-WHERE
      *----------  進捗ステータス←"確定済"
           MOVE  CNS-SHINTK-STS-000
             TO  H-SHINTK-STS           OF  HST-SEL-TKDYAA40-WHERE
           MOVE  SQL-SELECT-TKDYAA40    TO  SQLSTMT-S-TKDYAA40
           STRING SQLSTMT-S-TKDYAA40(1:FUNCTION
                                        LENGTH(SQL-SELECT-TKDYAA40))
                "[:V1="
                 H-KJN-YMD              OF  HST-TBL-TKDYAA40-SELECT
                "][:V2="
                 H-RIYO-CMP-CD          OF  HST-SEL-TKDYAA40-WHERE
                "][:V3="
                 H-FUND-CD              OF  HST-SEL-TKDYAA40-WHERE
                "][:V4="
                 H-PTF-CD               OF  HST-SEL-TKDYAA40-WHERE
                "][:V5="
                 H-HYK-KRTU-CD          OF  HST-SEL-TKDYAA40-WHERE
                "][:V6="
                 H-SHINTK-TASK-ID       OF  HST-SEL-TKDYAA40-WHERE
                "][:V7="
                 H-SHINTK-STS           OF  HST-SEL-TKDYAA40-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-SEL-TKDYAA40-FREE-MSG
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT-S-TKDYAA40 =["
      D             SQLSTMT-S-TKDYAA40"]"
      D    DISPLAY  CNS-PGM-ID":WK-SEL-TKDYAA40-FREE-MSG =["
      D             WK-SEL-TKDYAA40-FREE-MSG"]"
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  TKDYAA40  FROM  :SQLSTMT-S-TKDYAA40
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN   OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-091          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SEL-TKDYAA40-FREE-MSG
                                          TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SEL-KJN-2-SQL作成(PREPARE) END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SEL-KJN-2-PRE-EXT.
           EXIT.
      ******************************************************************
      *    SEL-KJN-2-SQL作成(EXECUTE)
      ******************************************************************
      *******         テーマ2682     20100404 修正  開始        ********
       SEL-KJN-2-EXE-RTN      SECTION.
      *******         テーマ2682     20100404 修正  終了        ********
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SEL-KJN-2-SQL作成(EXECUTE)START ***"
      *-----------------------------------------------------------------
           EXEC SQL EXECUTE TKDYAA40
                 USING :HST-TBL-TKDYAA40-SELECT.H-KJN-YMD,
                       :HST-SEL-TKDYAA40-WHERE.H-RIYO-CMP-CD,
                       :HST-SEL-TKDYAA40-WHERE.H-FUND-CD,
                       :HST-SEL-TKDYAA40-WHERE.H-PTF-CD,
                       :HST-SEL-TKDYAA40-WHERE.H-HYK-KRTU-CD,
                       :HST-SEL-TKDYAA40-WHERE.H-SHINTK-TASK-ID,
                       :HST-SEL-TKDYAA40-WHERE.H-SHINTK-STS
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(EXECUTE)= [" SQLCODE "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD OF  HST-TBL-TKDYAA40-SELECT=["
      D             H-KJN-YMD             OF  HST-TBL-TKDYAA40-SELECT"]"
      *-----------------------------------------------------------------
               MOVE  H-KJN-YMD OF HST-TBL-TKDYAA40-SELECT
                 TO  WK-END-YMD-KJN-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-END-YMD-KJN-9=["WK-END-YMD-KJN-9"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  ワーク実行ステータス
               MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
               MOVE  WK-STATUS            TO  WK-RTN-CODE
      *--------  ワークエラーパッケージを編集
               INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
               MOVE  CNS-POS-092          TO  WK-ERR-POS
      *----------  リターンコード
               MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
               MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
               MOVE  WK-SEL-TKDYAA40-FREE-MSG
                                          TO  WK-FREE-MSG
      *----------  エラー情報追加処理
               PERFORM  ERR-INFO-ADD-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  SEL-KJN-2-SQL作成(EXECUTE) END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SEL-KJN-2-EXE-EXT.
           EXIT.
      ******************************************************************
      *    日付の判断処理
      ******************************************************************
      *******         テーマ2682     20100404 修正  開始        ********
       DATE-CHECK-RTN         SECTION.
      *******         テーマ2682     20100404 修正  終了        ********
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  日付の判断処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークGAMMA残高確定日= ["
      D             WK-END-YMD-KJN-9 "]"
      D    DISPLAY  CNS-PGM-ID":PTF期間FROM= [" WK-KZYN-YMD-FROM
      D                       OF  WK-PTF-ATT-DATA(WK-IDX-J) "]"
      D    DISPLAY  CNS-PGM-ID":PTF期間TO  = [" WK-KZYN-YMD-TO
      D                       OF  WK-PTF-ATT-DATA(WK-IDX-J) "]"
      *-----------------------------------------------------------------
           IF  WK-KIKAN-FR-9 = WK-KIKAN-TO-9 THEN
             IF  WK-KIKAN-FR-9 = WK-END-YMD-KJN-9  THEN
      *----------  次のto年月日へ進む
               MOVE  CNS-ON             TO  FLG-NEXT-MEISAI
      *----------  ワーク実行ステータス
      *------------------ <残タスク157の対応 START>---------------------
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *------------------ <残タスク157の対応 END>-----------------------
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL    OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD    OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-E000355
                 TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  WK-GYOMU-FREE-MSG    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *----------  業務エラー1処理
               PERFORM  GYOMU-ERR-1-RTN
             ELSE
               CONTINUE
             END-IF
           ELSE
      *----------  テーマ2693対応START
             IF  WK-KZYN-YMD-FROM         OF  WK-PTF-ATT-DATA(WK-IDX-J)
               <= WK-END-YMD-KJN-9
             AND  WK-END-YMD-KJN-9
               <= WK-KZYN-YMD-TO          OF  WK-PTF-ATT-DATA(WK-IDX-J)
      *----------  テーマ2693対応END
             THEN
      *----------  次のto年月日へ進む
               MOVE  CNS-ON             TO  FLG-NEXT-MEISAI
      *----------  ワーク実行ステータス
      *------------------ <残タスク157の対応 START>---------------------
               IF  WK-STATUS < CNS-4
               THEN
                 MOVE  CNS-4            TO  WK-STATUS
               ELSE
                 CONTINUE
               END-IF
      *------------------ <残タスク157の対応 END>-----------------------
      *----------  ワークリターンコード
               IF  WK-STATUS > WK-RTN-CODE
               THEN
                 MOVE  WK-STATUS        TO  WK-RTN-CODE
               ELSE
                 CONTINUE
               END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CODE=["WK-RTN-CODE"]"
      *-----------------------------------------------------------------
      *----------  ワーク業務エラーパッケージを編集
               INITIALIZE  WK-GYOMU-ERR-INFO
      *----------  基準日実行ステータス
      *---------- ファンドコード
               MOVE  WK-FUND-CD-DETAIL    OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-FUND-CD     OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- ポートフォリオコード
               MOVE  WK-PTF-CD-DETAIL     OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-PTF-CD      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 評価系列コード
               MOVE  WK-DEFAUL-THYK-CD    OF  WK-PTF-ATT-DATA(WK-IDX-J)
                 TO  WK-GYOMU-HYK-KRTU-CD  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日From
               MOVE  WK-KIKAN-FR
                 TO  WK-GYOMU-KJN-YMD-FROM  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 基準日To
               MOVE  WK-KIKAN-TO
                 TO  WK-GYOMU-KJN-YMD-TO  OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- メッセージID
               MOVE  CNS-MSG-E000355
                 TO  WK-GYOMU-MSG-ID      OF  WK-GYOMU-ERR-INFO(CNS-1)
      *---------- 置換文字
               MOVE  SPACE
                 TO  WK-GYOMU-TK-MOJI(CNS-1,CNS-1)
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  WK-GYOMU-FREE-MSG    OF  WK-GYOMU-ERR-INFO(CNS-1)
      *----------  業務エラー1処理
               PERFORM  GYOMU-ERR-1-RTN
             ELSE
               CONTINUE
             END-IF
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  日付の判断処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATE-CHECK-EXT.
           EXIT.
      *******         テーマ2693     20100404 修正  開始        ********
      ******************************************************************
      *    カーソル(CLOSE)
      ******************************************************************
       CR-CLOSE-5-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル3(CLOSE)  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR3 CLOSE)  =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CR-OPEN3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN3          =["FLG-CR-OPEN3"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ワーク実行ステータス
             MOVE  CNS-16               TO  WK-STATUS
      *----------  ワークリターンコード
             MOVE  WK-STATUS            TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-082          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  WK-SELECT-FREE-MSG3  TO  WK-FREE-MSG
      *----------  エラー情報追加処理
             PERFORM  ERR-INFO-ADD-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル3(CLOSE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-CLOSE-5-EXT.
           EXIT.
      ******************************************************************
      *    カーソル(CLOSE)
      ******************************************************************
       CR-CLOSE-6-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)3  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE CR3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR CLOSE)3  =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-CR-OPEN3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-CR-OPEN3         =["FLG-CR-OPEN3"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ワークリターンコード
             MOVE  CNS-16               TO  WK-RTN-CODE
      *----------  ワークエラーパッケージを編集
             INITIALIZE  WK-SYS-ERR-INFO
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID           TO  WK-ERR-PGM-ID
      *----------  ポジション
             MOVE  CNS-POS-083          TO  WK-ERR-POS
      *----------  リターンコード
             MOVE  CNS-RTN-900          TO  WK-RTN-CD
      *----------  詳細リターンコード
             MOVE  SQLCODE              TO  WK-DETAIL-RTN-CD
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1         TO  WK-DETAIL-RTN-CD-FLG
      *---------- フリーメッセージ
             MOVE  WK-SELECT-FREE-MSG3  TO  WK-FREE-MSG
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル(CLOSE)3  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CR-CLOSE-6-EXT.
           EXIT.
      *******         テーマ2693     20100404 修正  終了        ********
