      ******************************************************************
      *$Header: $
      ******************************************************************
      *
      *     システムＩＤ   : TSTAR
      *     システム名称   : 次期TSTARシステム
      *     プログラムＩＤ : SCZY1210
      *     プログラム名称 : 進捗管理ＩＮＳＵＰＤルーチン(残高向け)
      *     処理概要       : 1.先頭セッションの場合（ポートフォリオ・
      *                        基準年月日/基準年月単位の処理開始時）
      *                        ポートフォリオの並行稼動チェックを行なう
      *                        並行稼動禁止で続行できない場合、実行状況
      *                        管理明細の明細単位実行ステータスを更新す
      *                        る、BTの場合、エラーメッセージも出力する
      *                        進捗の確定チェックを行う
      *                        確定済で続行できない場合、実行状況管理
      *                        明細の明細単位実行ステータスを更新する、
      *                        BTの場合、エラーメッセージも出力する
      *                        ポートフォリオ状態、進捗管理、進捗管理
      *                        (年月単位)のステータス更新を行なう
      *                        進捗管理対象外の業務タスクでも日付単位の
      *                        並行稼動チェックを行う、並行稼動チェック
      *                        で続行できる場合、ポートフォリオ状態を
      *                        更新する
      *                      2.最終セッションの場合（ポートフォリオ・
      *                        基準年月日/基準年月単位の処理終了時、BTの
      *                        場合のみ）
      *                        ポートフォリオ状態ステータスの更新を行う
      *                        進捗管理の終了ステータスを更新する、進捗
      *                        管理(年月単位)のステータスを更新する
      *                        進捗管理対象外の業務タスクで日付単位の並
      *                        行稼動チェックのときはポートフォリオ状態
      *                        のみ更新する
      *                      3.再処理要の更新
      *                        基準年月日/基準年月以降の過去データ再処理
      *                        の更新を行なう
      *                        時価再処理、通常再処理及び過去データ
      *                        再処理の更新を行なう
      *     参照ＤＢ       : 実行状況管理明細(TKDYAA35)
      *                      進捗管理(TKDYAA40)
      *                      ポートフォリオ状態(TKDYAA41)
      *                      進捗タスクマスタ(TKDYAA42)
      *                      システム処理所属進捗タスク(TKDYAA43)
      *                      進捗管理相関関係マスタ(TKDYAA44)
      *                      ユーザー会社属性 (TOC0SE16)
      *                      業務タスクマスタ (TOC0DA21)
      *                      アップロードマスタ (TOC0DA23)
      *                      実行順序制御マスタ (TKDYAA20)
      *     引数           : IN  ARG1
      *                    : IN  ARG2
      *                    : OUT ARG3
      *                    : OUT ARG4
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20090204   新規  SCS        蒋  磊  新規作成
      *     20091015   変更  SCS        周  軼  GIPS対応
      *     20100615   変更  SCS        呉聞傑  テーマ2821対応
      *     20120924   変更  SCS        黄丹丹  テーマ3434対応
      *     20130221   変更  SCS        黄丹丹  テーマ3495対応
      ******************************************************************
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SCZY1210.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  09-02-04.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       SPECIAL-NAMES.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id: $".
      ******************************************************************
      *                   コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SCZY1210".
      *----------  正常リターンコード
         05  CNS-RET-NORMAL        PIC  X(03)  VALUE  "000".
      *----------  パラメータエラー
         05  CNS-RET-PARM          PIC  X(03)  VALUE  "800".
      *----------  システムエラー（Oracle）
         05  CNS-RET-ORACLE        PIC  X(03)  VALUE  "900".
      *----------  システムエラー（Oracle以外）
         05  CNS-RET-ORCIGAI       PIC  X(03)  VALUE  "901".
      *----------  該当データなし
         05  CNS-RET-NODATA        PIC  X(03)  VALUE  "110".
      *----------  基準日
         05  CNS-KJN-YMD           PIC  X(08)  VALUE  "基準日：".
      *----------  一意制約
         05  CNS-RET-CD-ITI-SEYAKU PIC  X(03)  VALUE  "300".
      *----------  SQLCODE=0（正常）
         05  CNS-SQL-NORMAL        PIC  S9(04)  COMP-3 VALUE +0000.
      *----------  SQLCODE=1403（データなし）
         05  CNS-SQL-NODATA        PIC  S9(04)  COMP-3 VALUE +1403.
         05  CNS-NOWAIT            PIC  S9(04)  COMP-3 VALUE -0054.
         05  CNS-N-1               PIC  9(01)  VALUE  1.
      ******************************************************************
      *                      ワーク  エリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-TABLEID-1          PIC  X(13).
         05  WK-TABLEID-2          PIC  X(13).
         05  WK-TABLEID-3          PIC  X(13).
         05  WK-TABLEID-4          PIC  X(13).
         05  WK-TABLEID-5          PIC  X(13).
         05  WK-TABLEID-6          PIC  X(13).
         05  WK-TABLEID-7          PIC  X(13).
         05  WK-TABLEID-8          PIC  X(13).
         05  WK-TABLEID-9          PIC  X(13).
         05  WK-TABLEID-10         PIC  X(13).
         05  WK-TABLEID-11         PIC  X(13).
         05  WK-TABLEID-12         PIC  X(13).
      *----- ワークSQLポインター
         05  WK-SQL-POINTER        PIC  9(09)  COMP.
      *----- ワーク起動ユーザーID
         05  WK-KIDOU-SID-31       PIC  X(20).
      *----- ワーク業務タスクID
         05  WK-GYOMU-TASK-ID-31   PIC  X(07).
      *----- ワークPARM-SCZY1210-ARG2
         05  WK-PARM-SCZY1210-ARG2.
      *----- ワーク利用会社コード
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  WK-RIYO-CMP-CD-1    PIC  X(04).
      *----- ワーク処理実行日
           10  WK-SYORI-YMD        PIC  9(08).
      *----- ワーク起動ID
           10  WK-KIDOU-ID         PIC  X(04).
      *----- ワーク業務タスクID
           10  WK-GYOMU-TASK-ID    PIC  X(07).
           10  WK-GYOMU-TASK-ID-1  PIC  X(07).
      *----- ワーク基準年月日/基準年月
           10  WK-KJN-YMD          PIC  9(08).
           10  WK-KJN-YMD-1        PIC  9(08).
      *----- ワーク最終処理基準日
           10  WK-SS-SYORI-YMD     PIC  9(08).
      *----- ワーク再処理基準日FROM
           10  WK-REDO-KJN-YMD-FROM
                                   PIC  9(08).
      *----- ワークベビー未処理フラグ
           10  WK-BABY-MISYORI-FLG PIC  X(01).
      *----- ワークファンドコード
           10  WK-FUND-CD          PIC  X(12).
           10  WK-FUND-CD-1        PIC  X(12).
      *----- ワークポートフォリオコード
           10  WK-PTF-CD           PIC  X(04).
           10  WK-PTF-CD-1         PIC  X(04).
      *----- ワーク評価系列コード
           10  WK-HYK-KRTU-CD      PIC  X(04).
           10  WK-HYK-KRTU-CD-1    PIC  X(04).
      *----- ワーク帳票ID
           10  WK-REP-ID           PIC  X(08).
      *----- ワーク帳票任意コード
           10  WK-REP-ANY-CD       PIC  X(50).
      *----- ワーク基準日FROM
           10  WK-KJN-YMD-FROM     PIC  9(08).
      *----- ワーク実行ステータス
           10  WK-JIKOU-STS        PIC  X(03).
      *----- ワークポートフォリオ状態データ有無区分
         05  WK-PTF-JYOTAI-FLG     PIC  X(01).
      *----- ワーク進捗管理データ有無区分
         05  WK-SHINTK-KANRI-FLG   PIC  X(01).
      *----- ワーク進捗タスクID
         05  WK-SHINTK-TASK-ID     PIC  X(07).
         05  WK-SHINTK-TASK-ID-1   PIC  X(07).
      *----- ワーク基準日FROM
         05  WK-KJN-YMD-FROM-1     PIC  9(08).
      *----- ワーク基準日TO
         05  WK-KJN-YMD-TO-1       PIC  9(08).
      *----- ワークポートフォリオ状態ステータス
         05  WK-PTF-JYOTAI-STS     PIC  X(01).
      *----- ワーク進捗ステータス
         05  WK-SHINTK-STS         PIC  X(03).
         05  WK-OLD-SHINTK-STS     PIC  X(03).
      *----- ワーク過去データ再処理区分
         05  WK-PAST-REDO-KBN      PIC  X(01).
      *----- 進捗タスク識別区分
         05  WK-SHINTK-TASK-KBN    PIC  X(01).
      *-----  ワーク確定範囲区分
         05  WK-KAKUTEI-KBN        PIC  X(01).
      *----- 進捗管理(年月単位)に対象レコード件数
         05  WK-KENSU-COUNT        PIC  9(08).
         05  WK-HEIKO-CHK-KBN      PIC  X(01).
         05  WK-CMP-SHINTK-UPD-MODE-KBN
                                   PIC  X(01).
         05  WK-SHINTK-UPD-MODE-KBN     PIC  X(01).
      *----- ワークカーソルオープンフラグ
         05  WK-CUR01-OPEN-FLG     PIC  X(01).
         05  WK-CUR02-OPEN-FLG     PIC  X(01).
         05  WK-CUR03-OPEN-FLG     PIC  X(01).
         05  WK-CUR06-OPEN-FLG     PIC  X(01).
         05  WK-CUR10-OPEN-FLG     PIC  X(01).
         05  WK-CUR12-OPEN-FLG     PIC  X(01).
         05  WK-CUR9-OPEN-FLG      PIC  X(01).
         05  WK-CUR101-OPEN-FLG    PIC  X(01).
         05  WK-CUR11-OPEN-FLG     PIC  X(01).
         05  WK-FETCH06-END-FLG    PIC  X(01).
      *----------  フリーメッセージ
         05  WK-ERR-SQLSTMT1       PIC  X(1500).
         05  WK-ERR-SQLSTMT2       PIC  X(1500).
         05  WK-ERR-SQLSTMT3       PIC  X(1500).
         05  WK-ERR-SQLSTMT4       PIC  X(1500).
         05  WK-ERR-SQLSTMT5       PIC  X(1500).
         05  WK-ERR-SQLSTMT6       PIC  X(1500).
         05  WK-ERR-SQLSTMT7       PIC  X(1500).
         05  WK-ERR-SQLSTMT9       PIC  X(1500).
         05  WK-ERR-SQLSTMT10      PIC  X(1500).
         05  WK-ERR-SQLSTMT11      PIC  X(600).
         05  WK-ERR-SQLSTMT12      PIC  X(1500).
         05  WK-ERR-SQLSTMT01      PIC  X(1500).
         05  WK-ERR-SQLSTMT02      PIC  X(1500).
         05  WK-ERR-SQLSTMT03      PIC  X(1500).
         05  WK-ERR-SQLSTMT06      PIC  X(1500).
         05  WK-ERR-SQLSTMT191     PIC  X(1500).
         05  WK-ERR-SQLSTMT192     PIC  X(1500).
         05  WK-KIDOU-ID-1         PIC  X(04).
      *----------  ワークチェック区分
         05  WK-CHECK-KBN          PIC  X(01).
         05  WK-PTF-COUNT          PIC  9(08).
         05  WK-KENSU-1            PIC  9(08).
         05  WK-KENSU-3            PIC  9(08).
         05  WK-KJN-YMD-99         PIC  9(08).
         05  WK-KJN-YMD-X
             REDEFINES  WK-KJN-YMD-99
                                   PIC  X(08).
         05  WK-KJN-YM             PIC  9(06).
         05  WK-FLG                PIC  X(01).
         05  WK-KJN-YMD-TO         PIC  X(08).
         05  WK-KJN-YMD-TO-9
             REDEFINES  WK-KJN-YMD-TO
                                   PIC  9(08).
         05  WK-KJN-YM-00          PIC  9(08).
         05  WK-KJN-YM-00-X
             REDEFINES  WK-KJN-YM-00
                                   PIC  X(08).
         05  WK-KJN-YM-99          PIC  9(08).
         05  WK-KJN-YM-99-X
             REDEFINES  WK-KJN-YM-99
                                   PIC  X(08).
      *---------  ワーク並行稼動チェック要否区分
         05  WK-HEIKO-KBN          PIC  X(01).
      *---------  ワーク過去データ再処理要否区分
         05  WK-PAST-DATA-REDO-KBN PIC  X(01).
         05  WK-OLD-KIDOU-ID       PIC  X(04).
         05  WK-OLD-JIKOU-START-TIME
                                   PIC  X(14).
         05  WK-SS-JIKOU-START-TIME     PIC  X(14).
         05  WK-SAISR-SHINTK-TASK-ID
                                   PIC  X(07).
      *---------  ワーク件数
         05  WK-COUNT              PIC  9(02).
         05  WK-IDX1               PIC  9(02).
      *---------  ワーク進捗管理情報
         05  WK-KENSU-GRP.
           10  WK-KJN-TASK         OCCURS  21.
      *----------  ワーク基準年月日/基準年月FROM
             15  WK-KJN-FROM       PIC  9(08).
      *----------  ワーク基準年月日/基準年月TO
             15  WK-KJN-TO         PIC  9(08).
      *----------  ワーク進捗タスクID
             15  WK-TASK-ID        PIC  X(07).
         05  WK-CR6-OPEN-FLG       PIC  X(01).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1160 テーブルID取得ルーチンコピー句
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
       01  PARM-SCZY1160-RTNPKG.
         05  PARM-SCZY1160-ARG3.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *----------  SCZY1170 リターンパッケージ取得ルーチン
       01  PARM-SCZY1170-INOUT.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
      *---------- 「TIDYAA40_INS」DBアクセスルーチン
       01  PARM-TIDYAA40-INOUT.
         05  PARM-TIDYAA40-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-TIDYAA40-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
           COPY  "TKDYAA40.cpy".
       01  PARM-TIDYAA40-RTNPKG.
         05  PARM-TIDYAA40-ARG3.
      *----------  RTNパッケージ
           10  RTN-PACKAGE.
           COPY  "CZRTNPACKAGE.cpy".
      *---------- 「TIDYAA41_INS」DBアクセスルーチン
       01  PARM-TIDYAA41-INOUT.
         05  PARM-TIDYAA41-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
         05  PARM-TIDYAA41-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
           COPY  "TKDYAA41.cpy".
       01  PARM-TIDYAA41-RTNPKG.
         05  PARM-TIDYAA41-ARG3.
      *----------  RTNパッケージ
           10  RTN-PACKAGE.
           COPY  "CZRTNPACKAGE.cpy".
      *---------- 「TSDYAA31_SEL」DBアクセスルーチン
       01  PARM-TSDYAA31-INOUT.
         05  PARM-TSDYAA31-ARG1.
      *----------  利用会社コード
           10  RIYO-CMP-CD         PIC  X(04).
      *----------  入力データ
           10  SEL-IN-DATA.
      *----------  利用会社コード
             15  RIYO-CMP-CD-I     PIC  X(04).
      *----------  処理実行日
             15  SYORI-YMD-I       PIC  9(08).
      *----------  起動ID
             15  KIDOU-ID-I        PIC  X(04).
      *----------  更新日時
             15  UPD-DATE-I        PIC  X(14).
      *----------  ロック区分
             15  LOCK-KBN-I        PIC  X(01).
         05  PARM-TSDYAA31-ARG2.
      *----------  DBレイアウトコピー句
           10  TBL-LAYOUT.
           COPY  "TKDYAA31.cpy".
       01  PARM-TSDYAA31-RTNPKG.
         05  PARM-TSDYAA31-ARG3.
      *----------  RTNパッケージ
           10  RTN-PACKAGE.
           COPY  "CZRTNPACKAGE.cpy".
       01  PARM-SCZY7080-INOUT.
           COPY  "SCZY7080.cpy".
       01  PARM-SCZY7080-RTNPKG.
         05  PARM-SCZY7080-ARG3.
           10  RTN-PACKAGE.
           COPY  "CZRTNPACKAGE.cpy".
       01  PARM-SCZY1200-INOUT.
           COPY  "SCZY1200.cpy".
       01  PARM-SCZY1200-RTNPKG.
         05  PARM-SCZY1200-ARG2.
           10  RTN-PACKAGE.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                ＳＱＬ通信領域
      ******************************************************************
           EXEC  SQL  INCLUDE  SQLCA  END-EXEC.
           EXEC  SQL  BEGIN    DECLARE  SECTION  END-EXEC.
      *----------  動的SQL文をいれるバッファ
       01  DYNAMIC-SQL-LANGUAGE.
         05  SQLSTMT1              PIC  X(1000) VARYING.
         05  SQLSTMT2              PIC  X(1000) VARYING.
         05  SQLSTMT3              PIC  X(1000) VARYING.
         05  SQLSTMT4              PIC  X(1000) VARYING.
         05  SQLSTMT5              PIC  X(1000) VARYING.
         05  SQLSTMT6              PIC  X(1000) VARYING.
         05  SQLSTMT7              PIC  X(1000) VARYING.
         05  SQLSTMT9              PIC  X(1000) VARYING.
         05  SQLSTMT10             PIC  X(1000) VARYING.
         05  SQLSTMT11             PIC  X(500)  VARYING.
         05  SQLSTMT12             PIC  X(1000) VARYING.
         05  SQLSTMT01             PIC  X(1000) VARYING.
         05  SQLSTMT02             PIC  X(1000) VARYING.
         05  SQLSTMT03             PIC  X(1000) VARYING.
         05  SQLSTMT05             PIC  X(1000) VARYING.
         05  SQLSTMT06             PIC  X(1000) VARYING.
         05  SQLSTMT191            PIC  X(1000) VARYING.
         05  SQLSTMT192            PIC  X(1000) VARYING.
         05  H-PTF-COUNT           PIC  9(08).
         05  H-KENSU-1             PIC  9(08).
         05  H-KENSU-3             PIC  9(08).
         05  H-GYOMU-TASK          PIC  X(07).
         05  H-HEIKO-CHK-KBN       PIC  X(01).
         05  H-SHINTK-TASK-KBN     PIC  X(01).
         05  H-PAST-REDO-KBN       PIC  X(01).
         05  H-KAKUTEI-KBN         PIC  X(01).
         05  H-SHINTK-TASK-ID      PIC  X(07).
         05  H-SHINTK-TASK-ID-1    PIC  X(07).
         05  H-KJN-YMD             PIC  9(06).
         05  H-SHINTK-STS          PIC  X(03).
         05  H-OLD-SHINTK-STS      PIC  X(03).
         05  H-JIKA-SAISR-KBN      PIC  X(01).
         05  H-KENSU-COUNT         PIC  9(08).
         05  H-CMP-SHINTK-UPD-MODE-KBN
                                   PIC  X(01).
         05  H-SHINTK-UPD-MODE-KBN PIC  X(01).
         05  H-OLD-KIDOU-ID        PIC  X(04).
         05  H-OLD-JIKOU-START-TIME
                                   PIC  X(14).
         05  H-KIDOU-ID            PIC  X(04).
         05  H-SS-JIKOU-START-TIME PIC  X(14).
         05  H-RIYO-CMP-CD         PIC  X(04).
         05  H-SYORI-YMD           PIC  9(08).
         05  H-PTF-JYOTAI-STS      PIC  X(01).
         05  H-WHERE-6.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-6     PIC  X(04).
      *----------  処理実行日
           10  H-SYORI-YMD-6       PIC  9(08).
      *----------  起動ID
           10  H-KIDOU-ID-6        PIC  X(04).
      *----------  実行ステータス
         05  H-JIKOU-STS           PIC  X(03).
      *----------  一時停止区分
         05  H-ITIJI-TEISHI-KBN    PIC  X(01).
           EXEC  SQL  END      DECLARE  SECTION  END-EXEC.
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SCZY1210-INOUT.
      *----------  進捗管理ＩＮＳＵＰＤルーチン
           COPY "SCZY1210.cpy".
       01  PARM-SCZY1210-RTNPKG.
      *----------  RTNパッケージ
         05  PARM-SCZY1210-ARG4.
           COPY "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *        PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SCZY1210-INOUT
                  PARM-SCZY1210-RTNPKG.
      ******************************************************************
      *          SCZY1210 進捗管理ＩＮＳＵＰＤルーチン(残高向け)
      ******************************************************************
       BASE-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY1210 進捗管理ＩＮＳＵＰＤ START  ***"
      *-----------------------------------------------------------------
      *---------- 前処理
           PERFORM  START-RTN
      *---------- 主処理
           PERFORM  MAIN-RTN
      *---------- 後処理
           PERFORM  END-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY1210 進捗管理ＩＮＳＵＰＤ END  ***".
      *-----------------------------------------------------------------
       BASE-EXT.
           EXIT.
      ******************************************************************
      *                 前処理
      ******************************************************************
       START-RTN              SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  前処理  START  ***"
      *-----------------------------------------------------------------
      *---------- 初期化処理
           PERFORM  INIT-RTN
      *---------- パラメータチェック処理
           PERFORM  PARM-CHK-RTN
      *---------- テーブルID取得処理
           PERFORM  TBLID-GET-RTN
           IF  SS-SYORI-YMD OF PARM-SCZY1210-INOUT = 0 THEN
      *---------- ARG2.最終処理基準日=0の場合
      *           ARG2.最終処理基準日  ←  ARG2.基準年月日/基準年月
             MOVE  KJN-YMD         OF PARM-SCZY1210-INOUT
               TO  SS-SYORI-YMD    OF PARM-SCZY1210-INOUT
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "最終処理基準日:["
      D               SS-SYORI-YMD OF PARM-SCZY1210-INOUT "]"
      D    DISPLAY  "***  前処理  END  ***".
      *-----------------------------------------------------------------
       START-EXT.
           EXIT.
      ******************************************************************
      *                 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  主処理  START  ***"
      *-----------------------------------------------------------------
      *---------- 進捗タスクID取得処理
           PERFORM  SHINTKID-GET-RTN
           IF  SESION-KBN               OF PARM-SCZY1210-ARG1 = "0"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'0'(先頭セッション)の場合"
      *-----------------------------------------------------------------
      *---------- 先頭セッション処理
             PERFORM  HEAD-SESION-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'1'(最終セッション)の場合"
      *-----------------------------------------------------------------
      *---------- 最終セッション処理
             PERFORM  TAIL-SESION-RTN
           END-IF
           IF  SESION-KBN               OF PARM-SCZY1210-ARG1 = "0"
             AND OLBT-KBN               OF PARM-SCZY1210-ARG1 = "BT"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "セッション区分が'0'且つOL/BT区分が'BT'の場合、"
      D    DISPLAY  "処理を続く"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "(セッション区分が'0'且つOL/BT区分が'BT')以外の場合"
      D    DISPLAY  "WK-SHINTK-STS:["WK-SHINTK-STS"]"
      *-----------------------------------------------------------------
             IF     WK-CHECK-KBN = "1"
               AND  (WK-SHINTK-STS = "100"
               OR    WK-SHINTK-STS = "200"
               OR    WK-SHINTK-STS = "500") THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワークチェック区分 = '1'の場合"
      *-----------------------------------------------------------------
      *---------- 再処理起因進捗タスクID更新処理
               PERFORM  SAISR-SHINTKID-RTN
             END-IF
           END-IF
      *---------- 3.2.5.進捗管理（年月単位）更新処理
      *---------- 3.2.5.1.進捗管理（年月単位）の進捗ステータス更新処理
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク進捗チェック要否区分=["WK-CHECK-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-CHECK-KBN = "1" THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  3.2.5.1.進捗管理（年月単位）の進捗ステータス"
      D             "更新処理   START  ***"
      *-----------------------------------------------------------------
               PERFORM  SHINTK-KANRI-YM1-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  3.2.5.1.進捗管理（年月単位）の進捗ステータス"
      D             "更新処理   END  ***"
      *-----------------------------------------------------------------
           ELSE
             CONTINUE
           END-IF
      *---------- 3.2.5.2.進捗管理（年月単位）の再処理起因進捗タスクID
      *                   更新処理
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  3.2.5.2.進捗管理（年月単位）の再処理起因進捗"
      D             "タスクID更新処理   START  ***"
      D    DISPLAY  "ARG1.セッション区分=["
      D             SESION-KBN   OF  PARM-SCZY1210-ARG1"]"
      D    DISPLAY  "ARG1.OL/BT区分=["
      D             OLBT-KBN     OF  PARM-SCZY1210-ARG1"]"
      D    DISPLAY  "ワーク進捗チェック要否区分=["WK-CHECK-KBN"]"
      D    DISPLAY  "ワーク進捗ステータス=["WK-SHINTK-STS"]"
      *-----------------------------------------------------------------
           IF  SESION-KBN               OF PARM-SCZY1210-ARG1 = "0"
             AND OLBT-KBN               OF PARM-SCZY1210-ARG1 = "BT"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "セッション区分が'0'且つOL/BT区分が'BT'の場合、"
      D    DISPLAY  "処理を続く"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "(セッション区分が'0'且つOL/BT区分が'BT')以外の場合"
      *-----------------------------------------------------------------
             IF     WK-CHECK-KBN = "1"
               AND  (WK-SHINTK-STS = "100"
               OR    WK-SHINTK-STS = "200"
               OR    WK-SHINTK-STS = "500")
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク件数 = ["WK-COUNT"]"
      *-----------------------------------------------------------------
               PERFORM  VARYING  WK-IDX1  FROM CNS-N-1 BY CNS-N-1
                 UNTIL  WK-IDX1 > WK-COUNT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-IDX1 = ["WK-IDX1"]"
      *-----------------------------------------------------------------
      *----------  ワーク基準年月日/基準年月FROM(ワーク件数)
                 MOVE  WK-KJN-FROM            OF  WK-KJN-TASK
                                              OF  WK-KENSU-GRP(WK-IDX1)
                   TO  WK-KJN-YMD-FROM-1
      *----------  ワーク基準年月日/基準年月TO(ワーク件数)
                 MOVE  WK-KJN-TO              OF  WK-KJN-TASK
                                              OF  WK-KENSU-GRP(WK-IDX1)
                   TO  WK-KJN-YMD-TO-1
      *----------  ワーク進捗タスクID(ワーク件数)
                 MOVE  WK-TASK-ID             OF  WK-KJN-TASK
                                              OF  WK-KENSU-GRP(WK-IDX1)
                   TO  WK-SHINTK-TASK-ID-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク基準年月日/基準年月FROM("WK-IDX1")= ["
      D              WK-KJN-FROM           OF  WK-KJN-TASK
      D                                    OF  WK-KENSU-GRP(WK-IDX1)"]"
      D    DISPLAY  "ワーク基準年月日/基準年月TO("WK-IDX1")= ["
      D              WK-KJN-TO             OF  WK-KJN-TASK
      D                                    OF  WK-KENSU-GRP(WK-IDX1)"]"
      D    DISPLAY  "ワーク進捗タスクID("WK-IDX1")= ["
      D              WK-TASK-ID            OF  WK-KJN-TASK
      D                                    OF  WK-KENSU-GRP(WK-IDX1)"]"
      *-----------------------------------------------------------------
                 PERFORM  CALL-SCZY1200-RTN
               END-PERFORM
             ELSE
               CONTINUE
             END-IF
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  主処理  END  ***".
      *-----------------------------------------------------------------
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *                 先頭セッション処理
      ******************************************************************
       HEAD-SESION-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  先頭セッション処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ポートフォリオ実行可能チェック  START  ***"
      D    DISPLAY  "ARG1.OL/BT区分=["
      D              OLBT-KBN  OF  PARM-SCZY1210-ARG1"]"
      *-----------------------------------------------------------------
           IF  OLBT-KBN                 OF PARM-SCZY1210-ARG1 = "BT"
           THEN
             PERFORM  SELECT-TKDYAA31-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-HEIKO-KBN:["WK-HEIKO-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-HEIKO-KBN = "1" THEN
             PERFORM  PTF-JIKOU-CHK-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CHECK-KBN:["WK-CHECK-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-CHECK-KBN = "1" THEN
             PERFORM  SQL-12-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-HEIKO-KBN:["WK-HEIKO-KBN"]"
      *-----------------------------------------------------------------
      *---------- ポートフォリオ状態更新処理
           IF  WK-HEIKO-KBN = "1" THEN
             PERFORM  PTF-JYOTAI-UPD-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CHECK-KBN:["WK-CHECK-KBN"]"
      *-----------------------------------------------------------------
      *---------- 進捗管理更新処理
           IF  WK-CHECK-KBN = "1" THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワークチェック区分 = '1'の場合"
      *-----------------------------------------------------------------
               PERFORM  TSDYAA31-SEL-RTN
               PERFORM  SHINTK-KANRI-UPD-RTN
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  先頭セッション処理  END  ***".
      *-----------------------------------------------------------------
       HEAD-SESION-EXT.
           EXIT.
      ******************************************************************
      *                 最終セッション処理
      ******************************************************************
       TAIL-SESION-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  最終セッション処理  START  ***"
      D    DISPLAY  "WK-HEIKO-KBN:["WK-HEIKO-KBN"]"
      *-----------------------------------------------------------------
      *---------- ポートフォリオ状態更新処理
           IF  WK-HEIKO-KBN = "1" THEN
               PERFORM  SQL-1-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CHECK-KBN:["WK-CHECK-KBN"]"
      *-----------------------------------------------------------------
      *---------- 進捗管理更新処理
           IF  WK-CHECK-KBN = "1" THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワークチェック区分 = '1'の場合"
      *-----------------------------------------------------------------
               PERFORM  SHINTK-UPD-2-RTN
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  最終セッション処理  END  ***".
      *-----------------------------------------------------------------
       TAIL-SESION-EXT.
           EXIT.
      ******************************************************************
      *                 再処理起因進捗タスクID更新処理
      ******************************************************************
       SAISR-SHINTKID-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  再処理起因進捗タスクID更新処理  START  ***"
      *-----------------------------------------------------------------
      *----- 処理中の進捗タスクID過去データ再処理要更新処理
           PERFORM  SAISYRI-DATA-UPD-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SHINTK-TASK-ID=["WK-SHINTK-TASK-ID"]"
      *-----------------------------------------------------------------
           IF  WK-SHINTK-TASK-ID NOT = "ST00100"
           AND  WK-SHINTK-TASK-ID NOT = "ST00200"
           AND  WK-SHINTK-TASK-ID NOT = "ST00300"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク進捗タスク識別区分＝'A'、'B'、'C' 以外の場合"
      *-----------------------------------------------------------------
             PERFORM  KR-SHINTKID-UPD2-RTN
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  再処理起因進捗タスクID更新処理  END  ***".
      *-----------------------------------------------------------------
       SAISR-SHINTKID-EXT.
           EXIT.
      ******************************************************************
      *                 初期化処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *---------- 初期化
           INITIALIZE  DYNAMIC-SQL-LANGUAGE
                       WORK-AREA
                       PARM-SCZY1210-ARG3
                       PARM-SCZY1210-ARG4
                       PARM-SCZY1160-INOUT
                       PARM-SCZY1160-RTNPKG
                       PARM-SCZY1170-INOUT
                       PARM-SCZY1170-RTNPKG
                       PARM-TIDYAA40-INOUT
                       PARM-TIDYAA40-RTNPKG
                       PARM-TIDYAA41-INOUT
                       PARM-TIDYAA41-RTNPKG
                       PARM-TSDYAA31-INOUT
                       PARM-TSDYAA31-RTNPKG
                       PARM-SCZY7080-INOUT
                       PARM-SCZY1200-INOUT
                       PARM-SCZY7080-RTNPKG
                       PARM-SCZY1200-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "DYNAMIC-SQL-LANGUAGE:["DYNAMIC-SQL-LANGUAGE"]"
      D    DISPLAY  "WORK-AREA           :["WORK-AREA           "]"
      D    DISPLAY  "PARM-SCZY1210-ARG3  :["PARM-SCZY1210-ARG3  "]"
      D    DISPLAY  "PARM-SCZY1210-ARG4  :["PARM-SCZY1210-ARG4  "]"
      D    DISPLAY  "PARM-SCZY1160-INOUT :["PARM-SCZY1160-INOUT "]"
      D    DISPLAY  "PARM-SCZY1160-RTNPKG:["PARM-SCZY1160-RTNPKG"]"
      D    DISPLAY  "PARM-SCZY1170-INOUT :["PARM-SCZY1170-INOUT "]"
      D    DISPLAY  "PARM-SCZY1170-RTNPKG:["PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  "PARM-TIDYAA40-INOUT :["PARM-TIDYAA40-INOUT "]"
      D    DISPLAY  "PARM-TIDYAA40-RTNPKG:["PARM-TIDYAA40-RTNPKG"]"
      D    DISPLAY  "PARM-TIDYAA41-INOUT :["PARM-TIDYAA41-INOUT "]"
      D    DISPLAY  "PARM-TIDYAA41-RTNPKG:["PARM-TIDYAA41-RTNPKG"]"
      D    DISPLAY  "PARM-TSDYAA31-INOUT :["PARM-TSDYAA31-INOUT "]"
      D    DISPLAY  "PARM-TSDYAA31-RTNPKG:["PARM-TSDYAA31-RTNPKG"]"
      D    DISPLAY  "PARM-SCZY7080-INOUT :["PARM-SCZY7080-INOUT "]"
      D    DISPLAY  "PARM-SCZY7080-RTNPKG:["PARM-SCZY7080-RTNPKG"]"
      D    DISPLAY  "PARM-SCZY1200-INOUT :["PARM-SCZY1200-INOUT "]"
      D    DISPLAY  "PARM-SCZY1200-RTNPKG:["PARM-SCZY1200-RTNPKG"]"
      *-----------------------------------------------------------------
           MOVE  "0"                    TO PTF-JIKOU-KBN
                                        OF PARM-SCZY1210-ARG3
           MOVE  "0"                    TO WK-PAST-DATA-REDO-KBN
           MOVE  "1"                    TO WK-CHECK-KBN
           MOVE  "1"                    TO WK-HEIKO-KBN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "PTF-JIKOU-KBN      OF PARM-SCZY1210-ARG3:["
      D              PTF-JIKOU-KBN      OF PARM-SCZY1210-ARG3"]"
      D    DISPLAY  "WK-CHECK-KBN:["    WK-CHECK-KBN "]"
      D    DISPLAY  "WK-HEIKO-KBN:["    WK-HEIKO-KBN "]"
      D    DISPLAY  "WK-PAST-DATA-REDO-KBN:[" WK-PAST-DATA-REDO-KBN "]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  初期化処理  END  ***".
      *-----------------------------------------------------------------
       INIT-EXT.
           EXIT.
      ******************************************************************
      *                 パラメータチェック処理
      ******************************************************************
       PARM-CHK-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  パラメータチェック処理  START  ***"
      *-----------------------------------------------------------------
      *---------- パラメータチェック
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SESION-KBN         OF PARM-SCZY1210-ARG1:["
      D              SESION-KBN         OF PARM-SCZY1210-ARG1"]"
      D    DISPLAY  "OLBT-KBN           OF PARM-SCZY1210-ARG1:["
      D              OLBT-KBN           OF PARM-SCZY1210-ARG1"]"
      *-----------------------------------------------------------------
           EVALUATE  SESION-KBN         OF PARM-SCZY1210-ARG1
             WHEN  "0"
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'0'(先頭セッション)の場合"
      *-----------------------------------------------------------------
               IF  OLBT-KBN OF PARM-SCZY1210-ARG1 NOT= "OL" AND
                   OLBT-KBN OF PARM-SCZY1210-ARG1 NOT= "BT"
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'OL'、'BT'以外の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-PARM     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0001"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "パラメータエラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'OL' OR 'BT'の場合、処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
             WHEN  "1"
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'1'(最終セッション)の場合"
      *-----------------------------------------------------------------
               IF  OLBT-KBN             OF PARM-SCZY1210-ARG1 NOT= "BT"
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'BT'(バッチ用)以外の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-PARM     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0002"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "パラメータエラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'BT'(バッチ用)の場合、処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'0'、'1'以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-PARM       TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0003"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "パラメータエラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  パラメータチェック処理  END  ***".
      *-----------------------------------------------------------------
       PARM-CHK-EXT.
           EXIT.
      ******************************************************************
      *                 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  テーブルID取得処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  RIYO-CMP-CD            OF PARM-SCZY1160-ARG1
           MOVE  "TKDYAA40"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(1)
           MOVE  "TKDYAA41"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(2)
           MOVE  "TKDYAA44"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(3)
           MOVE  "TKDYAA43"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(4)
           MOVE  "TKDYAA42"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(5)
           MOVE  "TOC0SE16"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(6)
           MOVE  "TKDYAA35"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(7)
           MOVE  "TOC0DA21"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(8)
           MOVE  "TOC0DA23"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(9)
           MOVE  "TKDYAA20"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(10)
           MOVE  "TKDYAA31"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(11)
           MOVE  "TKDYAA66"             TO TBL-ID
                                        OF PARM-SCZY1160-ARG1(12)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-SCZY1160-ARG1:["
      D              RIYO-CMP-CD        OF PARM-SCZY1160-ARG1"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(1):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(2):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(3):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(4):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(5):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(6):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(7):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(7)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(8):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(8)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(9):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(9)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(10):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(10)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(11):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(11)"]"
      D    DISPLAY  "TBL-ID             OF PARM-SCZY1160-ARG1(12):["
      D              TBL-ID             OF PARM-SCZY1160-ARG1(12)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"
           USING  PARM-SCZY1160-INOUT
                  PARM-SCZY1160-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1160-ARG3:["
      D              RTN-CD             OF PARM-SCZY1160-ARG3
      D                        (COUNTER OF PARM-SCZY1160-ARG3)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD             OF PARM-SCZY1160-ARG3
                               (COUNTER OF PARM-SCZY1160-ARG3)
             WHEN  CNS-RET-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード='000'(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(1)
                 TO  WK-TABLEID-1
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(2)
                 TO  WK-TABLEID-2
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(3)
                 TO  WK-TABLEID-3
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(4)
                 TO  WK-TABLEID-4
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(5)
                 TO  WK-TABLEID-5
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(6)
                 TO  WK-TABLEID-6
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(7)
                 TO  WK-TABLEID-7
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(8)
                 TO  WK-TABLEID-8
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(9)
                 TO  WK-TABLEID-9
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(10)
                 TO  WK-TABLEID-10
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(11)
                 TO  WK-TABLEID-11
               MOVE  HENSYUGO-TBL-ID    OF PARM-SCZY1160-ARG2(12)
                 TO  WK-TABLEID-12
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-TABLEID-1:["WK-TABLEID-1"]"
      D    DISPLAY  "WK-TABLEID-2:["WK-TABLEID-2"]"
      D    DISPLAY  "WK-TABLEID-3:["WK-TABLEID-3"]"
      D    DISPLAY  "WK-TABLEID-4:["WK-TABLEID-4"]"
      D    DISPLAY  "WK-TABLEID-5:["WK-TABLEID-5"]"
      D    DISPLAY  "WK-TABLEID-6:["WK-TABLEID-6"]"
      D    DISPLAY  "WK-TABLEID-7:["WK-TABLEID-7"]"
      D    DISPLAY  "WK-TABLEID-8:["WK-TABLEID-8"]"
      D    DISPLAY  "WK-TABLEID-9:["WK-TABLEID-9"]"
      D    DISPLAY  "WK-TABLEID-10:["WK-TABLEID-10"]"
      D    DISPLAY  "WK-TABLEID-11:["WK-TABLEID-11"]"
      D    DISPLAY  "WK-TABLEID-12:["WK-TABLEID-12"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード<>'000'(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORCIGAI    TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0004"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  PARM-SCZY1160-ARG3 TO PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "テーブルID取得エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  テーブルID取得処理  END  ***".
      *-----------------------------------------------------------------
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *     対象業務タスクの一時停止区分と実行ステータスを取得処理
      ******************************************************************
       SELECT-TKDYAA31-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  対象業務タスクの一時停止区分と実行ステータス"
      D             "を取得処理  START  ***"
      *-----------------------------------------------------------------
      *----------   1) 『一時停止区分と実行ステータスを取得』PREPARE処理
           PERFORM  CR6-PREPARE-RTN
      *----------   2) 『一時停止区分と実行ステータスを取得』OPEN処理
           PERFORM  CR6-OPEN-RTN
      *----------   3) 『一時停止区分と実行ステータスを取得』FETCH処理
           PERFORM  CR6-FETCH-RTN
      *----------   4) 『一時停止区分と実行ステータスを取得』CLOSE処理
           PERFORM  CR6-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  対象業務タスクの一時停止区分と実行ステータス"
      D             "を取得処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-TKDYAA31-EXT.
           EXIT.
      ******************************************************************
      *    『一時停止区分と実行ステータスを取得』PREPARE処理
      ******************************************************************
       CR6-PREPARE-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  『一時停止区分と実行ステータスを取得』"
      D             "PREPARE処理  START *****"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT6
                       WK-ERR-SQLSTMT6
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  H-RIYO-CMP-CD-6
           MOVE  SYORI-YMD              OF PARM-SCZY1210-ARG2
             TO  H-SYORI-YMD-6
           MOVE  KIDOU-ID               OF PARM-SCZY1210-ARG2
             TO  H-KIDOU-ID-6
           STRING
             "SELECT DECODE(B.RIYO_CMP_CD,NULL,A.JIKOU_STS,'300') AS"
             " JIKOU_STS,A.ITIJI_TEISHI_KBN FROM "
              WK-TABLEID-11
             " A, "
              WK-TABLEID-12
             " B "
             " WHERE A.RIYO_CMP_CD=:V1"
             " AND A.SYORI_YMD=:V2"
             " AND A.KIDOU_ID=:V3"
             " AND A.RIYO_CMP_CD=B.RIYO_CMP_CD(+)"
             " AND A.SYORI_YMD=B.SYORI_YMD(+)"
             " AND A.KIDOU_ID=B.KIDOU_ID(+)"
           DELIMITED  BY  SIZE
           INTO  SQLSTMT6-ARR
           POINTER  WK-SQL-POINTER
           MOVE  WK-SQL-POINTER      TO  SQLSTMT6-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["H-RIYO-CMP-CD-6 "]"
      D    DISPLAY  "V2 = ["H-SYORI-YMD-6"]"
      D    DISPLAY  "V3 = ["H-KIDOU-ID-6"]"
      D    DISPLAY  "別紙6 SQL文:["SQLSTMT6-ARR"]"
      D    DISPLAY  "別紙6 SQL長:["SQLSTMT6-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT6-ARR
                   "[V1:"H-RIYO-CMP-CD-6  "]"
                   "[V2:"H-SYORI-YMD-6"]"
                   "[V3:"H-KIDOU-ID-6"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT6
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  S06  FROM  :SQLSTMT6
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  PREPARE  NORMAL"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  PREPARE  ABNORMAL"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0082"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT6    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *---------- カーソル 宣言
           EXEC  SQL
             DECLARE  CR6  CURSOR  FOR  S06
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DECLARE) =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  DECLARE  NORMAL"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  DECLARE  ABNORMAL"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0083"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT6    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  『一時停止区分と実行ステータスを取得』"
      D             "PREPARE処理  END *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CR6-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    2)『一時停止区分と実行ステータスを取得』OPEN処理
      ******************************************************************
       CR6-OPEN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  『一時停止区分と実行ステータスを取得』"
      D             "OPEN処理  START *****"
      *-----------------------------------------------------------------
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CR6
             USING  :H-RIYO-CMP-CD-6,
                    :H-SYORI-YMD-6,
                    :H-KIDOU-ID-6
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN) =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  OPEN  NORMAL"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CR6-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CR6-OPEN-FLG = ["WK-CR6-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  OPEN  ABNORMAL"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0084"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT6    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  『一時停止区分と実行ステータスを取得』"
      D             "OPEN処理  END *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CR6-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3)『一時停止区分と実行ステータスを取得』FETCH処理
      ******************************************************************
       CR6-FETCH-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  『一時停止区分と実行ステータスを取得』"
      D             "FETCH処理  START *****"
      *-----------------------------------------------------------------
           INITIALIZE  H-JIKOU-STS
                       H-ITIJI-TEISHI-KBN
           EXEC  SQL
             FETCH  CR6
             INTO
      *---------- 進捗タスクID取得
               :H-JIKOU-STS,
               :H-ITIJI-TEISHI-KBN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH) =["SQLCODE"]"
      D    DISPLAY  "取得した実行ステータス =["H-JIKOU-STS"]"
      D    DISPLAY  "取得した一時停止区分 =["H-ITIJI-TEISHI-KBN"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  FETCH  NORMAL"
      *-----------------------------------------------------------------
               MOVE  RIYO-CMP-CD            OF  PARM-SCZY1210-INOUT
                 TO  H-RIYO-CMP-CD
               MOVE  SYORI-YMD              OF  PARM-SCZY1210-INOUT
                 TO  H-SYORI-YMD
               MOVE  KIDOU-ID               OF  PARM-SCZY1210-INOUT
                 TO  H-KIDOU-ID
      *----------  取得した一時停止区分＝'1'(有効)の場合
               IF  H-ITIJI-TEISHI-KBN  =  "1"
               THEN
                 PERFORM  TKDYAA35-UPD-1-RTN
                 MOVE  "2"        TO  PTF-JIKOU-KBN
                   OF  PARM-SCZY1210-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ポートフォリオ実行可能区分=["PTF-JIKOU-KBN
      D                                      OF  PARM-SCZY1210-ARG3 "]"
      *-----------------------------------------------------------------
                 PERFORM  END-RTN
               ELSE
      *----------  取得した実行ステータス＝'300'(強制終了)の場合
                 IF  H-JIKOU-STS  =  "300"
                 THEN
      *----------  実行状況管理明細実行ステータスを更新する
                   PERFORM  TKDYAA35-UPD-2-RTN
                   MOVE  "2"    TO  PTF-JIKOU-KBN
                     OF  PARM-SCZY1210-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ポートフォリオ実行可能区分=["PTF-JIKOU-KBN
      D                                      OF  PARM-SCZY1210-ARG3 "]"
      *-----------------------------------------------------------------
                   PERFORM  END-RTN
                 ELSE
                   CONTINUE
                 END-IF
               END-IF
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  FETCH  ABNORMAL"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0085"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT6    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  "*****  『一時停止区分と実行ステータスを取得』"
      D             "FETCH処理  END *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CR6-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    4)『一時停止区分と実行ステータスを取得』CLOSE処理
      ******************************************************************
       CR6-CLOSE-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  『一時停止区分と実行ステータスを取得』"
      D             "CLOSE処理  START *****"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CR6
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE) =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  CLOSE  NORMAL"
      *-----------------------------------------------------------------
               MOVE  "0"                TO WK-CR6-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CR6-OPEN-FLG =["WK-CR6-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CR6  CLOSE  ABNORMAL"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0086"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT6    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  『一時停止区分と実行ステータスを取得』"
      D             "CLOSE処理  END *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CR6-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *                 実行状況管理明細更新処理-1
      ******************************************************************
       TKDYAA35-UPD-1-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  実行状況管理明細更新処理-1  START *****"
      *-----------------------------------------------------------------
           MOVE  1  TO  SQLSTMT191-LEN
           STRING  "UPDATE "
      *----------  実行状況管理明細(TKDYAA35)
                   WK-TABLEID-7
      *----------  明細単位実行ステータス
                   " SET JIKOU_STS = '650'"
                   ", UPD_DATE = SYSDATE "
      *----------  更新ログインユーザ会社コード
                   ", UPD_LOGIN_CMP_CD = '"
                   H-RIYO-CMP-CD
      *----------  更新ユーザID
                   "', UPD_SID = '"
                   SPACE
      *----------  更新プログラムID
                   "', UPD_PGMID = '"
                   CNS-PGM-ID
                   "' "
      *----------  WHERE条件
      *----------  利用会社コード＝ARG2.利用会社コード
                   " WHERE RIYO_CMP_CD = :V1"
      *----------  処理実行日＝ARG2.処理実行日
                   " AND  SYORI_YMD =  :V2"
      *----------  起動ID＝ARG2.起動ID
                   " AND  KIDOU_ID = :V3"
      *----------  明細単位実行ステータス＝'650'(実行待ち)
                   " AND  JIKOU_STS = '600'"
                   DELIMITED BY SIZE
                   INTO  SQLSTMT191-ARR    WITH  POINTER
                   SQLSTMT191-LEN
                   STRING  SQLSTMT191-ARR
                   "[V1:"  H-RIYO-CMP-CD "]"
                   "[V2:"  H-SYORI-YMD   "]"
                   "[V3:"  H-KIDOU-ID    "]"
                   DELIMITED BY SIZE
                   INTO  WK-ERR-SQLSTMT191
      *-------------------<DEBUG>---------------------------------------
      D  DISPLAY  "強制終了の場合SQL        文  =["  SQLSTMT191-ARR  "]"
      D  DISPLAY  "強制終了の場合SQLSTMT191-LEN =["  SQLSTMT191-LEN  "]"
      *-----------------------------------------------------------------
               EXEC SQL
                       PREPARE S03 FROM :SQLSTMT191
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(強制終了PREPARE) = ["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  NOT = CNS-SQL-NORMAL
               THEN
      *----------  ポジション
                 MOVE  "0072"               TO  ERR-POS
                                            OF  PARM-SCZY1170-INOUT
      *----------  リターンコード
                 MOVE  CNS-RET-ORACLE       TO  RTN-CD
                                            OF  PARM-SCZY1170-INOUT
      *----------  詳細リターンコード
                 MOVE  SQLCODE              TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-INOUT
      *----------  詳細ﾘﾀｰﾝｺｰﾄﾞﾃﾞｺｰﾄﾞﾌﾗｸﾞ
                 MOVE  "1"                  TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-INOUT
      *----------  フリーメッセージ
                 MOVE  WK-ERR-SQLSTMT191    TO  FREE-MSG
                                            OF  PARM-SCZY1170-INOUT
      *----------  エラー処理
                 PERFORM  ERR-RTN
               END-IF
               EXEC SQL EXECUTE S03 USING
      *----------  基準年月日
                  :H-RIYO-CMP-CD,
                  :H-SYORI-YMD,
                  :H-KIDOU-ID
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(強制終了EXECUTE) = ["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  NOT =  CNS-SQL-NORMAL
                 AND  SQLCODE  NOT = CNS-SQL-NODATA
               THEN
      *----------  ポジション
                 MOVE  "0073"               TO  ERR-POS
                                            OF  PARM-SCZY1170-INOUT
      *----------  リターンコード
                 MOVE  CNS-RET-ORACLE       TO  RTN-CD
                                            OF  PARM-SCZY1170-INOUT
      *----------  詳細リターンコード
                 MOVE  SQLCODE              TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-INOUT
      *----------  詳細ﾘﾀｰﾝｺｰﾄﾞﾃﾞｺｰﾄﾞﾌﾗｸﾞ
                 MOVE  "1"                  TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-INOUT
      *----------  フリーメッセージ
                 MOVE  WK-ERR-SQLSTMT191    TO  FREE-MSG
                                            OF  PARM-SCZY1170-INOUT
      *----------  エラー処理
                 PERFORM  ERR-RTN
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  実行状況管理明細更新処理-1  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKDYAA35-UPD-1-EXT.
           EXIT.
      ******************************************************************
      *                 実行状況管理明細更新処理-2
      ******************************************************************
       TKDYAA35-UPD-2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  実行状況管理明細更新処理-2  START *****"
      *-----------------------------------------------------------------
           MOVE  1  TO  SQLSTMT192-LEN
           STRING  "UPDATE "
      *----------  実行状況管理明細(TKDYAA35)
                   WK-TABLEID-7
      *----------  明細単位実行ステータス
                   " SET JIKOU_STS = '300'"
                   ", UPD_DATE = SYSDATE "
      *----------  更新ログインユーザ会社コード
                   ", UPD_LOGIN_CMP_CD = '"
                   H-RIYO-CMP-CD
      *----------  更新ユーザID
                   "', UPD_SID = '"
                   SPACE
      *----------  更新プログラムID
                   "', UPD_PGMID = '"
                   CNS-PGM-ID
                   "' "
      *----------  WHERE条件
      *----------  利用会社コード＝ARG2.利用会社コード
                   " WHERE RIYO_CMP_CD = :V1"
      *----------  処理実行日＝ARG2.処理実行日
                   " AND  SYORI_YMD =  :V2"
      *----------  起動ID＝ARG2.起動ID
                   " AND  KIDOU_ID = :V3"
      *----------  明細単位実行ステータス＝`600`(実行中)
      *            OR 明細単位実行ステータス＝`650`(実行待ち)
                   " AND  (JIKOU_STS = '650' OR JIKOU_STS = '600')"
                   DELIMITED BY SIZE
                   INTO  SQLSTMT192-ARR    WITH  POINTER
                   SQLSTMT192-LEN
                   STRING  SQLSTMT192-ARR
                   "[V1:"  H-RIYO-CMP-CD "]"
                   "[V2:"  H-SYORI-YMD   "]"
                   "[V3:"  H-KIDOU-ID    "]"
                   DELIMITED BY SIZE
                   INTO  WK-ERR-SQLSTMT192
      *-------------------<DEBUG>---------------------------------------
      D  DISPLAY  "強制終了の場合SQL        文  =["  SQLSTMT192-ARR  "]"
      D  DISPLAY  "強制終了の場合SQLSTMT192-LEN =["  SQLSTMT192-LEN  "]"
      *-----------------------------------------------------------------
               EXEC SQL
                       PREPARE S04 FROM :SQLSTMT192
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(強制終了PREPARE) = ["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  NOT = CNS-SQL-NORMAL
               THEN
      *----------  ポジション
                 MOVE  "0074"               TO  ERR-POS
                                            OF  PARM-SCZY1170-INOUT
      *----------  リターンコード
                 MOVE  CNS-RET-ORACLE       TO  RTN-CD
                                            OF  PARM-SCZY1170-INOUT
      *----------  詳細リターンコード
                 MOVE  SQLCODE              TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-INOUT
      *----------  詳細ﾘﾀｰﾝｺｰﾄﾞﾃﾞｺｰﾄﾞﾌﾗｸﾞ
                 MOVE  "1"                  TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-INOUT
      *----------  フリーメッセージ
                 MOVE  WK-ERR-SQLSTMT192    TO  FREE-MSG
                                            OF  PARM-SCZY1170-INOUT
      *----------  エラー処理
                 PERFORM  ERR-RTN
               END-IF
               EXEC SQL EXECUTE S04 USING
      *----------  基準年月日
                  :H-RIYO-CMP-CD,
                  :H-SYORI-YMD,
                  :H-KIDOU-ID
               END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(強制終了EXECUTE) = ["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  NOT =  CNS-SQL-NORMAL
                 AND  SQLCODE  NOT = CNS-SQL-NODATA
               THEN
      *----------  ポジション
                 MOVE  "0075"               TO  ERR-POS
                                            OF  PARM-SCZY1170-INOUT
      *----------  リターンコード
                 MOVE  CNS-RET-ORACLE       TO  RTN-CD
                                            OF  PARM-SCZY1170-INOUT
      *----------  詳細リターンコード
                 MOVE  SQLCODE              TO  DETAIL-RTN-CD
                                            OF  PARM-SCZY1170-INOUT
      *----------  詳細ﾘﾀｰﾝｺｰﾄﾞﾃﾞｺｰﾄﾞﾌﾗｸﾞ
                 MOVE  "1"                  TO  DETAIL-RTN-CD-FLG
                                            OF  PARM-SCZY1170-INOUT
      *----------  フリーメッセージ
                 MOVE  WK-ERR-SQLSTMT192    TO  FREE-MSG
                                            OF  PARM-SCZY1170-INOUT
      *----------  エラー処理
                 PERFORM  ERR-RTN
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  実行状況管理明細更新処理-2  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       TKDYAA35-UPD-2-EXT.
           EXIT.
      ******************************************************************
      *                 進捗タスクID取得処理
      ******************************************************************
       SHINTKID-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗タスクID取得処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL01  START  ***"
      *-----------------------------------------------------------------
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID
           STRING
             "SELECT T1.SHINTK_TASK_ID,T1.SHINTK_UPD_MODE_KBN,"
             "T2.SHINTK_TASK_KBN,"
             "T2.PAST_REDO_KBN,T2.KAKUTEI_KBN,"
             "T3.SHINTK_UPD_MODE_KBN AS CMP_SHINTK_UPD_MODE_KBN FROM "
              WK-TABLEID-4
             " T1, "
              WK-TABLEID-5
             " T2, "
              WK-TABLEID-6
             " T3"
             " WHERE T1.RIYO_CMP_CD = :V1"
             " AND TRIM(T1.SYS_SYORI_ID) = TRIM( :V2 )"
             " AND (T1.SYS_SYORI_TYPE = '1' OR T1.SYS_SYORI_TYPE = '3')"
             " AND T1.RIYO_CMP_CD = T2.RIYO_CMP_CD"
             " AND T1.SHINTK_TASK_ID = T2.SHINTK_TASK_ID"
             " AND T1.RIYO_CMP_CD = T3.LOGIN_CMP_CD"
           DELIMITED  BY  SIZE
           INTO  SQLSTMT01-ARR
           POINTER  WK-SQL-POINTER
           MOVE     WK-SQL-POINTER      TO SQLSTMT01-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD  "]"
      D    DISPLAY  "V2 = ["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  "別紙7 SQL文:["SQLSTMT01-ARR"]"
      D    DISPLAY  "別紙7 SQL長:["SQLSTMT01-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT01-ARR
                   "[V1:"WK-RIYO-CMP-CD  "]"
                   "[V2:"WK-GYOMU-TASK-ID"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT01
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD01  FROM  :SQLSTMT01
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0005"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT01   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL01  PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL01  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-OPEN  START  ***"
      *-----------------------------------------------------------------
      *---------- カーソル 宣言
           EXEC  SQL
             DECLARE  CUR01  CURSOR  FOR  STMT_RECORD01
           END-EXEC
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CUR01
             USING  :WK-RIYO-CMP-CD,
                    :WK-GYOMU-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CUR01-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR01-OPEN-FLG = ["WK-CUR01-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0006"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT01   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-OPEN  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-OPEN  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-FETCH  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
             FETCH  CUR01
             INTO
      *---------- 進捗タスクID取得
               :H-SHINTK-TASK-ID-1,
               :H-SHINTK-UPD-MODE-KBN,
               :H-SHINTK-TASK-KBN,
               :H-PAST-REDO-KBN,
               :H-KAKUTEI-KBN,
               :H-CMP-SHINTK-UPD-MODE-KBN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-SHINTK-TASK-ID-1 TO  WK-SHINTK-TASK-ID
               MOVE  H-SHINTK-UPD-MODE-KBN   TO  WK-SHINTK-UPD-MODE-KBN
               MOVE  H-SHINTK-TASK-KBN  TO  WK-SHINTK-TASK-KBN
               MOVE  H-PAST-REDO-KBN    TO  WK-PAST-REDO-KBN
               MOVE  H-KAKUTEI-KBN      TO  WK-KAKUTEI-KBN
               MOVE  H-CMP-SHINTK-UPD-MODE-KBN
                                        TO  WK-CMP-SHINTK-UPD-MODE-KBN
               MOVE  "1"                TO  WK-FLG
               PERFORM  SQL-5-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      D    DISPLAY  "WK-SHINTK-TASK-ID:["WK-SHINTK-TASK-ID"]"
      D    DISPLAY  "WK-SHINTK-UPD-MODE-KBN:["WK-SHINTK-UPD-MODE-KBN"]"
      D    DISPLAY  "WK-SHINTK-TASK-KBN:["WK-SHINTK-TASK-KBN"]"
      D    DISPLAY  "WK-PAST-REDO-KBN:["WK-PAST-REDO-KBN"]"
      D    DISPLAY  "WK-KAKUTEI-KBN:["WK-KAKUTEI-KBN"]"
      D    DISPLAY  "WK-CMP-SHINTK-UPD-MODE-KBN:["
      D                               WK-CMP-SHINTK-UPD-MODE-KBN"]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-NODATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE＝1403(データなし)の場合"
      *-----------------------------------------------------------------
               PERFORM  SQL-5-RTN
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0007"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT01   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-FETCH  エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-FETCH  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-CLOSE  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CUR01
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  "0"                TO WK-CUR01-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR01-OPEN-FLG =["WK-CUR01-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0008"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT01   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-CLOSE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR01-CLOSE  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗タスクID取得処理  END  ***".
      *-----------------------------------------------------------------
       SHINTKID-GET-EXT.
           EXIT.
      ******************************************************************
      * 業務タスクマスタとアップロードマスタの並行稼動チェック区分を取得
      ******************************************************************
       SQL-5-RTN              SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SQL-5  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                      WK-SQL-POINTER
                                           WK-PARM-SCZY1210-ARG2
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID
           STRING  "SELECT HEIKO_CHK_KBN FROM "
                   WK-TABLEID-8
                   " WHERE GYOMU_TASK_ID = :V1"
                   " UNION SELECT HEIKO_CHK_KBN FROM "
                   WK-TABLEID-9
                   " WHERE UPLOAD_ID = :V2"
           DELIMITED  BY  SIZE  INTO  SQLSTMT9-ARR
           POINTER  WK-SQL-POINTER
           MOVE  WK-SQL-POINTER         TO SQLSTMT9-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  "V2 = ["WK-GYOMU-TASK-ID"}"
      D    DISPLAY  "別紙5 SQL文:["SQLSTMT9-ARR"]"
      D    DISPLAY  "別紙5 SQL長:["SQLSTMT9-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT9-ARR
                   "[V1:"WK-GYOMU-TASK-ID"]"
                   "[V2:"WK-GYOMU-TASK-ID"]"
           DELIMITED  BY  SIZE  INTO  WK-ERR-SQLSTMT9
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD9  FROM  :SQLSTMT9
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0009"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT9    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-CUR9  PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-OPEN  START  ***"
      *-----------------------------------------------------------------
      *---------- カーソル 宣言
           EXEC  SQL
             DECLARE  CUR9  CURSOR  FOR  STMT_RECORD9
           END-EXEC
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CUR9
             USING  :WK-GYOMU-TASK-ID,
                    :WK-GYOMU-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CUR9-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR9-OPEN-FLG = ["WK-CUR9-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0010"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT9    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-OPEN  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-OPEN  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-FETCH  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
             FETCH  CUR9
             INTO
      *---------- ワーク並行稼動チェック区分
               :H-HEIKO-CHK-KBN
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-HEIKO-CHK-KBN    TO  WK-HEIKO-CHK-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      D    DISPLAY  "WK-HEIKO-CHK-KBN:["WK-HEIKO-CHK-KBN"]"
      *-----------------------------------------------------------------
               IF  WK-FLG = "1" THEN
                 IF  WK-HEIKO-CHK-KBN = "2" OR
                     WK-HEIKO-CHK-KBN = "4" THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク並行稼動チェック区分＝'2'或いは'4'の場合"
      *-----------------------------------------------------------------
                   CONTINUE
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク並行稼動チェック区分＝'2'或いは'4'以外の場合"
      *-----------------------------------------------------------------
                   MOVE  "0"            TO  WK-HEIKO-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク並行稼動チェック要否区分:["WK-HEIKO-KBN"]"
      *-----------------------------------------------------------------
                 END-IF
               END-IF
               IF  WK-FLG NOT = "1" THEN
                 IF  WK-HEIKO-CHK-KBN = "2" OR
                     WK-HEIKO-CHK-KBN = "4" THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク並行稼動チェック区分＝'2'或いは'4'の場合"
      *-----------------------------------------------------------------
                   MOVE  "0"            TO  WK-CHECK-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク進捗チェック区分:["WK-CHECK-KBN"]"
      *-----------------------------------------------------------------
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク並行稼動チェック区分＝'2'或いは'4'以外の場合"
      *-----------------------------------------------------------------
                   PERFORM  END-RTN
                 END-IF
               END-IF
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0011"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT9    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-FETCH  エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-FETCH  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-CLOSE  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CUR9
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  "0"                TO WK-CUR9-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR9-OPEN-FLG = ["WK-CUR9-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0012"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT9    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-CLOSE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR9-CLOSE  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SQL-5  END  ***".
      *-----------------------------------------------------------------
       SQL-5-EXT.
           EXIT.
      ******************************************************************
      *                 ポートフォリオ実行可能チェック処理
      ******************************************************************
       PTF-JIKOU-CHK-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ポートフォリオ状態ステータスを取得する"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL02  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                      WK-SQL-POINTER
                                           WK-PARM-SCZY1210-ARG2
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2(1:6)
             TO  WK-KJN-YM
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD
           MOVE  KIDOU-ID               OF PARM-SCZY1210-ARG2
             TO  WK-KIDOU-ID
           STRING
             KJN-YMD OF PARM-SCZY1210-ARG2(1:6)
             "99"
           DELIMITED BY SIZE INTO WK-KJN-YMD-X
           STRING
             WK-KJN-YM
             "00"
           DELIMITED BY SIZE INTO WK-KJN-YM-00-X
           STRING
             WK-KJN-YM
             "99"
           DELIMITED BY SIZE INTO WK-KJN-YM-99-X
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID
           STRING
             "SELECT COUNT(1) FROM "
              WK-TABLEID-2
             " WHERE RIYO_CMP_CD = :V1"
           DELIMITED  BY  SIZE
           INTO  SQLSTMT02-ARR
           POINTER  WK-SQL-POINTER
           IF  WK-KJN-YMD(7:2) = 99 THEN
             STRING
               " AND ((KJN_YMD >= :V2 AND KJN_YMD <= :V3)"
               " OR KJN_YMD = 99999999)"
               " AND (KJN_YMD = :V4 OR KJN_YMD = :V5 OR 1=1)"
             DELIMITED  BY  SIZE
             INTO  SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND ((KJN_YMD >= :V2 AND KJN_YMD <= :V3)"
               " OR KJN_YMD = 99999999 OR 1=1)"
               " AND (KJN_YMD = :V4 OR KJN_YMD = :V5"
               " OR KJN_YMD = 99999999)"
             DELIMITED  BY  SIZE
             INTO  SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  FUND-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (FUND_CD      = :V6 OR FUND_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (FUND_CD      = :V6 OR FUND_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  PTF-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (PTF_CD       = :V7 OR PTF_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (PTF_CD       = :V7 OR PTF_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  HYK-KRTU-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (HYK_KRTU_CD  = :V8 OR HYK_KRTU_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (HYK_KRTU_CD  = :V8 OR HYK_KRTU_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           STRING
             " AND PTF_JYOTAI_STS = '1'"
           DELIMITED  BY  SIZE
           INTO  SQLSTMT02-ARR
           POINTER  WK-SQL-POINTER
           IF  WK-HEIKO-CHK-KBN = "2" THEN
             STRING  " AND (GYOMU_TASK_ID = :V9 OR GYOMU_TASK_ID IN ("
                     " SELECT SK_GYOMU_TASK_ID FROM "
                     WK-TABLEID-10
                     " WHERE GYOMU_TASK_ID = :V10"
                     " AND GYOMU_TASK_KBN = '3'))"
             DELIMITED BY SIZE INTO SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING  " AND (GYOMU_TASK_ID = :V9 OR GYOMU_TASK_ID IN ("
                     " SELECT SK_GYOMU_TASK_ID FROM "
                     WK-TABLEID-10
                     " WHERE GYOMU_TASK_ID = :V10"
                     " AND GYOMU_TASK_KBN = '3') OR 1=1)"
             DELIMITED BY SIZE INTO SQLSTMT02-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           STRING  " AND SS_UPD_KIDOU_ID <> :V11"
           DELIMITED BY SIZE
           INTO SQLSTMT02-ARR
           POINTER  WK-SQL-POINTER
           MOVE     WK-SQL-POINTER      TO SQLSTMT02-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD"]"
      D    DISPLAY  "V2 = ["WK-KJN-YM-00  "]"
      D    DISPLAY  "V3 = ["WK-KJN-YM-99  "]"
      D    DISPLAY  "V4 = ["WK-KJN-YMD    "]"
      D    DISPLAY  "V5 = ["WK-KJN-YMD-99 "]"
      D    DISPLAY  "V6 = ["WK-FUND-CD    "]"
      D    DISPLAY  "V7 = ["WK-PTF-CD     "]"
      D    DISPLAY  "V8 = ["WK-HYK-KRTU-CD"]"
      D    DISPLAY  "V9 = ["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  "V10= ["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  "V11= ["WK-KIDOU-ID"]"
      D    DISPLAY  "別紙8 SQL文:["SQLSTMT02-ARR"]"
      D    DISPLAY  "別紙8 SQL長:["SQLSTMT02-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT02-ARR
                   "[V1:"WK-RIYO-CMP-CD"]"
                   "[V2:"WK-KJN-YM-00  "]"
                   "[V3:"WK-KJN-YM-99  "]"
                   "[V4:"WK-KJN-YMD    "]"
                   "[V5:"WK-KJN-YMD-99 "]"
                   "[V6:"WK-FUND-CD    "]"
                   "[V7:"WK-PTF-CD     "]"
                   "[V8:"WK-HYK-KRTU-CD"]"
                   "[V9:"WK-GYOMU-TASK-ID"]"
                   "[V10:"WK-GYOMU-TASK-ID"]"
                   "[V11:"WK-KIDOU-ID"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT02
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD02  FROM  :SQLSTMT02
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0017"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT02   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL02  PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL02  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-OPEN  START  ***"
      *-----------------------------------------------------------------
      *---------- カーソル 宣言
           EXEC  SQL
             DECLARE  CUR02  CURSOR  FOR  STMT_RECORD02
           END-EXEC
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CUR02
             USING  :WK-RIYO-CMP-CD,
                    :WK-KJN-YM-00,
                    :WK-KJN-YM-99,
                    :WK-KJN-YMD,
                    :WK-KJN-YMD-99,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-GYOMU-TASK-ID,
                    :WK-GYOMU-TASK-ID,
                    :WK-KIDOU-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CUR02-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR02-OPEN-FLG = ["WK-CUR02-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0018"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT02   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-OPEN  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-OPEN  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-FETCH  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
             FETCH  CUR02
             INTO
      *---------- ポートフォリオ状態ステータスが'1'(処理中)の件数
               :H-PTF-COUNT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-PTF-COUNT        TO  WK-PTF-COUNT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      D    DISPLAY  "WK-PTF-COUNT:["WK-PTF-COUNT"]"
      *-----------------------------------------------------------------
               IF  WK-PTF-COUNT > 0 THEN
                 PERFORM  SQL-9-1-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "OLBT-KBN           OF  PARM-SCZY1210-ARG1:["
      D              OLBT-KBN           OF  PARM-SCZY1210-ARG1"]"
      *-----------------------------------------------------------------
                 IF  OLBT-KBN           OF  PARM-SCZY1210-ARG1 = "BT"
                 THEN
                   MOVE  "W000522"      TO  MSG-ID
                                        OF  PARM-SCZY7080-ARG2(1)
                   IF  KJN-YMD OF PARM-SCZY1210-INOUT(7:2) = "99"
                   THEN
                     STRING
                       CNS-KJN-YMD
                       KJN-YMD OF PARM-SCZY1210-INOUT(1:6)
                     DELIMITED BY SIZE
                     INTO FREE-MSG OF PARM-SCZY7080-ARG2(1)
                   ELSE
                     STRING
                       CNS-KJN-YMD
                       KJN-YMD OF PARM-SCZY1210-INOUT
                     DELIMITED BY SIZE
                     INTO FREE-MSG OF PARM-SCZY7080-ARG2(1)
                   END-IF
                   PERFORM  CALL-SCZY7080-RTN
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "後処理へ進む"
      *-----------------------------------------------------------------
                 PERFORM  END-RTN
               ELSE
                 PERFORM  SQL-14-RTN
               END-IF
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0019"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT02   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-FETCH  エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-FETCH  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-CLOSE  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CUR02
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  "0"                TO WK-CUR02-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR02-OPEN-FLG = ["WK-CUR02-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0020"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT02   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-CLOSE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR02-CLOSE  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PTF-JIKOU-CHK-EXT.
           EXIT.
      ******************************************************************
      *                 進捗管理の確定済の件数を取得処理
      ******************************************************************
       SQL-12-RTN             SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗管理の確定済の件数を取得処理"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL03  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク進捗チェック要否区分＝'1'の場合"
      *-----------------------------------------------------------------
           INITIALIZE                      WK-SQL-POINTER
                                           WK-PARM-SCZY1210-ARG2
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID
           STRING
             "SELECT COUNT(1) FROM "
              WK-TABLEID-1
             " WHERE RIYO_CMP_CD  = :V1"
           DELIMITED  BY  SIZE
           INTO  SQLSTMT03-ARR
           POINTER   WK-SQL-POINTER
           IF  WK-KAKUTEI-KBN = '1' THEN
             STRING " AND KJN_YMD = :V2"
             DELIMITED BY SIZE INTO SQLSTMT03-ARR
             POINTER   WK-SQL-POINTER
           ELSE
             STRING " AND KJN_YMD >= :V2"
             DELIMITED BY SIZE INTO SQLSTMT03-ARR
             POINTER   WK-SQL-POINTER
           END-IF
           STRING
             " AND FUND_CD        = :V3"
             " AND PTF_CD         = :V4"
             " AND HYK_KRTU_CD    = :V5"
             " AND SHINTK_TASK_ID = :V6"
             " AND SHINTK_STS     = '000'"
           DELIMITED  BY  SIZE
           INTO  SQLSTMT03-ARR
           POINTER  WK-SQL-POINTER
           MOVE     WK-SQL-POINTER      TO SQLSTMT03-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD   "]"
      D    DISPLAY  "V2 = ["WK-KJN-YMD       "]"
      D    DISPLAY  "V3 = ["WK-FUND-CD       "]"
      D    DISPLAY  "V4 = ["WK-PTF-CD        "]"
      D    DISPLAY  "V5 = ["WK-HYK-KRTU-CD   "]"
      D    DISPLAY  "V6 = ["WK-SHINTK-TASK-ID"]"
      D    DISPLAY  "別紙12 SQL文:["SQLSTMT03-ARR"]"
      D    DISPLAY  "別紙12 SQL長:["SQLSTMT03-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT03-ARR
                   "[V1:"WK-RIYO-CMP-CD   "]"
                   "[V2:"WK-KJN-YMD       "]"
                   "[V3:"WK-FUND-CD       "]"
                   "[V4:"WK-PTF-CD        "]"
                   "[V5:"WK-HYK-KRTU-CD   "]"
                   "[V6:"WK-SHINTK-TASK-ID"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT03
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD03  FROM  :SQLSTMT03
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0021"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT03   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL03  PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL03  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-OPEN  START  ***"
      *-----------------------------------------------------------------
      *---------- カーソル 宣言
           EXEC  SQL
             DECLARE  CUR03  CURSOR  FOR  STMT_RECORD03
           END-EXEC
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CUR03
             USING  :WK-RIYO-CMP-CD,
                    :WK-KJN-YMD,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-SHINTK-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CUR03-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR03-OPEN-FLG = ["WK-CUR03-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0022"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT03   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-OPEN  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-OPEN  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-FETCH  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL  FETCH  CUR03
             INTO
      *---------- 進捗ステータスが'000'(確定済)の件数
               :H-KENSU-1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-KENSU-1          TO  WK-KENSU-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      D    DISPLAY  "WK-KENSU-1:["WK-KENSU-1"]"
      *-----------------------------------------------------------------
               IF  WK-KENSU-1 > 0 THEN
                 PERFORM  SQL-9-2-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "OLBT-KBN           OF  PARM-SCZY1210-ARG1:["
      D              OLBT-KBN           OF  PARM-SCZY1210-ARG1"]"
      *-----------------------------------------------------------------
                 IF  OLBT-KBN           OF  PARM-SCZY1210-ARG1 = "BT"
                 THEN
                   MOVE  "W000521"      TO  MSG-ID
                                        OF  PARM-SCZY7080-ARG2(1)
                   STRING
                     CNS-KJN-YMD
                     KJN-YMD OF PARM-SCZY1210-INOUT
                   DELIMITED BY SIZE
                   INTO FREE-MSG OF PARM-SCZY7080-ARG2(1)
                   PERFORM  CALL-SCZY7080-RTN
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "後処理へ進む"
      *-----------------------------------------------------------------
                 PERFORM  END-RTN
               ELSE
                 PERFORM  SQL-10-RTN
               END-IF
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0023"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT03   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-FETCH  エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-FETCH  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-CLOSE  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CUR03
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  "0"                TO WK-CUR03-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR03-OPEN-FLG = ["WK-CUR03-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0024"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT03   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-CLOSE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR03-CLOSE  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ポートフォリオ実行可能チェック  END  ***".
      *-----------------------------------------------------------------
       SQL-12-EXT.
           EXIT.
      ******************************************************************
      *            ポートフォリオ状態に該当レコード件数を取得
      ******************************************************************
       SQL-14-RTN             SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得した処理中の件数＞0以外の場合"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL12  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE             WK-SQL-POINTER
                                  WK-PARM-SCZY1210-ARG2
           MOVE  1                TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD      OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  KJN-YMD          OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD
           MOVE  FUND-CD          OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD           OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD      OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           MOVE  GYOMU-TASK-ID    OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID
           STRING
             "SELECT COUNT(1) FROM "
              WK-TABLEID-2
             " WHERE RIYO_CMP_CD = :V1"
             " AND KJN_YMD       = :V2"
             " AND FUND_CD       = :V3"
             " AND PTF_CD        = :V4"
             " AND HYK_KRTU_CD   = :V5"
             " AND GYOMU_TASK_ID = :V6"
           DELIMITED BY SIZE INTO SQLSTMT12-ARR
           POINTER  WK-SQL-POINTER
           MOVE  WK-SQL-POINTER   TO  SQLSTMT12-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD"]"
      D    DISPLAY  "V2 = ["WK-KJN-YMD    "]"
      D    DISPLAY  "V3 = ["WK-FUND-CD    "]"
      D    DISPLAY  "V4 = ["WK-PTF-CD     "]"
      D    DISPLAY  "V5 = ["WK-HYK-KRTU-CD"]"
      D    DISPLAY  "V6 = ["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  "別紙14 SQL文:["SQLSTMT12-ARR"]"
      D    DISPLAY  "別紙14 SQL長:["SQLSTMT12-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT12-ARR
                   "[V1:"WK-RIYO-CMP-CD"]"
                   "[V2:"WK-KJN-YMD    "]"
                   "[V3:"WK-FUND-CD    "]"
                   "[V4:"WK-PTF-CD     "]"
                   "[V5:"WK-HYK-KRTU-CD"]"
                   "[V6:"WK-GYOMU-TASK-ID"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT12
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD12  FROM  :SQLSTMT12
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                      OF PARM-SCZY1170-ARG1
             MOVE  CNS-RET-ORACLE     TO RTN-CD
                                      OF PARM-SCZY1170-ARG1
             MOVE  SQLCODE            TO DETAIL-RTN-CD
                                      OF PARM-SCZY1170-ARG1
             MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                      OF PARM-SCZY1170-ARG1
             MOVE  "0025"             TO ERR-POS
                                      OF PARM-SCZY1170-ARG1
             MOVE  WK-ERR-SQLSTMT12   TO FREE-MSG
                                      OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL12  PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL12  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-OPEN  START  ***"
      *-----------------------------------------------------------------
      *---------- カーソル 宣言
           EXEC  SQL
             DECLARE  CUR12  CURSOR  FOR  STMT_RECORD12
           END-EXEC
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CUR12
             USING  :WK-RIYO-CMP-CD,
                    :WK-KJN-YMD,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-GYOMU-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CUR12-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR12-OPEN-FLG = ["WK-CUR12-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0026"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT12   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-OPEN  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-OPEN  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-FETCH  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
             FETCH  CUR12
             INTO
      *---------- ポートフォリオ状態に該当レコード
             :H-KENSU-3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-KENSU-3         TO  WK-KENSU-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      D    DISPLAY  "WK-KENSU-3:["WK-KENSU-3"]"
      *-----------------------------------------------------------------
               IF  WK-KENSU-3 > 0 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得した件数＞0の場合,処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               ELSE
                 MOVE  "1"        TO WK-PTF-JYOTAI-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得した件数＞0以外の場合"
      D    DISPLAY  "ワークポートフォリオ状態データ有無区分←'1'"
      D    DISPLAY  "WK-PTF-JYOTAI-FLG = ["WK-PTF-JYOTAI-FLG"]"
      *-----------------------------------------------------------------
               END-IF
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0027"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT12   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-FETCH  エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-FETCH  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-CLOSE  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CUR12
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  "0"               TO WK-CUR12-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR12-OPEN-FLG = ["WK-CUR12-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID        TO ERR-PGM-ID
                                       OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE    TO RTN-CD
                                       OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE           TO DETAIL-RTN-CD
                                       OF PARM-SCZY1170-ARG1
               MOVE  "1"               TO DETAIL-RTN-CD-FLG
                                       OF PARM-SCZY1170-ARG1
               MOVE  "0028"            TO ERR-POS
                                       OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT12  TO FREE-MSG
                                       OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-CLOSE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR12-CLOSE  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SQL-14-EXT.
           EXIT.
      ******************************************************************
      *                 実行状況管理明細を未処理に更新
      ******************************************************************
       SQL-9-1-RTN            SECTION.
           MOVE  "1"               TO  PTF-JIKOU-KBN
                                   OF  PARM-SCZY1210-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得した処理中の件数＞0の場合"
      D    DISPLAY  "ポートフォリオ実行可能区分 ← '1'"
      D    DISPLAY  "PTF-JIKOU-KBN      OF PARM-SCZY1210-ARG3:["
      D              PTF-JIKOU-KBN      OF PARM-SCZY1210-ARG3"]"
      D    DISPLAY  "実行状況管理明細を未処理に更新"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR2-PREPARE  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                WK-SQL-POINTER
                                     WK-PARM-SCZY1210-ARG2
           MOVE  1                 TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD       OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  SYORI-YMD         OF PARM-SCZY1210-ARG2
             TO  WK-SYORI-YMD
           MOVE  KIDOU-ID          OF PARM-SCZY1210-ARG2
             TO  WK-KIDOU-ID
           MOVE  FUND-CD           OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD            OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD       OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           MOVE  REP-ID            OF PARM-SCZY1210-ARG2
             TO  WK-REP-ID
           MOVE  REP-ANY-CD        OF PARM-SCZY1210-ARG2
             TO  WK-REP-ANY-CD
           MOVE  KJN-YMD-FROM      OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD-FROM
           STRING
             "UPDATE " WK-TABLEID-7 " SET "
             "JIKOU_STS = '155'"
             " ,UPD_DATE = SYSDATE "
             " ,UPD_LOGIN_CMP_CD = :V1"
             " ,UPD_SID = ' '"
             " ,UPD_PGMID = '"
              CNS-PGM-ID
             "' WHERE RIYO_CMP_CD = :V2"
             " AND SYORI_YMD      = :V3"
             " AND KIDOU_ID       = :V4"
           DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
           POINTER  WK-SQL-POINTER
           IF  FUND-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (FUND_CD      = :V5 OR FUND_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (FUND_CD      = :V5 OR FUND_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  PTF-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (PTF_CD       = :V6 OR PTF_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (PTF_CD       = :V6 OR PTF_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  HYK-KRTU-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (HYK_KRTU_CD  = :V7 OR HYK_KRTU_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (HYK_KRTU_CD  = :V7 OR HYK_KRTU_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           STRING
             " AND REP_ID         = :V8"
             " AND REP_ANY_CD     = :V9"
             " AND KJN_YMD_FROM   = :V10"
             " AND (JIKOU_STS    <= '155' OR JIKOU_STS > '400')"
           DELIMITED BY SIZE
           INTO  SQLSTMT2-ARR
           POINTER  WK-SQL-POINTER
           MOVE  WK-SQL-POINTER    TO SQLSTMT2-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD "]"
      D    DISPLAY  "V2 = ["WK-RIYO-CMP-CD "]"
      D    DISPLAY  "V3 = ["WK-SYORI-YMD   "]"
      D    DISPLAY  "V4 = ["WK-KIDOU-ID    "]"
      D    DISPLAY  "V5 = ["WK-FUND-CD     "]"
      D    DISPLAY  "V6 = ["WK-PTF-CD      "]"
      D    DISPLAY  "V7 = ["WK-HYK-KRTU-CD "]"
      D    DISPLAY  "V8 = ["WK-REP-ID      "]"
      D    DISPLAY  "V9 = ["WK-REP-ANY-CD  "]"
      D    DISPLAY  "V10= ["WK-KJN-YMD-FROM"]"
      D    DISPLAY  "別紙9 SQL文:["SQLSTMT2-ARR"]"
      D    DISPLAY  "別紙9 SQL長:["SQLSTMT2-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT2-ARR
                   "[V1:"WK-RIYO-CMP-CD "]"
                   "[V2:"WK-RIYO-CMP-CD "]"
                   "[V3:"WK-SYORI-YMD   "]"
                   "[V4:"WK-KIDOU-ID    "]"
                   "[V5:"WK-FUND-CD     "]"
                   "[V6:"WK-PTF-CD      "]"
                   "[V7:"WK-HYK-KRTU-CD "]"
                   "[V8:"WK-REP-ID      "]"
                   "[V9:"WK-REP-ANY-CD  "]"
                   "[V10:"WK-KJN-YMD-FROM"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT2
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD2  FROM  :SQLSTMT2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0013"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT2    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ＳＱＬ文 PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR2-PREPARE  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR2-EXECUTE  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
             EXECUTE  STMT_RECORD2
             USING  :WK-RIYO-CMP-CD,
                    :WK-RIYO-CMP-CD,
                    :WK-SYORI-YMD,
                    :WK-KIDOU-ID,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-REP-ID,
                    :WK-REP-ANY-CD,
                    :WK-KJN-YMD-FROM
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
                 EVALUATE  SQLCODE
                   WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
                     CONTINUE
                   WHEN  CNS-SQL-NODATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=1403(該当データなし)の場合、処理を続く"
      *-----------------------------------------------------------------
                     CONTINUE
                   WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
                     MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                            OF PARM-SCZY1170-ARG1
                     MOVE  CNS-RET-ORACLE   TO RTN-CD
                                            OF PARM-SCZY1170-ARG1
                     MOVE  SQLCODE          TO DETAIL-RTN-CD
                                            OF PARM-SCZY1170-ARG1
                     MOVE  "0014"           TO ERR-POS
                                            OF PARM-SCZY1170-ARG1
                     MOVE  "1"              TO DETAIL-RTN-CD-FLG
                                            OF PARM-SCZY1170-ARG1
                     MOVE  WK-ERR-SQLSTMT2  TO FREE-MSG
                                            OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "実行状況管理明細を未処理に更新エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                     PERFORM  ERR-RTN
                 END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR2-EXECUTE  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SQL-9-1-EXT.
           EXIT.
      ******************************************************************
      *                 実行状況管理明細を確定済に更新
      ******************************************************************
       SQL-9-2-RTN            SECTION.
           MOVE  "1"               TO  PTF-JIKOU-KBN
                                   OF  PARM-SCZY1210-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得した確定済件数＞0の場合"
      D    DISPLAY  "ポートフォリオ実行可能区分 ← '1'"
      D    DISPLAY  "PTF-JIKOU-KBN      OF PARM-SCZY1210-ARG3:["
      D              PTF-JIKOU-KBN      OF PARM-SCZY1210-ARG3"]"
      D    DISPLAY  "実行状況管理明細を確定済に更新する"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR2-PREPARE  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                WK-SQL-POINTER
                                     WK-PARM-SCZY1210-ARG2
           MOVE  1                 TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD       OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  SYORI-YMD         OF PARM-SCZY1210-ARG2
             TO  WK-SYORI-YMD
           MOVE  KIDOU-ID          OF PARM-SCZY1210-ARG2
             TO  WK-KIDOU-ID
           MOVE  FUND-CD           OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD            OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD       OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           MOVE  REP-ID            OF PARM-SCZY1210-ARG2
             TO  WK-REP-ID
           MOVE  REP-ANY-CD        OF PARM-SCZY1210-ARG2
             TO  WK-REP-ANY-CD
           MOVE  KJN-YMD-FROM      OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD-FROM
           STRING
             "UPDATE " WK-TABLEID-7 " SET "
             "JIKOU_STS = '156'"
             " ,UPD_DATE = SYSDATE "
             " ,UPD_LOGIN_CMP_CD = :V1"
             " ,UPD_SID = ' '"
             " ,UPD_PGMID = '"
              CNS-PGM-ID
             "' WHERE RIYO_CMP_CD = :V2"
             " AND SYORI_YMD      = :V3"
             " AND KIDOU_ID       = :V4"
           DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
           POINTER  WK-SQL-POINTER
           IF  FUND-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (FUND_CD      = :V5 OR FUND_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (FUND_CD      = :V5 OR FUND_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  PTF-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (PTF_CD       = :V6 OR PTF_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (PTF_CD       = :V6 OR PTF_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  HYK-KRTU-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (HYK_KRTU_CD  = :V7 OR HYK_KRTU_CD = ' ' OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (HYK_KRTU_CD  = :V7 OR HYK_KRTU_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT2-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           STRING
             " AND REP_ID         = :V8"
             " AND REP_ANY_CD     = :V9"
             " AND KJN_YMD_FROM   = :V10"
             " AND (JIKOU_STS    <= '156' OR JIKOU_STS > '400')"
           DELIMITED BY SIZE
           INTO  SQLSTMT2-ARR
           POINTER  WK-SQL-POINTER
           MOVE  WK-SQL-POINTER    TO SQLSTMT2-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD "]"
      D    DISPLAY  "V2 = ["WK-RIYO-CMP-CD "]"
      D    DISPLAY  "V3 = ["WK-SYORI-YMD   "]"
      D    DISPLAY  "V4 = ["WK-KIDOU-ID    "]"
      D    DISPLAY  "V5 = ["WK-FUND-CD     "]"
      D    DISPLAY  "V6 = ["WK-PTF-CD      "]"
      D    DISPLAY  "V7 = ["WK-HYK-KRTU-CD "]"
      D    DISPLAY  "V8 = ["WK-REP-ID      "]"
      D    DISPLAY  "V9 = ["WK-REP-ANY-CD  "]"
      D    DISPLAY  "V10= ["WK-KJN-YMD-FROM"]"
      D    DISPLAY  "別紙9 SQL文:["SQLSTMT2-ARR"]"
      D    DISPLAY  "別紙9 SQL長:["SQLSTMT2-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT2-ARR
                   "[V1:"WK-RIYO-CMP-CD "]"
                   "[V2:"WK-RIYO-CMP-CD "]"
                   "[V3:"WK-SYORI-YMD   "]"
                   "[V4:"WK-KIDOU-ID    "]"
                   "[V5:"WK-FUND-CD     "]"
                   "[V6:"WK-PTF-CD      "]"
                   "[V7:"WK-HYK-KRTU-CD "]"
                   "[V8:"WK-REP-ID      "]"
                   "[V9:"WK-REP-ANY-CD  "]"
                   "[V10:"WK-KJN-YMD-FROM"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT2
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD2  FROM  :SQLSTMT2
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0029"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT2    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ＳＱＬ文 PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR2-PREPARE  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR2-EXECUTE  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
             EXECUTE  STMT_RECORD2
             USING  :WK-RIYO-CMP-CD,
                    :WK-RIYO-CMP-CD,
                    :WK-SYORI-YMD,
                    :WK-KIDOU-ID,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-REP-ID,
                    :WK-REP-ANY-CD,
                    :WK-KJN-YMD-FROM
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
                 EVALUATE  SQLCODE
                   WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
                     CONTINUE
                   WHEN  CNS-SQL-NODATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=1403(該当データなし)の場合、処理を続く"
      *-----------------------------------------------------------------
                     CONTINUE
                   WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
                     MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                            OF PARM-SCZY1170-ARG1
                     MOVE  CNS-RET-ORACLE   TO RTN-CD
                                            OF PARM-SCZY1170-ARG1
                     MOVE  SQLCODE          TO DETAIL-RTN-CD
                                            OF PARM-SCZY1170-ARG1
                     MOVE  "0030"           TO ERR-POS
                                            OF PARM-SCZY1170-ARG1
                     MOVE  "1"              TO DETAIL-RTN-CD-FLG
                                            OF PARM-SCZY1170-ARG1
                     MOVE  WK-ERR-SQLSTMT2  TO FREE-MSG
                                            OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "実行状況管理明細を確定済に更新エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                     PERFORM  ERR-RTN
                 END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR2-EXECUTE  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SQL-9-2-EXT.
           EXIT.
      ******************************************************************
      *       進捗管理から進捗ステータスと前回進捗ステータスを取得
      ******************************************************************
       SQL-10-RTN             SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得した件数＞0以外の場合"
      *-----------------------------------------------------------------
           INITIALIZE                      WK-SQL-POINTER
                                           WK-PARM-SCZY1210-ARG2
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID
           STRING
             "SELECT SHINTK_STS,KIDOU_ID,SS_JIKOU_START_TIME"
             ",OLD_SHINTK_STS,OLD_KIDOU_ID,OLD_JIKOU_START_TIME FROM "
              WK-TABLEID-1
             " WHERE RIYO_CMP_CD  = :V1"
             " AND KJN_YMD        = :V2"
             " AND FUND_CD        = :V3"
             " AND PTF_CD         = :V4"
             " AND HYK_KRTU_CD    = :V5"
             " AND SHINTK_TASK_ID = :V6"
           DELIMITED  BY  SIZE
           INTO  SQLSTMT10-ARR
           POINTER  WK-SQL-POINTER
           MOVE     WK-SQL-POINTER      TO SQLSTMT10-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD   "]"
      D    DISPLAY  "V2 = ["WK-KJN-YMD       "]"
      D    DISPLAY  "V3 = ["WK-FUND-CD       "]"
      D    DISPLAY  "V4 = ["WK-PTF-CD        "]"
      D    DISPLAY  "V5 = ["WK-HYK-KRTU-CD   "]"
      D    DISPLAY  "V6 = ["WK-SHINTK-TASK-ID"]"
      D    DISPLAY  "別紙10 SQL文:["SQLSTMT10-ARR"]"
      D    DISPLAY  "別紙10 SQL長:["SQLSTMT10-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT10-ARR
                   "[V1:"WK-RIYO-CMP-CD   "]"
                   "[V2:"WK-KJN-YMD       "]"
                   "[V3:"WK-FUND-CD       "]"
                   "[V4:"WK-PTF-CD        "]"
                   "[V5:"WK-HYK-KRTU-CD   "]"
                   "[V6:"WK-SHINTK-TASK-ID"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT10
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD10  FROM  :SQLSTMT10
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0031"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT10   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL10  PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL10  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-OPEN  START  ***"
      *-----------------------------------------------------------------
      *---------- カーソル 宣言
           EXEC  SQL
             DECLARE  CUR10  CURSOR  FOR  STMT_RECORD10
           END-EXEC
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CUR10
             USING  :WK-RIYO-CMP-CD,
                    :WK-KJN-YMD,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-SHINTK-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CUR10-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR10-OPEN-FLG = ["WK-CUR10-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0032"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT10   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-OPEN  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-OPEN  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-FETCH  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL  FETCH  CUR10
             INTO
      *---------- 進捗ステータス
               :H-SHINTK-STS,
               :H-KIDOU-ID,
               :H-SS-JIKOU-START-TIME,
               :H-OLD-SHINTK-STS,
               :H-OLD-KIDOU-ID,
               :H-OLD-JIKOU-START-TIME
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-SHINTK-STS       TO  WK-SHINTK-STS
               MOVE  H-KIDOU-ID         TO  WK-KIDOU-ID-1
               MOVE  H-SS-JIKOU-START-TIME
                                        TO  WK-SS-JIKOU-START-TIME
               MOVE  H-OLD-SHINTK-STS   TO  WK-OLD-SHINTK-STS
               MOVE  H-OLD-KIDOU-ID     TO  WK-OLD-KIDOU-ID
               MOVE  H-OLD-JIKOU-START-TIME
                                        TO  WK-OLD-JIKOU-START-TIME
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      D    DISPLAY  "WK-SHINTK-STS:["WK-SHINTK-STS"]"
      D    DISPLAY  "WK-KIDOU-ID-1:["WK-KIDOU-ID-1"]"
      D    DISPLAY  "WK-SS-JIKOU-START-TIME:["WK-SS-JIKOU-START-TIME"]"
      D    DISPLAY  "WK-OLD-SHINTK-STS:["WK-OLD-SHINTK-STS"]"
      D    DISPLAY  "WK-OLD-KIDOU-ID:["WK-OLD-KIDOU-ID"]"
      D    DISPLAY  "WK-OLD-JIKOU-START-TIME:["
      D                                 WK-OLD-JIKOU-START-TIME"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NODATA
               MOVE  "1"                TO  WK-SHINTK-KANRI-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SHINTK-KANRI-FLG:["WK-SHINTK-KANRI-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0033"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT10   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-FETCH  エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-FETCH  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-CLOSE  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CUR10
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  "0"                TO WK-CUR10-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR10-OPEN-FLG = ["WK-CUR10-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0034"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT10   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-CLOSE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-CLOSE  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SQL-10-EXT.
           EXIT.
      ******************************************************************
      *                 ポートフォリオ状態更新処理
      ******************************************************************
       PTF-JYOTAI-UPD-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ポートフォリオ状態更新処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-PTF-JYOTAI-FLG:["WK-PTF-JYOTAI-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-PTF-JYOTAI-FLG = "1"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワークポートフォリオ状態データ有無区分='1'の場合"
      *-----------------------------------------------------------------
             PERFORM  CALL-TIDYAA41-RTN
           ELSE
      *----------     ポートフォリオ状態テーブル更新処理
             PERFORM  PTF-DATA-LOCK-RTN
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ポートフォリオ状態更新処理  END  ***".
      *-----------------------------------------------------------------
       PTF-JYOTAI-UPD-EXT.
           EXIT.
      ******************************************************************
      *                 ポートフォリオ状態INSERT処理
      ******************************************************************
       CALL-TIDYAA41-RTN      SECTION.
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  RIYO-CMP-CD            OF PARM-TIDYAA41-ARG1
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  RIYO-CMP-CD            OF PARM-TIDYAA41-ARG2
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  KJN-YMD                OF PARM-TIDYAA41-ARG2
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  FUND-CD                OF PARM-TIDYAA41-ARG2
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  PTF-CD                 OF PARM-TIDYAA41-ARG2
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  HYK-KRTU-CD            OF PARM-TIDYAA41-ARG2
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  GYOMU-TASK-ID          OF PARM-TIDYAA41-ARG2
           MOVE  SYORI-YMD              OF PARM-SCZY1210-ARG2
             TO  SS-UPD-JIKOBI          OF PARM-TIDYAA41-ARG2
           MOVE  KIDOU-ID               OF PARM-SCZY1210-ARG2
             TO  SS-UPD-KIDOU-ID        OF PARM-TIDYAA41-ARG2
           IF  OLBT-KBN                 OF PARM-SCZY1210-ARG1 = "BT"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'BT'(バッチ用)の場合"
      *-----------------------------------------------------------------
             MOVE  "1"                  TO PTF-JYOTAI-STS
                                        OF PARM-TIDYAA41-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'BT'(バッチ用)以外の場合"
      *-----------------------------------------------------------------
             MOVE  "0"                  TO PTF-JYOTAI-STS
                                        OF PARM-TIDYAA41-ARG2
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "OLBT-KBN           OF PARM-SCZY1210-ARG1=["
      D              OLBT-KBN           OF PARM-SCZY1210-ARG1"]"
      D    DISPLAY  "PTF-JYOTAI-STS     OF PARM-TIDYAA41-ARG2=["
      D              PTF-JYOTAI-STS     OF PARM-TIDYAA41-ARG2"]"
      *-----------------------------------------------------------------
      *----- 更新日時 ← 初期値
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  UPD-LOGIN-CMP-CD       OF PARM-TIDYAA41-ARG2
      *----- 更新ユーザID ← 初期値
      *----- 更新プログラムID ← 初期値
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-TIDYAA41-ARG1:["
      D              RIYO-CMP-CD        OF PARM-TIDYAA41-ARG1"]"
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-TIDYAA41-ARG2=["
      D              RIYO-CMP-CD        OF PARM-TIDYAA41-ARG2"]"
      D    DISPLAY  "KJN-YMD            OF PARM-TIDYAA41-ARG2=["
      D              KJN-YMD            OF PARM-TIDYAA41-ARG2"]"
      D    DISPLAY  "FUND-CD            OF PARM-TIDYAA41-ARG2=["
      D              FUND-CD            OF PARM-TIDYAA41-ARG2"]"
      D    DISPLAY  "PTF-CD             OF PARM-TIDYAA41-ARG2=["
      D              PTF-CD             OF PARM-TIDYAA41-ARG2"]"
      D    DISPLAY  "HYK-KRTU-CD        OF PARM-TIDYAA41-ARG2=["
      D              HYK-KRTU-CD        OF PARM-TIDYAA41-ARG2"]"
      D    DISPLAY  "GYOMU-TASK-ID      OF PARM-TIDYAA41-ARG2=["
      D              GYOMU-TASK-ID      OF PARM-TIDYAA41-ARG2"]"
      D    DISPLAY  "SS-UPD-JIKOBI      OF PARM-TIDYAA41-ARG2=["
      D              SS-UPD-JIKOBI      OF PARM-TIDYAA41-ARG2"]"
      D    DISPLAY  "SS-UPD-KIDOU-ID    OF PARM-TIDYAA41-ARG2=["
      D              SS-UPD-KIDOU-ID    OF PARM-TIDYAA41-ARG2"]"
      D    DISPLAY  "UPD-LOGIN-CMP-CD   OF PARM-TIDYAA41-ARG2=["
      D              UPD-LOGIN-CMP-CD   OF PARM-TIDYAA41-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "TIDYAA41"
           USING  PARM-TIDYAA41-INOUT
                  PARM-TIDYAA41-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD             OF PARM-TIDYAA41-ARG3:["
      D              RTN-CD             OF PARM-TIDYAA41-ARG3
      D                        (COUNTER OF PARM-TIDYAA41-ARG3)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD             OF PARM-TIDYAA41-ARG3
                               (COUNTER OF PARM-TIDYAA41-ARG3)
             WHEN  CNS-RET-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード='000'(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
      *----------    一意制約
             WHEN   CNS-RET-CD-ITI-SEYAKU
      *----------     ポートフォリオ状態テーブル更新処理
                 PERFORM  PTF-DATA-LOCK-RTN
             WHEN  CNS-RET-ORCIGAI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー(Oracle以外)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORCIGAI    TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0035"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  PARM-TIDYAA41-ARG3
                 TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ポートフォリオ状態更新エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0036"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  PARM-TIDYAA41-ARG3
                 TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ポートフォリオ状態更新エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           CONTINUE.
       CALL-TIDYAA41-EXT.
           EXIT.
      ******************************************************************
      *        更新対象のポートフォリオ状態のデータをロック処理
      ******************************************************************
       PTF-DATA-LOCK-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "**  更新対象のPTF状態データをロック処理  START **"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           MOVE  1  TO  SQLSTMT11-LEN
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD-1
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD-1
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD-1
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD-1
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD-1
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG2.利用会社コード =["WK-RIYO-CMP-CD-1"]"
      D    DISPLAY  "ARG2.基準年月日/基準年月 =["WK-KJN-YMD-1"]"
      D    DISPLAY  "ARG2.ファンドコード =["WK-FUND-CD-1"]"
      D    DISPLAY  "ARG2.ポートフォリオコード =["WK-PTF-CD-1"]"
      D    DISPLAY  "ARG2.評価系列コード =["WK-HYK-KRTU-CD-1"]"
      D    DISPLAY  "ARG2.業務タスクID =["WK-GYOMU-TASK-ID-1"]"
      *-----------------------------------------------------------------
           STRING  "SELECT "
      *----------  条件値
                   "PTF_JYOTAI_STS "
      *----------  FROM
                   " FROM "
                   WK-TABLEID-2
      *----------  WHERE条件
                   " WHERE"
      *----------   利用会社コード＝ARG2.利用会社コード
                    " RIYO_CMP_CD = :V1"
      *----------   基準日＝ARG2.基準年月日/基準年月
                    " AND KJN_YMD = :V2"
      *----------   ファンドコード＝ARG2.ファンドコード
                    " AND FUND_CD = :V3"
      *----------   ポートフォリオコード＝ARG2.ポートフォリオコード
                    " AND PTF_CD = :V4"
      *----------   評価系列コード＝ARG2.評価系列コード
                    " AND HYK_KRTU_CD = :V5"
      *----------   業務タスクID
                    " AND GYOMU_TASK_ID = :V6"
      *----------   ポートフォリオ状態ステータス＝'0'(未処理)
                    " AND PTF_JYOTAI_STS = '0'"
                    " FOR UPDATE NOWAIT "
               DELIMITED BY SIZE
               INTO  SQLSTMT11-ARR
               POINTER  SQLSTMT11-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLSTMT11-ARR=["SQLSTMT11-ARR"]"
      D    DISPLAY  "SQLSTMT11-LEN=["SQLSTMT11-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT11-ARR
                   "[V1:"  WK-RIYO-CMP-CD-1  "]"
                   "[V2:"  WK-KJN-YMD-1      "]"
                   "[V3:"  WK-FUND-CD-1      "]"
                   "[V4:"  WK-PTF-CD-1       "]"
                   "[V5:"  WK-HYK-KRTU-CD-1  "]"
                   "[V6:"  WK-GYOMU-TASK-ID-1"]"
               DELIMITED  BY  SIZE
               INTO  WK-ERR-SQLSTMT11
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-ERR-SQLSTMT11=["WK-ERR-SQLSTMT11"]"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文 PREPARE11
           EXEC SQL
               PREPARE S11  FROM :SQLSTMT11
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(PREPARE11)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  ポジション
               MOVE  "0077"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-ORACLE
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-ERR-SQLSTMT11
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル11 DECLARE
           EXEC SQL
               DECLARE CR11 CURSOR  FOR S11
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(DECLARE11)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  NOT = CNS-SQL-NORMAL
           THEN
      *----------  ポジション
               MOVE  "0078"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-ORACLE
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-ERR-SQLSTMT11
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  カーソル11 OPEN
           EXEC SQL
               OPEN  CR11
               USING
                   :WK-RIYO-CMP-CD-1,
                   :WK-KJN-YMD-1,
                   :WK-FUND-CD-1,
                   :WK-PTF-CD-1,
                   :WK-HYK-KRTU-CD-1,
                   :WK-GYOMU-TASK-ID-1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(OPEN11)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                   MOVE  "1"           TO WK-CUR11-OPEN-FLG
                   CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  処理を継続  *****"
      *-----------------------------------------------------------------
               WHEN  CNS-NOWAIT
      *----------  実行状況管理明細を未処理に更新処理
                   PERFORM  SQL-9-1-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "OLBT-KBN           OF PARM-SCZY1210-ARG1:["
      D              OLBT-KBN           OF PARM-SCZY1210-ARG1"]"
      *-----------------------------------------------------------------
                   IF  OLBT-KBN         OF PARM-SCZY1210-ARG1 = "BT"
                   THEN
                       MOVE  "W000522"
                         TO  MSG-ID     OF PARM-SCZY7080-ARG2(1)
                       IF  KJN-YMD OF PARM-SCZY1210-INOUT(7:2) = "99"
                       THEN
                           STRING
                             CNS-KJN-YMD
                             KJN-YMD    OF PARM-SCZY1210-INOUT(1:6)
                           DELIMITED BY SIZE
                           INTO FREE-MSG     OF PARM-SCZY7080-ARG2(1)
                       ELSE
                           STRING
                             CNS-KJN-YMD
                             KJN-YMD    OF PARM-SCZY1210-INOUT
                           DELIMITED BY SIZE
                           INTO FREE-MSG     OF PARM-SCZY7080-ARG2(1)
                       END-IF
      *----------  バッチメッセージＩＮＳルーチン
                       PERFORM  CALL-SCZY7080-RTN
                   ELSE
                       CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  処理を継続  *****"
      *-----------------------------------------------------------------
                   END-IF
                   PERFORM  END-RTN
               WHEN  OTHER
      *----------  ポジション
                   MOVE  "0079"
                     TO  ERR-POS             OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RET-ORACLE
                     TO  RTN-CD              OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE
                     TO  DETAIL-RTN-CD       OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  "1"
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  WK-ERR-SQLSTMT11
                     TO  FREE-MSG            OF PARM-SCZY1170-ARG1
                   PERFORM  ERR-RTN
           END-EVALUATE
      *----------  カーソル11 FETCH
           EXEC SQL
               FETCH  CR11
                INTO :H-PTF-JYOTAI-STS
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(FETCH11)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
                   CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  処理を継続  *****"
      *-----------------------------------------------------------------
                WHEN  CNS-SQL-NODATA
      *----------  実行状況管理明細を未処理に更新処理
                   PERFORM  SQL-9-1-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "OLBT-KBN           OF PARM-SCZY1210-ARG1:["
      D              OLBT-KBN           OF PARM-SCZY1210-ARG1"]"
      *-----------------------------------------------------------------
                   IF  OLBT-KBN         OF PARM-SCZY1210-ARG1 = "BT"
                   THEN
                       MOVE  "W000522"
                         TO  MSG-ID     OF PARM-SCZY7080-ARG2(1)
                       IF  KJN-YMD OF PARM-SCZY1210-INOUT(7:2) = "99"
                       THEN
                           STRING
                             CNS-KJN-YMD
                             KJN-YMD    OF PARM-SCZY1210-INOUT(1:6)
                           DELIMITED BY SIZE
                           INTO FREE-MSG     OF PARM-SCZY7080-ARG2(1)
                       ELSE
                           STRING
                             CNS-KJN-YMD
                             KJN-YMD    OF PARM-SCZY1210-INOUT
                           DELIMITED BY SIZE
                           INTO FREE-MSG     OF PARM-SCZY7080-ARG2(1)
                       END-IF
      *----------  バッチメッセージＩＮＳルーチン
                       PERFORM  CALL-SCZY7080-RTN
                   ELSE
                       CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  処理を継続  *****"
      *-----------------------------------------------------------------
                   END-IF
                   PERFORM  END-RTN
               WHEN  OTHER
      *----------  ポジション
                   MOVE  "0080"
                     TO  ERR-POS             OF PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RET-ORACLE
                     TO  RTN-CD              OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  SQLCODE
                     TO  DETAIL-RTN-CD       OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  "1"
                     TO  DETAIL-RTN-CD-FLG   OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  WK-ERR-SQLSTMT11
                     TO  FREE-MSG            OF PARM-SCZY1170-ARG1
                   PERFORM  ERR-RTN
           END-EVALUATE
           EXEC SQL
               CLOSE CR11
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(CLOSE11)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  = CNS-SQL-NORMAL
           THEN
               MOVE  "0"           TO WK-CUR11-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  処理を継続  *****"
      *-----------------------------------------------------------------
           ELSE
      *----------  ポジション
               MOVE  "0081"
                 TO  ERR-POS                 OF PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RET-ORACLE
                 TO  RTN-CD                  OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD           OF PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  "1"
                 TO  DETAIL-RTN-CD-FLG       OF PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  WK-ERR-SQLSTMT11
                 TO  FREE-MSG                OF PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-IF
      *----------  ポートフォリオ状態更新処理
           PERFORM  SQL-1-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  更新対象のPTF状態データをロック処理  END ***".
      *-----------------------------------------------------------------
       PTF-DATA-LOCK-EXT.
           EXIT.
      ******************************************************************
      *                 ポートフォリオ状態UPDATE処理
      ******************************************************************
       SQL-1-RTN              SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ポートフォリオ状態UPDATE処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE                    WK-SQL-POINTER
                                         WK-PARM-SCZY1210-ARG2
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  SYORI-YMD              OF PARM-SCZY1210-ARG2
             TO  WK-SYORI-YMD
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           MOVE  KIDOU-ID               OF PARM-SCZY1210-ARG2
             TO  WK-KIDOU-ID
           IF  OLBT-KBN                 OF PARM-SCZY1210-ARG1 = "BT"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "バッチ用のみの場合"
      *-----------------------------------------------------------------
             IF  SESION-KBN             OF PARM-SCZY1210-ARG1 = "0"
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'0'(先頭セッション)の場合"
      D    DISPLAY  "ポートフォリオ状態ステータスに'1'(処理中)をセット"
      *-----------------------------------------------------------------
               STRING
                 "UPDATE " WK-TABLEID-2 " SET "
                 "SS_UPD_JIKOBI = :V1"
                 " ,SS_UPD_KIDOU_ID = :V2"
                 " ,PTF_JYOTAI_STS = '1'"
                 " ,UPD_DATE = SYSDATE"
                 " ,UPD_LOGIN_CMP_CD = :V3"
                 " ,UPD_SID = ' '"
                 " ,UPD_PGMID = '"
                  CNS-PGM-ID
                 "'"
               DELIMITED BY SIZE
               INTO  SQLSTMT3-ARR
               POINTER  WK-SQL-POINTER
               MOVE  WK-SQL-POINTER   TO SQLSTMT3-LEN
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'1'(最終セッション)の場合"
      D    DISPLAY  "ポートフォリオ状態ステータスに'0'(未処理)をセット"
      *-----------------------------------------------------------------
               STRING
                 "UPDATE " WK-TABLEID-2 " SET "
                 "SS_UPD_JIKOBI = :V1"
                 " ,SS_UPD_KIDOU_ID = :V2"
                 " ,PTF_JYOTAI_STS = '0'"
                 " ,UPD_DATE = SYSDATE"
                 " ,UPD_LOGIN_CMP_CD = :V3"
                 " ,UPD_SID = ' '"
                 " ,UPD_PGMID = '"
                  CNS-PGM-ID
                 "'"
               DELIMITED BY SIZE
               INTO  SQLSTMT3-ARR
               POINTER  WK-SQL-POINTER
               MOVE  WK-SQL-POINTER   TO SQLSTMT3-LEN
             END-IF
      *----- 更新条件
             STRING
               " WHERE RIYO_CMP_CD = :V4"
               " AND KJN_YMD       = :V5"
               " AND FUND_CD       = :V6"
               " AND PTF_CD        = :V7"
               " AND HYK_KRTU_CD   = :V8"
               " AND GYOMU_TASK_ID = :V9"
             DELIMITED BY SIZE
             INTO  SQLSTMT3-ARR
             POINTER  WK-SQL-POINTER
             MOVE  WK-SQL-POINTER       TO SQLSTMT3-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-SYORI-YMD  "]"
      D    DISPLAY  "V2 = ["WK-KIDOU-ID   "]"
      D    DISPLAY  "V3 = ["WK-RIYO-CMP-CD"]"
      D    DISPLAY  "V4 = ["WK-RIYO-CMP-CD"]"
      D    DISPLAY  "V5 = ["WK-KJN-YMD    "]"
      D    DISPLAY  "V6 = ["WK-FUND-CD    "]"
      D    DISPLAY  "V7 = ["WK-PTF-CD     "]"
      D    DISPLAY  "V8 = ["WK-HYK-KRTU-CD"]"
      D    DISPLAY  "V9 = ["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  "別紙1 SQL文:["SQLSTMT3-ARR"]"
      D    DISPLAY  "別紙1 SQL長:["SQLSTMT3-LEN"]"
      *-----------------------------------------------------------------
             STRING  SQLSTMT3-ARR
                     "[V1:"WK-SYORI-YMD  "]"
                     "[V2:"WK-KIDOU-ID   "]"
                     "[V3:"WK-RIYO-CMP-CD"]"
                     "[V4:"WK-RIYO-CMP-CD"]"
                     "[V5:"WK-KJN-YMD    "]"
                     "[V6:"WK-FUND-CD    "]"
                     "[V7:"WK-PTF-CD     "]"
                     "[V8:"WK-HYK-KRTU-CD"]"
                     "[V9:"WK-GYOMU-TASK-ID"]"
             DELIMITED  BY  SIZE
             INTO  WK-ERR-SQLSTMT3
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "バッチ以外の場合"
      *-----------------------------------------------------------------
             STRING
               "UPDATE " WK-TABLEID-2 " SET "
               "SS_UPD_JIKOBI = :V1"
               " ,UPD_DATE = SYSDATE"
               " ,UPD_LOGIN_CMP_CD = :V2"
               " ,UPD_SID = ' '"
               " ,UPD_PGMID = '"
                CNS-PGM-ID
               "'"
      *----- 更新条件
               " WHERE RIYO_CMP_CD = :V3"
               " AND KJN_YMD       = :V4"
               " AND FUND_CD       = :V5"
               " AND PTF_CD        = :V6"
               " AND HYK_KRTU_CD   = :V7"
               " AND GYOMU_TASK_ID = :V8"
             DELIMITED BY SIZE
             INTO  SQLSTMT3-ARR
             POINTER  WK-SQL-POINTER
             MOVE  WK-SQL-POINTER       TO SQLSTMT3-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-SYORI-YMD  "]"
      D    DISPLAY  "V2 = ["WK-RIYO-CMP-CD"]"
      D    DISPLAY  "V3 = ["WK-RIYO-CMP-CD"]"
      D    DISPLAY  "V4 = ["WK-KJN-YMD    "]"
      D    DISPLAY  "V5 = ["WK-FUND-CD    "]"
      D    DISPLAY  "V6 = ["WK-PTF-CD     "]"
      D    DISPLAY  "V7 = ["WK-HYK-KRTU-CD"]"
      D    DISPLAY  "V8 = ["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  "別紙1 SQL文:["SQLSTMT3-ARR"]"
      D    DISPLAY  "別紙1 SQL長:["SQLSTMT3-LEN"]"
      *-----------------------------------------------------------------
             STRING  SQLSTMT3-ARR
                     "[V1:"WK-SYORI-YMD  "]"
                     "[V2:"WK-RIYO-CMP-CD"]"
                     "[V3:"WK-RIYO-CMP-CD"]"
                     "[V4:"WK-KJN-YMD    "]"
                     "[V5:"WK-FUND-CD    "]"
                     "[V6:"WK-PTF-CD     "]"
                     "[V7:"WK-HYK-KRTU-CD"]"
                     "[V8:"WK-GYOMU-TASK-ID"]"
             DELIMITED  BY  SIZE
             INTO  WK-ERR-SQLSTMT3
           END-IF
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD3  FROM  :SQLSTMT3
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0037"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT3    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ＳＱＬ文 PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           IF  OLBT-KBN                 OF PARM-SCZY1210-ARG1 = "BT"
           THEN
             EXEC  SQL
               EXECUTE  STMT_RECORD3
               USING  :WK-SYORI-YMD,
                      :WK-KIDOU-ID,
                      :WK-RIYO-CMP-CD,
                      :WK-RIYO-CMP-CD,
                      :WK-KJN-YMD,
                      :WK-FUND-CD,
                      :WK-PTF-CD,
                      :WK-HYK-KRTU-CD,
                      :WK-GYOMU-TASK-ID
             END-EXEC
           ELSE
             EXEC  SQL
               EXECUTE  STMT_RECORD3
               USING  :WK-SYORI-YMD,
                      :WK-RIYO-CMP-CD,
                      :WK-RIYO-CMP-CD,
                      :WK-KJN-YMD,
                      :WK-FUND-CD,
                      :WK-PTF-CD,
                      :WK-HYK-KRTU-CD,
                      :WK-GYOMU-TASK-ID
             END-EXEC
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0038"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT3    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ポートフォリオ状態更新エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           CONTINUE.
       SQL-1-EXT.
           EXIT.
      ******************************************************************
      *           実行状況管理アクセスルーチン(SELECT)をコール
      ******************************************************************
       TSDYAA31-SEL-RTN       SECTION.
           IF  OLBT-KBN                 OF PARM-SCZY1210-ARG1 = "BT"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "バッチ用のみの場合"
      D    DISPLAY  "***  実行状況管理アクセスルーチン(SEL)  START  ***"
      *-----------------------------------------------------------------
             MOVE  RIYO-CMP-CD          OF PARM-SCZY1210-ARG2
               TO  RIYO-CMP-CD          OF PARM-TSDYAA31-ARG1
                   RIYO-CMP-CD-I        OF PARM-TSDYAA31-ARG1
             MOVE  SYORI-YMD            OF PARM-SCZY1210-ARG2
               TO  SYORI-YMD-I          OF PARM-TSDYAA31-ARG1
             MOVE  KIDOU-ID             OF PARM-SCZY1210-ARG2
               TO  KIDOU-ID-I           OF PARM-TSDYAA31-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-TSDYAA31-ARG1:["
      D              RIYO-CMP-CD        OF PARM-TSDYAA31-ARG1"]"
      D    DISPLAY  "RIYO-CMP-CD-I      OF PARM-TSDYAA31-ARG1=["
      D              RIYO-CMP-CD-I      OF PARM-TSDYAA31-ARG1"]"
      D    DISPLAY  "SYORI-YMD-I        OF PARM-TSDYAA31-ARG1=["
      D              SYORI-YMD-I        OF PARM-TSDYAA31-ARG1"]"
      D    DISPLAY  "KIDOU-ID-I         OF PARM-TSDYAA31-ARG1=["
      D              KIDOU-ID-I         OF PARM-TSDYAA31-ARG1"]"
      D    DISPLAY  "PARM-TSDYAA31-ARG1= ["PARM-TSDYAA31-ARG1"]"
      D    DISPLAY  "PARM-TSDYAA31-ARG2= ["PARM-TSDYAA31-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "TSDYAA31"
           USING  PARM-TSDYAA31-INOUT
                  PARM-TSDYAA31-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD             OF PARM-TSDYAA31-ARG3:["
      D              RTN-CD             OF PARM-TSDYAA31-ARG3
      D                        (COUNTER OF PARM-TSDYAA31-ARG3)"]"
      *-----------------------------------------------------------------
             EVALUATE  RTN-CD           OF PARM-TSDYAA31-ARG3
                               (COUNTER OF PARM-TSDYAA31-ARG3)
               WHEN  CNS-RET-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード='000'(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               WHEN  CNS-RET-ORCIGAI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー(Oracle以外)の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORCIGAI  TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0039"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  PARM-TSDYAA31-ARG3
                   TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "実行状況管理アクセスルーチン(SELECT)コール エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORACLE   TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0040"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  PARM-TSDYAA31-ARG3
                   TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "実行状況管理アクセスルーチン(SELECT)コール エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  実行状況管理アクセスルーチン(SEL)  END  ***"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "オンライン(OL)の場合"
      D    DISPLAY  "実行状況管理アクセスルーチン(SEL)をコールしない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF.
       TSDYAA31-SEL-EXT.
           EXIT.
      ******************************************************************
      *                 進捗管理更新処理
      ******************************************************************
       SHINTK-KANRI-UPD-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理更新処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SHINTK-KANRI-FLG:["WK-SHINTK-KANRI-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-SHINTK-KANRI-FLG = "1"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク進捗管理データ有無区分='1'の場合"
      *-----------------------------------------------------------------
             PERFORM  CALL-TIDYAA40-RTN
           ELSE
      *----------    進捗管理テーブル更新
             PERFORM  UPD-TKDYAA40-RTN
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理更新処理  END  ***".
      *-----------------------------------------------------------------
       SHINTK-KANRI-UPD-EXT.
           EXIT.
      ******************************************************************
      *                 進捗管理INSERT処理
      ******************************************************************
       CALL-TIDYAA40-RTN      SECTION.
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  RIYO-CMP-CD            OF PARM-TIDYAA40-ARG1
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  RIYO-CMP-CD            OF PARM-TIDYAA40-ARG2
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  KJN-YMD                OF PARM-TIDYAA40-ARG2
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  FUND-CD                OF PARM-TIDYAA40-ARG2
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  PTF-CD                 OF PARM-TIDYAA40-ARG2
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  HYK-KRTU-CD            OF PARM-TIDYAA40-ARG2
           MOVE  WK-SHINTK-TASK-ID
             TO  SHINTK-TASK-ID         OF PARM-TIDYAA40-ARG2
           MOVE  SYORI-YMD              OF PARM-SCZY1210-ARG2
             TO  SYORI-YMD              OF PARM-TIDYAA40-ARG2
           MOVE  SS-SYORI-YMD           OF PARM-SCZY1210-ARG2
             TO  SS-SYORI-YMD           OF PARM-TIDYAA40-ARG2
           MOVE  BABY-MISYORI-FLG       OF PARM-SCZY1210-ARG2
             TO  BABY-MISYORI-FLG       OF PARM-TIDYAA40-ARG2
           MOVE  KIDOU-ID               OF PARM-SCZY1210-ARG2
             TO  KIDOU-ID               OF PARM-TIDYAA40-ARG2
           MOVE  "0"
             TO  JIKA-SAISR-KBN         OF PARM-TIDYAA40-ARG2
           MOVE  "0"
             TO  KJN-KEIKOKU-FLG        OF PARM-TIDYAA40-ARG2
           IF  OLBT-KBN                 OF PARM-SCZY1210-ARG1 = "BT"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "OLBT-KBN           OF PARM-SCZY1210-ARG1=["
      D              OLBT-KBN           OF PARM-SCZY1210-ARG1"]"
      D    DISPLAY  "ARG1.OL/BT区分が'BT'(バッチ用)の場合"
      *-----------------------------------------------------------------
             MOVE  JIKOU-STS            OF PARM-SCZY1210-ARG2
               TO  SHINTK-STS           OF PARM-TIDYAA40-ARG2
      *----- 最終実行終了日時 ← 初期値
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗ステータスにARG2.進捗ステータスをセット"
      D    DISPLAY  "最終実行終了日時 ← 初期値"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "OLBT-KBN           OF PARM-SCZY1210-ARG1=["
      D              OLBT-KBN           OF PARM-SCZY1210-ARG1"]"
      D    DISPLAY  "ARG1.OL/BT区分が'BT'(バッチ用)以外の場合"
      *-----------------------------------------------------------------
             MOVE  FUNCTION CURRENT-DATE(1:14)
               TO  SS-JIKOU-END-TIME    OF PARM-TIDYAA40-ARG2
             IF  WK-SHINTK-UPD-MODE-KBN = "3" THEN
               MOVE  "500"              TO SHINTK-STS
                                        OF PARM-TIDYAA40-ARG2
             ELSE
               MOVE  JIKOU-STS          OF PARM-SCZY1210-ARG2
                 TO  SHINTK-STS         OF PARM-TIDYAA40-ARG2
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SHINTK-UPD-MODE-KBN=["WK-SHINTK-UPD-MODE-KBN"]"
      D    DISPLAY  "進捗ステータスにをセット"
      D    DISPLAY  "最終実行終了日時にCURRENT-DATEで取得日時をセット"
      *-----------------------------------------------------------------
           END-IF
           MOVE  SHINTK-STS             OF PARM-TIDYAA40-ARG2
                                        TO WK-SHINTK-STS
           IF  WK-SHINTK-STS = "500" THEN
             MOVE  WK-SHINTK-TASK-ID
               TO  SAISR-SHINTK-TASK-ID OF PARM-TIDYAA40-ARG2
           ELSE
             MOVE  SPACE
               TO  SAISR-SHINTK-TASK-ID OF PARM-TIDYAA40-ARG2
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SHINTK-STS         OF PARM-TIDYAA40-ARG2=["
      D              SHINTK-STS         OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SS-JIKOU-END-TIME  OF PARM-TIDYAA40-ARG2=["
      D              SS-JIKOU-END-TIME  OF PARM-TIDYAA40-ARG2"]"
      *-----------------------------------------------------------------
      *----- 再処理起因進捗タスクID ← 初期値
      *----- 時価再処理区分 ← 初期値
      *----- 警告確認ログインユーザ会社コード ← 初期値
      *----- 警告確認ログインユーザID ← 初期値
      *----- 警告確認年月日 ← 初期値
      *----- 確定指示ログインユーザ会社コード ← 初期値
      *----- 確定指示ログインユーザID ← 初期値
      *----- 確定指示年月日 ← 初期値
      *----- 最終実行開始日時
           MOVE  FUNCTION CURRENT-DATE(1:14)
             TO  SS-JIKOU-START-TIME    OF PARM-TIDYAA40-ARG2
           IF  OLBT-KBN                 OF PARM-SCZY1210-ARG1 = "BT"
           THEN
      *----- 最終更新ユーザーID
             MOVE  KIDOU-SID            OF PARM-TSDYAA31-ARG2
               TO  SS-KIDOU-SID         OF PARM-TIDYAA40-ARG2
      *----- 最終更新処理ID
             MOVE  GYOMU-TASK-ID        OF PARM-TSDYAA31-ARG2
               TO  SS-GYOMU-TASK-ID     OF PARM-TIDYAA40-ARG2
           ELSE
             MOVE  SPACE
               TO  SS-KIDOU-SID         OF PARM-TIDYAA40-ARG2
             MOVE  SPACE
               TO  SS-GYOMU-TASK-ID     OF PARM-TIDYAA40-ARG2
           END-IF
      *----- 更新日時 ← 初期値
      *----- 更新ログインユーザ会社コード
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  UPD-LOGIN-CMP-CD       OF PARM-TIDYAA40-ARG2
      *----- 更新ユーザID ← 初期値
      *----- 更新プログラムID ← 初期値
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-TIDYAA40-ARG1:["
      D              RIYO-CMP-CD        OF PARM-TIDYAA40-ARG1"]"
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-TIDYAA40-ARG2=["
      D              RIYO-CMP-CD        OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "KJN-YMD            OF PARM-TIDYAA40-ARG2=["
      D              KJN-YMD            OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "FUND-CD            OF PARM-TIDYAA40-ARG2=["
      D              FUND-CD            OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "PTF-CD             OF PARM-TIDYAA40-ARG2=["
      D              PTF-CD             OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "HYK-KRTU-CD        OF PARM-TIDYAA40-ARG2=["
      D              HYK-KRTU-CD        OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SHINTK-TASK-ID     OF PARM-TIDYAA40-ARG2=["
      D              SHINTK-TASK-ID     OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SYORI-YMD          OF PARM-TIDYAA40-ARG2=["
      D              SYORI-YMD          OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SS-SYORI-YMD       OF PARM-TIDYAA40-ARG2=["
      D              SS-SYORI-YMD       OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "BABY-MISYORI-FLG   OF PARM-TIDYAA40-ARG2=["
      D              BABY-MISYORI-FLG   OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "KIDOU-ID           OF PARM-TIDYAA40-ARG2=["
      D              KIDOU-ID           OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SHINTK-STS         OF PARM-TIDYAA40-ARG2=["
      D              SHINTK-STS         OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SAISR-SHINTK-TASK-ID OF PARM-TIDYAA40-ARG2=["
      D              SAISR-SHINTK-TASK-ID OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "JIKA-SAISR-KBN     OF PARM-TIDYAA40-ARG2=["
      D              JIKA-SAISR-KBN     OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "KJN-KEIKOKU-FLG    OF PARM-TIDYAA40-ARG2=["
      D              KJN-KEIKOKU-FLG    OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SS-JIKOU-START-TIME  OF PARM-TIDYAA40-ARG2=["
      D              SS-JIKOU-START-TIME  OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SS-KIDOU-SID       OF PARM-TIDYAA40-ARG2=["
      D              SS-KIDOU-SID       OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "SS-GYOMU-TASK-ID   OF PARM-TIDYAA40-ARG2=["
      D              SS-GYOMU-TASK-ID   OF PARM-TIDYAA40-ARG2"]"
      D    DISPLAY  "UPD-LOGIN-CMP-CD   OF PARM-TIDYAA40-ARG2=["
      D              UPD-LOGIN-CMP-CD   OF PARM-TIDYAA40-ARG2"]"
      *-----------------------------------------------------------------
           CALL  "TIDYAA40"
           USING  PARM-TIDYAA40-INOUT
                  PARM-TIDYAA40-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD             OF PARM-TIDYAA40-ARG3:["
      D              RTN-CD             OF PARM-TIDYAA40-ARG3
      D                        (COUNTER OF PARM-TIDYAA40-ARG3)"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD             OF PARM-TIDYAA40-ARG3
                               (COUNTER OF PARM-TIDYAA40-ARG3)
             WHEN  CNS-RET-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード='000'(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
      *----------    一意制約
             WHEN   CNS-RET-CD-ITI-SEYAKU
      *----------     進捗管理テーブル更新処理
                 PERFORM  UPD-TKDYAA40-RTN
             WHEN  CNS-RET-ORCIGAI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "(システムエラー(Oracle以外)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORCIGAI    TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0041"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  PARM-TIDYAA40-ARG3
                 TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗管理アクセスルーチン(INSERT)コール エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0042"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  PARM-TIDYAA40-ARG3
                 TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗管理アクセスルーチン(INSERT)コール エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           CONTINUE.
       CALL-TIDYAA40-EXT.
           EXIT.
      ******************************************************************
      *               進捗管理テーブル更新処理
      ******************************************************************
       UPD-TKDYAA40-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  進捗管理テーブル更新処理  START *****"
      D    DISPLAY  "ワーク進捗管理データ有無区分<>'1'の場合"
      D    DISPLAY  "OLBT-KBN           OF PARM-SCZY1210-ARG1=["
      D              OLBT-KBN           OF PARM-SCZY1210-ARG1"]"
      D    DISPLAY  "WK-SHINTK-UPD-MODE-KBN:["WK-SHINTK-UPD-MODE-KBN"]"
      D    DISPLAY  "WK-CMP-SHINTK-UPD-MODE-KBN:["
      D                                   WK-CMP-SHINTK-UPD-MODE-KBN"]"
      D    DISPLAY  "WK-SHINTK-STS:["WK-SHINTK-STS"]"
      D    DISPLAY  "WK-OLD-SHINTK-STS:["WK-OLD-SHINTK-STS"]"
      D    DISPLAY  "JIKOU-STS OF PARM-SCZY1210-ARG2:["
      D                              JIKOU-STS OF PARM-SCZY1210-ARG2"]"
      *-----------------------------------------------------------------
           IF  OLBT-KBN               OF PARM-SCZY1210-ARG1 = "OL"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分＝'OL'(オンライン用)の場合"
      *-----------------------------------------------------------------
               IF  WK-SHINTK-UPD-MODE-KBN = "3" THEN
                 MOVE  "500"            TO WK-SHINTK-STS
               ELSE
                 IF  WK-SHINTK-UPD-MODE-KBN = "2" AND
                     WK-CMP-SHINTK-UPD-MODE-KBN = "2" THEN
                   IF  WK-SHINTK-STS > WK-OLD-SHINTK-STS
                     AND WK-SHINTK-STS NOT = "600" THEN
                     MOVE  WK-SHINTK-STS     TO WK-OLD-SHINTK-STS
                     MOVE  WK-KIDOU-ID-1     TO WK-OLD-KIDOU-ID
                     MOVE  WK-SS-JIKOU-START-TIME
                                             TO WK-OLD-JIKOU-START-TIME
                   END-IF
                   IF  (WK-OLD-SHINTK-STS > "100" AND
                        WK-OLD-SHINTK-STS < "500") AND
                        JIKOU-STS OF PARM-SCZY1210-ARG2 = "100" THEN
                     MOVE  "200"        TO WK-SHINTK-STS
                   ELSE
                     MOVE  JIKOU-STS    OF PARM-SCZY1210-ARG2
                                        TO WK-SHINTK-STS
                   END-IF
                 ELSE
                   MOVE  SPACE          TO WK-OLD-SHINTK-STS
                   MOVE  SPACE          TO WK-OLD-KIDOU-ID
                   MOVE  SPACE          TO WK-OLD-JIKOU-START-TIME
                   MOVE  JIKOU-STS      OF PARM-SCZY1210-ARG2
                                        TO WK-SHINTK-STS
                 END-IF
               END-IF
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'OL'(オンライン用)以外の場合"
      *-----------------------------------------------------------------
               IF  WK-SHINTK-UPD-MODE-KBN = "2" AND
                   WK-CMP-SHINTK-UPD-MODE-KBN = "2" THEN
                 IF  WK-SHINTK-STS > WK-OLD-SHINTK-STS
                   AND WK-SHINTK-STS NOT = "600" THEN
                   MOVE  WK-SHINTK-STS  TO WK-OLD-SHINTK-STS
                   MOVE  WK-KIDOU-ID-1  TO WK-OLD-KIDOU-ID
                   MOVE  WK-SS-JIKOU-START-TIME
                                        TO WK-OLD-JIKOU-START-TIME
                 END-IF
               ELSE
                 IF  WK-SHINTK-UPD-MODE-KBN NOT = "3" THEN
                   MOVE  SPACE          TO WK-OLD-SHINTK-STS
                   MOVE  SPACE          TO WK-OLD-KIDOU-ID
                   MOVE  SPACE          TO WK-OLD-JIKOU-START-TIME
                 END-IF
               END-IF
               MOVE  JIKOU-STS          OF PARM-SCZY1210-ARG2
                                        TO WK-SHINTK-STS
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SHINTK-STS:["WK-SHINTK-STS"]"
      D    DISPLAY  "WK-OLD-SHINTK-STS:["WK-OLD-SHINTK-STS"]"
      D    DISPLAY  "WK-OLD-KIDOU-ID:["WK-OLD-KIDOU-ID"]"
      D    DISPLAY  "WK-OLD-JIKOU-START-TIME:["
      D                                    WK-OLD-JIKOU-START-TIME"]"
      *-----------------------------------------------------------------
           PERFORM  SQL-2-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  進捗管理テーブル更新処理  END *****".
      *-----------------------------------------------------------------
       UPD-TKDYAA40-EXT.
           EXIT.
      ******************************************************************
      *               進捗管理の進捗ステータスを更新
      ******************************************************************
       SQL-2-RTN              SECTION.
             INITIALIZE                    WK-SQL-POINTER
                                           WK-PARM-SCZY1210-ARG2
             MOVE  1                    TO WK-SQL-POINTER
             MOVE  SYORI-YMD            OF PARM-SCZY1210-ARG2
               TO  WK-SYORI-YMD
             MOVE  SS-SYORI-YMD         OF PARM-SCZY1210-ARG2
               TO  WK-SS-SYORI-YMD
             MOVE  BABY-MISYORI-FLG     OF PARM-SCZY1210-ARG2
               TO  WK-BABY-MISYORI-FLG
             MOVE  KIDOU-ID             OF PARM-SCZY1210-ARG2
               TO  WK-KIDOU-ID
             MOVE  KIDOU-SID            OF PARM-TSDYAA31-ARG2
               TO  WK-KIDOU-SID-31
             MOVE  GYOMU-TASK-ID        OF PARM-TSDYAA31-ARG2
               TO  WK-GYOMU-TASK-ID-31
             MOVE  RIYO-CMP-CD          OF PARM-SCZY1210-ARG2
               TO  WK-RIYO-CMP-CD
             MOVE  KJN-YMD              OF PARM-SCZY1210-ARG2
               TO  WK-KJN-YMD
             MOVE  FUND-CD              OF PARM-SCZY1210-ARG2
               TO  WK-FUND-CD
             MOVE  PTF-CD               OF PARM-SCZY1210-ARG2
               TO  WK-PTF-CD
             MOVE  HYK-KRTU-CD          OF PARM-SCZY1210-ARG2
               TO  WK-HYK-KRTU-CD
             IF  WK-SHINTK-STS = "500" THEN
               MOVE  WK-SHINTK-TASK-ID  TO WK-SAISR-SHINTK-TASK-ID
             ELSE
               MOVE  SPACE              TO WK-SAISR-SHINTK-TASK-ID
             END-IF
             IF  SESION-KBN             OF PARM-SCZY1210-ARG1 = "0"
             THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'0'(先頭セッション)の場合"
      *-----------------------------------------------------------------
               IF  OLBT-KBN             OF PARM-SCZY1210-ARG1 = "OL"
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'OL'(オンライン用)の場合"
      *-----------------------------------------------------------------
                 STRING
                   "UPDATE " WK-TABLEID-1 " SET "
                   "SYORI_YMD = :V1"
                   " ,SS_SYORI_YMD = :V2"
                   " ,BABY_MISYORI_FLG = :V3"
                   " ,KIDOU_ID = :V4"
                   " ,SHINTK_STS = :V5"
                   " ,SAISR_SHINTK_TASK_ID = :V6"
                   " ,JIKA_SAISR_KBN = '0'"
                   " ,SS_JIKOU_START_TIME = '"
                    FUNCTION CURRENT-DATE(1:14)
                   "',SS_JIKOU_END_TIME = '"
                    FUNCTION CURRENT-DATE(1:14)
                   "',SS_KIDOU_SID = ' '"
                   " ,SS_GYOMU_TASK_ID = ' '"
                   " ,OLD_SHINTK_STS = :V7"
                   " ,OLD_KIDOU_ID = :V8"
                   " ,OLD_JIKOU_START_TIME = :V9"
                   " ,UPD_DATE = SYSDATE"
                   " ,UPD_LOGIN_CMP_CD = :V10"
                   " ,UPD_SID = ' '"
                   " ,UPD_PGMID = '"
                    CNS-PGM-ID
                   "'"
      *----- 更新条件
                   " WHERE RIYO_CMP_CD = :V11"
                   " AND KJN_YMD = :V12"
                   " AND FUND_CD = :V13"
                   " AND PTF_CD = :V14"
                   " AND HYK_KRTU_CD = :V15"
                   " AND SHINTK_TASK_ID = :V16"
                 DELIMITED BY SIZE
                 INTO  SQLSTMT4-ARR
                 POINTER  WK-SQL-POINTER
                 MOVE  WK-SQL-POINTER   TO SQLSTMT4-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-SYORI-YMD       "]"
      D    DISPLAY  "V2 = ["WK-SS-SYORI-YMD    "]"
      D    DISPLAY  "V3 = ["WK-BABY-MISYORI-FLG"]"
      D    DISPLAY  "V4 = ["WK-KIDOU-ID        "]"
      D    DISPLAY  "V5 = ["WK-SHINTK-STS      "]"
      D    DISPLAY  "V6 = ["WK-SAISR-SHINTK-TASK-ID"]"
      D    DISPLAY  "V7 = ["WK-OLD-SHINTK-STS  "]"
      D    DISPLAY  "V8 = ["WK-OLD-KIDOU-ID    "]"
      D    DISPLAY  "V9 = ["WK-OLD-JIKOU-START-TIME"]"
      D    DISPLAY  "V10= ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V11= ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V12= ["WK-KJN-YMD         "]"
      D    DISPLAY  "V13= ["WK-FUND-CD         "]"
      D    DISPLAY  "V14= ["WK-PTF-CD          "]"
      D    DISPLAY  "V15= ["WK-HYK-KRTU-CD     "]"
      D    DISPLAY  "V16= ["WK-SHINTK-TASK-ID  "]"
      D    DISPLAY  "別紙2 SQL文:["SQLSTMT4-ARR"]"
      D    DISPLAY  "別紙2 SQL長:["SQLSTMT4-LEN"]"
      *-----------------------------------------------------------------
                 STRING  SQLSTMT4-ARR
                     "[V1 :"WK-SYORI-YMD       "]"
                     "[V2 :"WK-SS-SYORI-YMD    "]"
                     "[V3 :"WK-BABY-MISYORI-FLG"]"
                     "[V4 :"WK-KIDOU-ID        "]"
                     "[V5 :"WK-SHINTK-STS      "]"
                     "[V6 :"WK-SAISR-SHINTK-TASK-ID"]"
                     "[V7 :"WK-OLD-SHINTK-STS  "]"
                     "[V8 :"WK-OLD-KIDOU-ID    "]"
                     "[V9 :"WK-OLD-JIKOU-START-TIME"]"
                     "[V10:"WK-RIYO-CMP-CD     "]"
                     "[V11:"WK-RIYO-CMP-CD     "]"
                     "[V12:"WK-KJN-YMD         "]"
                     "[V13:"WK-FUND-CD         "]"
                     "[V14:"WK-PTF-CD          "]"
                     "[V15:"WK-HYK-KRTU-CD     "]"
                     "[V16:"WK-SHINTK-TASK-ID  "]"
                 DELIMITED  BY  SIZE
                 INTO  WK-ERR-SQLSTMT4
               ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'BT'(バッチ用)の場合"
      D    DISPLAY  "KIDOU-SID          OF PARM-TSDYAA31-ARG2:["
      D              KIDOU-SID          OF PARM-TSDYAA31-ARG2"]"
      D    DISPLAY  "GYOMU-TASK-ID      OF PARM-TSDYAA31-ARG2:["
      D              GYOMU-TASK-ID      OF PARM-TSDYAA31-ARG2"]"
      *-----------------------------------------------------------------
                 STRING
                   "UPDATE " WK-TABLEID-1 " SET "
                   "SYORI_YMD = :V1"
                   " ,SS_SYORI_YMD = :V2"
                   " ,BABY_MISYORI_FLG = :V3"
                   " ,KIDOU_ID = :V4"
                   " ,SHINTK_STS = :V5"
                   " ,SAISR_SHINTK_TASK_ID = :V6"
                   " ,JIKA_SAISR_KBN = '0'"
                   " ,SS_JIKOU_START_TIME = '"
                    FUNCTION CURRENT-DATE(1:14)
                   "',SS_JIKOU_END_TIME = ' '"
                   " ,SS_KIDOU_SID = :V7"
                   " ,SS_GYOMU_TASK_ID = :V8"
                   " ,OLD_SHINTK_STS = :V9"
                   " ,OLD_KIDOU_ID = :V10"
                   " ,OLD_JIKOU_START_TIME = :V11"
                   " ,UPD_DATE = SYSDATE"
                   " ,UPD_LOGIN_CMP_CD = :V12"
                   " ,UPD_SID = ' '"
                   " ,UPD_PGMID = '"
                    CNS-PGM-ID
                   "'"
      *----- 更新条件
                   " WHERE RIYO_CMP_CD = :V13"
                   " AND KJN_YMD = :V14"
                   " AND FUND_CD = :V15"
                   " AND PTF_CD = :V16"
                   " AND HYK_KRTU_CD = :V17"
                   " AND SHINTK_TASK_ID = :V18"
                 DELIMITED BY SIZE
                 INTO  SQLSTMT4-ARR
                 POINTER  WK-SQL-POINTER
                 MOVE  WK-SQL-POINTER   TO SQLSTMT4-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-SYORI-YMD       "]"
      D    DISPLAY  "V2 = ["WK-SS-SYORI-YMD    "]"
      D    DISPLAY  "V3 = ["WK-BABY-MISYORI-FLG"]"
      D    DISPLAY  "V4 = ["WK-KIDOU-ID        "]"
      D    DISPLAY  "V5 = ["WK-SHINTK-STS      "]"
      D    DISPLAY  "V6 = ["WK-SAISR-SHINTK-TASK-ID"]"
      D    DISPLAY  "V7 = ["WK-KIDOU-SID-31    "]"
      D    DISPLAY  "V8 = ["WK-GYOMU-TASK-ID-31"]"
      D    DISPLAY  "V9 = ["WK-OLD-SHINTK-STS  "]"
      D    DISPLAY  "V10= ["WK-OLD-KIDOU-ID    "]"
      D    DISPLAY  "V11= ["WK-OLD-JIKOU-START-TIME"]"
      D    DISPLAY  "V12= ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V13= ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V14= ["WK-KJN-YMD         "]"
      D    DISPLAY  "V15= ["WK-FUND-CD         "]"
      D    DISPLAY  "V16= ["WK-PTF-CD          "]"
      D    DISPLAY  "V17= ["WK-HYK-KRTU-CD     "]"
      D    DISPLAY  "V18= ["WK-SHINTK-TASK-ID  "]"
      D    DISPLAY  "別紙2 SQL文:["SQLSTMT4-ARR"]"
      D    DISPLAY  "別紙2 SQL長:["SQLSTMT4-LEN"]"
      *-----------------------------------------------------------------
                 STRING  SQLSTMT4-ARR
                     "[V1 :"WK-SYORI-YMD       "]"
                     "[V2 :"WK-SS-SYORI-YMD    "]"
                     "[V3 :"WK-BABY-MISYORI-FLG"]"
                     "[V4 :"WK-KIDOU-ID        "]"
                     "[V5 :"WK-SHINTK-STS      "]"
                     "[V6 :"WK-SAISR-SHINTK-TASK-ID"]"
                     "[V7 :"WK-KIDOU-SID-31    "]"
                     "[V8 :"WK-GYOMU-TASK-ID-31"]"
                     "[V9 :"WK-OLD-SHINTK-STS  "]"
                     "[V10 :"WK-OLD-KIDOU-ID    "]"
                     "[V11:"WK-OLD-JIKOU-START-TIME"]"
                     "[V12:"WK-RIYO-CMP-CD     "]"
                     "[V13:"WK-RIYO-CMP-CD     "]"
                     "[V14:"WK-KJN-YMD         "]"
                     "[V15:"WK-FUND-CD         "]"
                     "[V16:"WK-PTF-CD          "]"
                     "[V17:"WK-HYK-KRTU-CD     "]"
                     "[V18:"WK-SHINTK-TASK-ID  "]"
                 DELIMITED  BY  SIZE
                 INTO  WK-ERR-SQLSTMT4
               END-IF
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.セッション区分が'1'(最終セッション)の場合"
      *-----------------------------------------------------------------
               IF  WK-SHINTK-STS = "500"
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ARG1.OL/BT区分が'BT'(バッチ用)の場合"
      *-----------------------------------------------------------------
                 STRING
                   "UPDATE " WK-TABLEID-1 " SET "
                   "SYORI_YMD = :V1"
                   " ,SS_SYORI_YMD = :V2"
                   " ,BABY_MISYORI_FLG = :V3"
                   " ,SHINTK_STS = :V4"
                   " ,SAISR_SHINTK_TASK_ID = :V5"
                   " ,SS_JIKOU_END_TIME = '"
                    FUNCTION CURRENT-DATE(1:14)
                   "',UPD_DATE = SYSDATE"
                   " ,UPD_LOGIN_CMP_CD = :V6"
                   " ,UPD_SID = ' '"
                   " ,UPD_PGMID = '"
                    CNS-PGM-ID
                   "'"
      *----- 更新条件
                   " WHERE RIYO_CMP_CD = :V7"
                   " AND KJN_YMD = :V8"
                   " AND FUND_CD = :V9"
                   " AND PTF_CD = :V10"
                   " AND HYK_KRTU_CD = :V11"
                   " AND SHINTK_TASK_ID = :V12"
                 DELIMITED BY SIZE
                 INTO  SQLSTMT4-ARR
                 POINTER  WK-SQL-POINTER
                 MOVE  WK-SQL-POINTER   TO SQLSTMT4-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-SYORI-YMD       "]"
      D    DISPLAY  "V2 = ["WK-SS-SYORI-YMD    "]"
      D    DISPLAY  "V3 = ["WK-BABY-MISYORI-FLG"]"
      D    DISPLAY  "V4 = ["WK-SHINTK-STS      "]"
      D    DISPLAY  "V5 = ["WK-SAISR-SHINTK-TASK-ID"]"
      D    DISPLAY  "V6 = ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V7 = ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V8 = ["WK-KJN-YMD         "]"
      D    DISPLAY  "V9 = ["WK-FUND-CD         "]"
      D    DISPLAY  "V10= ["WK-PTF-CD          "]"
      D    DISPLAY  "V11= ["WK-HYK-KRTU-CD     "]"
      D    DISPLAY  "V12= ["WK-SHINTK-TASK-ID  "]"
      D    DISPLAY  "別紙2 SQL文:["SQLSTMT4-ARR"]"
      D    DISPLAY  "別紙2 SQL長:["SQLSTMT4-LEN"]"
      *-----------------------------------------------------------------
                 STRING  SQLSTMT4-ARR
                         "[V1 :"WK-SYORI-YMD       "]"
                         "[V2 :"WK-SS-SYORI-YMD    "]"
                         "[V3 :"WK-BABY-MISYORI-FLG"]"
                         "[V4 :"WK-SHINTK-STS      "]"
                         "[V5 :"WK-SAISR-SHINTK-TASK-ID"]"
                         "[V6 :"WK-RIYO-CMP-CD     "]"
                         "[V7 :"WK-RIYO-CMP-CD     "]"
                         "[V8 :"WK-KJN-YMD         "]"
                         "[V9 :"WK-FUND-CD         "]"
                         "[V10:"WK-PTF-CD          "]"
                         "[V11:"WK-HYK-KRTU-CD     "]"
                         "[V12:"WK-SHINTK-TASK-ID  "]"
                 DELIMITED  BY  SIZE
                 INTO  WK-ERR-SQLSTMT4
               ELSE
                 STRING
                   "UPDATE " WK-TABLEID-1 " SET "
                   "SYORI_YMD = :V1"
                   " ,SS_SYORI_YMD = :V2"
                   " ,BABY_MISYORI_FLG = :V3"
                   " ,SHINTK_STS = :V4"
                   " ,SS_JIKOU_END_TIME = '"
                    FUNCTION CURRENT-DATE(1:14)
                   "',UPD_DATE = SYSDATE"
                   " ,UPD_LOGIN_CMP_CD = :V5"
                   " ,UPD_SID = ' '"
                   " ,UPD_PGMID = '"
                    CNS-PGM-ID
                   "'"
      *----- 更新条件
                   " WHERE RIYO_CMP_CD = :V6"
                   " AND KJN_YMD = :V7"
                   " AND FUND_CD = :V8"
                   " AND PTF_CD = :V9"
                   " AND HYK_KRTU_CD = :V10"
                   " AND SHINTK_TASK_ID = :V11"
                 DELIMITED BY SIZE
                 INTO  SQLSTMT4-ARR
                 POINTER  WK-SQL-POINTER
                 MOVE  WK-SQL-POINTER   TO SQLSTMT4-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-SYORI-YMD       "]"
      D    DISPLAY  "V2 = ["WK-SS-SYORI-YMD    "]"
      D    DISPLAY  "V3 = ["WK-BABY-MISYORI-FLG"]"
      D    DISPLAY  "V4 = ["WK-SHINTK-STS      "]"
      D    DISPLAY  "V5 = ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V6 = ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V7 = ["WK-KJN-YMD         "]"
      D    DISPLAY  "V8 = ["WK-FUND-CD         "]"
      D    DISPLAY  "V9 = ["WK-PTF-CD          "]"
      D    DISPLAY  "V10= ["WK-HYK-KRTU-CD     "]"
      D    DISPLAY  "V11= ["WK-SHINTK-TASK-ID  "]"
      D    DISPLAY  "別紙2 SQL文:["SQLSTMT4-ARR"]"
      D    DISPLAY  "別紙2 SQL長:["SQLSTMT4-LEN"]"
      *-----------------------------------------------------------------
                 STRING  SQLSTMT4-ARR
                         "[V1 :"WK-SYORI-YMD       "]"
                         "[V2 :"WK-SS-SYORI-YMD    "]"
                         "[V3 :"WK-BABY-MISYORI-FLG"]"
                         "[V4 :"WK-SHINTK-STS      "]"
                         "[V5 :"WK-RIYO-CMP-CD     "]"
                         "[V6 :"WK-RIYO-CMP-CD     "]"
                         "[V7 :"WK-KJN-YMD         "]"
                         "[V8 :"WK-FUND-CD         "]"
                         "[V9 :"WK-PTF-CD          "]"
                         "[V10:"WK-HYK-KRTU-CD     "]"
                         "[V11:"WK-SHINTK-TASK-ID  "]"
                 DELIMITED  BY  SIZE
                 INTO  WK-ERR-SQLSTMT4
               END-IF
             END-IF
      *---------- ＳＱＬ文 PREPARE
             EXEC  SQL
               PREPARE  STMT_RECORD4  FROM  :SQLSTMT4
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                          OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORACLE     TO RTN-CD
                                          OF PARM-SCZY1170-ARG1
                 MOVE  SQLCODE            TO DETAIL-RTN-CD
                                          OF PARM-SCZY1170-ARG1
                 MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                          OF PARM-SCZY1170-ARG1
                 MOVE  "0043"             TO ERR-POS
                                          OF PARM-SCZY1170-ARG1
                 MOVE  WK-ERR-SQLSTMT4    TO FREE-MSG
                                          OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ＳＱＬ文 PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
             IF  SESION-KBN             OF PARM-SCZY1210-ARG1 = "0"
             THEN
               IF  OLBT-KBN             OF PARM-SCZY1210-ARG1 = "OL"
               THEN
                 EXEC  SQL
                   EXECUTE  STMT_RECORD4
                   USING  :WK-SYORI-YMD,
                          :WK-SS-SYORI-YMD,
                          :WK-BABY-MISYORI-FLG,
                          :WK-KIDOU-ID,
                          :WK-SHINTK-STS,
                          :WK-SAISR-SHINTK-TASK-ID,
                          :WK-OLD-SHINTK-STS,
                          :WK-OLD-KIDOU-ID,
                          :WK-OLD-JIKOU-START-TIME,
                          :WK-RIYO-CMP-CD,
                          :WK-RIYO-CMP-CD,
                          :WK-KJN-YMD,
                          :WK-FUND-CD,
                          :WK-PTF-CD,
                          :WK-HYK-KRTU-CD,
                          :WK-SHINTK-TASK-ID
                 END-EXEC
               ELSE
                 EXEC  SQL
                   EXECUTE  STMT_RECORD4
                   USING  :WK-SYORI-YMD,
                          :WK-SS-SYORI-YMD,
                          :WK-BABY-MISYORI-FLG,
                          :WK-KIDOU-ID,
                          :WK-SHINTK-STS,
                          :WK-SAISR-SHINTK-TASK-ID,
                          :WK-KIDOU-SID-31,
                          :WK-GYOMU-TASK-ID-31,
                          :WK-OLD-SHINTK-STS,
                          :WK-OLD-KIDOU-ID,
                          :WK-OLD-JIKOU-START-TIME,
                          :WK-RIYO-CMP-CD,
                          :WK-RIYO-CMP-CD,
                          :WK-KJN-YMD,
                          :WK-FUND-CD,
                          :WK-PTF-CD,
                          :WK-HYK-KRTU-CD,
                          :WK-SHINTK-TASK-ID
                 END-EXEC
               END-IF
             ELSE
               IF  WK-SHINTK-STS = "500"
               THEN
                 EXEC  SQL
                   EXECUTE  STMT_RECORD4
                   USING  :WK-SYORI-YMD,
                          :WK-SS-SYORI-YMD,
                          :WK-BABY-MISYORI-FLG,
                          :WK-SHINTK-STS,
                          :WK-SAISR-SHINTK-TASK-ID,
                          :WK-RIYO-CMP-CD,
                          :WK-RIYO-CMP-CD,
                          :WK-KJN-YMD,
                          :WK-FUND-CD,
                          :WK-PTF-CD,
                          :WK-HYK-KRTU-CD,
                          :WK-SHINTK-TASK-ID
                 END-EXEC
               ELSE
                 EXEC  SQL
                   EXECUTE  STMT_RECORD4
                   USING  :WK-SYORI-YMD,
                          :WK-SS-SYORI-YMD,
                          :WK-BABY-MISYORI-FLG,
                          :WK-SHINTK-STS,
                          :WK-RIYO-CMP-CD,
                          :WK-RIYO-CMP-CD,
                          :WK-KJN-YMD,
                          :WK-FUND-CD,
                          :WK-PTF-CD,
                          :WK-HYK-KRTU-CD,
                          :WK-SHINTK-TASK-ID
                 END-EXEC
               END-IF
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORACLE   TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  SQLCODE          TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0044"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "1"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  WK-ERR-SQLSTMT4  TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗管理更新エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE.
       SQL-2-EXT.
           EXIT.
      ******************************************************************
      *                 進捗管理(年月単位)更新処理
      ******************************************************************
       SHINTK-KANRI-YM1-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理(年月単位)更新処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "KJN-YMD            OF PARM-SCZY1210-ARG2=["
      D              KJN-YMD            OF PARM-SCZY1210-ARG2"]"
      D    DISPLAY  "WK-SHINTK-TASK-ID = ["WK-SHINTK-TASK-ID"]"
      *-----------------------------------------------------------------
      *----- ワーク基準年月日/基準年月FROM  ←  ARG2.基準年月日/基準年月
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD-FROM-1
      *----- ワーク基準年月日/基準年月TO  ←  ARG2.基準年月日/基準年月
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD-TO-1
      *----- ワーク進捗タスクID  ←  3.2.1.処理で取得した進捗タスクID
           MOVE  WK-SHINTK-TASK-ID
             TO  WK-SHINTK-TASK-ID-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KJN-YMD-FROM-1   = ["WK-KJN-YMD-FROM-1  "]"
      D    DISPLAY  "WK-KJN-YMD-TO-1     = ["WK-KJN-YMD-TO-1    "]"
      D    DISPLAY  "WK-SHINTK-TASK-ID-1 = ["WK-SHINTK-TASK-ID-1"]"
      *-----------------------------------------------------------------
      *----- 進捗管理MAX情報取得処理をコールする
           PERFORM  CALL-SCZY1200-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理(年月単位)更新処理  END  ***".
      *-----------------------------------------------------------------
       SHINTK-KANRI-YM1-EXT.
           EXIT.
      ******************************************************************
      *                     進捗管理更新処理
      ******************************************************************
       SHINTK-UPD-2-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理更新処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                      WK-SQL-POINTER
                                           SQLSTMT10
                                           WK-ERR-SQLSTMT10
                                           H-SHINTK-STS
                                           H-OLD-SHINTK-STS
                                           WK-SHINTK-STS
                                           WK-OLD-SHINTK-STS
                                           WK-PARM-SCZY1210-ARG2
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  KJN-YMD                OF PARM-SCZY1210-ARG2
             TO  WK-KJN-YMD
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  WK-GYOMU-TASK-ID
           STRING
             "SELECT SHINTK_STS,OLD_SHINTK_STS FROM "
              WK-TABLEID-1
             " WHERE RIYO_CMP_CD  = :V1"
             " AND KJN_YMD        = :V2"
             " AND FUND_CD        = :V3"
             " AND PTF_CD         = :V4"
             " AND HYK_KRTU_CD    = :V5"
             " AND SHINTK_TASK_ID = :V6"
           DELIMITED  BY  SIZE
           INTO  SQLSTMT10-ARR
           POINTER  WK-SQL-POINTER
           MOVE     WK-SQL-POINTER      TO SQLSTMT10-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD   "]"
      D    DISPLAY  "V2 = ["WK-KJN-YMD       "]"
      D    DISPLAY  "V3 = ["WK-FUND-CD       "]"
      D    DISPLAY  "V4 = ["WK-PTF-CD        "]"
      D    DISPLAY  "V5 = ["WK-HYK-KRTU-CD   "]"
      D    DISPLAY  "V6 = ["WK-SHINTK-TASK-ID"]"
      D    DISPLAY  "別紙10 SQL文:["SQLSTMT10-ARR"]"
      D    DISPLAY  "別紙10 SQL長:["SQLSTMT10-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT10-ARR
                   "[V1:"WK-RIYO-CMP-CD   "]"
                   "[V2:"WK-KJN-YMD       "]"
                   "[V3:"WK-FUND-CD       "]"
                   "[V4:"WK-PTF-CD        "]"
                   "[V5:"WK-HYK-KRTU-CD   "]"
                   "[V6:"WK-SHINTK-TASK-ID"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT10
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD10  FROM  :SQLSTMT10
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0045"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT10   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL10  PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL10  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-OPEN  START  ***"
      *-----------------------------------------------------------------
      *---------- カーソル 宣言
           EXEC  SQL
             DECLARE  CUR101  CURSOR  FOR  STMT_RECORD10
           END-EXEC
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CUR101
             USING  :WK-RIYO-CMP-CD,
                    :WK-KJN-YMD,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-SHINTK-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CUR101-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR10-OPEN-FLG = ["WK-CUR101-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0046"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT10   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-OPEN  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-OPEN  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-FETCH  START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL  FETCH  CUR101
             INTO
      *---------- 進捗ステータス
               :H-SHINTK-STS,
               :H-OLD-SHINTK-STS
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  H-OLD-SHINTK-STS   TO  WK-OLD-SHINTK-STS
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      D    DISPLAY  "WK-OLD-SHINTK-STS:["WK-OLD-SHINTK-STS"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0047"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT10   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-FETCH  エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-FETCH  END  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-CLOSE  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CUR101
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  "0"                TO WK-CUR101-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR10-OPEN-FLG = ["WK-CUR101-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0048"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT10   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-CLOSE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR10-CLOSE  END  ***"
      D    DISPLAY  "WK-SHINTK-UPD-MODE-KBN:["WK-SHINTK-UPD-MODE-KBN"]"
      D    DISPLAY  "WK-CMP-SHINTK-UPD-MODE-KBN:["
      D                                   WK-CMP-SHINTK-UPD-MODE-KBN"]"
      D    DISPLAY  "WK-SHINTK-STS:["WK-SHINTK-STS"]"
      D    DISPLAY  "WK-OLD-SHINTK-STS:["WK-OLD-SHINTK-STS"]"
      D    DISPLAY  "JIKOU-STS OF PARM-SCZY1210-ARG2:["
      D                              JIKOU-STS OF PARM-SCZY1210-ARG2"]"
      *-----------------------------------------------------------------
           IF  WK-SHINTK-UPD-MODE-KBN = "3" THEN
             MOVE  "500"           TO WK-SHINTK-STS
           ELSE
             IF  WK-SHINTK-UPD-MODE-KBN = "2" AND
                 WK-CMP-SHINTK-UPD-MODE-KBN = "2" THEN
               IF  (WK-OLD-SHINTK-STS > "100" AND
                    WK-OLD-SHINTK-STS < "500") AND
                    JIKOU-STS OF PARM-SCZY1210-ARG2 = "100" THEN
                 MOVE  "200"         TO WK-SHINTK-STS
               ELSE
                 MOVE  JIKOU-STS     OF PARM-SCZY1210-ARG2
                                     TO WK-SHINTK-STS
               END-IF
             ELSE
               MOVE  JIKOU-STS       OF PARM-SCZY1210-ARG2
                                     TO WK-SHINTK-STS
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-SHINTK-STS:["WK-SHINTK-STS"]"
      *-----------------------------------------------------------------
           PERFORM  SQL-2-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理更新処理  END  ***".
      *-----------------------------------------------------------------
       SHINTK-UPD-2-EXT.
           EXIT.
      ******************************************************************
      *          処理中の進捗タスクID過去データ再処理要更新処理
      ******************************************************************
       SAISYRI-DATA-UPD-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗タスクID過去データ更新処理  START  ***"
      *-----------------------------------------------------------------
           IF  WK-PAST-REDO-KBN = "1"
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク過去データ再処理区分='1'(再処理要)の場合"
      *-----------------------------------------------------------------
             INITIALIZE                    WK-SQL-POINTER
                                           WK-PARM-SCZY1210-ARG2
             MOVE  1                    TO WK-SQL-POINTER
             MOVE  RIYO-CMP-CD          OF PARM-SCZY1210-ARG2
               TO  WK-RIYO-CMP-CD
             MOVE  KJN-YMD              OF PARM-SCZY1210-ARG2
               TO  WK-KJN-YMD
             MOVE  FUND-CD              OF PARM-SCZY1210-ARG2
               TO  WK-FUND-CD
             MOVE  PTF-CD               OF PARM-SCZY1210-ARG2
               TO  WK-PTF-CD
             MOVE  HYK-KRTU-CD          OF PARM-SCZY1210-ARG2
               TO  WK-HYK-KRTU-CD
             STRING
               "UPDATE " WK-TABLEID-1 " SET "
               "SHINTK_STS = '500'"
               " ,SAISR_SHINTK_TASK_ID = :V1"
               " ,UPD_DATE = SYSDATE"
               " ,UPD_LOGIN_CMP_CD = :V2"
               " ,UPD_SID = ' '"
               " ,UPD_PGMID = '"
                CNS-PGM-ID
               "' WHERE RIYO_CMP_CD = :V3"
               " AND KJN_YMD > :V4"
               " AND FUND_CD = :V5"
               " AND PTF_CD = :V6"
               " AND HYK_KRTU_CD = :V7"
               " AND SHINTK_TASK_ID = :V8"
             DELIMITED BY SIZE
             INTO  SQLSTMT5-ARR
             POINTER  WK-SQL-POINTER
             MOVE  WK-SQL-POINTER       TO SQLSTMT5-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-SHINTK-TASK-ID"]"
      D    DISPLAY  "V2 = ["WK-RIYO-CMP-CD   "]"
      D    DISPLAY  "V3 = ["WK-RIYO-CMP-CD   "]"
      D    DISPLAY  "V4 = ["WK-KJN-YMD       "]"
      D    DISPLAY  "V5 = ["WK-FUND-CD       "]"
      D    DISPLAY  "V6 = ["WK-PTF-CD        "]"
      D    DISPLAY  "V7 = ["WK-HYK-KRTU-CD   "]"
      D    DISPLAY  "V8 = ["WK-SHINTK-TASK-ID"]"
      D    DISPLAY  "別紙3 SQL文:["SQLSTMT5-ARR"]"
      D    DISPLAY  "別紙3 SQL長:["SQLSTMT5-LEN"]"
      *-----------------------------------------------------------------
             STRING  SQLSTMT5-ARR
                     "[V1 :"WK-SHINTK-TASK-ID"]"
                     "[V2 :"WK-RIYO-CMP-CD   "]"
                     "[V3 :"WK-RIYO-CMP-CD   "]"
                     "[V4 :"WK-KJN-YMD       "]"
                     "[V5 :"WK-FUND-CD       "]"
                     "[V6 :"WK-PTF-CD        "]"
                     "[V7 :"WK-HYK-KRTU-CD   "]"
                     "[V8 :"WK-SHINTK-TASK-ID"]"
             DELIMITED  BY  SIZE
             INTO  WK-ERR-SQLSTMT5
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD5  FROM  :SQLSTMT5
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0049"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT5    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           EXEC  SQL
             EXECUTE  STMT_RECORD5
             USING  :WK-SHINTK-TASK-ID,
                    :WK-RIYO-CMP-CD,
                    :WK-RIYO-CMP-CD,
                    :WK-KJN-YMD,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-SHINTK-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               WHEN  CNS-SQL-NODATA
                 CONTINUE
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORACLE   TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  SQLCODE          TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0050"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "1"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  WK-ERR-SQLSTMT5  TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗タスクID過去データ再処理要更新  エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗管理(年月単位)更新処理"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "KJN-YMD            OF PARM-SCZY1210-ARG2=["
      D              KJN-YMD            OF PARM-SCZY1210-ARG2"]"
      D    DISPLAY  "WK-SHINTK-TASK-ID = ["WK-SHINTK-TASK-ID"]"
      D    DISPLAY  "ワーク件数 = ["WK-COUNT"]"
      D    DISPLAY  "*ワーク進捗管理情報編集処理  START *"
      *-----------------------------------------------------------------
      *----- ワーク進捗管理情報編集処理
      *----- ワーク件数←ワーク件数 + 1
             COMPUTE  WK-COUNT = WK-COUNT + CNS-N-1
      *----- ワーク基準年月日/基準年月FROM(ワーク件数)
      *      ←  ARG2.基準年月日/基準年月
             MOVE  KJN-YMD             OF  PARM-SCZY1210-ARG2
               TO  WK-KJN-FROM         OF  WK-KJN-TASK
                                       OF  WK-KENSU-GRP(WK-COUNT)
      *----- ワーク基準年月日/基準年月TO(ワーク件数)  ←  99999999
             MOVE  99999999
               TO  WK-KJN-TO           OF  WK-KJN-TASK
                                       OF  WK-KENSU-GRP(WK-COUNT)
      *----- ワーク進捗タスクID(ワーク件数)
      *      ←ワーク再処理起因進捗タスクID
             MOVE  WK-SHINTK-TASK-ID
               TO  WK-TASK-ID          OF  WK-KJN-TASK
                                       OF  WK-KENSU-GRP(WK-COUNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク件数 = ["WK-COUNT"]"
      D    DISPLAY  "ワーク基準年月日/基準年月FROM("WK-COUNT")= ["
      D              WK-KJN-FROM       OF  WK-KJN-TASK
      D                                OF  WK-KENSU-GRP(WK-COUNT)"]"
      D    DISPLAY  "ワーク基準年月日/基準年月TO("WK-COUNT")= ["
      D              WK-KJN-TO         OF  WK-KJN-TASK
      D                                OF  WK-KENSU-GRP(WK-COUNT)"]"
      D    DISPLAY  "ワーク進捗タスクID("WK-COUNT")= ["
      D              WK-TASK-ID        OF  WK-KJN-TASK
      D                                OF  WK-KENSU-GRP(WK-COUNT)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得した過去データ再処理区分<>'1'場合、処理を続く"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗タスクID過去データ更新処理  END  ***".
      *-----------------------------------------------------------------
       SAISYRI-DATA-UPD-EXT.
           EXIT.
      ******************************************************************
      *             バッチメッセージＩＮＳルーチンをコール
      ******************************************************************
       CALL-SCZY7080-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  バッチメッセージＩＮＳルーチン  START  ***"
      *-----------------------------------------------------------------
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  RIYO-CMP-CD            OF PARM-SCZY7080-ARG1
           MOVE  SYORI-YMD              OF PARM-SCZY1210-ARG2
             TO  SYORI-YMD              OF PARM-SCZY7080-ARG1
           MOVE  KIDOU-ID               OF PARM-SCZY1210-ARG2
             TO  KIDOU-ID               OF PARM-SCZY7080-ARG1
           MOVE  GYOMU-TASK-ID          OF PARM-SCZY1210-ARG2
             TO  GYOMU-TASK-ID          OF PARM-SCZY7080-ARG1
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  FUND-CD                OF PARM-SCZY7080-ARG2(1)
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  PTF-CD                 OF PARM-SCZY7080-ARG2(1)
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  HYK-KRTU-CD            OF PARM-SCZY7080-ARG2(1)
           MOVE  REP-ID                 OF PARM-SCZY1210-ARG2
             TO  REP-ID                 OF PARM-SCZY7080-ARG2(1)
           MOVE  REP-ANY-CD             OF PARM-SCZY1210-ARG2
             TO  REP-ANY-CD             OF PARM-SCZY7080-ARG2(1)
           MOVE  KJN-YMD-FROM           OF PARM-SCZY1210-ARG2
             TO  KJN-YMD-FROM           OF PARM-SCZY7080-ARG2(1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-SCZY7080-ARG1:["
      D              RIYO-CMP-CD        OF PARM-SCZY7080-ARG1"]"
      D    DISPLAY  "SYORI-YMD          OF PARM-SCZY7080-ARG1:["
      D              SYORI-YMD          OF PARM-SCZY7080-ARG1"]"
      D    DISPLAY  "KIDOU-ID           OF PARM-SCZY7080-ARG1:["
      D              KIDOU-ID           OF PARM-SCZY7080-ARG1"]"
      D    DISPLAY  "GYOMU-TASK-ID      OF PARM-SCZY7080-ARG1:["
      D              GYOMU-TASK-ID      OF PARM-SCZY7080-ARG1"]"
      D    DISPLAY  "FUND-CD            OF PARM-SCZY7080-ARG2:["
      D              FUND-CD            OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "PTF-CD             OF PARM-SCZY7080-ARG2:["
      D              PTF-CD             OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "HYK-KRTU-CD        OF PARM-SCZY7080-ARG2:["
      D              HYK-KRTU-CD        OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "REP-ID             OF PARM-SCZY7080-ARG2:["
      D              REP-ID             OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "REP-ANY-CD         OF PARM-SCZY7080-ARG2:["
      D              REP-ANY-CD         OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "KJN-YMD-FROM       OF PARM-SCZY7080-ARG2:["
      D              KJN-YMD-FROM       OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "MSG-ID             OF PARM-SCZY7080-ARG2:["
      D              MSG-ID             OF PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY7080-ARG2:["
      D              FREE-MSG           OF PARM-SCZY7080-ARG2(1)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY7080"
           USING  PARM-SCZY7080-INOUT
                  PARM-SCZY7080-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD             OF PARM-SCZY7080-ARG3:["
      D              RTN-CD             OF PARM-SCZY7080-ARG3
      D                        (COUNTER OF PARM-SCZY7080-ARG3)"]"
      *-----------------------------------------------------------------
             EVALUATE  RTN-CD           OF PARM-SCZY7080-ARG3
                               (COUNTER OF PARM-SCZY7080-ARG3)
               WHEN  CNS-RET-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード='000'(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               WHEN  CNS-RET-ORACLE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー(Oracle)の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORACLE   TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0051"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  PARM-SCZY7080-ARG3
                   TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  バッチメッセージＩＮＳエラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORCIGAI  TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0052"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  PARM-SCZY7080-ARG3
                   TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  バッチメッセージＩＮＳエラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  バッチメッセージＩＮＳルーチン  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY7080-EXT.
           EXIT.
      ******************************************************************
      *             進捗管理MAX情報取得処理
      ******************************************************************
       CALL-SCZY1200-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理(年月単位)INSUPDルーチン  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1200-INOUT
                       PARM-SCZY1200-RTNPKG
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  RIYO-CMP-CD            OF PARM-SCZY1200-ARG1
           MOVE  WK-KJN-YMD-FROM-1
             TO  KJN-YMD-FROM           OF PARM-SCZY1200-ARG1
           MOVE  WK-KJN-YMD-TO-1
             TO  KJN-YMD-TO             OF PARM-SCZY1200-ARG1
           MOVE  WK-SHINTK-TASK-ID-1
             TO  SHINTK-TASK-ID         OF PARM-SCZY1200-ARG1
           MOVE  FUND-CD                OF PARM-SCZY1210-ARG2
             TO  FUND-CD                OF PARM-SCZY1200-ARG1
           MOVE  PTF-CD                 OF PARM-SCZY1210-ARG2
             TO  PTF-CD                 OF PARM-SCZY1200-ARG1
           MOVE  HYK-KRTU-CD            OF PARM-SCZY1210-ARG2
             TO  HYK-KRTU-CD            OF PARM-SCZY1200-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RIYO-CMP-CD        OF PARM-SCZY1200-ARG1:["
      D              RIYO-CMP-CD        OF PARM-SCZY1200-ARG1"]"
      D    DISPLAY  "KJN-YMD-FROM       OF PARM-SCZY1200-ARG1:["
      D              KJN-YMD-FROM       OF PARM-SCZY1200-ARG1"]"
      D    DISPLAY  "KJN-YMD-TO         OF PARM-SCZY1200-ARG1:["
      D              KJN-YMD-TO         OF PARM-SCZY1200-ARG1"]"
      D    DISPLAY  "SHINTK-TASK-ID     OF PARM-SCZY1200-ARG1:["
      D              SHINTK-TASK-ID     OF PARM-SCZY1200-ARG1"]"
      D    DISPLAY  "FUND-CD            OF PARM-SCZY1200-ARG1:["
      D              FUND-CD            OF PARM-SCZY1200-ARG1"]"
      D    DISPLAY  "PTF-CD             OF PARM-SCZY1200-ARG1:["
      D              PTF-CD             OF PARM-SCZY1200-ARG1"]"
      D    DISPLAY  "HYK-KRTU-CD        OF PARM-SCZY1200-ARG1:["
      D              HYK-KRTU-CD        OF PARM-SCZY1200-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1200"
           USING  PARM-SCZY1200-INOUT
                  PARM-SCZY1200-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1200-ARG2:["
      D              RTN-CD             OF PARM-SCZY1200-ARG2
      D                        (COUNTER OF PARM-SCZY1200-ARG2)"]"
      *-----------------------------------------------------------------
             EVALUATE  RTN-CD           OF PARM-SCZY1200-ARG2
                               (COUNTER OF PARM-SCZY1200-ARG2)
               WHEN  CNS-RET-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード='000'(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
                 CONTINUE
               WHEN  CNS-RET-ORACLE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "システムエラー(Oracle)の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORACLE   TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0053"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  PARM-SCZY1200-ARG2
                   TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理(年月単位)ＩＮＳＵＰＤエラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "上記以外の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORCIGAI  TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0054"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  PARM-SCZY1200-ARG2
                   TO  PARM-SCZY1170-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理(年月単位)ＩＮＳＵＰＤエラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "PARM-SCZY1170-ARG2:[" PARM-SCZY1170-ARG2"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗管理(年月単位)INSUPDルーチン  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY1200-EXT.
           EXIT.
      ******************************************************************
      *     関連進捗タスクID通常、先日付、過去データ再処理要更新処理
      ******************************************************************
       KR-SHINTKID-UPD2-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  関連進捗タスクID再処理要更新処理  START  ***"
      D    DISPLAY  "REDO-KJN-YMD-FROM OF PARM-SCZY1210-ARG2:["
      D              REDO-KJN-YMD-FROM OF PARM-SCZY1210-ARG2"]"
      D    DISPLAY  "SS-SYORI-YMD    OF PARM-SCZY1210-ARG2:["
      D              SS-SYORI-YMD    OF PARM-SCZY1210-ARG2"]"
      *-----------------------------------------------------------------
             IF  REDO-KJN-YMD-FROM OF PARM-SCZY1210-ARG2 = 0 THEN
               IF  SS-SYORI-YMD    OF PARM-SCZY1210-ARG2 = 0 THEN
                 MOVE  KJN-YMD     OF PARM-SCZY1210-ARG2
                                   TO WK-KJN-YMD-FROM-1
               ELSE
                 MOVE  SS-SYORI-YMD
                                   OF PARM-SCZY1210-ARG2
                                   TO WK-KJN-YMD-FROM-1
               END-IF
             ELSE
               MOVE  REDO-KJN-YMD-FROM
                                   OF PARM-SCZY1210-ARG2
                                   TO WK-KJN-YMD-FROM-1
             END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KJN-YMD-FROM-1   = ["WK-KJN-YMD-FROM-1  "]"
      *-----------------------------------------------------------------
      *---------- 動態的SQL文作成
             PERFORM  LINK-SQL2-RTN
      *---------- カーソルCUR OPEN
             PERFORM  CUR-OPEN2-RTN
      *---------- カーソルCUR FETCH
             PERFORM  CUR-FETCH2-RTN
      *---------- カーソルCUR CLOSE
             PERFORM  CUR-CLOSE2-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  関連進捗タスクID再処理要更新処理  END  ***".
      *-----------------------------------------------------------------
       KR-SHINTKID-UPD2-EXT.
           EXIT.
      ******************************************************************
      *    動態的SQL文作成
      ******************************************************************
       LINK-SQL2-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL2-RTN  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                      WK-SQL-POINTER
                                           WK-PARM-SCZY1210-ARG2
           MOVE  1                      TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD            OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           STRING
             "SELECT T1.KR_SHINTK_TASK_ID,T2.PAST_REDO_KBN FROM "
              WK-TABLEID-3
             " T1,"
              WK-TABLEID-5
             " T2"
             " WHERE T1.RIYO_CMP_CD = :V1"
             " AND T1.SHINTK_TASK_ID = :V2"
             " AND T1.SHINTK_TASK_SKKK_KBN = '1'"
             " AND T1.RIYO_CMP_CD = T2.RIYO_CMP_CD"
             " AND T1.KR_SHINTK_TASK_ID = T2.SHINTK_TASK_ID"
             " ORDER BY KR_SHINTK_TASK_ID"
           DELIMITED BY SIZE
           INTO  SQLSTMT06-ARR
           POINTER  WK-SQL-POINTER
           MOVE  WK-SQL-POINTER         TO SQLSTMT06-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-RIYO-CMP-CD   "]"
      D    DISPLAY  "V2 = ["WK-SHINTK-TASK-ID"]"
      D    DISPLAY  "別紙4 SQL文:["SQLSTMT06-ARR"]"
      D    DISPLAY  "別紙4 SQL長:["SQLSTMT06-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT06-ARR
                   "[V1 :"WK-RIYO-CMP-CD   "]"
                   "[V2 :"WK-SHINTK-TASK-ID"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT06
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD06  FROM  :SQLSTMT06
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0061"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT06   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL2  PREPARE  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL2-RTN  END  ***".
      *-----------------------------------------------------------------
       LINK-SQL2-EXT.
           EXIT.
      ******************************************************************
      *    カーソル  OPEN
      ******************************************************************
       CUR-OPEN2-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR-OPEN2-RTN  START  ***"
      *-----------------------------------------------------------------
      *---------- カーソル宣言
           EXEC  SQL
             DECLARE  CUR06  CURSOR  FOR  STMT_RECORD06
           END-EXEC
      *---------- カーソル OPEN
           EXEC  SQL
             OPEN  CUR06
             USING  :WK-RIYO-CMP-CD,
                    :WK-SHINTK-TASK-ID
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               MOVE  "1"                TO WK-CUR06-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR06-OPEN-FLG = ["WK-CUR06-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0062"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT06   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR-OPEN2  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR-OPEN2-RTN  END  ***".
      *-----------------------------------------------------------------
       CUR-OPEN2-EXT.
           EXIT.
      ******************************************************************
      *    カーソル FETCH
      ******************************************************************
       CUR-FETCH2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR-FETCH2-RTN  START  ***"
      *-----------------------------------------------------------------
           PERFORM  UNTIL  WK-FETCH06-END-FLG = "1"
             INITIALIZE  H-SHINTK-TASK-ID,
                         H-PAST-REDO-KBN
             EXEC  SQL  FETCH  CUR06
               INTO
      *---------- 進捗タスクID
                 :H-SHINTK-TASK-ID,
                 :H-PAST-REDO-KBN
             END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      D    DISPLAY  "H-SHINTK-TASK-ID:["H-SHINTK-TASK-ID"]"
      D    DISPLAY  "H-PAST-REDO-KBN:[" H-PAST-REDO-KBN "]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  進捗タスク詳細情報取得処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  LINK-SQL  START  ***"
      D    DISPLAY  "WK-PAST-DATA-REDO-KBN:["WK-PAST-DATA-REDO-KBN"]"
      *-----------------------------------------------------------------
                 IF  WK-PAST-DATA-REDO-KBN = "1" THEN
      *----- ワーク基準年月日/基準年月TO  ←  99999999
                   MOVE  99999999
                     TO  WK-KJN-YMD-TO-1
      *----- ワーク進捗タスクID  ←  フェッチした進捗タスクID
                   MOVE  H-SHINTK-TASK-ID
                     TO  WK-SHINTK-TASK-ID-1
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      D    DISPLAY  "WK-PAST-REDO-KBN:["WK-PAST-REDO-KBN"]"
      D    DISPLAY  "H-PAST-REDO-KBN:["H-PAST-REDO-KBN"]"
      *-----------------------------------------------------------------
                   IF  WK-PAST-REDO-KBN = "1" OR H-PAST-REDO-KBN = "1"
                   THEN
                     MOVE  "1"            TO WK-PAST-DATA-REDO-KBN
                   END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-PAST-DATA-REDO-KBN:["WK-PAST-DATA-REDO-KBN"]"
      *-----------------------------------------------------------------
                   IF  WK-PAST-DATA-REDO-KBN = "1" THEN
      *----- ワーク基準年月日/基準年月TO  ←  99999999
                     MOVE  99999999
                       TO  WK-KJN-YMD-TO-1
      *----- ワーク進捗タスクID  ←  フェッチした進捗タスクID
                     MOVE  H-SHINTK-TASK-ID
                       TO  WK-SHINTK-TASK-ID-1
                   ELSE
                     IF  KJN-YMD OF PARM-SCZY1210-ARG2(7:2) = 99 THEN
      *----- ワーク基準年月日/基準年月TO  ←  ARG2.基準年月日/基準年月
                       MOVE  KJN-YMD           OF PARM-SCZY1210-ARG2
                         TO  WK-KJN-YMD-TO-1
      *----- ワーク進捗タスクID  ←  フェッチした進捗タスクID
                       MOVE  H-SHINTK-TASK-ID
                         TO  WK-SHINTK-TASK-ID-1
                     ELSE
                       STRING  KJN-YMD OF PARM-SCZY1210-ARG2(1:6)
                               "99"
                       DELIMITED BY SIZE  INTO WK-KJN-YMD-TO
      *----- ワーク基準年月日/基準年月TO  ←  ARG2.基準年月日/基準年月(1:6) || 99
                       MOVE  WK-KJN-YMD-TO-9   TO WK-KJN-YMD-TO-1
      *----- ワーク進捗タスクID  ←  フェッチした進捗タスクID
                       MOVE  H-SHINTK-TASK-ID
                         TO  WK-SHINTK-TASK-ID-1
                     END-IF
                   END-IF
                 END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "KJN-YMD            OF PARM-SCZY1210-ARG2=["
      D              KJN-YMD            OF PARM-SCZY1210-ARG2"]"
      D    DISPLAY  "H-SHINTK-TASK-ID = ["H-SHINTK-TASK-ID"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-KJN-YMD-TO-1     = ["WK-KJN-YMD-TO-1    "]"
      D    DISPLAY  "WK-SHINTK-TASK-ID-1 = ["WK-SHINTK-TASK-ID-1"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗ステータスと再処理起因進捗タスクIDを更新する"
      D    DISPLAY  "ワーク件数 = ["WK-COUNT"]"
      D    DISPLAY  "*ワーク進捗管理情報編集処理  START *"
      *-----------------------------------------------------------------
      *----- ワーク進捗管理情報編集処理
      *----- ワーク件数←ワーク件数 + 1
                 COMPUTE  WK-COUNT = WK-COUNT + CNS-N-1
      *----- ワーク基準年月日/基準年月FROM(ワーク件数)
      *      ←  ワーク基準年月日/基準年月FROM
                 MOVE  WK-KJN-YMD-FROM-1
                   TO  WK-KJN-FROM         OF  WK-KJN-TASK
                                           OF  WK-KENSU-GRP(WK-COUNT)
      *----- ワーク基準年月日/基準年月TO(ワーク件数)
      *      ←  ワーク基準年月日/基準年月TO
                 MOVE  WK-KJN-YMD-TO-1
                   TO  WK-KJN-TO           OF  WK-KJN-TASK
                                           OF  WK-KENSU-GRP(WK-COUNT)
      *----- ワーク進捗タスクID(ワーク件数)
      *      ←  ワーク進捗タスクID
                 MOVE  WK-SHINTK-TASK-ID-1
                   TO  WK-TASK-ID          OF  WK-KJN-TASK
                                           OF  WK-KENSU-GRP(WK-COUNT)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク件数 = ["WK-COUNT"]"
      D    DISPLAY  "ワーク基準年月日/基準年月FROM("WK-COUNT")= ["
      D              WK-KJN-FROM           OF  WK-KJN-TASK
      D                                    OF  WK-KENSU-GRP(WK-COUNT)"]"
      D    DISPLAY  "ワーク基準年月日/基準年月TO("WK-COUNT")= ["
      D              WK-KJN-TO             OF  WK-KJN-TASK
      D                                    OF  WK-KENSU-GRP(WK-COUNT)"]"
      D    DISPLAY  "ワーク進捗タスクID("WK-COUNT")= ["
      D              WK-TASK-ID            OF  WK-KJN-TASK
      D                                    OF  WK-KENSU-GRP(WK-COUNT)"]"
      *-----------------------------------------------------------------
                 PERFORM  SQL-11-RTN
               WHEN  CNS-SQL-NODATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=1403の場合"
      *-----------------------------------------------------------------
                 MOVE  "1"              TO  WK-FETCH06-END-FLG
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE≠0(正常)且つ1403(データなし)の場合"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
                 MOVE  CNS-RET-ORACLE   TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  SQLCODE          TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "0069"           TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
                 MOVE  "1"              TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
                 MOVE  WK-ERR-SQLSTMT06 TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  データのフェッチ処理エラー  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-PERFORM.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR-FETCH2-RTN  END  ***".
      *-----------------------------------------------------------------
       CUR-FETCH2-EXT.
           EXIT.
      ******************************************************************
      *     進捗管理の進捗ステータスと再処理起因進捗タスクIDを更新
      ******************************************************************
       SQL-11-RTN             SECTION.
           INITIALIZE                  WK-SQL-POINTER
                                       WK-PARM-SCZY1210-ARG2
           MOVE  1                  TO WK-SQL-POINTER
           MOVE  RIYO-CMP-CD        OF PARM-SCZY1210-ARG2
             TO  WK-RIYO-CMP-CD
           MOVE  FUND-CD            OF PARM-SCZY1210-ARG2
             TO  WK-FUND-CD
           MOVE  PTF-CD             OF PARM-SCZY1210-ARG2
             TO  WK-PTF-CD
           MOVE  HYK-KRTU-CD        OF PARM-SCZY1210-ARG2
             TO  WK-HYK-KRTU-CD
           STRING
             "UPDATE /*+ INDEX(" WK-TABLEID-1 " " WK-TABLEID-1
             "_IX04) */ " WK-TABLEID-1 " SET "
             "SHINTK_STS = '500'"
             " ,SAISR_SHINTK_TASK_ID = :V1"
             " ,UPD_DATE = SYSDATE"
             " ,UPD_LOGIN_CMP_CD = :V2"
             " ,UPD_SID = ' '"
             " ,UPD_PGMID = '"
              CNS-PGM-ID
             "' WHERE RIYO_CMP_CD = :V3"
           DELIMITED BY SIZE  INTO  SQLSTMT7-ARR
           POINTER  WK-SQL-POINTER
           IF  WK-PAST-DATA-REDO-KBN = "1" OR
              (WK-PAST-DATA-REDO-KBN = "0" AND
               KJN-YMD OF PARM-SCZY1210-ARG2(7:2) = 99) THEN
             STRING
               " AND KJN_YMD >= :V4"
               " AND KJN_YMD <= :V5"
             DELIMITED BY SIZE  INTO  SQLSTMT7-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (KJN_YMD = :V4 OR KJN_YMD = :V5)"
             DELIMITED BY SIZE INTO SQLSTMT7-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           STRING
             " AND (SS_SYORI_YMD = 0 OR SS_SYORI_YMD >= :V6)"
           DELIMITED BY SIZE INTO SQLSTMT7-ARR
           POINTER  WK-SQL-POINTER
           IF  FUND-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (FUND_CD      = :V7 OR FUND_CD = ' '"
               " OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT7-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (FUND_CD      = :V7 OR FUND_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT7-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  PTF-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (PTF_CD       = :V8 OR PTF_CD = ' '"
               " OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT7-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (PTF_CD       = :V8 OR PTF_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT7-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           IF  HYK-KRTU-CD OF PARM-SCZY1210-ARG2 = SPACE THEN
             STRING
               " AND (HYK_KRTU_CD  = :V9 OR HYK_KRTU_CD = ' '"
               " OR 1=1)"
             DELIMITED BY SIZE  INTO  SQLSTMT7-ARR
             POINTER  WK-SQL-POINTER
           ELSE
             STRING
               " AND (HYK_KRTU_CD  = :V9 OR HYK_KRTU_CD = ' ')"
             DELIMITED BY SIZE  INTO  SQLSTMT7-ARR
             POINTER  WK-SQL-POINTER
           END-IF
           STRING
             " AND SHINTK_TASK_ID = :V10"
           DELIMITED BY SIZE
           INTO  SQLSTMT7-ARR
           POINTER  WK-SQL-POINTER
           MOVE  WK-SQL-POINTER     TO SQLSTMT7-LEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "V1 = ["WK-SHINTK-TASK-ID  "]"
      D    DISPLAY  "V2 = ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V3 = ["WK-RIYO-CMP-CD     "]"
      D    DISPLAY  "V4 = ["WK-KJN-YMD-FROM-1  "]"
      D    DISPLAY  "V5 = ["WK-KJN-YMD-TO-1    "]"
      D    DISPLAY  "V6 = ["WK-KJN-YMD-FROM-1  "]"
      D    DISPLAY  "V7 = ["WK-FUND-CD         "]"
      D    DISPLAY  "V8 = ["WK-PTF-CD          "]"
      D    DISPLAY  "V9 = ["WK-HYK-KRTU-CD     "]"
      D    DISPLAY  "V10= ["WK-SHINTK-TASK-ID-1"]"
      D    DISPLAY  "別紙11 SQL文:["SQLSTMT7-ARR"]"
      D    DISPLAY  "別紙11 SQL長:["SQLSTMT7-LEN"]"
      *-----------------------------------------------------------------
           STRING  SQLSTMT7-ARR
                   "[V1 :"WK-SHINTK-TASK-ID  "]"
                   "[V2 :"WK-RIYO-CMP-CD     "]"
                   "[V3 :"WK-RIYO-CMP-CD     "]"
                   "[V4 :"WK-KJN-YMD-FROM-1  "]"
                   "[V5 :"WK-KJN-YMD-TO-1    "]"
                   "[V6 :"WK-KJN-YMD-FROM-1  "]"
                   "[V7 :"WK-FUND-CD         "]"
                   "[V8 :"WK-PTF-CD          "]"
                   "[V9 :"WK-HYK-KRTU-CD     "]"
                   "[V10:"WK-SHINTK-TASK-ID-1"]"
           DELIMITED  BY  SIZE
           INTO  WK-ERR-SQLSTMT7
      *---------- ＳＱＬ文 PREPARE
           EXEC  SQL
             PREPARE  STMT_RECORD7  FROM  :SQLSTMT7
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0065"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT7    TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           EXEC  SQL
             EXECUTE  STMT_RECORD7
             USING  :WK-SHINTK-TASK-ID,
                    :WK-RIYO-CMP-CD,
                    :WK-RIYO-CMP-CD,
                    :WK-KJN-YMD-FROM-1,
                    :WK-KJN-YMD-TO-1,
                    :WK-KJN-YMD-FROM-1,
                    :WK-FUND-CD,
                    :WK-PTF-CD,
                    :WK-HYK-KRTU-CD,
                    :WK-SHINTK-TASK-ID-1
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-NODATA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=1403の場合、処理を続く"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID       TO ERR-PGM-ID
                                      OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE   TO RTN-CD
                                      OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE          TO DETAIL-RTN-CD
                                      OF PARM-SCZY1170-ARG1
               MOVE  "0066"           TO ERR-POS
                                      OF PARM-SCZY1170-ARG1
               MOVE  "1"              TO DETAIL-RTN-CD-FLG
                                      OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT7  TO FREE-MSG
                                      OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "進捗ステータスと再処理起因進捗タスクID更新エラー"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
           CONTINUE.
       SQL-11-EXT.
           EXIT.
      ******************************************************************
      *    カーソル CLOSE
      ******************************************************************
       CUR-CLOSE2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR-CLOSE2-RTN  START  ***"
      *-----------------------------------------------------------------
           EXEC SQL
             CLOSE CUR06
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE=0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  "0"                TO WK-CUR06-OPEN-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR06-OPEN-FLG =["WK-CUR06-OPEN-FLG"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE<>0(正常)の場合"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID         TO ERR-PGM-ID
                                        OF PARM-SCZY1170-ARG1
               MOVE  CNS-RET-ORACLE     TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  SQLCODE            TO DETAIL-RTN-CD
                                        OF PARM-SCZY1170-ARG1
               MOVE  "1"                TO DETAIL-RTN-CD-FLG
                                        OF PARM-SCZY1170-ARG1
               MOVE  "0070"             TO ERR-POS
                                        OF PARM-SCZY1170-ARG1
               MOVE  WK-ERR-SQLSTMT06   TO FREE-MSG
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR-CLOSE2  ERROR  ***"
      D    DISPLAY  "ERR-PGM-ID         OF PARM-SCZY1170-ARG1:["
      D              ERR-PGM-ID         OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1=["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD      OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1:["
      D              DETAIL-RTN-CD-FLG  OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "ERR-POS            OF PARM-SCZY1170-ARG1:["
      D              ERR-POS            OF PARM-SCZY1170-ARG1"]"
      D    DISPLAY  "FREE-MSG           OF PARM-SCZY1170-ARG1:["
      D              FREE-MSG           OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  CUR-CLOSE2-RTN  END  ***".
      *-----------------------------------------------------------------
       CUR-CLOSE2-EXT.
           EXIT.
      ******************************************************************
      *                        後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   後処理  START  ***"
      D    DISPLAY  "WK-CUR01-OPEN-FLG:["WK-CUR01-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR02-OPEN-FLG:["WK-CUR02-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR03-OPEN-FLG:["WK-CUR03-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR9-OPEN-FLG:["WK-CUR9-OPEN-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-CUR01-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR01
           END-EXEC
             MOVE  "0"        TO  WK-CUR01-OPEN-FLG
           END-IF
           IF  WK-CUR02-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR02
           END-EXEC
             MOVE  "0"        TO  WK-CUR02-OPEN-FLG
           END-IF
           IF  WK-CUR03-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR03
           END-EXEC
             MOVE  "0"        TO  WK-CUR03-OPEN-FLG
           END-IF
           IF  WK-CUR9-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR9
           END-EXEC
             MOVE  "0"        TO  WK-CUR9-OPEN-FLG
           END-IF
           IF  WK-CUR11-OPEN-FLG = "1" THEN
             EXEC SQL
               CLOSE CR11
             END-EXEC
             MOVE  "0"        TO  WK-CUR11-OPEN-FLG
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR01-OPEN-FLG:["WK-CUR01-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR02-OPEN-FLG:["WK-CUR02-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR03-OPEN-FLG:["WK-CUR03-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR9-OPEN-FLG:["WK-CUR9-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR11-OPEN-FLG:["WK-CUR11-OPEN-FLG"]"
      *-----------------------------------------------------------------
           MOVE     "000"               TO RTN-CD
                                        OF PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD             OF PARM-SCZY1170-ARG1:["
      D              RTN-CD             OF PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"
           USING  PARM-SCZY1170-INOUT
                  PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-ARG2     TO PARM-SCZY1210-ARG4.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "PARM-SCZY1210-ARG4:[" PARM-SCZY1210-ARG4"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   後処理  END  ***".
      *-----------------------------------------------------------------
       END-EXT.
           GOBACK.
      ******************************************************************
      *                 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ERR-RTN  START  ***"
      D    DISPLAY  "WK-CUR01-OPEN-FLG:["WK-CUR01-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR02-OPEN-FLG:["WK-CUR02-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR03-OPEN-FLG:["WK-CUR03-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR06-OPEN-FLG:["WK-CUR06-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR10-OPEN-FLG:["WK-CUR10-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR12-OPEN-FLG:["WK-CUR12-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR9-OPEN-FLG:["WK-CUR9-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR101-OPEN-FLG:["WK-CUR101-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR11-OPEN-FLG:["WK-CUR11-OPEN-FLG"]"
      D    DISPLAY  "WK-CR6-OPEN-FLG:["WK-CR6-OPEN-FLG"]"
      *-----------------------------------------------------------------
           IF  WK-CUR01-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR01
           END-EXEC
             MOVE  "0"        TO  WK-CUR01-OPEN-FLG
           END-IF
           IF  WK-CUR02-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR02
           END-EXEC
             MOVE  "0"        TO  WK-CUR02-OPEN-FLG
           END-IF
           IF  WK-CUR03-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR03
           END-EXEC
             MOVE  "0"        TO  WK-CUR03-OPEN-FLG
           END-IF
           IF  WK-CUR06-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR06
           END-EXEC
             MOVE  "0"        TO  WK-CUR06-OPEN-FLG
           END-IF
           IF  WK-CUR10-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR10
           END-EXEC
             MOVE  "0"        TO  WK-CUR10-OPEN-FLG
           END-IF
           IF  WK-CUR12-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR12
           END-EXEC
             MOVE  "0"        TO  WK-CUR12-OPEN-FLG
           END-IF
           IF  WK-CUR9-OPEN-FLG  = "1" THEN
           EXEC SQL
             CLOSE CUR9
           END-EXEC
             MOVE  "0"        TO  WK-CUR9-OPEN-FLG
           END-IF
           IF  WK-CUR101-OPEN-FLG = "1" THEN
           EXEC SQL
             CLOSE CUR101
           END-EXEC
             MOVE  "0"        TO  WK-CUR101-OPEN-FLG
           END-IF
           IF  WK-CUR11-OPEN-FLG = "1" THEN
             EXEC SQL
               CLOSE CR11
             END-EXEC
             MOVE  "0"        TO  WK-CUR11-OPEN-FLG
           END-IF
           IF  WK-CR6-OPEN-FLG = "1" THEN
             EXEC SQL
               CLOSE CR6
             END-EXEC
             MOVE  "0"        TO  WK-CR6-OPEN-FLG
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-CUR01-OPEN-FLG:["WK-CUR01-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR02-OPEN-FLG:["WK-CUR02-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR03-OPEN-FLG:["WK-CUR03-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR06-OPEN-FLG:["WK-CUR06-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR10-OPEN-FLG:["WK-CUR10-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR12-OPEN-FLG:["WK-CUR12-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR9-OPEN-FLG:["WK-CUR9-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR101-OPEN-FLG:["WK-CUR101-OPEN-FLG"]"
      D    DISPLAY  "WK-CUR11-OPEN-FLG:["WK-CUR11-OPEN-FLG"]"
      D    DISPLAY  "WK-CR6-OPEN-FLG:["WK-CR6-OPEN-FLG"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"          USING PARM-SCZY1170-INOUT
                                           PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-ARG2     TO PARM-SCZY1210-ARG4.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "PARM-SCZY1210-ARG4:[" PARM-SCZY1210-ARG4"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  ERR-RTN  END  ***".
      *-----------------------------------------------------------------
       ERR-EXT.
           GOBACK.
      ******************************************************************
