      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ1510
      * プログラム名称 : 対象銘柄（玉）決定
      * 処理概要       : 基準日断面情報より、銘柄別断面情報を作成する
      * 参照ＤＢ       : 基準日断面情報テーブル（TKMZBW02）
      *                : 取引差分更新管理テーブル（TKMZSK00）
      *                : 銘柄別断面情報テーブル（TKMZBW03）
      * 更新ＤＢ       : 銘柄別断面情報テーブル（TKMZBW03）
      *                : 残高履歴テーブル     (TKMZZR00)
      *                : 資金残履歴テーブル   (TKMZSR00)
      *                : 元本残高テーブル     (TKMZGZ00)
      * 引数           : IN      基準日断面情報のコピー句
      *                : OUT     RTNパッケージ
      * 改訂履歴
      * 年月日        区分     所属    担当      内容
      * ------------  ----     ------  -------  -------------
      * 20080124      新規     SCS     陸委     新規作成
      * 20081021      修正     SCS     王粒
      * 20081202      修正     SCS     顧建鋒
      * 20090106      修正     SCS     徐曉俊   残タスク172対応
      * 20090107      修正     SCS     徐曉俊
      * 20090225      修正     SCS     徐曉俊   連結障害0001355対応
      * 20090309      修正     SCS     徐曉俊   残タスク165対応
      * 20090703      修正     SCS     王飛     総合障害1341
      * 20090717      修正     SCS     何傑文   総合障害1412
      * 20100212      修正     SCS     陳曄     GIPS2.0性能改善
      * 20100212      修正     SCS     陳曄     GIPS2.0差分
      * 20100223      修正     SCS     陳曄     GIPS2.0差分
      * 20100323      修正     SCS     兪ル     連結障害0002200対応
      * 20100407      修正     SCS     韓       連結障害0002241対応
      * 20100408      修正     SCS     韓       SQL文銘柄種類条件削除
      * 20100603      修正     SCS     兪巧芳   テーマ2751
      * 20100705      修正     SCS     兪巧芳   テーマ2818
      * 20110418      修正     SCS     シャ建   テーマ3212-1
      * 20120731      修正     SCS     黄丹丹   テーマ3415-1
      * 20120928      修正     SCS     高志軍   テーマ3415-3
      * 20130823      修正     SCS     楊暁波   テーマ3564
      * 20130805      修正     SCS     常  峰   テーマ3545-1.NAM向け性能改善
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ1510.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-01-24.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
      ******************************************************************
      *                 作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
      *----------  共通コンスタント定義の宣言
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "SMZJ1510".
      *----------  RTN戻り値
         05  CNS-RTN-140           PIC  X(03)  VALUE  "140".
      *----------  テーブルID
      *----------  取引差分更新管理テーブル
         05  CNS-TBL-ID1           PIC  X(08)  VALUE  "TKMZSK00".
      *----------  基準日断面情報テーブル
         05  CNS-TBL-ID2           PIC  X(08)  VALUE  "TKMZBW02".
      *----------  銘柄別断面情報テーブル
         05  CNS-TBL-ID3           PIC  X(08)  VALUE  "TKMZBW03".
      *----------  残高履歴テーブル
         05  CNS-TBL-ID4           PIC  X(08)  VALUE  "TKMZZR00".
      *----------  資金残履歴テーブル
         05  CNS-TBL-ID5           PIC  X(08)  VALUE  "TKMZSR00".
      *----------  元本残高テーブル
         05  CNS-TBL-ID6           PIC  X(08)  VALUE  "TKMZGZ00".
      *----------  取引
         05  CNS-TBL-ID7           PIC  X(08)  VALUE  "TKMXTR00".
      *----------  20100212(GIPS2.0)  START
      *---------- 再処理要ポートフォリオ一覧（取引）
         05  CNS-TBL-ID9           PIC  X(08)  VALUE  "TKDYGP12".
      *---------- 再処理要ポートフォリオ一覧（銘柄属性）
         05  CNS-TBL-ID11          PIC  X(08)  VALUE  "TKDYGP16".
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
      *---------- ワーク再処理要銘柄一覧
         05  CNS-TBL-ID12          PIC  X(08)  VALUE  "TKMZGP01".
      *---------- 未収収益
         05  CNS-TBL-ID13          PIC  X(08)  VALUE  "TKMZMS00".
      *---------- 債券過去経過利息
         05  CNS-TBL-ID14          PIC  X(08)  VALUE  "TKMZKR00".
      *----------  20100223(GIPS2.0)  END
      *---------- 権利配当情報
         05  CNS-TBL-ID15          PIC  X(08)  VALUE  "TKJCKP00".
      *----------  計算パターン
         05  CNS-CALC-PTN-1        PIC  X(01)  VALUE  "1".
         05  CNS-CALC-PTN-2        PIC  X(01)  VALUE  "2".
      *----------  順番
         05  CNS-JUNBAN-1          PIC  9(01)  VALUE  1.
      *----------  証券種別コード
         05  CNS-SEC-SBT-CD-MA     PIC  X(02)  VALUE  "MA".
         05  CNS-SEC-SBT-CD-MA99   PIC  X(04)  VALUE  "MA99".
         05  CNS-SEC-SBT-CD-MAR    PIC  X(03)  VALUE  "MAR".
         05  CNS-SEC-SBT-CD-MABF   PIC  X(04)  VALUE  "MABF".
         05  CNS-SEC-SBT-CD-MABO   PIC  X(04)  VALUE  "MABO".
         05  CNS-SEC-SBT-CD-MAB    PIC  X(03)  VALUE  "MAB".
         05  CNS-SEC-SBT-CD-MAFB   PIC  X(04)  VALUE  "MAFB".
         05  CNS-SEC-SBT-CD-MASF   PIC  X(04)  VALUE  "MASF".
         05  CNS-SEC-SBT-CD-MASO   PIC  X(04)  VALUE  "MASO".
         05  CNS-SEC-SBT-CD-MAS    PIC  X(03)  VALUE  "MAS".
         05  CNS-SEC-SBT-CD-MAFS   PIC  X(04)  VALUE  "MAFS".
      *----------  株式GROUP
         05  CNS-SEC-SBT-CD-CASH   PIC  X(04)  VALUE  "CASH".
         05  CNS-SEC-SBT-CD-EX     PIC  X(02)  VALUE  "EX".
         05  CNS-SEC-SBT-CD-PRI    PIC  X(03)  VALUE  "PRI".
         05  CNS-SEC-SBT-CD-S      PIC  X(01)  VALUE  "S".
         05  CNS-SEC-SBT-CD-DSMS   PIC  X(04)  VALUE  "DSMS".
         05  CNS-SEC-SBT-CD-FSMS   PIC  X(04)  VALUE  "FSMS".
         05  CNS-SEC-SBT-CD-ET     PIC  X(02)  VALUE  "ET".
         05  CNS-SEC-SBT-CD-ETB    PIC  X(03)  VALUE  "ETB".
         05  CNS-SEC-SBT-CD-ETS    PIC  X(03)  VALUE  "ETS".
         05  CNS-SEC-SBT-CD-ETCB   PIC  X(04)  VALUE  "ETCB".
         05  CNS-SEC-SBT-CD-ETDB   PIC  X(04)  VALUE  "ETDB".
         05  CNS-SEC-SBT-CD-ETDS   PIC  X(04)  VALUE  "ETDS".
         05  CNS-SEC-SBT-CD-ETDC   PIC  X(04)  VALUE  "ETDC".
         05  CNS-SEC-SBT-CD-ETFS   PIC  X(04)  VALUE  "ETFS".
         05  CNS-SEC-SBT-CD-ETFB   PIC  X(04)  VALUE  "ETFB".
         05  CNS-SEC-SBT-CD-ETF    PIC  X(03)  VALUE  "ETF".
         05  CNS-SEC-SBT-CD-REIT   PIC  X(04)  VALUE  "REIT".
         05  CNS-SEC-SBT-CD-XMOS   PIC  X(04)  VALUE  "XMOS".
         05  CNS-SEC-SBT-CD-SM     PIC  X(02)  VALUE  "SM".
      *----------  債券GROUP
         05  CNS-SEC-SBT-CD-B      PIC  X(01)  VALUE  "B".
         05  CNS-SEC-SBT-CD-MB     PIC  X(02)  VALUE  "MB".
         05  CNS-SEC-SBT-CD-DBMS   PIC  X(04)  VALUE  "DBMS".
         05  CNS-SEC-SBT-CD-FBMS   PIC  X(04)  VALUE  "FBMS".
         05  CNS-SEC-SBT-CD-CB     PIC  X(02)  VALUE  "CB".
         05  CNS-SEC-SBT-CD-WB     PIC  X(02)  VALUE  "WB".
         05  CNS-SEC-SBT-CD-CBMS   PIC  X(04)  VALUE  "CBMS".
         05  CNS-SEC-SBT-CD-XMOB   PIC  X(04)  VALUE  "XMOB".
      *----------  銘柄種類又は銘柄種類２
         05  CNS-MEG-CD-SHRU-1     PIC  X(01)  VALUE  "1".
         05  CNS-MEG-CD-SHRU-2     PIC  X(01)  VALUE  "2".
         05  CNS-MEG-CD-SHRU-3     PIC  X(01)  VALUE  "3".
      *----------  再計算区分
         05  CNS-SAI-CALC-KBN-1    PIC  X(01)  VALUE  "1".
         05  CNS-SAI-CALC-KBN-2    PIC  X(01)  VALUE  "2".
      *----------  基本会計ベースフラグ
         05  CNS-KH-KAIKEI-BS-FLG-1
                                   PIC  X(01)  VALUE  "1".
         05  CNS-KH-KAIKEI-BS-FLG-2
                                   PIC  X(01)  VALUE  "2".
      *---------- コンスタント
      *----------  20100212(GIPS2.0)  START
         05  CNS-0                 PIC  9(01)  VALUE  0.
      *----------  20100212(GIPS2.0)  END
         05  CNS-1                 PIC  9(01)  VALUE  1.
         05  CNS-2                 PIC  9(01)  VALUE  2.
      *----------  20100212(GIPS2.0)  START
         05  CNS-100               PIC  9(03)  VALUE  100.
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
         05  CNS-X-0               PIC  X(01)  VALUE  "0".
         05  CNS-SQL-MSG-TRUNCATE  PIC  X(19)  VALUE
                                               " SQL-MSG(TRUNCATE):".
      *----------  20100223(GIPS2.0)  END
      *---------- コンスタント
         05  CNS-99999999          PIC  9(08)  VALUE  99999999.
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-SQL-MSG-INSERT    PIC  X(17)  VALUE
                                               " SQL-MSG(INSERT):".
         05  CNS-SQL-MSG-DELETE    PIC  X(17)  VALUE
                                               " SQL-MSG(DELETE):".
         05  CNS-SQL-MSG-UPDATE    PIC  X(17)  VALUE
                                               " SQL-MSG(UPDATE):".
         05  CNS-C1                PIC  X(01)  VALUE  "1".
         05  CNS-C0                PIC  X(01)  VALUE  "0".
         05  CNS-X-1               PIC  X(01)  VALUE  "1".
         05  CNS-X-2               PIC  X(01)  VALUE  "2".
         05  CNS-X-3               PIC  X(01)  VALUE  "3".
      ******************************************************************
      *                   フラグ  エリア
      ******************************************************************
       01  FLAG-AREA.
      *----------  FETCH終了フラグ
         05  FLG-FETCH-SYUURYOU    PIC  9(01).
         05  FLG-FETCH-SYUURYOU-45 PIC  9(01).
      *----------  銘柄別断面情報カーソルFETCH終了フラグ
         05  FLG-FETCH-MGBT-DMN    PIC  9(01).
      *----------  取引差分更新管理カーソルオープンフラグ１
      *  05  FLG-TKMZSK00-CR1-OPEN PIC  9(01).                          @3212SEINO@@
      *----------  基準日断面情報カーソルオープンフラグ
      *  05  FLG-TKMZBW02-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  銘柄別断面情報カーソルオープンフラグ
      *  05  FLG-TKMZBW03-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  取引差分更新管理カーソルオープンフラグ２
      *  05  FLG-TKMZSK00-CR21-OPEN                                     @3212SEINO@@
      *                            PIC  9(01).                          @3212SEINO@@
      *  05  FLG-TKMZSK00-CR22-OPEN                                     @3212SEINO@@
      *                            PIC  9(01).                          @3212SEINO@@
      *----------  取引差分更新管理カーソルオープンフラグ３
      *  05  FLG-TKMZSK00-CR3-OPEN PIC  9(01).                          @3212SEINO@@
      *----------  20100212(GIPS2.0)  START
      *----------  FETCH終了フラグ19
         05  FLG-FETCH-SYUURYOU-19 PIC  9(01).
      *----------  FETCH終了フラグ21
         05  FLG-FETCH-SYUURYOU-21 PIC  9(01).
      *----------  取引差分更新管理カーソルオープンフラグ19
         05  FLG-TKMZSK00-CR19-OPEN
                                   PIC  9(01).
      *----------  20100212(GIPS2.0)  END
         05  EST-FLG               PIC  9(01).
      ******************************************************************@3212SEINO@@
      *         フラグエリア２(PREPARE,DECLAREスキップ判定用)           @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FLG-AREA2.                                                   @3212SEINO@@
      *----------  取引差分更新管理カーソルオープンフラグ_１            @3212SEINO@@
         05  FLG-TKMZSK00-CR1-OPEN PIC  9(01).                          @3212SEINO@@
      *----------  基準日断面情報カーソルオープンフラグ                 @3212SEINO@@
         05  FLG-TKMZBW02-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  銘柄別断面情報カーソルオープンフラグ                 @3212SEINO@@
         05  FLG-TKMZBW03-CR-OPEN  PIC  9(01).                          @3212SEINO@@
      *----------  取引差分更新管理カーソルオープンフラグ２ー１         @3212SEINO@@
         05  FLG-TKMZSK00-CR21-OPEN                                     @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  取引差分更新管理カーソルオープンフラグ２ー２         @3212SEINO@@
         05  FLG-TKMZSK00-CR22-OPEN                                     @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  残高履歴DELカーソルオープンフラグ                    @3212SEINO@@
         05  FLG-DELETE-TKMZZR00   PIC  9(01).                          @3212SEINO@@
      *----------  資金残履歴DELカーソルオープンフラグ                  @3212SEINO@@
         05  FLG-DELETE-TKMZSR00   PIC  9(01).                          @3212SEINO@@
      *----------  元本残高DELカーソルオープンフラグ                    @3212SEINO@@
         05  FLG-DELETE-TKMZGZ00   PIC  9(01).                          @3212SEINO@@
      *----------  取引差分更新管理カーソルオープンフラグ３             @3212SEINO@@
         05  FLG-TKMZSK00-CR3-OPEN PIC  9(01).                          @3212SEINO@@
      *----------  銘柄別断面情報INSカーソルオープンフラグ1             @3212SEINO@@
         05  FLG-INSERT-TKMZBW03-CR1                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  銘柄別断面情報INSカーソルオープンフラグ2             @3212SEINO@@
         05  FLG-INSERT-TKMZBW03-CR2                                    @3212SEINO@@
                                   PIC  9(01).                          @3212SEINO@@
      *----------  銘柄別断面情報カーソルオープンフラグ_3
         05  TKMZBW03-45-OPEN-FLG  PIC  9(01).
      *----------  残高履歴カーソルオープンフラグ
         05  TKMZZR00-46-OPEN-FLG  PIC  9(01).
         05  TKMZZR00-46-OPEN-FLG-2
                                   PIC  9(01).
      *----------  取引カーソルオープンフラグ
         05  TKMXTR00-47-OPEN-FLG-1
                                   PIC  9(01).
         05  TKMXTR00-47-OPEN-FLG-2
                                   PIC  9(01).
         05  TKMXTR00-47-OPEN-FLG-3
                                   PIC  9(01).
         05  TKMXTR00-47-OPEN-FLG-4
                                   PIC  9(01).
      *----------  未収補正カーソルオープンフラグ
         05  TKMZMS00-48-OPEN-FLG  PIC  9(01).
         05  TKMZMS00-48-OPEN-FLG-2
                                   PIC  9(01).
      *----------  経過利息カーソルオープンフラグ
         05  TKMZKR00-49-OPEN-FLG  PIC  9(01).
      *----------  未収配当カーソルオープンフラグ
         05  TKJCKP00-50-OPEN-FLG  PIC  9(01).
      ******************************************************************@3212SEINO@@
      *                複数回起動チェック用スイッチ                     @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FIRST-SW                PIC  X(03)  VALUE 'YES'.             @3212SEINO@@
      ******************************************************************
      *                 ワ－ク  エリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      *----------  処理実行日
         05  WK-IN-SYORI-YMD       PIC  S9(08).
      *----------  起動ID
         05  WK-IN-KIDOU-ID        PIC  X(04).
      *----------  利用会社コード
         05  WK-IN-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
         05  WK-IN-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
         05  WK-IN-PTF-CD          PIC  X(04).
      *----------  基準日
         05  WK-IN-KJN-YMD         PIC  S9(08).
      *----------  順番
         05  WK-IN-JUNBAN          PIC  S9(07).
      *----------  開始基準日
         05  WK-IN-KAISI-KJN-YMD   PIC  S9(08).
      *----------  開始基準日の翌日
         05  WK-IN-KAISI-KJN-YMD-NEXT
                                   PIC  S9(08).
      *----------  計算パターン
         05  WK-IN-CALC-PTN        PIC  X(01).
      *----------  基本会計ベースフラグ
         05  WK-IN-KH-KAIKEI-BASE-FLG
                                   PIC  X(01).
      *----------  20100212(GIPS2.0)  START
         05  WK-IN-GIPS-MODE       PIC  X(01).
      *----------  処理フラグ
         05  WK-SYURI-FLG          PIC  X(01).
      *----------  20100212(GIPS2.0)  END
      *---------- ワークテーブル
         05  WK-TABLE.
           10  WK-TABLE-ID1        PIC  X(13).
           10  WK-TABLE-ID2        PIC  X(13).
           10  WK-TABLE-ID3        PIC  X(13).
           10  WK-TABLE-ID4        PIC  X(13).
           10  WK-TABLE-ID5        PIC  X(13).
           10  WK-TABLE-ID6        PIC  X(13).
           10  WK-TABLE-ID7        PIC  X(13).
      *----------  20100212(GIPS2.0)  START
           10  WK-TABLE-ID9        PIC  X(13).
           10  WK-TABLE-ID11       PIC  X(13).
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
           10  WK-TABLE-ID12       PIC  X(13).
           10  WK-TABLE-ID13       PIC  X(13).
           10  WK-TABLE-ID14       PIC  X(13).
           10  WK-TABLE-ID15       PIC  X(13).
         05  WK-CNT                PIC  9(04).
      *----------  20100223(GIPS2.0)  END
      *---------- ワーク.開始基準日の翌日
         05  WK-KAISI-KJN-YMD-YKJT
                                   PIC  9(08).
      *----------  順番-1
         05  WK-JUNBAN-MINUS-1     PIC  S9(07).
      *---------- ポジション1
         05  WK-ERR-POS1           PIC  X(04).
      *---------- ポジション2
         05  WK-ERR-POS2           PIC  X(04).
      *---------- ポジション3
         05  WK-ERR-POS3           PIC  X(04).
      *---------- ポジション4
         05  WK-ERR-POS4           PIC  X(04).
      *---------- ポジション5
         05  WK-ERR-POS5           PIC  X(04).
      *---------- ポジションINSERT1
         05  WK-ERR-IPOS1          PIC  X(04).
      *---------- ポジションINSERT2
         05  WK-ERR-IPOS2          PIC  X(04).
      *---------- ポジションINSERT3
         05  WK-ERR-IPOS3          PIC  X(04).
      *---------- ワーク増幅区分
         05  WK-ZOFKU-KBN          PIC  X(01).
      *----------  20100212(GIPS2.0)  START
         05  WK-COM.
      *------  銘柄コード
           10  WK-MEG-CD           PIC  X(15).
      *------  証券種別コード
           10  WK-SEC-SBT-CD       PIC  X(04).
      *------  資産負債・買建売建フラグ
           10  WK-TATE-FLG         PIC  X(01).
      *------  玉ＩＤ
           10  WK-GYOKU-ID         PIC  X(10).
      *------  市場通貨コード
           10  WK-SIJO-TUKA-CD     PIC  X(04).
      *------  差分更新From日
           10  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *------  銘柄種類
           10  WK-MEG-CD-SHRU      PIC  X(01).
      *------  再計算区分(INDEX)
           10  WK-SAI-CALC-KBN     PIC  X(01).
      *------  銘柄種類2
           10  WK-MEG-CD-SHRU2     PIC  X(01).
      *------  有効銘柄フラグ(INDEX)
           10  WK-YUKO-MEG-FLG     PIC  X(01).
      *----------  INSERT 件数
         05  WK-COUNT-TMP          PIC  9(03).
      *----------  INSERT 件数+1
         05  WK-ERR-KENSU          PIC  9(03).
      *----------  20100212(GIPS2.0)  END
      ******************************************************************
      *                ORACLE ホスト変数定義
      ******************************************************************
      *----------ＳＱＬコミュニケーション領域
           EXEC  SQL      INCLUDE   SQLCA        END-EXEC.
           EXEC  SQL      INCLUDE   ORACA        END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
      *----------ORACLE宣言文（ホスト変数定義）
       01  HST-AREA.
      *---------- 取引差分更新管理(別紙1-1)
         05  H-TKMZSK00.
      *------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  資産/負債・買建/売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *---------- 取引差分更新管理条件(別紙1-1)
         05  H-TKMZSK00-S.
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *---------- 取引差分更新管理(別紙1-6)
         05  H-TKMZSK00-1.
      *------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  資産/負債・買建/売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *------  差分計算開始日（約定）
           10  H-SBN-CALC-FROM-YKJ
                                   PIC  S9(08).
      *------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *---------- 取引差分更新管理条件(別紙1-6)
         05  H-TKMZSK00-S1.
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  最終計上日（約定）
           10  H-LAST-KJY-YMD-YKJ  PIC  S9(08).
      *------  差分計算開始日（約定）
           10  H-SBN-CALC-FROM-YKJ
                                   PIC  S9(08).
      *---------- 取引差分更新管理(別紙1-6)
         05  H-TKMZSK00-2.
      *------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  資産/負債・買建/売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *------  差分計算開始日（受渡）
           10  H-SBN-CALC-FROM-UKE
                                   PIC  S9(08).
      *------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *---------- 取引差分更新管理条件(別紙1-6)
         05  H-TKMZSK00-S2.
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  最終計上日（受渡）
           10  H-LAST-KJY-YMD-UKE  PIC  S9(08).
      *------  差分計算開始日（受渡）
           10  H-SBN-CALC-FROM-UKE
                                   PIC  S9(08).
      *---------- 取引差分更新管理(別紙1-11)
         05  H-TKMZSK00-3.
      *------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  資産/負債・買建/売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *---------- 銘柄別断面情報条件(別紙1-11)
         05  H-TKMZSK00-S3.
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *---------- 基準日断面情報(別紙1-3)
         05  H-TKMZBW02.
      *------  計算パターン
           10  H-CALC-PTN          PIC  X(01).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *---------- 基準日断面情報条件(別紙1-3)
         05  H-TKMZBW02-S.
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  順番
           10  H-JUNBAN            PIC  S9(07).
      *---------- 銘柄別断面情報(別紙1-4)
         05  H-TKMZBW03.
      *------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  資産/負債・買建/売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *------  銘柄種類
           10  H-MEG-CD-SHRU       PIC  X(01).
      *------  銘柄種類２
           10  H-MEG-CD-SHRU2      PIC  X(01).
      *------  差分更新From日
           10  H-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *---------- 銘柄別断面情報条件(別紙1-4)
         05  H-TKMZBW03-S.
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *---------- 銘柄別断面情報(別紙1-2,別紙1-5,別紙1-7,別紙1-12,別紙1-16)
      *----------  20100212(GIPS2.0)  START
         05  H-TKMZBW03-TBL-INSERT.
           10  H-TKMZBW03-INSERT     OCCURS  100.
      *----------  処理実行日
             20  H-SYORI-YMD       PIC  S9(08).
      *----------  起動ID
             20  H-KIDOU-ID        PIC  X(04).
      *----------  利用会社コード
             20  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             20  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             20  H-PTF-CD          PIC  X(04).
      *----------  開始基準日
             20  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  基準日
             20  H-KJN-YMD         PIC  S9(08).
      *----------  銘柄コード
             20  H-MEG-CD          PIC  X(15).
      *----------  証券種別コード
             20  H-SEC-SBT-CD      PIC  X(04).
      *----------  資産/負債・買建/売建フラグ
             20  H-TATE-FLG        PIC  X(01).
      *----------  玉ID
             20  H-GYOKU-ID        PIC  X(10).
      *----------  市場通貨コード
             20  H-SIJO-TUKA-CD    PIC  X(04).
      *----------  差分更新From日
             20  H-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *----------  銘柄種類
             20  H-MEG-CD-SHRU     PIC  X(01).
      *----------  再計算区分
             20  H-SAI-CALC-KBN    PIC  X(01).
      *----------  銘柄種類２
             20  H-MEG-CD-SHRU2    PIC  X(01).
      *----------  有効銘柄フラグ
             20  H-YUKO-MEG-FLG    PIC  X(01).
      *----------  更新ログインユーザ会社コード
             20  H-UPD-LOGIN-CMP-CD
                                   PIC  X(04).
      *----------  20100212(GIPS2.0)  END
      *----------  残高履歴(別紙1-10)
         05  H-TKMZZR00-DELETE.
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  最終有効日
           10  H-LAST-YUKO-YMD     PIC  S9(08).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  資金残履歴(別紙1-13)
         05  H-TKMZSR00-DELETE.
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  最終有効日
           10  H-LAST-YUKO-YMD     PIC  S9(08).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  元本残高(別紙1-14)
         05  H-TKMZGZ00-DELETE.
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  最終有効日
           10  H-LAST-YUKO-YMD     PIC  S9(08).
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *---------- 銘柄別断面情報条件(別紙1-18)
         05  H-TKMZBW03-18.
      *------  銘柄種類
           10  H-MEG-CD-SHRU       PIC  X(01).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  20100212(GIPS2.0)  START
         05  H-TKMZSK00-S4.
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  計算期間FROM
           10  H-CALC-KKN-FROM     PIC  S9(08).
      *------  計算期間TO
           10  H-CALC-KKN-TO       PIC  S9(08).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
         05  H-TKMZSK00-4.
      *------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
         05  H-TKMZBW03-S4.
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  計算期間FROM
           10  H-CALC-KKN-FROM     PIC  S9(08).
      *------  計算期間TO
           10  H-CALC-KKN-TO       PIC  S9(08).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  基準日
           10  H-KJN-YMD           PIC  S9(08).
         05  H-TKMZBW03-4.
      *------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *------  玉ＩＤ
           10  H-GYOKU-ID          PIC  X(10).
      *------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *------  銘柄種類
           10  H-MEG-CD-SHRU       PIC  X(01).
      *------  銘柄種類2
           10  H-MEG-CD-SHRU2      PIC  X(01).
      *------  差分更新From日
           10  H-SABON-UPDATE-FROM PIC  S9(08).
      *----------  件数
         05  HST-CNT               PIC  S9(03)  COMP.
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
         05  H-TKMZGP01-I24.
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  計算期間FROM
           10  H-CALC-KKN-FROM     PIC  S9(08).
      *----------  計算期間TO
           10  H-CALC-KKN-TO       PIC  S9(08).
      *----------  ワークDEL_INDEX
         05  H-DEL-IDX             PIC  9(03).
      *----------  ワークDELETE用データパッケージ
         05  H-DEL-KEY.
           10  H-DEL-TBL-KEY       OCCURS  100.
      *----------  利用会社コード
             20  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             20  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             20  H-PTF-CD          PIC  X(04).
      *----------  開始基準日
             20  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  基準日
             20  H-KJN-YMD         PIC  S9(08).
      *----------  利用会社コード
             20  H-RIYO-CMP-CD-2   PIC  X(04).
      *----------  ファンドコード
             20  H-FUND-CD-2       PIC  X(12).
      *----------  ポートフォリオコード
             20  H-PTF-CD-2        PIC  X(04).
         05  H-DEL2-KEY.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *----------  開始基準日
           10  H-KAISI-KJN-YMD     PIC  S9(08).
      *----------  基準日
           10  H-KJN-YMD           PIC  S9(08).
      *----------  処理実行日
           10  H-SYORI-YMD         PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *----------  20100223(GIPS2.0)  END
      *---------- 銘柄別断面情報(別紙1-45)
         05  H-TKMZBW03-45.
      *------  処理実行日
           10  H-SYORI-YMD         PIC  9(08).
      *------  起動ID
           10  H-KIDOU-ID          PIC  X(04).
      *------  利用会社コード
           10  H-RIYO-CMP-CD       PIC  X(04).
      *------  ファンドコード
           10  H-FUND-CD           PIC  X(12).
      *------  ポートフォリオコード
           10  H-PTF-CD            PIC  X(04).
      *------  開始基準日
           10  H-KAISI-KJN-YMD     PIC  9(08).
      *------  基準日
           10  H-KJN-YMD           PIC  9(08).
      *------  銘柄コード
           10  H-MEG-CD            PIC  X(15).
      *------  証券種別コード
           10  H-SEC-SBT-CD        PIC  X(04).
      *------  資産負債・買建売建フラグ
           10  H-TATE-FLG          PIC  X(01).
      *------  玉ID
           10  H-GYOKU-ID          PIC  X(10).
      *------  市場通貨コード
           10  H-SIJO-TUKA-CD      PIC  X(04).
      *------  差分更新From日
           10  H-SABON-UPDATE-FROM PIC  9(08).
      *------  銘柄種類
           10  H-MEG-CD-SHRU       PIC  X(01).
      *------  再計算区分
           10  H-SAI-CALC-KBN      PIC  X(01).
      *------  銘柄種類２
           10  H-MEG-CD-SHRU2      PIC  X(01).
         05  H-FETCH-46.
           10  H-FUND-CD           PIC  X(12).
         05  H-FETCH-47-1.
           10  H-FUND-CD           PIC  X(12).
         05  H-FETCH-47-2.
           10  H-FUND-CD           PIC  X(12).
         05  H-FETCH-48.
           10  H-FUND-CD           PIC  X(12).
         05  H-FETCH-49.
           10  H-FUND-CD           PIC  X(12).
         05  H-FETCH-50.
           10  H-NAIBU-MEG-CD      PIC  X(15).
         05  SQLSTMT               PIC  X(2500).
         05  SQLSTMT1              PIC  X(2500).
         05  SQLSTMT11             PIC  X(200).                         @3212SEINO@@
         05  SQLSTMT2              PIC  X(300).                         @3212SEINO@@
         05  SQLSTMT3              PIC  X(350).                         @3212SEINO@@
         05  SQLSTMT4              PIC  X(300).                         @3212SEINO@@
         05  SQLSTMT5              PIC  X(300).                         @3212SEINO@@
         05  SQLSTMT6              PIC  X(450).                         @3212SEINO@@
         05  SQLSTMT7              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT8              PIC  X(450).                         @3212SEINO@@
         05  SQLSTMT9              PIC  X(500).                         @3212SEINO@@
         05  SQLSTMT10             PIC  X(600).                         @3212SEINO@@
         05  SQLSTMT23             PIC  X(600).                         @3212SEINO@@
         05  SQLSTMT45             PIC  X(350).
         05  SQLSTMT46             PIC  X(250).
         05  SQLSTMT46-2           PIC  X(250).
         05  SQLSTMT47-1           PIC  X(250).
         05  SQLSTMT47-2           PIC  X(250).
         05  SQLSTMT47-3           PIC  X(250).
         05  SQLSTMT47-4           PIC  X(250).
         05  SQLSTMT48             PIC  X(300).
         05  SQLSTMT48-2           PIC  X(300).
         05  SQLSTMT49             PIC  X(250).
         05  SQLSTMT50             PIC  X(200).
         05  SQLSTMT51             PIC  X(350).
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *                ミドル
      ******************************************************************
       01  SQL-AREA.
      *---------- SELECT SQL文(別紙1-1)
      *---------- 取引差分更新管理テーブルFETCH処理
         05  SQL-SELECT-1-1.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(09)  VALUE
               "  MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
               "  SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
               "  TATE_FLG,".
             15  FILLER            PIC  X(11)  VALUE
               "  GYOKU_ID,".
             15  FILLER            PIC  X(14)  VALUE
               "  SIJO_TUKA_CD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
      *---------- SELECT SQL文(別紙1-3)
      *---------- 基準日断面情報テーブルFETCH処理
         05  SQL-SELECT-1-3.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 " SELECT".
             15  FILLER            PIC  X(20)  VALUE
                 "  NVL(CALC_PTN,' '),".
             15  FILLER            PIC  X(09)  VALUE
                 "  KJN_YMD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZBW02      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(30)  VALUE
                 "  AND SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(28)  VALUE
                 "  AND KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND JUNBAN = :P_JUNBAN".
      *---------- SELECT SQL文(別紙1-4)
      *---------- 銘柄別断面情報テーブルFETCH処理
         05  SQL-SELECT-1-4.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 " SELECT".
             15  FILLER            PIC  X(09)  VALUE
                 "  MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
                 "  SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 "  TATE_FLG,".
             15  FILLER            PIC  X(11)  VALUE
                 "  GYOKU_ID,".
             15  FILLER            PIC  X(23)  VALUE
                 "  NVL(MEG_CD_SHRU,' '),".
             15  FILLER            PIC  X(24)  VALUE
                 "  NVL(MEG_CD_SHRU2,' '),".
             15  FILLER            PIC  X(27)  VALUE
                 "  NVL(SABON_UPDATE_FROM,0),".
             15  FILLER            PIC  X(14)  VALUE
               "  SIJO_TUKA_CD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(30)  VALUE
                 "  AND SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(28)  VALUE
                 "  AND KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND KJN_YMD = :P_KJN_YMD".
      *---------- SELECT SQL文(別紙1-6)
      *---------- 取引差分更新管理テーブルFETCH処理
         05  SQL-SELECT-1-6-A.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 " SELECT".
             15  FILLER            PIC  X(09)  VALUE
                 "  MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
                 "  SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 "  TATE_FLG,".
             15  FILLER            PIC  X(11)  VALUE
                 "  GYOKU_ID,".
             15  FILLER            PIC  X(27)  VALUE
                 "  NVL(SBN_CALC_FROM_YKJ,0),".
             15  FILLER            PIC  X(14)  VALUE
               "  SIJO_TUKA_CD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(45)  VALUE
                 "  AND LAST_KJY_YMD_YKJ >= :P_LAST_KJY_YMD_YKJ".
             15  FILLER            PIC  X(47)  VALUE
                 "  AND SBN_CALC_FROM_YKJ <= :P_SBN_CALC_FROM_YKJ".
         05  SQL-SELECT-1-6-B.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 " SELECT".
             15  FILLER            PIC  X(09)  VALUE
                 "  MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
                 "  SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 "  TATE_FLG,".
             15  FILLER            PIC  X(11)  VALUE
                 "  GYOKU_ID,".
             15  FILLER            PIC  X(27)  VALUE
                 "  NVL(SBN_CALC_FROM_UKE,0),".
             15  FILLER            PIC  X(14)  VALUE
               "  SIJO_TUKA_CD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(30)  VALUE
                 "  RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(26)  VALUE
                 "  AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(24)  VALUE
                 "  AND PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(45)  VALUE
                 "  AND LAST_KJY_YMD_UKE >= :P_LAST_KJY_YMD_UKE".
             15  FILLER            PIC  X(47)  VALUE
                 "  AND SBN_CALC_FROM_UKE <= :P_SBN_CALC_FROM_UKE".
      *---------- INSERT SQL文(別紙1-2,別紙1-5,別紙1-7,別紙1-12,別紙1-16)
      *---------- 銘柄別断面情報テーブルINSERT処理
         05  SQL-INSERT-1-2.
           10  SQL-INSERT.
             15  FILLER            PIC  X(13)  VALUE
                 " INSERT INTO ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " (".
             15  FILLER            PIC  X(12)  VALUE
                 "  SYORI_YMD,".
             15  FILLER            PIC  X(11)  VALUE
                 "  KIDOU_ID,".
             15  FILLER            PIC  X(14)  VALUE
                 "  RIYO_CMP_CD,".
             15  FILLER            PIC  X(10)  VALUE
                 "  FUND_CD,".
             15  FILLER            PIC  X(09)  VALUE
                 "  PTF_CD,".
             15  FILLER            PIC  X(16)  VALUE
                 "  KAISI_KJN_YMD,".
             15  FILLER            PIC  X(10)  VALUE
                 "  KJN_YMD,".
             15  FILLER            PIC  X(09)  VALUE
                 "  MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
                 "  SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 "  TATE_FLG,".
             15  FILLER            PIC  X(11)  VALUE
                 "  GYOKU_ID,".
             15  FILLER            PIC  X(15)  VALUE
                 "  SIJO_TUKA_CD,".
             15  FILLER            PIC  X(20)  VALUE
                 "  SABON_UPDATE_FROM,".
             15  FILLER            PIC  X(14)  VALUE
                 "  MEG_CD_SHRU,".
             15  FILLER            PIC  X(15)  VALUE
                 "  SAI_CALC_KBN,".
             15  FILLER            PIC  X(15)  VALUE
                 "  MEG_CD_SHRU2,".
             15  FILLER            PIC  X(15)  VALUE
                 "  YUKO_MEG_FLG,".
             15  FILLER            PIC  X(11)  VALUE
                 "  UPD_DATE,".
             15  FILLER            PIC  X(19)  VALUE
                 "  UPD_LOGIN_CMP_CD,".
             15  FILLER            PIC  X(10)  VALUE
                 "  UPD_SID,".
             15  FILLER            PIC  X(13)  VALUE
                 "  UPD_PGMID )".
           10  SQL-VALUES.
             15  FILLER            PIC  X(09)  VALUE
                 "  VALUES ".
             15  FILLER            PIC  X(04)  VALUE
                 "  ( ".
             15  FILLER            PIC  X(13)  VALUE
                 ":P_SYORI_YMD,".
             15  FILLER            PIC  X(12)  VALUE
                 ":P_KIDOU_ID,".
             15  FILLER            PIC  X(15)  VALUE
                 ":P_RIYO_CMP_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 ":P_FUND_CD,".
             15  FILLER            PIC  X(10)  VALUE
                 ":P_PTF_CD,".
             15  FILLER            PIC  X(17)  VALUE
                 ":P_KAISI_KJN_YMD,".
             15  FILLER            PIC  X(11)  VALUE
                 ":P_KJN_YMD,".
             15  FILLER            PIC  X(10)  VALUE
                 ":P_MEG_CD,".
             15  FILLER            PIC  X(14)  VALUE
                 ":P_SEC_SBT_CD,".
             15  FILLER            PIC  X(12)  VALUE
                 ":P_TATE_FLG,".
             15  FILLER            PIC  X(12)  VALUE
                 ":P_GYOKU_ID,".
             15  FILLER            PIC  X(16)  VALUE
                 ":P_SIJO_TUKA_CD,".
             15  FILLER            PIC  X(21)  VALUE
                 ":P_SABON_UPDATE_FROM,".
             15  FILLER            PIC  X(15)  VALUE
                 ":P_MEG_CD_SHRU,".
             15  FILLER            PIC  X(16)  VALUE
                 ":P_SAI_CALC_KBN,".
             15  FILLER            PIC  X(16)  VALUE
                 ":P_MEG_CD_SHRU2,".
             15  FILLER            PIC  X(16)  VALUE
                 ":P_YUKO_MEG_FLG,".
             15  FILLER            PIC  X(08)  VALUE
                 "SYSDATE,".
             15  FILLER            PIC  X(20)  VALUE
                 ":P_UPD_LOGIN_CMP_CD,".
             15  FILLER            PIC  X(04)  VALUE
                 "' ',".
             15  FILLER            PIC  X(12)  VALUE
                 "'SMZJ1510' )".
      *---------- DELETE SQL文(別紙1-10)
      *---------- TKMZZR00テーブルDELETE処理
         05  SQL-DELETE-1-10.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZZR00      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(21)  VALUE
                 " KJN_YMD = :P_KJN_YMD".
             15  FILLER            PIC  X(39)  VALUE
                 " AND ( RIYO_CMP_CD , FUND_CD , PTF_CD ,".
             15  FILLER            PIC  X(44)  VALUE
                 " SEC_SBT_CD , MEG_CD , TATE_FLG , GYOKU_ID )".
             15  FILLER            PIC  X(13)  VALUE
                 " IN ( SELECT ".
             15  FILLER            PIC  X(33)  VALUE
                 " RIYO_CMP_CD , FUND_CD , PTF_CD ,".
             15  FILLER            PIC  X(43)  VALUE
                 " SEC_SBT_CD , MEG_CD , TATE_FLG , GYOKU_ID ".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
             15  FILLER            PIC  X(09)  VALUE
                 " A WHERE ".
             15  FILLER            PIC  X(21)  VALUE
                 " A.LAST_YUKO_YMD <> 0".
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.LAST_YUKO_YMD <> 99999999".
             15  FILLER            PIC  X(40)  VALUE
                 " AND A.LAST_YUKO_YMD <= :P_LAST_YUKO_YMD".
             15  FILLER            PIC  X(35)  VALUE
                 " AND A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-13)
      *---------- TKMZSR00テーブルDELETE処理
         05  SQL-DELETE-1-13.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZSR00      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(21)  VALUE
                 " KJN_YMD = :P_KJN_YMD".
             15  FILLER            PIC  X(39)  VALUE
                 " AND ( RIYO_CMP_CD , FUND_CD , PTF_CD ,".
             15  FILLER            PIC  X(13)  VALUE
                 " KS_KOZA_NO )".
             15  FILLER            PIC  X(13)  VALUE
                 " IN ( SELECT ".
             15  FILLER            PIC  X(33)  VALUE
                 " RIYO_CMP_CD , FUND_CD , PTF_CD ,".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD ".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
             15  FILLER            PIC  X(09)  VALUE
                 " A WHERE ".
             15  FILLER            PIC  X(21)  VALUE
                 " A.LAST_YUKO_YMD <> 0".
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.LAST_YUKO_YMD <> 99999999".
             15  FILLER            PIC  X(40)  VALUE
                 " AND A.LAST_YUKO_YMD <= :P_LAST_YUKO_YMD".
             15  FILLER            PIC  X(35)  VALUE
                 " AND A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-14)
      *---------- TKMZGZ00テーブルDELETE処理
         05  SQL-DELETE-1-14.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZGZ00      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(21)  VALUE
                 " KJN_YMD = :P_KJN_YMD".
             15  FILLER            PIC  X(39)  VALUE
                 " AND ( RIYO_CMP_CD , FUND_CD , PTF_CD )".
             15  FILLER            PIC  X(13)  VALUE
                 " IN ( SELECT ".
             15  FILLER            PIC  X(32)  VALUE
                 " RIYO_CMP_CD , FUND_CD , PTF_CD ".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
             15  FILLER            PIC  X(09)  VALUE
                 " A WHERE ".
             15  FILLER            PIC  X(21)  VALUE
                 " A.LAST_YUKO_YMD <> 0".
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.LAST_YUKO_YMD <> 99999999".
             15  FILLER            PIC  X(40)  VALUE
                 " AND A.LAST_YUKO_YMD <= :P_LAST_YUKO_YMD".
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.MEG_CD = '               '".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.SEC_SBT_CD = 'PRI'".
             15  FILLER            PIC  X(35)  VALUE
                 " AND A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- SELECT SQL文(別紙1-11)
      *---------- 取引差分更新管理テーブルFETCH処理
         05  SQL-SELECT-1-11.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(09)  VALUE
               "  MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
               "  SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
               "  TATE_FLG,".
             15  FILLER            PIC  X(11)  VALUE
               "  GYOKU_ID,".
             15  FILLER            PIC  X(14)  VALUE
               "  SIJO_TUKA_CD".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(47)  VALUE
                 "  ( SEC_SBT_CD , MEG_CD , TATE_FLG , GYOKU_ID )".
             15  FILLER            PIC  X(17)  VALUE
                 " NOT IN ( SELECT ".
             15  FILLER            PIC  X(43)  VALUE
                 " SEC_SBT_CD , MEG_CD , TATE_FLG , GYOKU_ID ".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(09)  VALUE
                 " A WHERE ".
             15  FILLER            PIC  X(27)  VALUE
                 " A.SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(35)  VALUE
                 " AND A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.KJN_YMD = :P_KJN_YMD".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
             15  FILLER            PIC  X(33)  VALUE
                 " AND RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *----------  銘柄別断面情報（TKMZBW03）
         05  SQL-INSERT-TKMZBW03.
           10  S-INSERT-TKMZBW03.
             15  FILLER            PIC  X(13)  VALUE
                 " INSERT INTO ".
             15  SQL-TBL-TKMZBW03  PIC  X(13).
      *----------  VALUES
           10  S-VALUES-TKMZBW03.
             15  FILLER            PIC  X(04)  VALUE
                 "  ( ".
             15  FILLER            PIC  X(08)  VALUE
                 " SELECT ".
             15  FILLER            PIC  X(11)  VALUE
                 " SYORI_YMD,".
             15  FILLER            PIC  X(10)  VALUE
                 " KIDOU_ID,".
             15  FILLER            PIC  X(13)  VALUE
                 " RIYO_CMP_CD,".
             15  FILLER            PIC  X(09)  VALUE
                 " FUND_CD,".
             15  FILLER            PIC  X(08)  VALUE
                 " PTF_CD,".
             15  FILLER            PIC  X(15)  VALUE
                 " KAISI_KJN_YMD,".
             15  FILLER            PIC  X(09)  VALUE
                 " KJN_YMD,".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(12)  VALUE
                 " SEC_SBT_CD,".
             15  FILLER            PIC  X(10)  VALUE
                 " TATE_FLG,".
             15  FILLER            PIC  X(10)  VALUE
                 " GYOKU_ID,".
             15  FILLER            PIC  X(14)  VALUE
                 " SIJO_TUKA_CD,".
             15  FILLER            PIC  X(19)  VALUE
                 " SABON_UPDATE_FROM,".
             15  FILLER            PIC  X(16)  VALUE
                 " :P_MEG_CD_SHRU,".
             15  FILLER            PIC  X(14)  VALUE
                 " SAI_CALC_KBN,".
             15  FILLER            PIC  X(14)  VALUE
                 " MEG_CD_SHRU2,".
             15  FILLER            PIC  X(14)  VALUE
                 " YUKO_MEG_FLG,".
             15  FILLER            PIC  X(10)  VALUE
                 " UPD_DATE,".
             15  FILLER            PIC  X(18)  VALUE
                 " UPD_LOGIN_CMP_CD,".
             15  FILLER            PIC  X(09)  VALUE
                 " UPD_SID,".
             15  FILLER            PIC  X(11)  VALUE
                 " UPD_PGMID ".
             15  FILLER            PIC  X(06)  VALUE " FROM ".
             15  SQL-TBL-TKMZBW03  PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE " WHERE".
      *----------  処理実行日
             15  FILLER            PIC  X(25)  VALUE
                 " SYORI_YMD = :P_SYORI_YMD".
      *----------  起動ID
             15  FILLER            PIC  X(27)  VALUE
                 " AND KIDOU_ID = :P_KIDOU_ID".
      *----------  利用会社コード
             15  FILLER            PIC  X(33)  VALUE
                 " AND RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *----------  基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND KJN_YMD = :P_KJN_YMD".
      *---------- 証券種別コード
             15  FILLER            PIC  X(48)  VALUE
                 " AND SEC_SBT_CD IN ('CASH','MAR ','MABF','MABO',".
             15  FILLER            PIC  X(49)  VALUE
                 "'MAB ','MAFB','MASF','MASO','MAS ','MAFS','MA99')".
             15  FILLER            PIC  X(23)  VALUE
                 " AND MEG_CD_SHRU = '3' ".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *----------  20100212(GIPS2.0)  START
      *----------  銘柄別断面情報（TKMZBW03）
         05  SQL-FETCH-TKMZSK00.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 "SELECT ".
             15  FILLER            PIC  X(09)  VALUE
                 "A.MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
                  "A.SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 "A.TATE_FLG,".
             15  FILLER            PIC  X(11)  VALUE
                 "A.GYOKU_ID,".
             15  FILLER            PIC  X(14)  VALUE
                 "A.SIJO_TUKA_CD".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
             15  FILLER            PIC  X(03)  VALUE  " A,".
             15  SQL-TKMZGP01      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE  " B".
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  利用会社コード
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
      *----------  証券種別コード
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.SEC_SBT_CD = B.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND A.MEG_CD = B.MEG_CD".
         05  SQL-FETCH-TKMZBW03.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 "SELECT ".
             15  FILLER            PIC  X(09)  VALUE
                 "A.MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
                  "A.SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 "A.TATE_FLG,".
             15  FILLER            PIC  X(11)  VALUE
                 "A.GYOKU_ID,".
             15  FILLER            PIC  X(15)  VALUE
                 "A.SIJO_TUKA_CD,".
             15  FILLER            PIC  X(14)  VALUE
                 "A.MEG_CD_SHRU,".
             15  FILLER            PIC  X(15)  VALUE
                 "A.MEG_CD_SHRU2,".
             15  FILLER            PIC  X(19)  VALUE
                 "A.SABON_UPDATE_FROM".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(03)  VALUE  " A,".
             15  FILLER            PIC  X(08)  VALUE
                 "(SELECT ".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 " SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  FILLER            PIC  X(09)  VALUE
                 "((SELECT ".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 " SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKDYGP11      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
                 " FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *----------  計算期間ＦＲＯＭ
             15  FILLER            PIC  X(39)  VALUE
                 " AND CALC_KKN_FROM <= :P_CALC_KKN_FROMD".
      *----------  計算期間ＴＯ
             15  FILLER            PIC  X(35)  VALUE
                 " AND CALC_KKN_TO >= :P_CALC_KKN_TO)".
             15  FILLER            PIC  X(10)  VALUE  " UNION ALL".
             15  FILLER            PIC  X(08)  VALUE
                 "(SELECT ".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 " SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKDYGP12      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
                 " FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *----------  計算期間ＦＲＯＭ
             15  FILLER            PIC  X(39)  VALUE
                 " AND CALC_KKN_FROM <= :P_CALC_KKN_FROMD".
      *----------  計算期間ＴＯ
             15  FILLER            PIC  X(35)  VALUE
                 " AND CALC_KKN_TO >= :P_CALC_KKN_TO)".
             15  FILLER            PIC  X(10)  VALUE  " UNION ALL".
             15  FILLER            PIC  X(08)  VALUE
                 "(SELECT ".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 " SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKDYGP13      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
                 " FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *----------  計算期間ＦＲＯＭ
             15  FILLER            PIC  X(39)  VALUE
                 " AND CALC_KKN_FROM <= :P_CALC_KKN_FROMD".
      *----------  計算期間ＴＯ
             15  FILLER            PIC  X(34)  VALUE
                 " AND CALC_KKN_TO >= :P_CALC_KKN_TO".
      *----------  対象種別
             15  FILLER            PIC  X(29)  VALUE
                 " AND TAISYO_SBT IN ('5','6'))".
             15  FILLER            PIC  X(10)  VALUE  " UNION ALL".
             15  FILLER            PIC  X(08)  VALUE
                 "(SELECT ".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 " SEC_SBT_CD".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKDYGP16      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
                 " FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *----------  計算期間ＦＲＯＭ
             15  FILLER            PIC  X(39)  VALUE
                 " AND CALC_KKN_FROM <= :P_CALC_KKN_FROMD".
      *----------  計算期間ＴＯ
             15  FILLER            PIC  X(37)  VALUE
                 " AND CALC_KKN_TO >= :P_CALC_KKN_TO)))".
             15  FILLER            PIC  X(10)  VALUE  " GROUP BY ".
             15  FILLER            PIC  X(20)  VALUE
                 "MEG_CD,SEC_SBT_CD) B".
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  利用会社コード
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
      *----------  ファンドコード
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
      *----------  処理実行日
             15  FILLER            PIC  X(31)  VALUE
                 " AND A.SYORI_YMD = :P_SYORI_YMD".
      *----------  起動ID
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KIDOU_ID = :P_KIDOU_ID".
      *----------  基準日
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.KJN_YMD = :P_KJN_YMD".
      *----------  証券種別コード
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.SEC_SBT_CD = B.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND A.MEG_CD = B.MEG_CD".
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
         05  SQL-TRUNCATE-TKMZGP01.
           10  SQL-TRUNCATE.
             15  FILLER            PIC  X(09)  VALUE
                 "TRUNCATE ".
             15  FILLER            PIC  X(06)  VALUE
                 "TABLE ".
             15  SQL-TKMZGP01      PIC  X(13).
      *---------- INSERT SQL文(別紙1-24)
      *---------- ワーク再処理要銘柄一覧TBLへINSERT処理
         05  SQL-INSERT-1-24.
           10  SQL-INSERT.
             15  FILLER            PIC  X(13)  VALUE
                 " INSERT INTO ".
             15  SQL-TKMZGP01      PIC  X(13).
             15  FILLER            PIC  X(08)  VALUE
                 "(SELECT ".
             15  FILLER            PIC  X(12)  VALUE
                 " SEC_SBT_CD,".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(20)  VALUE
                 " MIN(CALC_KKN_FROM),".
             15  FILLER            PIC  X(17)  VALUE
                 " MAX(CALC_KKN_TO)".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  FILLER            PIC  X(02)  VALUE
                 "( ".
             15  FILLER            PIC  X(08)  VALUE
                 "(SELECT ".
             15  FILLER            PIC  X(30)  VALUE
                 " HKZ_SEC_SBT_CD as SEC_SBT_CD,".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(15)  VALUE
                 " CALC_KKN_FROM,".
             15  FILLER            PIC  X(12)  VALUE
                 " CALC_KKN_TO".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKDYGP12      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
                 " FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *----------  計算期間ＦＲＯＭ
             15  FILLER            PIC  X(39)  VALUE
                 " AND CALC_KKN_FROM <= :P_CALC_KKN_FROMD".
      *----------  計算期間ＴＯ
             15  FILLER            PIC  X(35)  VALUE
                 " AND CALC_KKN_TO >= :P_CALC_KKN_TO)".
             15  FILLER            PIC  X(10)  VALUE  " UNION ALL".
             15  FILLER            PIC  X(08)  VALUE
                 "(SELECT ".
             15  FILLER            PIC  X(12)  VALUE
                 " SEC_SBT_CD,".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD,".
             15  FILLER            PIC  X(15)  VALUE
                 " CALC_KKN_FROM,".
             15  FILLER            PIC  X(12)  VALUE
                 " CALC_KKN_TO".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKDYGP16      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE  " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(21)  VALUE
                 " FUND_CD = :P_FUND_CD".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(23)  VALUE
                 " AND PTF_CD = :P_PTF_CD".
      *----------  計算期間ＦＲＯＭ
             15  FILLER            PIC  X(39)  VALUE
                 " AND CALC_KKN_FROM <= :P_CALC_KKN_FROMD".
      *----------  計算期間ＴＯ
             15  FILLER            PIC  X(36)  VALUE
                 " AND CALC_KKN_TO >= :P_CALC_KKN_TO))".
             15  FILLER            PIC  X(10)  VALUE  " GROUP BY ".
             15  FILLER            PIC  X(18)  VALUE
                 "SEC_SBT_CD,MEG_CD)".
      *---------- DELETE SQL文(別紙1-25)
      *---------- TKMZZR00テーブルDELETE処理
         05  SQL-DELETE-1-25.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZZR00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD > :P_KJN_YMD_F".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD < :P_KJN_YMD_T".
             15  FILLER            PIC  X(11)  VALUE
                 " AND EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
             15  FILLER            PIC  X(03)  VALUE
                 " B,".
             15  SQL-TKMZGP01      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " C".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(33)  VALUE
                 " B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(32)  VALUE
                 " AND B.SEC_SBT_CD = C.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD = C.MEG_CD".
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.KJN_YMD >= C.CALC_KKN_FROM".
             15  FILLER            PIC  X(31)  VALUE
                 " AND A.KJN_YMD <= C.CALC_KKN_TO".
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.SEC_SBT_CD = B.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND A.MEG_CD = B.MEG_CD".
             15  FILLER            PIC  X(26)  VALUE
                 " AND B.SEC_SBT_CD <> 'PRI'".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-26)
      *---------- TKMZSR00テーブルDELETE処理
         05  SQL-DELETE-1-26.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZSR00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD > :P_KJN_YMD_F".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD < :P_KJN_YMD_T".
             15  FILLER            PIC  X(11)  VALUE
                 " AND EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
             15  FILLER            PIC  X(03)  VALUE
                 " B,".
             15  SQL-TKMZGP01      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " C".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(33)  VALUE
                 " B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(32)  VALUE
                 " AND B.SEC_SBT_CD = C.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD = C.MEG_CD".
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.KJN_YMD >= C.CALC_KKN_FROM".
             15  FILLER            PIC  X(31)  VALUE
                 " AND A.KJN_YMD <= C.CALC_KKN_TO".
             15  FILLER            PIC  X(28)  VALUE
                 " AND A.KS_KOZA_NO = B.MEG_CD".
             15  FILLER            PIC  X(21)  VALUE
                 " AND B.SEC_SBT_CD IN ".
             15  FILLER            PIC  X(35)  VALUE
                 "('CASH','MA99','MAR','MABF','MABO',".
             15  FILLER            PIC  X(40)  VALUE
                 "'MAB','MAFB','MASF','MASO','MAS','MAFS')".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-41)
      *---------- TKMZGZ00テーブルDELETE処理
         05  SQL-DELETE-1-41.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZGZ00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD > :P_KJN_YMD_F".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD < :P_KJN_YMD_T".
             15  FILLER            PIC  X(11)  VALUE
                 " AND EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZSK00      PIC  X(13).
             15  FILLER            PIC  X(03)  VALUE
                 " B,".
             15  SQL-TKMZGP01      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " C".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(33)  VALUE
                 " B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(32)  VALUE
                 " AND B.SEC_SBT_CD = C.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD = C.MEG_CD".
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.KJN_YMD >= C.CALC_KKN_FROM".
             15  FILLER            PIC  X(31)  VALUE
                 " AND A.KJN_YMD <= C.CALC_KKN_TO".
             15  FILLER            PIC  X(26)  VALUE
                 " AND C.SEC_SBT_CD = 'PRI '".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-27)
      *---------- TKMZZR00テーブルDELETE処理
         05  SQL-DELETE-1-27.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZZR00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD = :P_KJN_YMD".
             15  FILLER            PIC  X(11)  VALUE
                 " AND EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " B".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(27)  VALUE
                 " B.SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(37)  VALUE
                 " AND B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KJN_YMD = :P_KJN_YMD_B".
             15  FILLER            PIC  X(32)  VALUE
                 " AND B.SEC_SBT_CD = A.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD = A.MEG_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD_SHRU = '1'".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-42)
      *---------- TKMZGZ00テーブルDELETE処理
         05  SQL-DELETE-1-42.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZGZ00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD = :P_KJN_YMD".
             15  FILLER            PIC  X(11)  VALUE
                 " AND EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " B".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(27)  VALUE
                 " B.SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(37)  VALUE
                 " AND B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KJN_YMD = :P_KJN_YMD_B".
             15  FILLER            PIC  X(26)  VALUE
                 " AND B.SEC_SBT_CD = 'PRI '".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD_SHRU = '2'".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-28)
      *---------- TKMZSR00テーブルDELETE処理
         05  SQL-DELETE-1-28.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZSR00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND A.KJN_YMD = :P_KJN_YMD".
             15  FILLER            PIC  X(11)  VALUE
                 " AND EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " B".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(27)  VALUE
                 " B.SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(37)  VALUE
                 " AND B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KJN_YMD = :P_KJN_YMD_B".
             15  FILLER            PIC  X(28)  VALUE
                 " AND B.MEG_CD = A.KS_KOZA_NO".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD_SHRU = '3'".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-29)
      *---------- TKMZMS00テーブルDELETE処理
         05  SQL-DELETE-1-29.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZMS00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.TEKIYO_FROM > :P_KJN_YMD_F".
             15  FILLER            PIC  X(34)  VALUE
                 " AND A.TEKIYO_FROM <= :P_KJN_YMD_T".
             15  FILLER            PIC  X(45)  VALUE
                 " AND A.SJTK_MS_SHEKI_IN = 999999999999999.999".
             15  FILLER            PIC  X(47)  VALUE
                 " AND A.SJTK_GENSEN_TAX_IN = 999999999999999.999".
             15  FILLER            PIC  X(46)  VALUE
                 " AND A.MNK_TSHO_SRYZN_IN = 999999999999.999999".
             15  FILLER            PIC  X(45)  VALUE
                 " AND A.UYTK_MS_SHEKI_IN = 999999999999999.999".
             15  FILLER            PIC  X(47)  VALUE
                 " AND A.UYTK_GENSEN_TAX_IN = 999999999999999.999".
             15  FILLER            PIC  X(40)  VALUE
                 " AND A.HYK_KWS_IN =  99999999.9999999999".
             15  FILLER            PIC  X(49)  VALUE
                 " AND A.GENS_TAX_HYK_KWS_IN =  99999999.9999999999".
             15  FILLER            PIC  X(11)  VALUE
                 " AND EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " B".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(27)  VALUE
                 " B.SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(37)  VALUE
                 " AND B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KJN_YMD = :P_KJN_YMD_B".
             15  FILLER            PIC  X(32)  VALUE
                 " AND B.SEC_SBT_CD = A.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD = A.MEG_CD".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- UPDATE SQL文(別紙1-30)
      *---------- TKMZMS00テーブルDELETE処理
         05  SQL-UPDATE-1-30.
           10  SQL-UPDATE.
             15  FILLER            PIC  X(07)  VALUE
                 "UPDATE ".
             15  SQL-TKMZMS00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(04)  VALUE
                 " SET".
             15  FILLER            PIC  X(21)  VALUE
                 " A.SJTK_MS_SHEKI = 0,".
             15  FILLER            PIC  X(23)  VALUE
                 " A.SJTK_GENSEN_TAX = 0,".
             15  FILLER            PIC  X(22)  VALUE
                 " A.MNK_TSHO_SRYZN = 0,".
             15  FILLER            PIC  X(17)  VALUE
                 " A.UPD_FLG = '3',".
             15  FILLER            PIC  X(22)  VALUE
                 " A.UPD_DATE = SYSDATE,".
             15  FILLER            PIC  X(42)  VALUE
                 " A.UPD_LOGIN_CMP_CD = :P_UPD_LOGIN_CMP_CD,".
             15  FILLER            PIC  X(24)  VALUE
                 " A.UPD_SID = :P_UPD_SID,".
             15  FILLER            PIC  X(25)  VALUE
                 " A.UPD_PGMID = 'SMZJ1510'".
             15  FILLER            PIC  X(13)  VALUE
                 " WHERE EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " B".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.TEKIYO_FROM > :P_KJN_YMD_F".
             15  FILLER            PIC  X(34)  VALUE
                 " AND A.TEKIYO_FROM <= :P_KJN_YMD_T".
             15  FILLER            PIC  X(07)  VALUE
                 " AND ".
             15  FILLER            PIC  X(43)  VALUE
                 " (A.SJTK_MS_SHEKI_IN <> 999999999999999.999".
             15  FILLER            PIC  X(47)  VALUE
                 " OR A.SJTK_GENSEN_TAX_IN <> 999999999999999.999".
             15  FILLER            PIC  X(46)  VALUE
                 " OR A.MNK_TSHO_SRYZN_IN <> 999999999999.999999".
             15  FILLER            PIC  X(45)  VALUE
                 " OR A.UYTK_MS_SHEKI_IN <> 999999999999999.999".
             15  FILLER            PIC  X(47)  VALUE
                 " OR A.UYTK_GENSEN_TAX_IN <> 999999999999999.999".
             15  FILLER            PIC  X(39)  VALUE
                 " OR A.HYK_KWS_IN <> 99999999.9999999999".
             15  FILLER            PIC  X(49)  VALUE
                 " OR A.GENS_TAX_HYK_KWS_IN <> 99999999.9999999999)".
             15  FILLER            PIC  X(31)  VALUE
                 " AND B.SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(37)  VALUE
                 " AND B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KJN_YMD = :P_KJN_YMD_B".
             15  FILLER            PIC  X(32)  VALUE
                 " AND B.SEC_SBT_CD = A.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD = A.MEG_CD".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- DELETE SQL文(別紙1-31)
      *---------- TKMZKR00テーブルDELETE処理
         05  SQL-DELETE-1-31.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  SQL-TKMZKR00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.TEKIYO_FROM > :P_KJN_YMD_F".
             15  FILLER            PIC  X(34)  VALUE
                 " AND A.TEKIYO_FROM <= :P_KJN_YMD_T".
             15  FILLER            PIC  X(45)  VALUE
                 " AND A.SJTK_KEKA_RSK_IN = 999999999999.999999".
             15  FILLER            PIC  X(47)  VALUE
                 " AND A.SJTK_GENSEN_TAX_IN = 999999999999999.999".
             15  FILLER            PIC  X(46)  VALUE
                 " AND A.UYTK_KEKA_RSK_IN = 999999999999.999999".
             15  FILLER            PIC  X(47)  VALUE
                 " AND A.UYTK_GENSEN_TAX_IN = 999999999999999.999".
             15  FILLER            PIC  X(39)  VALUE
                 " AND A.HYK_KWS_IN = 99999999.9999999999".
             15  FILLER            PIC  X(48)  VALUE
                 " AND A.GENS_TAX_HYK_KWS_IN = 99999999.9999999999".
             15  FILLER            PIC  X(50)  VALUE
                 " AND A.FACTOR_RENDOU_KESU_IN = 99999999.9999999999".
             15  FILLER            PIC  X(49)  VALUE
                 " AND A.MNK_TSHO_FACE_ZAN_IN = 999999999999.999999".
             15  FILLER            PIC  X(11)  VALUE
                 " AND EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " B".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(27)  VALUE
                 " B.SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(37)  VALUE
                 " AND B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KJN_YMD = :P_KJN_YMD_B".
             15  FILLER            PIC  X(32)  VALUE
                 " AND B.SEC_SBT_CD = A.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD = A.MEG_CD".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *---------- UPDATE SQL文(別紙1-32)
      *---------- TKMZKR00テーブルDELETE処理
         05  SQL-UPDATE-1-32.
           10  SQL-UPDATE.
             15  FILLER            PIC  X(07)  VALUE
                 "UPDATE ".
             15  SQL-TKMZKR00      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " A".
             15  FILLER            PIC  X(04)  VALUE
                 " SET".
             15  FILLER            PIC  X(21)  VALUE
                 " A.SJTK_KEKA_RSK = 0,".
             15  FILLER            PIC  X(23)  VALUE
                 " A.SJTK_GENSEN_TAX = 0,".
             15  FILLER            PIC  X(25)  VALUE
                 " A.MNK_TSHO_FACE_ZAN = 0,".
             15  FILLER            PIC  X(26)  VALUE
                 " A.FACTOR_RENDOU_KESU = 0,".
             15  FILLER            PIC  X(17)  VALUE
                 " A.UPD_FLG = '3',".
             15  FILLER            PIC  X(22)  VALUE
                 " A.UPD_DATE = SYSDATE,".
             15  FILLER            PIC  X(42)  VALUE
                 " A.UPD_LOGIN_CMP_CD = :P_UPD_LOGIN_CMP_CD,".
             15  FILLER            PIC  X(24)  VALUE
                 " A.UPD_SID = :P_UPD_SID,".
             15  FILLER            PIC  X(25)  VALUE
                 " A.UPD_PGMID = 'SMZJ1510'".
             15  FILLER            PIC  X(13)  VALUE
                 " WHERE EXISTS".
             15  FILLER            PIC  X(16)  VALUE
                 " (SELECT 1 FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(02)  VALUE
                 " B".
             15  FILLER            PIC  X(07)  VALUE
                 " WHERE ".
             15  FILLER            PIC  X(31)  VALUE
                 " A.RIYO_CMP_CD = :P_RIYO_CMP_CD".
             15  FILLER            PIC  X(27)  VALUE
                 " AND A.FUND_CD = :P_FUND_CD".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.PTF_CD = :P_PTF_CD".
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.TEKIYO_FROM > :P_KJN_YMD_F".
             15  FILLER            PIC  X(34)  VALUE
                 " AND A.TEKIYO_FROM <= :P_KJN_YMD_T".
             15  FILLER            PIC  X(07)  VALUE
                 " AND ".
             15  FILLER            PIC  X(43)  VALUE
                 " (A.SJTK_KEKA_RSK_IN <> 999999999999.999999".
             15  FILLER            PIC  X(47)  VALUE
                 " OR A.SJTK_GENSEN_TAX_IN <> 999999999999999.999".
             15  FILLER            PIC  X(46)  VALUE
                 " OR A.UYTK_KEKA_RSK_IN <> 999999999999.999999".
             15  FILLER            PIC  X(47)  VALUE
                 " OR A.UYTK_GENSEN_TAX_IN <> 999999999999999.999".
             15  FILLER            PIC  X(47)  VALUE
                 " OR A.HYK_KWS_IN <> 99999999.9999999999".
             15  FILLER            PIC  X(48)  VALUE
                 " OR A.GENS_TAX_HYK_KWS_IN <> 99999999.9999999999".
             15  FILLER            PIC  X(50)  VALUE
                 " OR A.FACTOR_RENDOU_KESU_IN <> 99999999.9999999999".
             15  FILLER            PIC  X(50)  VALUE
                 " OR A.MNK_TSHO_FACE_ZAN_IN <> 999999999999.999999)".
             15  FILLER            PIC  X(31)  VALUE
                 " AND B.SYORI_YMD = :P_SYORI_YMD".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KIDOU_ID = :P_KIDOU_ID".
             15  FILLER            PIC  X(37)  VALUE
                 " AND B.RIYO_CMP_CD = :P_RIYO_CMP_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.FUND_CD = :P_FUND_CD_B".
             15  FILLER            PIC  X(27)  VALUE
                 " AND B.PTF_CD = :P_PTF_CD_B".
             15  FILLER            PIC  X(29)  VALUE
                 " AND B.KJN_YMD = :P_KJN_YMD_B".
             15  FILLER            PIC  X(32)  VALUE
                 " AND B.SEC_SBT_CD = A.SEC_SBT_CD".
             15  FILLER            PIC  X(24)  VALUE
                 " AND B.MEG_CD = A.MEG_CD".
             15  FILLER            PIC  X(02)  VALUE
                 " )".
      *----------  20100223(GIPS2.0)  END
      *----------  銘柄別断面情報（別紙1-45 SQL説明）
         05  SQL-FETCH-45.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 "SELECT ".
             15  FILLER            PIC  X(10)  VALUE
                 "SYORI_YMD,".
             15  FILLER            PIC  X(09)  VALUE
                 "KIDOU_ID,".
             15  FILLER            PIC  X(12)  VALUE
                 "RIYO_CMP_CD,".
             15  FILLER            PIC  X(08)  VALUE
                 "FUND_CD,".
             15  FILLER            PIC  X(07)  VALUE
                 "PTF_CD,".
             15  FILLER            PIC  X(14)  VALUE
                 "KAISI_KJN_YMD,".
             15  FILLER            PIC  X(08)  VALUE
                 "KJN_YMD,".
             15  FILLER            PIC  X(07)  VALUE
                 "MEG_CD,".
             15  FILLER            PIC  X(11)  VALUE
                 "SEC_SBT_CD,".
             15  FILLER            PIC  X(09)  VALUE
                 "TATE_FLG,".
             15  FILLER            PIC  X(09)  VALUE
                 "GYOKU_ID,".
             15  FILLER            PIC  X(13)  VALUE
                 "SIJO_TUKA_CD,".
             15  FILLER            PIC  X(18)  VALUE
                 "SABON_UPDATE_FROM,".
             15  FILLER            PIC  X(12)  VALUE
                 "MEG_CD_SHRU,".
             15  FILLER            PIC  X(13)  VALUE
                 "SAI_CALC_KBN,".
             15  FILLER            PIC  X(12)  VALUE
                 "MEG_CD_SHRU2".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(14)  VALUE
                 " FUND_CD = :V1".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(17)  VALUE
                 " AND PTF_CD = :V2".
      *----------  処理実行日
             15  FILLER            PIC  X(20)  VALUE
                 " AND SYORI_YMD = :V3".
      *----------  起動ID
             15  FILLER            PIC  X(19)  VALUE
                 " AND KIDOU_ID = :V4".
      *----------  基準日
             15  FILLER            PIC  X(17)  VALUE
                 " AND KJN_YMD= :V5".
      *----------  銘柄種類
             15  FILLER            PIC  X(23)  VALUE
                 " AND MEG_CD_SHRU = '1' ".
      *----------  残高履歴（別紙1-46 SQL説明）
         05  SQL-SELECT-46.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 "SELECT ".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(08)  VALUE
                 "FUND_CD ".
      *---------- 20120928 修正終了
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZZR00      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(14)  VALUE
                 " FUND_CD = :V6".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(17)  VALUE
                 " AND PTF_CD = :V7".
      *----------  銘柄コード
             15  FILLER            PIC  X(17)  VALUE
                 " AND MEG_CD = :V8".
      *----------  証券種別コード
             15  SQL-SELECT-46-SEC PIC  X(26).
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(20)  VALUE
                 " AND TATE_FLG = :V10".
      *----------  玉ID
             15  FILLER            PIC  X(21)  VALUE
                 " AND GYOKU_ID = :V11 ".
      *----------  基準日
             15  FILLER            PIC  X(20)  VALUE
                 " AND KJN_YMD = :V12 ".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(14)  VALUE
                 " AND ROWNUM=1 ".
      *----------  証券種別コード
         05  SQL-SELECT-46-SEC-1.
           10  FILLER              PIC  X(21)  VALUE
                 " AND SEC_SBT_CD = :V9".
         05  SQL-SELECT-46-SEC-2.
           10  FILLER              PIC  X(26)  VALUE
                 " AND SEC_SBT_CD LIKE 'MA%'".
      *---------- 20120928 修正終了
      *----------  取引（別紙1-47 SQL説明）
         05  SQL-SELECT-47.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 "SELECT ".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(08)  VALUE
                 "FUND_CD ".
      *---------- 20120928 修正終了
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMXTR00      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(15)  VALUE
                 " FUND_CD = :V13".
      *----------  銘柄コード
             15  FILLER            PIC  X(18)  VALUE
                 " AND MEG_CD = :V15".
      *----------  証券種別コード
             15  SQL-SELECT-47-SEC PIC  X(26).
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(20)  VALUE
                 " AND TATE_FLG = :V17".
      *----------  玉ID
             15  FILLER            PIC  X(21)  VALUE
                 " AND GYOKU_ID = :V18 ".
      *----------  受渡日
             15  FILLER            PIC  X(21)  VALUE
                 " AND UKE_YMD >= :V19 ".
      *----------  約定ベースの場合
         05  SQL-SELECT-47-YKJ.
      *----------  約定日
           10  FILLER              PIC  X(21)  VALUE
               " AND YKJ_YMD <= :V20 ".
      *----------  受渡ベースの場合
         05  SQL-SELECT-47-UKE.
      *----------  受渡日
           10  FILLER              PIC  X(21)  VALUE
               " AND UKE_YMD <= :V21 ".
      *----------  受渡ベースの場合
         05  SQL-SELECT-47-ROWNUM.
      *---------- 20120928 修正開始
           10  FILLER              PIC  X(14)  VALUE
               " AND ROWNUM=1 ".
      *----------  証券種別コード
         05  SQL-SELECT-47-SEC-1.
           10  FILLER              PIC  X(22)  VALUE
                 " AND SEC_SBT_CD = :V16".
         05  SQL-SELECT-47-SEC-2.
           10  FILLER              PIC  X(26)  VALUE
                 " AND SEC_SBT_CD LIKE 'MA%'".
      *---------- 20120928 修正終了
      *----------  未収収益（別紙1-48 SQL説明）
         05  SQL-SELECT-48.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 "SELECT ".
             15  FILLER            PIC  X(10)  VALUE
                 "/*+ INDEX(".
             15  SQL-TKMZMS00-1    PIC  X(13).
             15  FILLER            PIC  X(01)  VALUE " ".
             15  SQL-TKMZMS00-2    PIC  X(13).
             15  FILLER            PIC  X(10)  VALUE "_PRKY) */ ".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(08)  VALUE
                 "FUND_CD ".
      *---------- 20120928 修正終了
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZMS00      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(15)  VALUE
                 " FUND_CD = :V22".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
                 " AND PTF_CD = :V23".
      *----------  銘柄コード
             15  FILLER            PIC  X(18)  VALUE
                 " AND MEG_CD = :V24".
      *----------  証券種別コード
             15  SQL-SELECT-48-SEC PIC  X(26).
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(20)  VALUE
                 " AND TATE_FLG = :V26".
      *----------  玉ID
             15  FILLER            PIC  X(20)  VALUE
                 " AND GYOKU_ID = :V27".
      *----------  適用開始日 >= ARG1.基準日断面情報.開始基準日の翌日
             15  FILLER            PIC  X(24)  VALUE
                 " AND TEKIYO_FROM >= :V28".
      *----------  適用開始日 <= ARG1.基準日断面情報.基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND TEKIYO_FROM <= :V29 ".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(14)  VALUE
                 " AND ROWNUM=1 ".
      *----------  証券種別コード
         05  SQL-SELECT-48-SEC-1.
           10  FILLER              PIC  X(22)  VALUE
                 " AND SEC_SBT_CD = :V25".
         05  SQL-SELECT-48-SEC-2.
           10  FILLER              PIC  X(26)  VALUE
                 " AND SEC_SBT_CD LIKE 'MA%'".
      *---------- 20120928 修正終了
      *----------  債券過去経過利息（別紙1-49 SQL説明）
         05  SQL-SELECT-49.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 "SELECT ".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(08)  VALUE
                 "FUND_CD ".
      *---------- 20120928 修正終了
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKMZKR00      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(15)  VALUE
                 " FUND_CD = :V30".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(18)  VALUE
                 " AND PTF_CD = :V31".
      *----------  銘柄コード
             15  FILLER            PIC  X(18)  VALUE
                 " AND MEG_CD = :V32".
      *----------  証券種別コード
             15  FILLER            PIC  X(22)  VALUE
                 " AND SEC_SBT_CD = :V33".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(20)  VALUE
                 " AND TATE_FLG = :V34".
      *----------  玉ID
             15  FILLER            PIC  X(20)  VALUE
                 " AND GYOKU_ID = :V35".
      *----------  適用開始日 >= ARG1.基準日断面情報.開始基準日の翌日
             15  FILLER            PIC  X(24)  VALUE
                 " AND TEKIYO_FROM >= :V36".
      *----------  適用開始日 <= ARG1.基準日断面情報.基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND TEKIYO_FROM <= :V37 ".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(14)  VALUE
                 " AND ROWNUM=1 ".
      *---------- 20120928 修正終了
      *----------  権利配当情報（別紙1-50 SQL説明）
         05  SQL-SELECT-50.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
                 "SELECT ".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(13)  VALUE
                 "NAIBU_MEG_CD ".
      *---------- 20120928 修正終了
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  SQL-TKJCKP00      PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
      *----------  権利配当情報系列コード
             15  FILLER            PIC  X(24)  VALUE
                 " KENP_INFO_KRTU_CD = ' '".
      *----------  内部銘柄コード
             15  FILLER            PIC  X(24)  VALUE
                 " AND NAIBU_MEG_CD = :V38".
      *----------  権利／配当区分
             15  FILLER            PIC  X(25)  VALUE
                 " AND KENRI_HAIT_KBN = '2'".
      *----------  適用開始日 >= ARG1.基準日断面情報.開始基準日の翌日
             15  FILLER            PIC  X(24)  VALUE
                 " AND TEKIYO_FROM >= :V39".
      *----------  適用開始日 <= ARG1.基準日断面情報.基準日
             15  FILLER            PIC  X(24)  VALUE
                 " AND TEKIYO_FROM <= :V40".
      *---------- 20120928 修正開始
             15  FILLER            PIC  X(14)  VALUE
                 " AND ROWNUM=1 ".
      *---------- 20120928 修正終了
      *----------  銘柄別断面情報（別紙1-51 SQL説明）
         05  SQL-UPDATE-51.
           10  SQL-UPDATE.
             15  FILLER            PIC  X(07)  VALUE
                 "UPDATE ".
             15  SQL-TKMZBW03      PIC  X(13).
             15  FILLER            PIC  X(04)  VALUE
                 " SET".
             15  FILLER            PIC  X(25)  VALUE
                 " YUKO_MEG_FLG = :V41 ".
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
      *----------  ファンドコード
             15  FILLER            PIC  X(27)  VALUE
                 " FUND_CD = :V42".
      *----------  ポートフォリオコード
             15  FILLER            PIC  X(25)  VALUE
                 " AND PTF_CD = :V43".
      *----------  処理実行日
             15  FILLER            PIC  X(25)  VALUE
                 " AND SYORI_YMD = :V44".
      *----------  起動ID
             15  FILLER            PIC  X(25)  VALUE
                 " AND KIDOU_ID = :V45".
      *----------  基準日
             15  FILLER            PIC  X(25)  VALUE
                 " AND KJN_YMD = :V46".
      *----------  銘柄コード
             15  FILLER            PIC  X(25)  VALUE
                 " AND MEG_CD = :V47".
      *----------  証券種別コード
             15  FILLER            PIC  X(25)  VALUE
                 " AND SEC_SBT_CD = :V48".
      *----------  資産負債・買建売建フラグ
             15  FILLER            PIC  X(25)  VALUE
                 " AND TATE_FLG = :V49".
      *----------  玉ＩＤ
             15  FILLER            PIC  X(25)  VALUE
                 " AND GYOKU_ID = :V50".
      *----------  銘柄種類
             15  FILLER            PIC  X(25)  VALUE
                 " AND MEG_CD_SHRU = :V51".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- SELECT SQL文(別紙1-1)
         05  WK-MSG-1-1.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSK00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE
               "'".
      *---------- SELECT SQL文(別紙1-3)
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW02         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND SYORI_YMD =".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(14)  VALUE
               "' AND JUNBAN =".
           10  WK-JUNBAN           PIC  S9(07).
      *---------- SELECT SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW03         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(17)  VALUE
               "' AND SYORI_YMD =".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND KJN_YMD =".
           10  WK-KJN-YMD          PIC  S9(08).
      *---------- SELECT SQL文(別紙1-6)
         05  WK-MSG-1-6-A.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSK00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(25)  VALUE
               "' AND LAST_KJY_YMD_YKJ >=".
           10  WK-LAST-KJY-YMD-YKJ
                                   PIC  S9(08).
           10  FILLER              PIC  X(25)  VALUE
               " AND SBN_CALC_FROM_YKJ <=".
           10  WK-SBN-CALC-FROM-YKJ
                                   PIC  S9(08).
      *---------- SELECT SQL文(別紙1-6)
         05  WK-MSG-1-6-B.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSK00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(25)  VALUE
               "' AND LAST_KJY_YMD_UKE >=".
           10  WK-LAST-KJY-YMD-UKE
                                   PIC  S9(08).
           10  FILLER              PIC  X(25)  VALUE
               " AND SBN_CALC_FROM_UKE <=".
           10  WK-SBN-CALC-FROM-UKE
                                   PIC  S9(08).
      *---------- INSERT SQL文(別紙1-2,別紙1-5,別紙1-7,別紙1-12,別紙1-16)
         05  WK-MSG-1-2.
           10  FILLER              PIC  X(09)  VALUE
               "  VALUES ".
           10  FILLER              PIC  X(04)  VALUE
               "  ( ".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(02)  VALUE
               ", ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  WK-SIJO-TUKA-CD     PIC  X(04).
           10  FILLER              PIC  X(03)  VALUE
               "', ".
           10  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
           10  FILLER              PIC  X(03)  VALUE
               ", '".
           10  WK-MEG-CD-SHRU      PIC  X(01).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-SAI-CALC-KBN     PIC  X(01).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-MEG-CD-SHRU2     PIC  X(01).
           10  FILLER              PIC  X(04)  VALUE
               "', '".
           10  WK-YUKO-MEG-FLG-1   PIC  X(01).
           10  FILLER              PIC  X(02)  VALUE
               "')".
      *---------- DELECT SQL文(別紙1-10)
         05  WK-MSG-1-10.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  WK-TKMZZR00       PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(10)  VALUE
                 " KJN_YMD =".
             15  WK-KJN-YMD        PIC  S9(08).
             15  FILLER            PIC  X(39)  VALUE
                 " AND ( RIYO_CMP_CD , FUND_CD , PTF_CD ,".
             15  FILLER            PIC  X(44)  VALUE
                 " SEC_SBT_CD , MEG_CD , TATE_FLG , GYOKU_ID )".
             15  FILLER            PIC  X(13)  VALUE
                 " IN ( SELECT ".
             15  FILLER            PIC  X(33)  VALUE
                 " RIYO_CMP_CD , FUND_CD , PTF_CD ,".
             15  FILLER            PIC  X(43)  VALUE
                 " SEC_SBT_CD , MEG_CD , TATE_FLG , GYOKU_ID ".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  WK-TKMZSK00       PIC  X(13).
             15  FILLER            PIC  X(09)  VALUE
                 " A WHERE ".
             15  FILLER            PIC  X(21)  VALUE
                 " A.LAST_YUKO_YMD <> 0".
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.LAST_YUKO_YMD <> 99999999".
             15  FILLER            PIC  X(23)  VALUE
                 " AND A.LAST_YUKO_YMD <=".
             15  WK-LAST-YUKO-YMD  PIC  S9(08).
             15  FILLER            PIC  X(21)  VALUE
                 " AND A.RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD    PIC  X(04).
             15  FILLER            PIC  X(18)  VALUE
                 "' AND A.FUND_CD ='".
             15  WK-FUND-CD        PIC  X(12).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND A.PTF_CD ='".
             15  WK-PTF-CD         PIC  X(04).
             15  FILLER            PIC  X(03)  VALUE
                 "' )".
      *---------- DELETE SQL文(別紙1-13)
         05  WK-MSG-1-13.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  WK-TKMZSR00       PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(10)  VALUE
                 " KJN_YMD =".
             15  WK-KJN-YMD        PIC  S9(08).
             15  FILLER            PIC  X(39)  VALUE
                 " AND ( RIYO_CMP_CD , FUND_CD , PTF_CD ,".
             15  FILLER            PIC  X(13)  VALUE
                 " KS_KOZA_NO )".
             15  FILLER            PIC  X(13)  VALUE
                 " IN ( SELECT ".
             15  FILLER            PIC  X(33)  VALUE
                 " RIYO_CMP_CD , FUND_CD , PTF_CD ,".
             15  FILLER            PIC  X(08)  VALUE
                 " MEG_CD ".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  WK-TKMZSK00       PIC  X(13).
             15  FILLER            PIC  X(09)  VALUE
                 " A WHERE ".
             15  FILLER            PIC  X(21)  VALUE
                 " A.LAST_YUKO_YMD <> 0".
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.LAST_YUKO_YMD <> 99999999".
             15  FILLER            PIC  X(23)  VALUE
                 " AND A.LAST_YUKO_YMD <=".
             15  WK-LAST-YUKO-YMD  PIC  S9(08).
             15  FILLER            PIC  X(21)  VALUE
                 " AND A.RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD    PIC  X(04).
             15  FILLER            PIC  X(18)  VALUE
                 "' AND A.FUND_CD ='".
             15  WK-FUND-CD        PIC  X(12).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND A.PTF_CD ='".
             15  WK-PTF-CD         PIC  X(04).
             15  FILLER            PIC  X(03)  VALUE
                 "' )".
      *---------- DELETE SQL文(別紙1-14)
         05  WK-MSG-1-14.
           10  SQL-DELETE.
             15  FILLER            PIC  X(12)  VALUE
                 "DELETE FROM ".
             15  WK-TKMZGZ00       PIC  X(13).
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(10)  VALUE
                 " KJN_YMD =".
             15  WK-KJN-YMD        PIC  S9(08).
             15  FILLER            PIC  X(39)  VALUE
                 " AND ( RIYO_CMP_CD , FUND_CD , PTF_CD )".
             15  FILLER            PIC  X(13)  VALUE
                 " IN ( SELECT ".
             15  FILLER            PIC  X(32)  VALUE
                 " RIYO_CMP_CD , FUND_CD , PTF_CD ".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  WK-TKMZSK00       PIC  X(13).
             15  FILLER            PIC  X(09)  VALUE
                 " A WHERE ".
             15  FILLER            PIC  X(21)  VALUE
                 " A.LAST_YUKO_YMD <> 0".
             15  FILLER            PIC  X(32)  VALUE
                 " AND A.LAST_YUKO_YMD <> 99999999".
             15  FILLER            PIC  X(23)  VALUE
                 " AND A.LAST_YUKO_YMD <=".
             15  WK-LAST-YUKO-YMD  PIC  S9(08).
             15  FILLER            PIC  X(33)  VALUE
                 " AND A.MEG_CD = '               '".
             15  FILLER            PIC  X(25)  VALUE
                 " AND A.SEC_SBT_CD = 'PRI'".
             15  FILLER            PIC  X(21)  VALUE
                 " AND A.RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD    PIC  X(04).
             15  FILLER            PIC  X(18)  VALUE
                 "' AND A.FUND_CD ='".
             15  WK-FUND-CD        PIC  X(12).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND A.PTF_CD ='".
             15  WK-PTF-CD         PIC  X(04).
             15  FILLER            PIC  X(03)  VALUE
                 "' )".
      *---------- SELECT SQL文(別紙1-11)
         05  WK-MSG-1-11.
           10  SQL-SELECT.
             15  FILLER            PIC  X(07)  VALUE
               " SELECT".
             15  FILLER            PIC  X(09)  VALUE
               "  MEG_CD,".
             15  FILLER            PIC  X(13)  VALUE
               "  SEC_SBT_CD,".
             15  FILLER            PIC  X(11)  VALUE
               "  TATE_FLG,".
             15  FILLER            PIC  X(10)  VALUE
               "  GYOKU_ID".
           10  SQL-FROM.
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  WK-TKMZSK00       PIC  X(13).
           10  SQL-WHERE.
             15  FILLER            PIC  X(06)  VALUE
                 " WHERE".
             15  FILLER            PIC  X(46)  VALUE
                 "  (SEC_SBT_CD , MEG_CD , TATE_FLG , GYOKU_ID )".
             15  FILLER            PIC  X(17)  VALUE
                 " NOT IN ( SELECT ".
             15  FILLER            PIC  X(43)  VALUE
                 " SEC_SBT_CD , MEG_CD , TATE_FLG , GYOKU_ID ".
             15  FILLER            PIC  X(06)  VALUE
                 " FROM ".
             15  WK-TKMZBW03       PIC  X(13).
             15  FILLER            PIC  X(09)  VALUE
                 " A WHERE ".
             15  FILLER            PIC  X(14)  VALUE
                 " A.SYORI_YMD =".
             15  WK-SYORI-YMD      PIC  S9(08).
             15  FILLER            PIC  X(18)  VALUE
                 " AND A.KIDOU_ID ='".
             15  WK-KIDOU-ID       PIC  X(04).
             15  FILLER            PIC  X(22)  VALUE
                 "' AND A.RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD    PIC  X(04).
             15  FILLER            PIC  X(18)  VALUE
                 "' AND A.FUND_CD ='".
             15  WK-FUND-CD        PIC  X(12).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND A.PTF_CD ='".
             15  WK-PTF-CD         PIC  X(04).
             15  FILLER            PIC  X(17)  VALUE
                 "' AND A.KJN_YMD =".
             15  WK-KJN-YMD        PIC  S9(08).
             15  FILLER            PIC  X(02)  VALUE
                 " )".
             15  FILLER            PIC  X(19)  VALUE
                 " AND RIYO_CMP_CD ='".
             15  WK-RIYO-CMP-CD-W  PIC  X(04).
             15  FILLER            PIC  X(16)  VALUE
                 "' AND FUND_CD ='".
             15  WK-FUND-CD-W      PIC  X(12).
             15  FILLER            PIC  X(15)  VALUE
                 "' AND PTF_CD ='".
             15  WK-PTF-CD-W       PIC  X(04).
             15  FILLER            PIC  X(01)  VALUE
                 "'".
      *----------  銘柄別断面情報（TKMZBW03）
         05  WK-MSG-1-18.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TBL-TKMZBW03     PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE  "),".
      *----------  処理実行日
           10  FILLER              PIC  X(19)
               VALUE  "WHERE SYORI_YMD = '".
           10  WK-SQL-SYORI-YMD    PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  起動ID
           10  FILLER              PIC  X(17)
               VALUE  " AND KIDOU_ID = '".
           10  WK-SQL-KIDOU-ID     PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  利用会社コード
           10  FILLER              PIC  X(20)
               VALUE  " AND RIYO_CMP_CD = '".
           10  WK-SQL-RIYO-CMP-CD  PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ファンドコード
           10  FILLER              PIC  X(16)
               VALUE  " AND FUND_CD = '".
           10  WK-SQL-FUND-CD      PIC  X(12).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(15)
               VALUE  " AND PTF_CD = '".
           10  WK-SQL-PTF-CD       PIC  X(04).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *----------  基準日
           10  FILLER              PIC  X(16)  VALUE
                 " AND KJN_YMD = '".
           10  WK-SQL-KJN-YMD      PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE  "'".
      *---------- 証券種別コード
           10  FILLER              PIC  X(47)  VALUE
                 " AND SEC_SBT_CD IN ('CASH','MAR','MABF','MABO',".
           10  FILLER              PIC  X(47)  VALUE
                 "'MAB','MAFB','MASF','MASO','MAS','MAFS','MA99')".
           10  FILLER              PIC  X(23)  VALUE
                 " AND MEG_CD_SHRU = '3' ".
      *----------  20100212(GIPS2.0)  START
      *---------- SELECT SQL文(別紙1-19)
         05  WK-MSG-1-19.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSK00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(22)  VALUE
               "' AND CALC_KKN_FROM ='".
           10  WK-CALC-KKN-FROM    PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               "' AND CALC_KKN_TO ='".
           10  WK-CALC-KKN-TO      PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
                 "'".
      *---------- SELECT SQL文(別紙1-21)
         05  WK-MSG-1-21.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZBW03         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(22)  VALUE
               "' AND CALC_KKN_FROM ='".
           10  WK-CALC-KKN-FROM    PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               "' AND CALC_KKN_TO ='".
           10  WK-CALC-KKN-TO      PIC  S9(08).
           10  FILLER              PIC  X(18)  VALUE
               "' AND SYORI_YMD ='".
           10  WK-SYORI-YMD        PIC  S9(08).
           10  FILLER              PIC  X(17)  VALUE
               "' AND KIDOU_ID ='".
           10  WK-KIDOU-ID         PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND KJN_YMD ='".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
                 "'".
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
         05  WK-MSG-1-23.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZGP01         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ")".
         05  WK-MSG-1-24.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZGP01         PIC  X(13).
           10  FILLER              PIC  X(01)  VALUE
               ")".
           10  FILLER              PIC  X(10)  VALUE
               "FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(22)  VALUE
               "' AND CALC_KKN_FROM ='".
           10  WK-CALC-KKN-FROM    PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               "' AND CALC_KKN_TO ='".
           10  WK-CALC-KKN-TO      PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE
                 "'".
      *----------  20100223(GIPS2.0)  END
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
           COPY  "CZRTNPACKAGE.cpy".
      *---------- テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  RTNパッケージコピー句
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ1510-IN.
           COPY  "SMZJ1510.cpy".
       01  PARM-SMZJ1510-RTNPKG.
      *----------  RTNパッケージ
         05  PARM-SMZJ1510-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ1510-IN
                  PARM-SMZJ1510-RTNPKG.
      ******************************************************************
      *                 対象銘柄（玉）決定
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  SMZJ1510  START  ****"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  SMZJ1510  END  ****"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *    3.1  前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID "****  前処理  START  ****"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBL-ID-INIT-RTN
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID "****  前処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1  初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  初期化処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  WORK-AREA
                       FLAG-AREA
                       HST-AREA
                       SQL-AREA
                       E-MSG-TBL
                       PARM-SMZJ1510-ARG3
                       PARM-SCZY1170-IN
                       PARM-SCZY1170-RTNPKG
                       PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-----  初回ＣＡＬＬ時のみフラグエリア２の初期化を行う            @3212SEINO@@
           IF     FIRST-SW = 'YES'                                      @3212SEINO@@
           THEN                                                         @3212SEINO@@
                  INITIALIZE                FLG-AREA2                   @3212SEINO@@
                  MOVE  'NO '           TO  FIRST-SW                    @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           MOVE  CNS-RTN-000
             TO  RTN-CD                 OF  PARM-SCZY1170-ARG1
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":WORK-AREA=["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID ":FLAG-AREA=["FLAG-AREA"]"
      D    DISPLAY  CNS-PGM-ID ":FLG-AREA2 =["FLG-AREA2 "]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":HST-AREA =["HST-AREA "]"
      D    DISPLAY  CNS-PGM-ID ":SQL-AREA =["SQL-AREA "]"
      D    DISPLAY  CNS-PGM-ID ":E-MSG-TBL=["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SMZJ1510-ARG3  =["
      D                          PARM-SMZJ1510-ARG3"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1170-IN    =["
      D                          PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1170-RTNPKG=["
      D                          PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-SCZY1160-INOUT =["
      D                          PARM-SCZY1160-INOUT"]"
      D    DISPLAY  CNS-PGM-ID ":PARM-RTNPKG         =["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
      *----------  処理実行日
           MOVE  SYORI-YMD              OF  PARM-SMZJ1510-IN
             TO  WK-IN-SYORI-YMD
      *----------  起動ID
           MOVE  KIDOU-ID               OF  PARM-SMZJ1510-IN
             TO  WK-IN-KIDOU-ID
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD            OF  PARM-SMZJ1510-IN
             TO  WK-IN-RIYO-CMP-CD
      *----------  ファンドコード
           MOVE  FUND-CD                OF  PARM-SMZJ1510-IN
             TO  WK-IN-FUND-CD
      *----------  ポートフォリオコード
           MOVE  PTF-CD                 OF  PARM-SMZJ1510-IN
             TO  WK-IN-PTF-CD
      *----------  基準日
           MOVE  KJN-YMD                OF  PARM-SMZJ1510-IN
             TO  WK-IN-KJN-YMD
      *----------  順番
           MOVE  JUNBAN                 OF  PARM-SMZJ1510-IN
             TO  WK-IN-JUNBAN
      *----------  開始基準日
           MOVE  KAISI-KJN-YMD          OF  PARM-SMZJ1510-IN
             TO  WK-IN-KAISI-KJN-YMD
      *----------  開始基準日の翌日
           MOVE  KAISI-KJN-YMD-NEXT     OF  PARM-SMZJ1510-IN
             TO  WK-IN-KAISI-KJN-YMD-NEXT
      *----------  計算パターン
           MOVE  CALC-PTN               OF  PARM-SMZJ1510-IN
             TO  WK-IN-CALC-PTN
      *----------  基本会計ベースフラグ
           MOVE  KH-KAIKEI-BASE-FLG     OF  PARM-SMZJ1510-IN
             TO  WK-IN-KH-KAIKEI-BASE-FLG
           MOVE  CNS-C1  TO  WK-ZOFKU-KBN
      *----------  20100212(GIPS2.0)  START
      *----------  ＧＩＰＳモード
           MOVE  GIPS-MODE              OF  PARM-SMZJ1510-IN
             TO  WK-IN-GIPS-MODE
      *----------  20100212(GIPS2.0)  END
      *----------  処理フラグ
           MOVE  SYURI-FLG              OF  PARM-SMZJ1510-ARG1
             TO  WK-SYURI-FLG
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":処理実行日    =["WK-IN-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID ":起動ID        =["WK-IN-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["WK-IN-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID ":ファンドコード=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID ":ポートフォリオコード=["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID ":基準日        =["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID ":順番          =["WK-IN-JUNBAN"]"
      D    DISPLAY  CNS-PGM-ID ":開始基準日    =["WK-IN-KAISI-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID ":開始基準日の翌日=["
      D             WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID ":計算パターン  =["WK-IN-CALC-PTN"]"
      D    DISPLAY  CNS-PGM-ID ":基本会計ベースフラグ=["
      D             WK-IN-KH-KAIKEI-BASE-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":WK-ZOFKU-KBN  =["WK-ZOFKU-KBN"]"
      *----------  20100212(GIPS2.0)  START
      D    DISPLAY  CNS-PGM-ID ":ＧＩＰＳモード  =["WK-IN-GIPS-MODE"]"
      *----------  20100212(GIPS2.0)  END
      D    DISPLAY  CNS-PGM-ID ":処理フラグ      =["WK-SYURI-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":WK有効銘柄フラグ =["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID ":****  初期化処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *        テーブルID取得処理
      ******************************************************************
       TBL-ID-INIT-RTN        SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  START  ****"
      *-----------------------------------------------------------------
      *---------- テーブルID取得処理
           MOVE  WK-IN-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  取引差分更新管理テーブル
           MOVE  CNS-TBL-ID1
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  基準日断面情報テーブル
           MOVE  CNS-TBL-ID2
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *----------  銘柄別断面情報テーブル
           MOVE  CNS-TBL-ID3
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *----------  残高履歴テーブル
           MOVE  CNS-TBL-ID4
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *----------  資金残履歴テーブル
           MOVE  CNS-TBL-ID5
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
      *----------  元本残高テーブル
           MOVE  CNS-TBL-ID6
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(6)
      *----------  取引
           MOVE  CNS-TBL-ID7
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(7)
      *----------  20100212(GIPS2.0)  START
      *----------  再処理要ポートフォリオ一覧（取引）
           MOVE  CNS-TBL-ID9
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(8)
      *----------  再処理要ポートフォリオ一覧（銘柄属性）
           MOVE  CNS-TBL-ID11
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(9)
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
      *----------  ワーク再処理要銘柄一覧
           MOVE  CNS-TBL-ID12
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(10)
      *----------  未収収益
           MOVE  CNS-TBL-ID13
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(11)
      *----------  債券過去経過利息
           MOVE  CNS-TBL-ID14
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(12)
      *----------  20100212(GIPS2.0)  END
      *----------  権利配当情報
           MOVE  CNS-TBL-ID15
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(13)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID1=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID2=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID3=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID4=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID5=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(5)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID6=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(6)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID7=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(7)"]"
      *----------  20100212(GIPS2.0)  START
      D    DISPLAY  CNS-PGM-ID ":テーブルID9=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(8)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID11=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(9)"]"
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
      D    DISPLAY  CNS-PGM-ID ":テーブルID12=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(10)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID13=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(11)"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID14=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(12)"]"
      *----------  20100223(GIPS2.0)  END
      D    DISPLAY  CNS-PGM-ID ":テーブルID15=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(13)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SCZY1160)=["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TABLE-ID1
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TABLE-ID2
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TABLE-ID3
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TABLE-ID4
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TABLE-ID5
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(6)
               TO  WK-TABLE-ID6
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(7)
               TO  WK-TABLE-ID7
      *----------  20100212(GIPS2.0)  START
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(8)
               TO  WK-TABLE-ID9
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(9)
               TO  WK-TABLE-ID11
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(10)
               TO  WK-TABLE-ID12
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(11)
               TO  WK-TABLE-ID13
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(12)
               TO  WK-TABLE-ID14
      *----------  20100223(GIPS2.0)  END
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(13)
               TO  WK-TABLE-ID15
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID1=["WK-TABLE-ID1"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID2=["WK-TABLE-ID2"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID3=["WK-TABLE-ID3"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID4=["WK-TABLE-ID4"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID5=["WK-TABLE-ID5"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID6=["WK-TABLE-ID6"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID7=["WK-TABLE-ID7"]"
      *----------  20100212(GIPS2.0)  START
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID9=["WK-TABLE-ID9"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID11=["WK-TABLE-ID11"]"
      *----------  20100212(GIPS2.0)  END
      *----------  20100223(GIPS2.0)  START
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID12=["WK-TABLE-ID12"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID13=["WK-TABLE-ID13"]"
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID14=["WK-TABLE-ID14"]"
      *----------  20100223(GIPS2.0)  END
      D    DISPLAY  CNS-PGM-ID ":編集後テーブルID15=["WK-TABLE-ID15"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------</DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":テーブルID取得エラー"
      *-----------------------------------------------------------------
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.2  主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID "****  主処理  START  ****"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.GIPSモード=["
      D             WK-IN-GIPS-MODE"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.順番=["
      D             WK-IN-JUNBAN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.計算パターン=["
      D             WK-IN-CALC-PTN"]"
      *-----------------------------------------------------------------
      *----------  20100212(GIPS2.0)  START
           IF  WK-IN-GIPS-MODE = CNS-C1
           THEN
      *----------  20100223(GIPS2.0)  START
      *----------  ワーク再処理要銘柄一覧TBLクリア処理
             PERFORM  TRUNCATE-TABLE-RTN
      *----------  ワーク再処理要銘柄一覧TBLへINSERT処理
             PERFORM  INSERT-TABLE-RTN
      *----------  3.2.0.2 ARG1.基準日断面情報.順番＝1の場合（最初の断面）
             PERFORM  TORIHIKI-RTN
      *----------  3.2.0.3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.順番=["
      D             WK-IN-JUNBAN"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.処理フラグ=["
      D             WK-SYURI-FLG"]"
      *-----------------------------------------------------------------
             IF  WK-IN-JUNBAN = CNS-1
               AND WK-SYURI-FLG = CNS-C1
             THEN
               PERFORM  DEL-TBL-RTN
             ELSE
               CONTINUE
             END-IF
      *----------  3.2.0.4元1711の処理をする
               PERFORM  DEL-TBL2-RTN
      *----------  20100223(GIPS2.0)  END
           ELSE
             EVALUATE  WK-IN-CALC-PTN
               WHEN  CNS-CALC-PTN-2
      *----------  3.2.1.当断面の計算パターンは強制の場合の処理
                 PERFORM  DANMEI-CALC-PTN-2-RTN
               WHEN  CNS-CALC-PTN-1
      *----------  3.2.2.当断面の計算パターンは差分の場合の処理
                 PERFORM  DANMEI-CALC-PTN-1-RTN
               WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":当断面の計算パターン 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                 MOVE  CNS-POS-002
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                 MOVE  CNS-RTN-800
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                 MOVE  ZERO
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                 MOVE  CNS-DETAIL-0
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
                 MOVE  CNS-PARM-ERR
                   TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-ZOFKU-KBN=["WK-ZOFKU-KBN"]"
      *-----------------------------------------------------------------
           IF  WK-ZOFKU-KBN = CNS-C1
           THEN
      *----------  3.2.4.銘柄別断面情報データ増幅処理
             PERFORM  MGBT-DMN-INFO-ADD-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  20100212(GIPS2.0)  END
      *----------  3.2.5.有効銘柄チェック処理
           PERFORM  YUKO-MEG-FETCH-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理   END   ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      *----------  20100223(GIPS2.0)  START
      ******************************************************************
      *    ワーク再処理要銘柄一覧TBLクリア処理
      ******************************************************************
       TRUNCATE-TABLE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク再処理要銘柄一覧TBLクリア処理"
      D             "  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
           MOVE  WK-TABLE-ID12
             TO  SQL-TKMZGP01           OF  SQL-TRUNCATE-TKMZGP01,
                 WK-TKMZGP01            OF  WK-MSG-1-23
      *----ＳＱＬ文
           MOVE  SQL-TRUNCATE-TKMZGP01  TO  SQLSTMT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"
      *-----------------------------------------------------------------
           EXEC SQL
               PREPARE S11 FROM :SQLSTMT
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE        =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-003
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-TRUNCATE,
                     SQL-TRUNCATE-TKMZGP01,
                     WK-MSG-1-23        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S11
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE        =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-004
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-TRUNCATE,
                     SQL-TRUNCATE-TKMZGP01,
                     WK-MSG-1-23        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ワーク再処理要銘柄一覧TBLクリア処理"
      D             "  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TRUNCATE-TABLE-EXT.
           EXIT.
      ******************************************************************
      *    ワーク再処理要銘柄一覧TBLへINSERT処理
      ******************************************************************
       INSERT-TABLE-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク再処理要銘柄一覧TBLへINSERT処理"
      D                       "  START  *****"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
           MOVE  WK-TABLE-ID12
             TO  SQL-TKMZGP01           OF  SQL-INSERT-1-24,
                 WK-TKMZGP01            OF  WK-MSG-1-24
           MOVE  WK-TABLE-ID9
             TO  SQL-TKDYGP12           OF  SQL-INSERT-1-24
           MOVE  WK-TABLE-ID11
             TO  SQL-TKDYGP16           OF  SQL-INSERT-1-24
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZGP01-I24,
                 WK-FUND-CD             OF  WK-MSG-1-24
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZGP01-I24,
                 WK-PTF-CD              OF  WK-MSG-1-24
           MOVE  WK-IN-KJN-YMD
             TO  H-CALC-KKN-FROM        OF  H-TKMZGP01-I24,
                 H-CALC-KKN-TO          OF  H-TKMZGP01-I24,
                 WK-CALC-KKN-FROM       OF  WK-MSG-1-24,
                 WK-CALC-KKN-TO         OF  WK-MSG-1-24
      *----ＳＱＬ文
           MOVE  SQL-INSERT-1-24        TO  SQLSTMT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-IN-FUND-CD=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-PTF-CD=["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":WK-IN-KJN-YMD=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT=["SQLSTMT"]"
      *-----------------------------------------------------------------
           EXEC SQL
               PREPARE S12 FROM :SQLSTMT
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE        =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-005
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     SQL-INSERT         OF  SQL-INSERT-1-24,
                     WK-MSG-1-24        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL
           EXECUTE S12
                 USING :H-TKMZGP01-I24.H-FUND-CD,
                       :H-TKMZGP01-I24.H-PTF-CD,
                       :H-TKMZGP01-I24.H-CALC-KKN-FROM,
                       :H-TKMZGP01-I24.H-CALC-KKN-TO,
                       :H-TKMZGP01-I24.H-FUND-CD,
                       :H-TKMZGP01-I24.H-PTF-CD,
                       :H-TKMZGP01-I24.H-CALC-KKN-FROM,
                       :H-TKMZGP01-I24.H-CALC-KKN-TO
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(EXECUTE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE        =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-006
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     SQL-INSERT         OF  SQL-INSERT-1-24,
                     WK-MSG-1-24        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク再処理要銘柄一覧TBLへINSERT処理"
      D                       "  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       INSERT-TABLE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.0.3
      ******************************************************************
       DEL-TBL-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DEL-TBL  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-DEL-IDX
                       H-DEL-KEY
      *-----------  ワークDEL_INDEX←1
           MOVE  CNS-1                TO  H-DEL-IDX
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DEL-TBL-RTN]"                 GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  VARYING  WK-CNT  FROM CNS-1 BY CNS-1
           UNTIL  WK-CNT > KJN-NISU   OF  PARM-SMZJ1510-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-DEL-IDX =["H-DEL-IDX"]"
      D    DISPLAY  CNS-PGM-ID":WK-CNT =["WK-CNT"]"
      *-----------------------------------------------------------------
      *-----------  ワークDELETE用データパッケージ[ワークDEL_INDEX]を編集
             MOVE  RIYO-CMP-CD        OF  PARM-SMZJ1510-ARG1
               TO  H-RIYO-CMP-CD      OF  H-DEL-TBL-KEY(H-DEL-IDX),
                   H-RIYO-CMP-CD-2    OF  H-DEL-TBL-KEY(H-DEL-IDX)
             MOVE  FUND-CD            OF  PARM-SMZJ1510-ARG1
               TO  H-FUND-CD          OF  H-DEL-TBL-KEY(H-DEL-IDX),
                   H-FUND-CD-2        OF  H-DEL-TBL-KEY(H-DEL-IDX)
             MOVE  PTF-CD             OF  PARM-SMZJ1510-ARG1
               TO  H-PTF-CD           OF  H-DEL-TBL-KEY(H-DEL-IDX),
                   H-PTF-CD-2         OF  H-DEL-TBL-KEY(H-DEL-IDX)
             MOVE  KAISI-KJN-YMD2     OF  KJN-YMD-SYOSAI(WK-CNT)
               TO  H-KAISI-KJN-YMD    OF  H-DEL-TBL-KEY(H-DEL-IDX)
             MOVE  KJN-YMD2           OF  KJN-YMD-SYOSAI(WK-CNT)
               TO  H-KJN-YMD          OF  H-DEL-TBL-KEY(H-DEL-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD  =["
      D               H-RIYO-CMP-CD      OF  H-DEL-TBL-KEY(H-DEL-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":H-RIYO-CMP-CD-2=["
      D               H-RIYO-CMP-CD-2    OF  H-DEL-TBL-KEY(H-DEL-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD      =["
      D               H-FUND-CD          OF  H-DEL-TBL-KEY(H-DEL-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":H-FUND-CD-2    =["
      D               H-FUND-CD-2        OF  H-DEL-TBL-KEY(H-DEL-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD       =["
      D               H-PTF-CD           OF  H-DEL-TBL-KEY(H-DEL-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":H-PTF-CD-2     =["
      D               H-PTF-CD-2         OF  H-DEL-TBL-KEY(H-DEL-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":H-KAISI-KJN-YMD=["
      D               H-KAISI-KJN-YMD    OF  H-DEL-TBL-KEY(H-DEL-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":H-KJN-YMD      =["
      D               H-KJN-YMD          OF  H-DEL-TBL-KEY(H-DEL-IDX)"]"
      *-----------------------------------------------------------------
             IF  H-DEL-IDX = CNS-100  OR
                 WK-CNT  =  KJN-NISU  OF  PARM-SMZJ1510-ARG1
             THEN
      *----------  1)残高履歴から削除
               PERFORM  DEL-TKMZZR00-2-RTN
      *----------  2)資金残履歴から削除
               PERFORM  DEL-TKMZSR00-2-RTN
      *----------  3)元本残高から削除
               PERFORM  DEL-TKMZGZ00-2-RTN
               INITIALIZE  H-DEL-KEY
               MOVE  CNS-1           TO  H-DEL-IDX
             ELSE
               COMPUTE  H-DEL-IDX = H-DEL-IDX + CNS-1
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DEL-TBL-RTN]"                 GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------  ARG2.処理フラグ←0：処理しない
           MOVE  CNS-X-0
             TO  SYURI-FLG           OF  PARM-SMZJ1510-ARG2
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG2.処理フラグ =["
      D             SYURI-FLG        OF  PARM-SMZJ1510-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":***  DEL-TBL  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TBL-EXT.
           EXIT.
      ******************************************************************
      *   1)残高履歴から削除
      ******************************************************************
       DEL-TKMZZR00-2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  残高履歴TBL
           MOVE  WK-TABLE-ID4
             TO  SQL-TKMZZR00           OF  SQL-DELETE-1-25
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-DELETE-1-25
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID12
             TO  SQL-TKMZGP01           OF  SQL-DELETE-1-25
      *-----------------------------------------------------------------
           MOVE  SQL-DELETE-1-25        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S13  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-007
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-TABLE-ID4       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S13
                USING  :H-DEL-TBL-KEY
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-008
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-TABLE-ID4     DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  残高履歴から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZZR00-2-EXT.
           EXIT.
      ******************************************************************
      *   2)資金残履歴から削除
      ******************************************************************
       DEL-TKMZSR00-2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  資金残履歴TBL
           MOVE  WK-TABLE-ID5
             TO  SQL-TKMZSR00           OF  SQL-DELETE-1-26
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-DELETE-1-26
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID12
             TO  SQL-TKMZGP01           OF  SQL-DELETE-1-26
      *-----------------------------------------------------------------
           MOVE  SQL-DELETE-1-26        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S14  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-009
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-TABLE-ID5       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S14
                USING  :H-DEL-TBL-KEY
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-010
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-TABLE-ID5     DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  資金残履歴から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZSR00-2-EXT.
           EXIT.
      ******************************************************************
      *   3)元本残高から削除
      ******************************************************************
       DEL-TKMZGZ00-2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  元本残高TBL
           MOVE  WK-TABLE-ID6
             TO  SQL-TKMZGZ00           OF  SQL-DELETE-1-41
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-DELETE-1-41
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID12
             TO  SQL-TKMZGP01           OF  SQL-DELETE-1-41
      *-----------------------------------------------------------------
           MOVE  SQL-DELETE-1-41        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S15  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-011
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-TABLE-ID6       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S15
                USING  :H-DEL-TBL-KEY
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-012
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-TABLE-ID6     DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  元本残高から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZGZ00-2-EXT.
           EXIT.
      ******************************************************************
      *    3.2.0.4
      ******************************************************************
       DEL-TBL2-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DEL-TBL2  START ***"
      *-----------------------------------------------------------------
           PERFORM  DATA-EDIT-DEL-RTN
      *----------  1)基準日の残高履歴から削除
           PERFORM  DEL-TKMZZR00-3-RTN
      *----------  2)基準日の元本残高から削除
           PERFORM  DEL-TKMZGZ00-3-RTN
      *----------  3)基準日の資金残履歴から削除
           PERFORM  DEL-TKMZSR00-3-RTN
      *----------  4)未収収益データ削除
           PERFORM  DEL-TKMZMS00-3-RTN
      *----------  5)債券過去経過利息データ削除
           PERFORM  DEL-TKMZKR00-3-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DEL-TBL2  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TBL2-EXT.
           EXIT.
      ******************************************************************
      *   DATA-EDIT-DEL-RTN
      ******************************************************************
       DATA-EDIT-DEL-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DATA-EDIT-DEL-RTN START  ***"
      *-----------------------------------------------------------------
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD       OF  PARM-SMZJ1510-ARG1
             TO  H-RIYO-CMP-CD     OF  H-DEL2-KEY
      *----------  ファンドコード
           MOVE  FUND-CD           OF  PARM-SMZJ1510-ARG1
             TO  H-FUND-CD         OF  H-DEL2-KEY
      *----------  ポートフォリオコード
           MOVE  PTF-CD            OF  PARM-SMZJ1510-ARG1
             TO  H-PTF-CD          OF  H-DEL2-KEY
      *----------  開始基準日
           MOVE  KAISI-KJN-YMD     OF  PARM-SMZJ1510-ARG1
             TO  H-KAISI-KJN-YMD   OF  H-DEL2-KEY
      *----------  基準日
           MOVE  KJN-YMD           OF  PARM-SMZJ1510-ARG1
             TO  H-KJN-YMD         OF  H-DEL2-KEY
      *----------  処理実行日
           MOVE  SYORI-YMD         OF  PARM-SMZJ1510-ARG1
             TO  H-SYORI-YMD       OF  H-DEL2-KEY
      *----------  起動ID
           MOVE  KIDOU-ID          OF  PARM-SMZJ1510-ARG1
             TO  H-KIDOU-ID        OF  H-DEL2-KEY
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード            =["
      D             H-RIYO-CMP-CD     OF  H-DEL2-KEY"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード            =["
      D             H-FUND-CD         OF  H-DEL2-KEY"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード      =["
      D             H-PTF-CD          OF  H-DEL2-KEY"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日                =["
      D             H-KAISI-KJN-YMD   OF  H-DEL2-KEY"]"
      D    DISPLAY  CNS-PGM-ID":基準日                    =["
      D             H-KJN-YMD         OF  H-DEL2-KEY"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日                =["
      D             H-SYORI-YMD       OF  H-DEL2-KEY"]"
      D    DISPLAY  CNS-PGM-ID":起動ID                    =["
      D             H-KIDOU-ID        OF  H-DEL2-KEY"]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DATA-EDIT-DEL-RTN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-EDIT-DEL-EXT.
           EXIT.
      ******************************************************************
      *   1)対象銘柄データの基準日の残高履歴から削除
      ******************************************************************
       DEL-TKMZZR00-3-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄データの基準日の"
      D                 "残高履歴から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  残高履歴TBL
           MOVE  WK-TABLE-ID4
             TO  SQL-TKMZZR00           OF  SQL-DELETE-1-27
      *----------  銘柄別断面情報テーブル
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-DELETE-1-27
      *-----------------------------------------------------------------
           MOVE  SQL-DELETE-1-27        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S22  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-013
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-TABLE-ID4       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象銘柄データの基準日の"
      D                 "残高履歴を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S22
                USING   :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD,
                        :H-DEL2-KEY.H-SYORI-YMD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-014
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-TABLE-ID4     DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象銘柄データの基準日の"
      D                    "残高履歴を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄データの基準日の"
      D                   "残高履歴から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZZR00-3-EXT.
           EXIT.
      ******************************************************************
      *   2)対象銘柄データの基準日の元本残高から削除
      ******************************************************************
       DEL-TKMZGZ00-3-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄データの基準日の"
      D                  "元本残高から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  元本残高TBL
           MOVE  WK-TABLE-ID6
             TO  SQL-TKMZGZ00           OF  SQL-DELETE-1-42
      *----------  銘柄別断面情報テーブル
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-DELETE-1-42
      *-----------------------------------------------------------------
           MOVE  SQL-DELETE-1-42        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S16  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-015
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-TABLE-ID6       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象銘柄データの基準日の"
      D                       "元本残高を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S16
                USING   :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD,
                        :H-DEL2-KEY.H-SYORI-YMD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-016
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-TABLE-ID6     DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象銘柄データの基準日の"
      D                  "元本残高を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄データの基準日の"
      D                       "元本残高から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZGZ00-3-EXT.
           EXIT.
      ******************************************************************
      *   3)対象銘柄データの基準日の資金残履歴から削除
      ******************************************************************
       DEL-TKMZSR00-3-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄データの基準日の"
      D                      "資金残履歴から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  資金残履歴TBL
           MOVE  WK-TABLE-ID5
             TO  SQL-TKMZSR00           OF  SQL-DELETE-1-28
      *----------  銘柄別断面情報テーブル
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-DELETE-1-28
      *-----------------------------------------------------------------
           MOVE  SQL-DELETE-1-28        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S17  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-017
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-TABLE-ID5       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象銘柄データの基準日の"
      D                        "資金残履歴を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S17
                USING   :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD,
                        :H-DEL2-KEY.H-SYORI-YMD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-018
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-TABLE-ID5     DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":対象銘柄データの基準日の"
      D                        "資金残履歴を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  対象銘柄データの基準日の"
      D                       "資金残履歴から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZSR00-3-EXT.
           EXIT.
      ******************************************************************
      *   4)未収収益データ削除
      ******************************************************************
       DEL-TKMZMS00-3-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収収益データ削除 START  ***"
      *-----------------------------------------------------------------
      *----------  未収収益TBLよりユーザ入力なしのデータを物理削除
           PERFORM  DELETE-TKMZMS00-RTN
      *----------  未収収益TBLよりユーザ入力あるのデータをupdate(論理削除)
           PERFORM  UPDATE-TKMZMS00-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収収益データ削除 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZMS00-3-EXT.
           EXIT.
      ******************************************************************
      *   未収収益TBLよりユーザ入力なしのデータを物理削除
      ******************************************************************
       DELETE-TKMZMS00-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収収益TBLよりユーザ入力なしの"
      D                   "データを物理削除 START  ***"
      *-----------------------------------------------------------------
      *----------  未収収益
           MOVE  WK-TABLE-ID13
             TO  SQL-TKMZMS00           OF  SQL-DELETE-1-29
      *----------  銘柄別断面情報テーブル
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-DELETE-1-29
      *-----------------------------------------------------------------
           MOVE  SQL-DELETE-1-29        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S18  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-019
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-TABLE-ID13      DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益TBLよりユーザ入力なしの"
      D                   "データを物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S18
                USING   :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KAISI-KJN-YMD,
                        :H-DEL2-KEY.H-KJN-YMD,
                        :H-DEL2-KEY.H-SYORI-YMD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-020
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-TABLE-ID13    DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益TBLよりユーザ入力なしの"
      D                   "データを物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収収益TBLよりユーザ入力なしの"
      D                   "データを物理削除 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DELETE-TKMZMS00-EXT.
           EXIT.
      ******************************************************************
      *   未収収益TBLよりユーザ入力なしのデータを論理削除
      ******************************************************************
       UPDATE-TKMZMS00-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収収益TBLよりユーザ入力なしの"
      D                   "データを論理削除 START  ***"
      *-----------------------------------------------------------------
      *----------  未収収益
           MOVE  WK-TABLE-ID13
             TO  SQL-TKMZMS00           OF  SQL-UPDATE-1-30
      *----------  銘柄別断面情報テーブル
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-UPDATE-1-30
      *-----------------------------------------------------------------
           MOVE  SQL-UPDATE-1-30        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S19  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-021
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-TABLE-ID13      DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益TBLよりユーザ入力なしの"
      D                   "データを論理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S19
                USING   :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KAISI-KJN-YMD,
                        :H-DEL2-KEY.H-KJN-YMD,
                        :H-DEL2-KEY.H-SYORI-YMD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-022
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-TABLE-ID13    DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":未収収益TBLよりユーザ入力なしの"
      D                   "データを論理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収収益TBLよりユーザ入力なしの"
      D                   "データを論理削除 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UPDATE-TKMZMS00-EXT.
           EXIT.
      ******************************************************************
      *   5)債券過去経過利息データ削除
      ******************************************************************
       DEL-TKMZKR00-3-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  債券過去経過利息"
      D                       "データ削除 START  ***"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息TBLよりユーザ入力なしのデータを物理削除
           PERFORM  DELETE-TKMZKR00-RTN
      *----------  債券過去経過利息TBLよりユーザ入力あるのデータをupdate(論理削除)
           PERFORM  UPDATE-TKMZKR00-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  債券過去経過利息"
      D                       "データ削除 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZKR00-3-EXT.
           EXIT.
      ******************************************************************
      *   債券過去経過利息TBLよりユーザ入力なしのデータを物理削除
      ******************************************************************
       DELETE-TKMZKR00-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  債券過去経過利息TBLよりユーザ入力"
      D                   "なしのデータを物理削除 START  ***"
      *-----------------------------------------------------------------
      *----------  債券過去経過利息
           MOVE  WK-TABLE-ID14
             TO  SQL-TKMZKR00           OF  SQL-DELETE-1-31
      *----------  銘柄別断面情報テーブル
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-DELETE-1-31
      *-----------------------------------------------------------------
           MOVE  SQL-DELETE-1-31        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S20  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-023
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-TABLE-ID14      DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息TBLよりユーザ入力"
      D                   "なしのデータを物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S20
                USING   :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KAISI-KJN-YMD,
                        :H-DEL2-KEY.H-KJN-YMD,
                        :H-DEL2-KEY.H-SYORI-YMD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-024
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-TABLE-ID14    DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":債券過去経過利息TBLよりユーザ入力"
      D                   "なしのデータを物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  債券過去経過利息TBLよりユーザ入力"
      D                   "なしのデータを物理削除 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DELETE-TKMZKR00-EXT.
           EXIT.
      ******************************************************************
      *   経過利息TBLよりユーザ入力なしのデータを論理削除
      ******************************************************************
       UPDATE-TKMZKR00-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  経過利息TBLよりユーザ入力なしの"
      D                   "データを論理削除 START  ***"
      *-----------------------------------------------------------------
      *----------  経過利息
           MOVE  WK-TABLE-ID14
             TO  SQL-TKMZKR00           OF  SQL-UPDATE-1-32
      *----------  銘柄別断面情報テーブル
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-UPDATE-1-32
      *-----------------------------------------------------------------
           MOVE  SQL-UPDATE-1-32        TO  SQLSTMT1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1    =["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S21  FROM :SQLSTMT1 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-UPDATE,
                     WK-TABLE-ID14      DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":経過利息TBLよりユーザ入力なしの"
      D                   "データを論理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S21
                USING   :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KAISI-KJN-YMD,
                        :H-DEL2-KEY.H-KJN-YMD,
                        :H-DEL2-KEY.H-SYORI-YMD,
                        :H-DEL2-KEY.H-KIDOU-ID,
                        :H-DEL2-KEY.H-RIYO-CMP-CD,
                        :H-DEL2-KEY.H-FUND-CD,
                        :H-DEL2-KEY.H-PTF-CD,
                        :H-DEL2-KEY.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-026
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-UPDATE,
                       WK-TABLE-ID14    DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":経過利息TBLよりユーザ入力なしの"
      D                   "データを論理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  経過利息TBLよりユーザ入力なしの"
      D                   "データを論理削除 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UPDATE-TKMZKR00-EXT.
           EXIT.
      *----------  20100223(GIPS2.0)  END
      *----------  20100212(GIPS2.0)  START
      ******************************************************************
      *    3.2.0.1.取引差分更新管理TBLと各再処理要ポートフォリオ一覧TBL
      *    から該当ポートフォリオすべての銘柄（玉）情報を取得する
      ******************************************************************
       TORIHIKI-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引差分更新管理TBLと各再処理要"
      D             "  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TORIHIKI-CUR-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TORIHIKI-CUR-OPEN-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF             TO   FLG-FETCH-SYUURYOU-19
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU-19=["
      D             FLG-FETCH-SYUURYOU-19"]"
      *-----------------------------------------------------------------
           INITIALIZE  HST-CNT
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TORIHIKI-RTN]"                GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  TORIHIKI-CUR-FET-RTN
             UNTIL  FLG-FETCH-SYUURYOU-19 = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [TORIHIKI-RTN]"                GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------  カーソルクローズ処理
           PERFORM  TORIHIKI-CUR-CLOSE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引差分更新管理TBLと各再処理要"
      D             "  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TORIHIKI-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TORIHIKI-CUR-DEC-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZSK00-S4,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-19
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZSK00-S4,
                 WK-FUND-CD             OF  WK-MSG-1-19
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZSK00-S4,
                 WK-PTF-CD              OF  WK-MSG-1-19
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-FETCH-TKMZSK00,
                 WK-TKMZSK00            OF  WK-MSG-1-19
           MOVE  WK-TABLE-ID12
             TO  SQL-TKMZGP01           OF  SQL-FETCH-TKMZSK00
           INITIALIZE  SQLSTMT1
      *----ＳＱＬ文
           MOVE  SQL-FETCH-TKMZSK00     TO  SQLSTMT1
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT1=["SQLSTMT1"]"
      *-----------------------------------------------------------------
           EXEC  SQL  PREPARE  S19  FROM :SQLSTMT1  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-027
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-19        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL DECLARE TKMZSK00_CURSOR19 CURSOR  FOR S19 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-028
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-19        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TORIHIKI-CUR-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TORIHIKI-CUR-OPEN-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZSK00_CURSOR19
                 USING :H-TKMZSK00-S4.H-RIYO-CMP-CD,
                       :H-TKMZSK00-S4.H-FUND-CD,
                       :H-TKMZSK00-S4.H-PTF-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZSK00-CR19-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR19-OPEN=["
      D             FLG-TKMZSK00-CR19-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-029
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-19        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TORIHIKI-CUR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       TORIHIKI-CUR-FET-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZSK00-4
           EXEC  SQL
               FETCH
                    TKMZSK00_CURSOR19
               INTO :H-TKMZSK00-4.H-MEG-CD,
                    :H-TKMZSK00-4.H-SEC-SBT-CD,
                    :H-TKMZSK00-4.H-TATE-FLG,
                    :H-TKMZSK00-4.H-GYOKU-ID,
                    :H-TKMZSK00-4.H-SIJO-TUKA-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード    =["H-MEG-CD
      D                                 OF  H-TKMZSK00-4"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["H-SEC-SBT-CD
      D                                 OF  H-TKMZSK00-4"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["H-TATE-FLG
      D                                 OF  H-TKMZSK00-4"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ        =["H-GYOKU-ID
      D                                 OF  H-TKMZSK00-4"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["H-SIJO-TUKA-CD
      D                                 OF  H-TKMZSK00-4"]"
      *-----------------------------------------------------------------
      *--------  INSERT用ワーク銘柄別断面情報の編集を行う
               INITIALIZE                   WK-COM
               MOVE  H-MEG-CD           OF  H-TKMZSK00-4
                 TO  WK-MEG-CD          OF  WK-COM
               MOVE  H-SEC-SBT-CD       OF  H-TKMZSK00-4
                 TO  WK-SEC-SBT-CD      OF  WK-COM
               MOVE  H-TATE-FLG         OF  H-TKMZSK00-4
                 TO  WK-TATE-FLG        OF  WK-COM
               MOVE  H-GYOKU-ID         OF  H-TKMZSK00-4
                 TO  WK-GYOKU-ID        OF  WK-COM
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZSK00-4
                 TO  WK-SIJO-TUKA-CD    OF  WK-COM
               MOVE  ZERO
                 TO  WK-SABON-UPDATE-FROM   OF  WK-COM
               EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00-4
                 WHEN  CNS-SEC-SBT-CD-CASH
                 WHEN  CNS-SEC-SBT-CD-MA99
                 WHEN  CNS-SEC-SBT-CD-MAR
                 WHEN  CNS-SEC-SBT-CD-MABF
                 WHEN  CNS-SEC-SBT-CD-MABO
                 WHEN  CNS-SEC-SBT-CD-MAB
                 WHEN  CNS-SEC-SBT-CD-MAFB
                 WHEN  CNS-SEC-SBT-CD-MASF
                 WHEN  CNS-SEC-SBT-CD-MASO
                 WHEN  CNS-SEC-SBT-CD-MAS
                 WHEN  CNS-SEC-SBT-CD-MAFS
                   MOVE  CNS-MEG-CD-SHRU-3
                     TO  WK-MEG-CD-SHRU   OF  WK-COM
                 WHEN OTHER
                   IF  H-SEC-SBT-CD       OF  H-TKMZSK00-4
                    =  CNS-SEC-SBT-CD-PRI
                   THEN
                     MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   ELSE
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   END-IF
               END-EVALUATE
               MOVE  CNS-SAI-CALC-KBN-1
                 TO  WK-SAI-CALC-KBN    OF  WK-COM
               IF  WK-MEG-CD-SHRU       OF  WK-COM
                 = CNS-MEG-CD-SHRU-1
               THEN
                 EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00-4
                   WHEN  CNS-SEC-SBT-CD-S
                   WHEN  CNS-SEC-SBT-CD-DSMS
                   WHEN  CNS-SEC-SBT-CD-FSMS
                   WHEN  CNS-SEC-SBT-CD-ET
                   WHEN  CNS-SEC-SBT-CD-ETB
                   WHEN  CNS-SEC-SBT-CD-ETS
                   WHEN  CNS-SEC-SBT-CD-ETCB
                   WHEN  CNS-SEC-SBT-CD-ETDB
                   WHEN  CNS-SEC-SBT-CD-ETDS
                   WHEN  CNS-SEC-SBT-CD-ETDC
                   WHEN  CNS-SEC-SBT-CD-ETFS
                   WHEN  CNS-SEC-SBT-CD-ETFB
                   WHEN  CNS-SEC-SBT-CD-ETF
                   WHEN  CNS-SEC-SBT-CD-REIT
                   WHEN  CNS-SEC-SBT-CD-XMOS
                   WHEN  CNS-SEC-SBT-CD-SM
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  CNS-SEC-SBT-CD-B
                   WHEN  CNS-SEC-SBT-CD-MB
                   WHEN  CNS-SEC-SBT-CD-DBMS
                   WHEN  CNS-SEC-SBT-CD-FBMS
                   WHEN  CNS-SEC-SBT-CD-CB
                   WHEN  CNS-SEC-SBT-CD-WB
                   WHEN  CNS-SEC-SBT-CD-CBMS
                   WHEN  CNS-SEC-SBT-CD-XMOB
                    MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  OTHER
                     MOVE  CNS-MEG-CD-SHRU-3
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                 END-EVALUATE
               ELSE
                 MOVE  SPACE
                   TO  WK-MEG-CD-SHRU2       OF  WK-COM
               END-IF
               MOVE  CNS-X-1
                 TO  WK-YUKO-MEG-FLG         OF  WK-COM
               COMPUTE  HST-CNT = HST-CNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-YUKO-MEG-FLG=["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
               PERFORM  DATA-EDIT-RTN
      *----------  件数達到１００件時插入ＤＢ
               IF  HST-CNT = CNS-100
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON           TO    FLG-FETCH-SYUURYOU-19
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU-19=["
      D             FLG-FETCH-SYUURYOU-19"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ
               IF HST-CNT NOT = CNS-0
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-030
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-19      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TORIHIKI-CUR-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
       TORIHIKI-CUR-CLOSE-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               CLOSE TKMZSK00_CURSOR19
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR19-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR19-OPEN=["
      D             FLG-TKMZSK00-CR19-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-031
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-19         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TORIHIKI-CUR-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    DATA-EDIT-RTN
      ******************************************************************
       DATA-EDIT-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DATA-EDIT-RTN  START ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 処理実行日
           MOVE  WK-IN-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 起動ID
           MOVE  WK-IN-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 利用会社コード
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- ファンドコード
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- ポートフォリオコード
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 開始基準日
           MOVE  WK-IN-KAISI-KJN-YMD
             TO  H-KAISI-KJN-YMD        OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 基準日
           MOVE  WK-IN-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 銘柄コード
           MOVE  WK-MEG-CD              OF  WK-COM
             TO  H-MEG-CD               OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 証券種別コード
           MOVE  WK-SEC-SBT-CD          OF  WK-COM
             TO  H-SEC-SBT-CD           OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 資産/負債・買建/売建フラグ
           MOVE  WK-TATE-FLG            OF  WK-COM
             TO  H-TATE-FLG             OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 玉ID
           MOVE  WK-GYOKU-ID            OF  WK-COM
             TO  H-GYOKU-ID             OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 市場通貨コード
           MOVE  WK-SIJO-TUKA-CD        OF  WK-COM
             TO  H-SIJO-TUKA-CD         OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 差分更新From日
           MOVE  WK-SABON-UPDATE-FROM   OF  WK-COM
             TO  H-SABON-UPDATE-FROM    OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 銘柄種類
           MOVE  WK-MEG-CD-SHRU         OF  WK-COM
             TO  H-MEG-CD-SHRU          OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 再計算区分
           MOVE  WK-SAI-CALC-KBN        OF  WK-COM
             TO  H-SAI-CALC-KBN         OF  H-TKMZBW03-INSERT(HST-CNT)
      *---------- 銘柄種類２
           MOVE  WK-MEG-CD-SHRU2        OF  WK-COM
             TO  H-MEG-CD-SHRU2         OF  H-TKMZBW03-INSERT(HST-CNT)
      *----------  更新ログインユーザ会社コード
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-UPD-LOGIN-CMP-CD     OF  H-TKMZBW03-INSERT(HST-CNT)
      *----------  有効銘柄フラグ
           MOVE  WK-YUKO-MEG-FLG        OF  WK-COM
             TO  H-YUKO-MEG-FLG         OF  H-TKMZBW03-INSERT(HST-CNT)
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日    =["H-SYORI-YMD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":起動ID        =["H-KIDOU-ID
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["H-RIYO-CMP-CD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["H-FUND-CD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["H-PTF-CD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日    =["H-KAISI-KJN-YMD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":基準日        =["H-KJN-YMD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード    =["H-MEG-CD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["H-SEC-SBT-CD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["H-TATE-FLG
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID          =["H-GYOKU-ID
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["H-SIJO-TUKA-CD
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日=["H-SABON-UPDATE-FROM
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄種類      =["H-MEG-CD-SHRU
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":再計算区分    =["H-SAI-CALC-KBN
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄種類２    =["H-MEG-CD-SHRU2
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":有効銘柄フラグ =["H-YUKO-MEG-FLG
      D                                 OF H-TKMZBW03-INSERT(HST-CNT)"]"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  DATA-EDIT-RTN  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-EDIT-EXT.
           EXIT.
      ******************************************************************
      *    INSERT-SQL作成PREPARE処理
      ******************************************************************
       INSERT-PREPARE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT-PREPARE-RTN  START  *****"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT10                                        @3212SEINO@@
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-INSERT-1-2
      *----ＳＱＬ文
           MOVE  SQL-INSERT-1-2         TO  SQLSTMT10                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT10=["SQLSTMT10"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報INSカーソルオープンフ"    @3212SEINO@@
      D             "ラグ1=["FLG-INSERT-TKMZBW03-CR1"]"                 @3212SEINO@@
      *-----------------------------------------------------------------
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           IF    FLG-INSERT-TKMZBW03-CR1  =  CNS-OFF                    @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S10 FROM :SQLSTMT10                              @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE        =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-032
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     SQL-INSERT         OF  SQL-INSERT-1-2,
                     WK-MSG-1-2         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":INSERT-PREPARE-RTN  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       INSERT-PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    DATA-INSERT-RTN
      ******************************************************************
       DATA-INSERT-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA-INSERT-RTN  START "
      *-----------------------------------------------------------------
           EXEC SQL FOR :HST-CNT
           EXECUTE S10
                 USING :H-TKMZBW03-INSERT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SQLCODE(EXECUTE)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----------  件数清零
               INITIALIZE  HST-CNT
                           H-TKMZBW03-TBL-INSERT
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
             MOVE  CNS-ON               TO  FLG-INSERT-TKMZBW03-CR1     @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報INSカーソルオープンフ"    @3212SEINO@@
      D             "ラグ1=["FLG-INSERT-TKMZBW03-CR1"]"                 @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-UNIQUE
               MOVE  SQLERRD(3)      TO  WK-COUNT-TMP
               COMPUTE  WK-ERR-KENSU  =  WK-COUNT-TMP + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "WK-ERR-KENSU=["WK-ERR-KENSU"]"
      *-----------------------------------------------------------------
               INITIALIZE   WK-MSG-1-2
      *---------- 処理実行日
               MOVE  H-SYORI-YMD     OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SYORI-YMD    OF  WK-MSG-1-2
      *---------- 起動ID
               MOVE  H-KIDOU-ID      OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-KIDOU-ID     OF  WK-MSG-1-2
      *---------- 利用会社コード
               MOVE  H-RIYO-CMP-CD   OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-RIYO-CMP-CD  OF  WK-MSG-1-2
      *---------- ファンドコード
               MOVE  H-FUND-CD       OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-FUND-CD      OF  WK-MSG-1-2
      *---------- ポートフォリオコード
               MOVE  H-PTF-CD        OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-PTF-CD       OF  WK-MSG-1-2
      *---------- 開始基準日
               MOVE  H-KAISI-KJN-YMD OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-KAISI-KJN-YMD
                                     OF  WK-MSG-1-2
      *---------- 基準日
               MOVE  H-KJN-YMD       OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-KJN-YMD      OF  WK-MSG-1-2
      *---------- 銘柄コード
               MOVE  H-MEG-CD        OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-MEG-CD       OF  WK-MSG-1-2
      *---------- 証券種別コード
               MOVE  H-SEC-SBT-CD    OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SEC-SBT-CD   OF  WK-MSG-1-2
      *---------- 資産/負債・買建/売建フラグ
               MOVE  H-TATE-FLG      OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-TATE-FLG     OF  WK-MSG-1-2
      *---------- 玉ID
               MOVE  H-GYOKU-ID      OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-GYOKU-ID     OF  WK-MSG-1-2
      *---------- 市場通貨コード
               MOVE  H-SIJO-TUKA-CD  OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SIJO-TUKA-CD OF  WK-MSG-1-2
      *---------- 差分更新From日
               MOVE  H-SABON-UPDATE-FROM
                                     OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SABON-UPDATE-FROM
                                     OF  WK-MSG-1-2
      *---------- 銘柄種類
               MOVE  H-MEG-CD-SHRU   OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-MEG-CD-SHRU  OF  WK-MSG-1-2
      *---------- 再計算区分
               MOVE  H-SAI-CALC-KBN  OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SAI-CALC-KBN OF  WK-MSG-1-2
      *---------- 銘柄種類２
               MOVE  H-MEG-CD-SHRU2  OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-MEG-CD-SHRU2 OF  WK-MSG-1-2
      *---------- 有効銘柄フラグ
               MOVE  H-YUKO-MEG-FLG  OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-YUKO-MEG-FLG-1 OF  WK-MSG-1-2
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-033
                 TO  ERR-POS         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-300
                 TO  RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD   OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       SQL-INSERT    OF  SQL-INSERT-1-2,
                       WK-MSG-1-2    DELIMITED  BY  SIZE
                 INTO  FREE-MSG      OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
             WHEN  OTHER
               MOVE  SQLERRD(3)      TO  WK-COUNT-TMP
               COMPUTE   WK-ERR-KENSU = WK-COUNT-TMP + CNS-1
               INITIALIZE   WK-MSG-1-2
      *---------- 処理実行日
               MOVE  H-SYORI-YMD     OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SYORI-YMD    OF  WK-MSG-1-2
      *---------- 起動ID
               MOVE  H-KIDOU-ID      OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-KIDOU-ID     OF  WK-MSG-1-2
      *---------- 利用会社コード
               MOVE  H-RIYO-CMP-CD   OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-RIYO-CMP-CD  OF  WK-MSG-1-2
      *---------- ファンドコード
               MOVE  H-FUND-CD       OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-FUND-CD      OF  WK-MSG-1-2
      *---------- ポートフォリオコード
               MOVE  H-PTF-CD        OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-PTF-CD       OF  WK-MSG-1-2
      *---------- 開始基準日
               MOVE  H-KAISI-KJN-YMD OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-KAISI-KJN-YMD
                                     OF  WK-MSG-1-2
      *---------- 基準日
               MOVE  H-KJN-YMD       OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-KJN-YMD      OF  WK-MSG-1-2
      *---------- 銘柄コード
               MOVE  H-MEG-CD        OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-MEG-CD       OF  WK-MSG-1-2
      *---------- 証券種別コード
               MOVE  H-SEC-SBT-CD    OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SEC-SBT-CD   OF  WK-MSG-1-2
      *---------- 資産/負債・買建/売建フラグ
               MOVE  H-TATE-FLG      OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-TATE-FLG     OF  WK-MSG-1-2
      *---------- 玉ID
               MOVE  H-GYOKU-ID      OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-GYOKU-ID     OF  WK-MSG-1-2
      *---------- 市場通貨コード
               MOVE  H-SIJO-TUKA-CD  OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SIJO-TUKA-CD OF  WK-MSG-1-2
      *---------- 差分更新From日
               MOVE  H-SABON-UPDATE-FROM
                                     OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SABON-UPDATE-FROM
                                     OF  WK-MSG-1-2
      *---------- 銘柄種類
               MOVE  H-MEG-CD-SHRU   OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-MEG-CD-SHRU  OF  WK-MSG-1-2
      *---------- 再計算区分
               MOVE  H-SAI-CALC-KBN  OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-SAI-CALC-KBN OF  WK-MSG-1-2
      *---------- 銘柄種類２
               MOVE  H-MEG-CD-SHRU2  OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-MEG-CD-SHRU2 OF  WK-MSG-1-2
      *---------- 有効銘柄フラグ
               MOVE  H-YUKO-MEG-FLG  OF  H-TKMZBW03-INSERT(WK-ERR-KENSU)
                 TO  WK-YUKO-MEG-FLG-1 OF  WK-MSG-1-2
      *----------  メッセージ出力用 RTNパッケージの設定
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-034
                 TO  ERR-POS         OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD          OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD   OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       SQL-INSERT    OF  SQL-INSERT-1-2,
                       WK-MSG-1-2    DELIMITED  BY  SIZE
                 INTO  FREE-MSG     OF  PARM-SCZY1170-ARG1
               PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":DATA-INSERT-RTN  END "
      *-----------------------------------------------------------------
           CONTINUE.
       DATA-INSERT-EXT.
           EXIT.
      *----------  20100212(GIPS2.0)  END
      ******************************************************************
      *    3.2.1.当断面の計算パターンは強制の場合の処理
      ******************************************************************
       DANMEI-CALC-PTN-2-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  当断面の計算パターンは強制の場合"
      D             "の処理  START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.順番=["
      D             WK-IN-JUNBAN"]"
      *-----------------------------------------------------------------
           IF  WK-IN-JUNBAN  =  CNS-JUNBAN-1
           THEN
      *----------  3.2.1.1 ARG1.基準日断面情報.順番＝1の場合（最初の断面）
             MOVE  CNS-POS-003          TO  WK-ERR-POS1
             MOVE  CNS-POS-004          TO  WK-ERR-POS2
             MOVE  CNS-POS-005          TO  WK-ERR-POS3
             MOVE  CNS-POS-006          TO  WK-ERR-POS4
             MOVE  CNS-POS-007          TO  WK-ERR-POS5
             MOVE  CNS-POS-008          TO  WK-ERR-IPOS1
             MOVE  CNS-POS-009          TO  WK-ERR-IPOS2
             MOVE  CNS-POS-010          TO  WK-ERR-IPOS3
             PERFORM  DANMEI-JUNBAN-1-RTN
           ELSE
      *----------  3.2.1.2 ARG1.基準日断面情報.順番 <> 1の場合（最初の断面では無い）
             PERFORM  DANMEI-JUNBAN-N1-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  当断面の計算パターンは強制の場合"
      D             "の処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DANMEI-CALC-PTN-2-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.1 ARG1.基準日断面情報.順番＝1の場合（最初の断面）
      ******************************************************************
       DANMEI-JUNBAN-1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ARG1.基準日断面情報.順番＝1の場合"
      D             "(最初の断面)の処理  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  DMJB-1-CUR-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  DMJB-1-CUR-OPEN-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF             TO   FLG-FETCH-SYUURYOU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DANMEI-JUNBAN-1-RTN ]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  DMJB-1-CUR-FET-RTN
             UNTIL  FLG-FETCH-SYUURYOU = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [DANMEI-JUNBAN-1-RTN ]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *-----------  カーソルクローズ処理
      *    PERFORM  DMJB-1-CUR-CLOSE-RTN                                @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ARG1.基準日断面情報.順番＝1の場合"
      D             "(最初の断面)の処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DANMEI-JUNBAN-1-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       DMJB-1-CUR-DEC-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZSK00-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-1
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZSK00-S,
                 WK-FUND-CD             OF  WK-MSG-1-1
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZSK00-S,
                 WK-PTF-CD              OF  WK-MSG-1-1
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-SELECT-1-1,
                 WK-TKMZSK00            OF  WK-MSG-1-1
           INITIALIZE  SQLSTMT1
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-1         TO  SQLSTMT11                   @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT11=["SQLSTMT11"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフラ"   @3212SEINO@@
      D             "グ_1=["FLG-TKMZSK00-CR1-OPEN"]"                    @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZSK00-CR1-OPEN  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S1  FROM :SQLSTMT11  END-EXEC            @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  WK-ERR-POS1
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZSK00_CURSOR1 CURSOR  FOR S1 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  WK-ERR-POS2
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DMJB-1-CUR-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       DMJB-1-CUR-OPEN-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZSK00_CURSOR1
                 USING :H-TKMZSK00-S.H-RIYO-CMP-CD,
                       :H-TKMZSK00-S.H-FUND-CD,
                       :H-TKMZSK00-S.H-PTF-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZSK00-CR1-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR1-OPEN=["
      D             FLG-TKMZSK00-CR1-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  WK-ERR-POS3
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-1         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DMJB-1-CUR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       DMJB-1-CUR-FET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZSK00
           EXEC  SQL
               FETCH
                    TKMZSK00_CURSOR1
               INTO :H-TKMZSK00.H-MEG-CD,
                    :H-TKMZSK00.H-SEC-SBT-CD,
                    :H-TKMZSK00.H-TATE-FLG,
                    :H-TKMZSK00.H-GYOKU-ID,
                    :H-TKMZSK00.H-SIJO-TUKA-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード    =["H-MEG-CD
      D                                 OF  H-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["H-SEC-SBT-CD
      D                                 OF  H-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["H-TATE-FLG
      D                                 OF  H-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ        =["H-GYOKU-ID
      D                                 OF  H-TKMZSK00"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["H-SIJO-TUKA-CD
      D                                 OF  H-TKMZSK00"]"
      *-----------------------------------------------------------------
      *--------  INSERT用ワーク銘柄別断面情報の編集を行う
               INITIALIZE                   WK-COM
               MOVE  H-MEG-CD           OF  H-TKMZSK00
                 TO  WK-MEG-CD          OF  WK-COM
               MOVE  H-SEC-SBT-CD       OF  H-TKMZSK00
                 TO  WK-SEC-SBT-CD      OF  WK-COM
               MOVE  H-TATE-FLG         OF  H-TKMZSK00
                 TO  WK-TATE-FLG        OF  WK-COM
               MOVE  H-GYOKU-ID         OF  H-TKMZSK00
                 TO  WK-GYOKU-ID        OF  WK-COM
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZSK00
                 TO  WK-SIJO-TUKA-CD    OF  WK-COM
               MOVE  ZERO
                 TO  WK-SABON-UPDATE-FROM   OF  WK-COM
               EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00
                 WHEN  CNS-SEC-SBT-CD-CASH
                 WHEN  CNS-SEC-SBT-CD-MA99
                 WHEN  CNS-SEC-SBT-CD-MAR
                 WHEN  CNS-SEC-SBT-CD-MABF
                 WHEN  CNS-SEC-SBT-CD-MABO
                 WHEN  CNS-SEC-SBT-CD-MAB
                 WHEN  CNS-SEC-SBT-CD-MAFB
                 WHEN  CNS-SEC-SBT-CD-MASF
                 WHEN  CNS-SEC-SBT-CD-MASO
                 WHEN  CNS-SEC-SBT-CD-MAS
                 WHEN  CNS-SEC-SBT-CD-MAFS
                   MOVE  CNS-MEG-CD-SHRU-3
                     TO  WK-MEG-CD-SHRU   OF  WK-COM
                 WHEN OTHER
                   IF  H-SEC-SBT-CD       OF  H-TKMZSK00
                    =  CNS-SEC-SBT-CD-PRI
                   THEN
                     MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   ELSE
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   END-IF
               END-EVALUATE
               MOVE  CNS-SAI-CALC-KBN-1
                 TO  WK-SAI-CALC-KBN    OF  WK-COM
               IF  WK-MEG-CD-SHRU       OF  WK-COM
                 = CNS-MEG-CD-SHRU-1
               THEN
                 EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00
                   WHEN  CNS-SEC-SBT-CD-S
                   WHEN  CNS-SEC-SBT-CD-DSMS
                   WHEN  CNS-SEC-SBT-CD-FSMS
                   WHEN  CNS-SEC-SBT-CD-ET
                   WHEN  CNS-SEC-SBT-CD-ETB
                   WHEN  CNS-SEC-SBT-CD-ETS
                   WHEN  CNS-SEC-SBT-CD-ETCB
                   WHEN  CNS-SEC-SBT-CD-ETDB
                   WHEN  CNS-SEC-SBT-CD-ETDS
                   WHEN  CNS-SEC-SBT-CD-ETDC
                   WHEN  CNS-SEC-SBT-CD-ETFS
                   WHEN  CNS-SEC-SBT-CD-ETFB
                   WHEN  CNS-SEC-SBT-CD-ETF
                   WHEN  CNS-SEC-SBT-CD-REIT
                   WHEN  CNS-SEC-SBT-CD-XMOS
                   WHEN  CNS-SEC-SBT-CD-SM
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  CNS-SEC-SBT-CD-B
                   WHEN  CNS-SEC-SBT-CD-MB
                   WHEN  CNS-SEC-SBT-CD-DBMS
                   WHEN  CNS-SEC-SBT-CD-FBMS
                   WHEN  CNS-SEC-SBT-CD-CB
                   WHEN  CNS-SEC-SBT-CD-WB
                   WHEN  CNS-SEC-SBT-CD-CBMS
                   WHEN  CNS-SEC-SBT-CD-XMOB
                    MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  OTHER
                     MOVE  CNS-MEG-CD-SHRU-3
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                 END-EVALUATE
               ELSE
                 MOVE  SPACE
                   TO  WK-MEG-CD-SHRU2       OF  WK-COM
               END-IF
               MOVE  CNS-X-1
                 TO  WK-YUKO-MEG-FLG         OF  WK-COM
               COMPUTE  HST-CNT = HST-CNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-YUKO-MEG-FLG=["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
               PERFORM  DATA-EDIT-RTN
      *----------  件数達到１００件時插入ＤＢ
               IF  HST-CNT = CNS-100
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON           TO    FLG-FETCH-SYUURYOU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ
               IF HST-CNT NOT = CNS-0
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  WK-ERR-POS4
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-1       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DMJB-1-CUR-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      *DMJB-1-CUR-CLOSE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZSK00_CURSOR1
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR1-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR1-OPEN=["
      *D             FLG-TKMZSK00-CR1-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  WK-ERR-POS5
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-1         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *DMJB-1-CUR-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    3.2.1.2 ARG1.基準日断面情報.順番 <> 1の場合（最初の断面では無い）
      ******************************************************************
       DANMEI-JUNBAN-N1-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ARG1.基準日断面情報.順番 <> 1の場合"
      D             "(最初の断面では無い)の処理  START ***"
      *-----------------------------------------------------------------
      *-----------  1)基準日断面情報TBLから前断面の計算パターンを取得する
           PERFORM  ZDM-CALC-PTN-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上記取得した前断面の計算パターン=["
      D             H-CALC-PTN          OF  H-TKMZBW02"]"
      *-----------------------------------------------------------------
           EVALUATE  H-CALC-PTN         OF  H-TKMZBW02
             WHEN  CNS-CALC-PTN-2
      *-----------  2)上記取得した前断面の計算パターン＝2:強制の時
               PERFORM  ZDM-CALC-PTN-2-RTN
             WHEN  CNS-CALC-PTN-1
      *-----------  3)上記取得した前断面の計算パターン＝1:差分の時
               MOVE  CNS-POS-014        TO  WK-ERR-POS1
               MOVE  CNS-POS-015        TO  WK-ERR-POS2
               MOVE  CNS-POS-016        TO  WK-ERR-POS3
               MOVE  CNS-POS-017        TO  WK-ERR-POS4
               MOVE  CNS-POS-018        TO  WK-ERR-POS5
               MOVE  CNS-POS-019        TO  WK-ERR-IPOS1
               MOVE  CNS-POS-020        TO  WK-ERR-IPOS2
               MOVE  CNS-POS-021        TO  WK-ERR-IPOS3
               PERFORM  DANMEI-JUNBAN-1-RTN
             WHEN  OTHER
      *-----------  4)上記取得した前断面の計算パターンは上記以外の時
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":上記取得した前断面の計算パターン"
      D             "(データ不整合) 異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-035
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-140
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ARG1.基準日断面情報.順番 <> 1の場合"
      D             "(最初の断面では無い)の処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DANMEI-JUNBAN-N1-EXT.
           EXIT.
      ******************************************************************
      *    1)基準日断面情報TBLから前断面の計算パターンを取得処理
      ******************************************************************
       ZDM-CALC-PTN-GET-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 基準日断面情報TBLから前断面の計算"
      D             "パターンを取得処理  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  ZDM-CP-CUR-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  ZDM-CP-CUR-OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  ZDM-CP-CUR-FET-RTN
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *-----------  カーソルクローズ処理
      *    PERFORM  ZDM-CP-CUR-CLOSE-RTN                                @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 基準日断面情報TBLから前断面の計算"
      D             "パターンを取得処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ZDM-CALC-PTN-GET-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       ZDM-CP-CUR-DEC-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW02-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-3
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW02-S,
                 WK-FUND-CD             OF  WK-MSG-1-3
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW02-S,
                 WK-PTF-CD              OF  WK-MSG-1-3
           MOVE  WK-IN-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW02-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-3
           MOVE  WK-IN-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW02-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-3
           COMPUTE  WK-JUNBAN-MINUS-1
                 =  WK-IN-JUNBAN - CNS-1
           MOVE  WK-JUNBAN-MINUS-1
             TO  H-JUNBAN               OF  H-TKMZBW02-S,
                 WK-JUNBAN              OF  WK-MSG-1-3
           MOVE  WK-TABLE-ID2
             TO  SQL-TKMZBW02           OF  SQL-SELECT-1-3,
                 WK-TKMZBW02            OF  WK-MSG-1-3
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-3         TO  SQLSTMT2                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT2=["SQLSTMT2"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":基準日断面情報カーソルオープンフラグ=[" @3212SEINO@@
      D             FLG-TKMZBW02-CR-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZBW02-CR-OPEN  =  CNS-OFF                         @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S2  FROM :SQLSTMT2  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-036
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZBW02_CURSOR  CURSOR  FOR S2 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-037
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ZDM-CP-CUR-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       ZDM-CP-CUR-OPEN-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZBW02_CURSOR
                 USING :H-TKMZBW02-S.H-RIYO-CMP-CD,
                       :H-TKMZBW02-S.H-FUND-CD,
                       :H-TKMZBW02-S.H-PTF-CD,
                       :H-TKMZBW02-S.H-SYORI-YMD,
                       :H-TKMZBW02-S.H-KIDOU-ID,
                       :H-TKMZBW02-S.H-JUNBAN
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW02-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW02-CR-OPEN=["
      D             FLG-TKMZBW02-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-038
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ZDM-CP-CUR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       ZDM-CP-CUR-FET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZBW02
           EXEC  SQL
               FETCH
                    TKMZBW02_CURSOR
               INTO :H-TKMZBW02.H-CALC-PTN,
                    :H-TKMZBW02.H-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得した前断面の計算パターン=["
      D             H-CALC-PTN          OF  H-TKMZBW02"]"
      D    DISPLAY  CNS-PGM-ID":取得した前断面の基準日=["
      D             H-KJN-YMD           OF  H-TKMZBW02"]"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":該当データなし"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-039
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-110
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-040
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ZDM-CP-CUR-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      *ZDM-CP-CUR-CLOSE-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZBW02_CURSOR
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZBW02-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW02-CR-OPEN=["
      *D             FLG-TKMZBW02-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-POS-041
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-3         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *ZDM-CP-CUR-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    2)上記取得した前断面の計算パターン＝2:強制の時
      ******************************************************************
       ZDM-CALC-PTN-2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  上記取得した前断面の計算パターン"
      D             "＝2:強制の場合処理  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  CALC-P2-CUR-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  CALC-P2-CUR-OPEN-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF             TO   FLG-FETCH-SYUURYOU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [ZDM-CALC-PTN-2-RTN]"          GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  CALC-P2-CUR-FET-RTN
             UNTIL  FLG-FETCH-SYUURYOU = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [ZDM-CALC-PTN-2-RTN]"          GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *-----------  カーソルクローズ処理
      *    PERFORM  CALC-P2-CUR-CLOSE-RTN                               @3212SEINO@@
           MOVE  CNS-C0  TO  WK-ZOFKU-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-ZOFKU-KBN=["WK-ZOFKU-KBN"]"
      D    DISPLAY  CNS-PGM-ID":***  上記取得した前断面の計算パターン"
      D             "＝2:強制の場合処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ZDM-CALC-PTN-2-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       CALC-P2-CUR-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZBW03-S,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-4
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZBW03-S,
                 WK-FUND-CD             OF  WK-MSG-1-4
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZBW03-S,
                 WK-PTF-CD              OF  WK-MSG-1-4
           MOVE  WK-IN-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZBW03-S,
                 WK-SYORI-YMD           OF  WK-MSG-1-4
           MOVE  WK-IN-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZBW03-S,
                 WK-KIDOU-ID            OF  WK-MSG-1-4
           MOVE  H-KJN-YMD              OF  H-TKMZBW02
             TO  H-KJN-YMD              OF  H-TKMZBW03-S,
                 WK-KJN-YMD             OF  WK-MSG-1-4
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-SELECT-1-4,
                 WK-TKMZBW03            OF  WK-MSG-1-4
           INITIALIZE  SQLSTMT3                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-4         TO  SQLSTMT3                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT3=["SQLSTMT3"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ=[" @3212SEINO@@
      D             FLG-TKMZBW03-CR-OPEN"]"                             @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZBW03-CR-OPEN   =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S3  FROM :SQLSTMT3  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-042
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZBW03_CURSOR  CURSOR  FOR S3 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-043
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-P2-CUR-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       CALC-P2-CUR-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZBW03_CURSOR
                 USING :H-TKMZBW03-S.H-RIYO-CMP-CD,
                       :H-TKMZBW03-S.H-FUND-CD,
                       :H-TKMZBW03-S.H-PTF-CD,
                       :H-TKMZBW03-S.H-SYORI-YMD,
                       :H-TKMZBW03-S.H-KIDOU-ID,
                       :H-TKMZBW03-S.H-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZBW03-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW03-CR-OPEN=["
      D             FLG-TKMZBW03-CR-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-044
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-P2-CUR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       CALC-P2-CUR-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZBW03
           EXEC  SQL
               FETCH
                    TKMZBW03_CURSOR
               INTO :H-TKMZBW03.H-MEG-CD,
                    :H-TKMZBW03.H-SEC-SBT-CD,
                    :H-TKMZBW03.H-TATE-FLG,
                    :H-TKMZBW03.H-GYOKU-ID,
                    :H-TKMZBW03.H-MEG-CD-SHRU,
                    :H-TKMZBW03.H-MEG-CD-SHRU2,
                    :H-TKMZBW03.H-SABON-UPDATE-FROM,
                    :H-TKMZBW03.H-SIJO-TUKA-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード    =["H-MEG-CD
      D                                 OF  H-TKMZBW03"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["H-SEC-SBT-CD
      D                                 OF  H-TKMZBW03"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["H-TATE-FLG
      D                                 OF  H-TKMZBW03"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ        =["H-GYOKU-ID
      D                                 OF  H-TKMZBW03"]"
      D    DISPLAY  CNS-PGM-ID":銘柄種類      =["H-MEG-CD-SHRU
      D                                 OF  H-TKMZBW03"]"
      D    DISPLAY  CNS-PGM-ID":銘柄種類２    =["H-MEG-CD-SHRU2
      D                                 OF  H-TKMZBW03"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日=["H-SABON-UPDATE-FROM
      D                                 OF  H-TKMZBW03"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["H-SIJO-TUKA-CD
      D                                 OF  H-TKMZBW03"]"
      *-----------------------------------------------------------------
      *--------  INSERT用ワーク銘柄別断面情報の編集を行う
               INITIALIZE                   WK-COM
               MOVE  H-MEG-CD           OF  H-TKMZBW03
                 TO  WK-MEG-CD          OF  WK-COM
               MOVE  H-SEC-SBT-CD       OF  H-TKMZBW03
                 TO  WK-SEC-SBT-CD      OF  WK-COM
               MOVE  H-TATE-FLG         OF  H-TKMZBW03
                 TO  WK-TATE-FLG        OF  WK-COM
               MOVE  H-GYOKU-ID         OF  H-TKMZBW03
                 TO  WK-GYOKU-ID        OF  WK-COM
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZBW03
                 TO  WK-SIJO-TUKA-CD    OF  WK-COM
               MOVE  ZERO
                 TO  WK-SABON-UPDATE-FROM   OF  WK-COM
               MOVE  H-MEG-CD-SHRU      OF  H-TKMZBW03
                 TO  WK-MEG-CD-SHRU     OF  WK-COM
               MOVE  CNS-SAI-CALC-KBN-1
                 TO  WK-SAI-CALC-KBN    OF  WK-COM
               MOVE  H-MEG-CD-SHRU2     OF  H-TKMZBW03
                 TO  WK-MEG-CD-SHRU2    OF  WK-COM
               MOVE  CNS-X-1
                 TO  WK-YUKO-MEG-FLG         OF  WK-COM
               COMPUTE  HST-CNT = HST-CNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-YUKO-MEG-FLG=["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
               PERFORM  DATA-EDIT-RTN
      *----------  件数達到１００件時插入ＤＢ
               IF  HST-CNT = CNS-100
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON           TO    FLG-FETCH-SYUURYOU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ
               IF HST-CNT NOT = CNS-0
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-045
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-4       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALC-P2-CUR-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      *CALC-P2-CUR-CLOSE-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZBW03_CURSOR
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZBW03-CR-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZBW03-CR-OPEN=["
      *D             FLG-TKMZBW03-CR-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-POS-046
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-4         DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *CALC-P2-CUR-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    3.2.2.当断面の計算パターンは差分の場合の処理
      ******************************************************************
       DANMEI-CALC-PTN-1-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  当断面の計算パターンは差分の場合"
      D             "の処理  START ***"
      *-----------------------------------------------------------------
      *----------  3.2.2.1 開始基準日の翌日編集
           PERFORM  KJN-YMD-YKJT-RTN
      *----------  3.2.2.2 取引差分更新管理TBLから該当ポートフォリオの条件に合うのの銘柄（玉）情報を取得する
           EVALUATE  WK-IN-KH-KAIKEI-BASE-FLG
             WHEN  CNS-KH-KAIKEI-BS-FLG-1
      *----------  ARG1.基準日断面情報.基本会計ベースフラグ＝1：約定ベースの場合
               PERFORM  MEG-GYOKU-GET-1-RTN
             WHEN  CNS-KH-KAIKEI-BS-FLG-2
      *----------  ARG1.基準日断面情報.基本会計ベースフラグ＝2：受渡ベースの場合
               PERFORM  MEG-GYOKU-GET-2-RTN
             WHEN  OTHER
      *-----------  ARG1.基準日断面情報.基本会計ベースフラグは上記以外の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.基本会計ベース"
      D             "フラグは上記以外の場合"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-047
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  CNS-PARM-ERR
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *----------  3.2.2.3 有効でない断面削除
           PERFORM  DEL-MUKO-DANMEI-RTN
      *----------  3.2.2.4 コピー断面探し出す
           PERFORM  FIND-COPY-DANMEI-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  当断面の計算パターンは差分の場合"
      D             "の処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DANMEI-CALC-PTN-1-EXT.
           EXIT.
      ******************************************************************
      *    3.2.2.1 カレンダールーチンを使って、開始基準日の翌日を取得する
      ******************************************************************
       KJN-YMD-YKJT-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  開始基準日の翌日編集処理  START ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.開始基準日の翌日=["
      D             WK-IN-KAISI-KJN-YMD-NEXT"]"
      *-----------------------------------------------------------------
           IF  WK-IN-KAISI-KJN-YMD-NEXT = CNS-99999999
           THEN
      *----------  ワーク.開始基準日の翌日 ← 0
             MOVE  ZERO                 TO  WK-KAISI-KJN-YMD-YKJT
           ELSE
      *----------  ワーク.開始基準日の翌日 ← ARG1.基準日断面情報.開始基準日の翌日
             MOVE  WK-IN-KAISI-KJN-YMD-NEXT
               TO  WK-KAISI-KJN-YMD-YKJT
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク.開始基準日の翌日=["
      D             WK-KAISI-KJN-YMD-YKJT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  開始基準日の翌日を取得処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       KJN-YMD-YKJT-EXT.
           EXIT.
      ******************************************************************
      *    ARG1.基準日断面情報.基本会計ベースフラグ＝1：約定ベースの場合
      ******************************************************************
       MEG-GYOKU-GET-1-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ARG1.基準日断面情報.基本会計ベース"
      D             "フラグ＝1の場合処理  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  MEG-GK1-CUR-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  MEG-GK1-CUR-OPEN-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF             TO   FLG-FETCH-SYUURYOU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MEG-GYOKU-GET-1-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  MEG-GK1-CUR-FET-RTN
             UNTIL  FLG-FETCH-SYUURYOU = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MEG-GYOKU-GET-1-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *-----------  カーソルクローズ処理
      *    PERFORM  MEG-GK1-CUR-CLOSE-RTN                               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ARG1.基準日断面情報.基本会計ベース"
      D             "フラグ＝1の場合処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-GYOKU-GET-1-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       MEG-GK1-CUR-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZSK00-S1,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-6-A
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZSK00-S1,
                 WK-FUND-CD             OF  WK-MSG-1-6-A
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZSK00-S1,
                 WK-PTF-CD              OF  WK-MSG-1-6-A
           MOVE  WK-KAISI-KJN-YMD-YKJT
             TO  H-LAST-KJY-YMD-YKJ     OF  H-TKMZSK00-S1,
                 WK-LAST-KJY-YMD-YKJ    OF  WK-MSG-1-6-A
           MOVE  WK-IN-KJN-YMD
             TO  H-SBN-CALC-FROM-YKJ    OF  H-TKMZSK00-S1,
                 WK-SBN-CALC-FROM-YKJ   OF  WK-MSG-1-6-A
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-SELECT-1-6-A,
                 WK-TKMZSK00            OF  WK-MSG-1-6-A
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-6-A       TO  SQLSTMT4                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT4=["SQLSTMT4"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ２ー１=["FLG-TKMZSK00-CR21-OPEN"]"             @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZSK00-CR21-OPEN  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S4  FROM :SQLSTMT4  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-048
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6-A       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZSK00_CURSOR21 CURSOR  FOR S4 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-049
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6-A       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-GK1-CUR-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       MEG-GK1-CUR-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZSK00_CURSOR21
                 USING :H-TKMZSK00-S1.H-RIYO-CMP-CD,
                       :H-TKMZSK00-S1.H-FUND-CD,
                       :H-TKMZSK00-S1.H-PTF-CD,
                       :H-TKMZSK00-S1.H-LAST-KJY-YMD-YKJ,
                       :H-TKMZSK00-S1.H-SBN-CALC-FROM-YKJ
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZSK00-CR21-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR21-OPEN=["
      D             FLG-TKMZSK00-CR21-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-050
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6-A       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-GK1-CUR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       MEG-GK1-CUR-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZSK00-1
           EXEC  SQL
               FETCH
                    TKMZSK00_CURSOR21
               INTO :H-TKMZSK00-1.H-MEG-CD,
                    :H-TKMZSK00-1.H-SEC-SBT-CD,
                    :H-TKMZSK00-1.H-TATE-FLG,
                    :H-TKMZSK00-1.H-GYOKU-ID,
                    :H-TKMZSK00-1.H-SBN-CALC-FROM-YKJ,
                    :H-TKMZSK00-1.H-SIJO-TUKA-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード    =["H-MEG-CD
      D                                 OF  H-TKMZSK00-1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["H-SEC-SBT-CD
      D                                 OF  H-TKMZSK00-1"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["H-TATE-FLG
      D                                 OF  H-TKMZSK00-1"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ        =["H-GYOKU-ID
      D                                 OF  H-TKMZSK00-1"]"
      D    DISPLAY  CNS-PGM-ID":差分計算開始日（約定）=["
      D             H-SBN-CALC-FROM-YKJ
      D                                 OF  H-TKMZSK00-1"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード        =["
      D             H-SIJO-TUKA-CD      OF  H-TKMZSK00-1"]"
      *-----------------------------------------------------------------
      *--------  INSERT用ワーク銘柄別断面情報の編集を行う
               INITIALIZE                   WK-COM
               MOVE  H-MEG-CD           OF  H-TKMZSK00-1
                 TO  WK-MEG-CD          OF  WK-COM
               MOVE  H-SEC-SBT-CD       OF  H-TKMZSK00-1
                 TO  WK-SEC-SBT-CD      OF  WK-COM
               MOVE  H-TATE-FLG         OF  H-TKMZSK00-1
                 TO  WK-TATE-FLG        OF  WK-COM
               MOVE  H-GYOKU-ID         OF  H-TKMZSK00-1
                 TO  WK-GYOKU-ID        OF  WK-COM
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZSK00-1
                 TO  WK-SIJO-TUKA-CD    OF  WK-COM
               IF  WK-KAISI-KJN-YMD-YKJT  < H-SBN-CALC-FROM-YKJ
                 OF  H-TKMZSK00-1
                 AND H-SBN-CALC-FROM-YKJ
                 OF  H-TKMZSK00-1
                  <= WK-IN-KJN-YMD
               THEN
                 MOVE  H-SBN-CALC-FROM-YKJ    OF  H-TKMZSK00-1
                   TO  WK-SABON-UPDATE-FROM   OF  WK-COM
               ELSE
                 MOVE  ZERO
                   TO  WK-SABON-UPDATE-FROM   OF  WK-COM
               END-IF
               EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00-1
                 WHEN  CNS-SEC-SBT-CD-CASH
                 WHEN  CNS-SEC-SBT-CD-MA99
                 WHEN  CNS-SEC-SBT-CD-MAR
                 WHEN  CNS-SEC-SBT-CD-MABF
                 WHEN  CNS-SEC-SBT-CD-MABO
                 WHEN  CNS-SEC-SBT-CD-MAB
                 WHEN  CNS-SEC-SBT-CD-MAFB
                 WHEN  CNS-SEC-SBT-CD-MASF
                 WHEN  CNS-SEC-SBT-CD-MASO
                 WHEN  CNS-SEC-SBT-CD-MAS
                 WHEN  CNS-SEC-SBT-CD-MAFS
                   MOVE  CNS-MEG-CD-SHRU-3
                     TO  WK-MEG-CD-SHRU   OF  WK-COM
                 WHEN OTHER
                   IF  H-SEC-SBT-CD       OF  H-TKMZSK00-1
                    =  CNS-SEC-SBT-CD-PRI
                   THEN
                     MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   ELSE
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   END-IF
               END-EVALUATE
               MOVE  CNS-SAI-CALC-KBN-1
                 TO  WK-SAI-CALC-KBN    OF  WK-COM
               IF  WK-MEG-CD-SHRU       OF  WK-COM
                 = CNS-MEG-CD-SHRU-1
               THEN
                 EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00-1
                   WHEN  CNS-SEC-SBT-CD-S
                   WHEN  CNS-SEC-SBT-CD-DSMS
                   WHEN  CNS-SEC-SBT-CD-FSMS
                   WHEN  CNS-SEC-SBT-CD-ET
                   WHEN  CNS-SEC-SBT-CD-ETB
                   WHEN  CNS-SEC-SBT-CD-ETS
                   WHEN  CNS-SEC-SBT-CD-ETCB
                   WHEN  CNS-SEC-SBT-CD-ETDB
                   WHEN  CNS-SEC-SBT-CD-ETDS
                   WHEN  CNS-SEC-SBT-CD-ETDC
                   WHEN  CNS-SEC-SBT-CD-ETFS
                   WHEN  CNS-SEC-SBT-CD-ETFB
                   WHEN  CNS-SEC-SBT-CD-ETF
                   WHEN  CNS-SEC-SBT-CD-REIT
                   WHEN  CNS-SEC-SBT-CD-XMOS
                   WHEN  CNS-SEC-SBT-CD-SM
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  CNS-SEC-SBT-CD-B
                   WHEN  CNS-SEC-SBT-CD-MB
                   WHEN  CNS-SEC-SBT-CD-DBMS
                   WHEN  CNS-SEC-SBT-CD-FBMS
                   WHEN  CNS-SEC-SBT-CD-CB
                   WHEN  CNS-SEC-SBT-CD-WB
                   WHEN  CNS-SEC-SBT-CD-CBMS
                   WHEN  CNS-SEC-SBT-CD-XMOB
                    MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  OTHER
                     MOVE  CNS-MEG-CD-SHRU-3
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                 END-EVALUATE
               ELSE
                 MOVE  SPACE
                   TO  WK-MEG-CD-SHRU2       OF  WK-COM
               END-IF
               MOVE  CNS-X-1
                 TO  WK-YUKO-MEG-FLG         OF  WK-COM
               COMPUTE  HST-CNT = HST-CNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-YUKO-MEG-FLG=["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
               PERFORM  DATA-EDIT-RTN
      *----------  件数達到１００件時插入ＤＢ
               IF  HST-CNT = CNS-100
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO    FLG-FETCH-SYUURYOU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ
               IF HST-CNT NOT = CNS-0
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-051
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-6-A     DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-GK1-CUR-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      *MEG-GK1-CUR-CLOSE-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZSK00_CURSOR21
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR21-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR21-OPEN=["
      *D             FLG-TKMZSK00-CR21-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-POS-052
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-6-A       DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *MEG-GK1-CUR-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *    ARG1.基準日断面情報.基本会計ベースフラグ＝2：受渡ベースの場合
      ******************************************************************
       MEG-GYOKU-GET-2-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ARG1.基準日断面情報.基本会計ベース"
      D             "フラグ＝2の場合処理  START ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  MEG-GK2-CUR-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  MEG-GK2-CUR-OPEN-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF             TO   FLG-FETCH-SYUURYOU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MEG-GYOKU-GET-2-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  MEG-GK2-CUR-FET-RTN
             UNTIL  FLG-FETCH-SYUURYOU = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MEG-GYOKU-GET-2-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *-----------  カーソルクローズ処理
      *    PERFORM  MEG-GK2-CUR-CLOSE-RTN                               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ARG1.基準日断面情報.基本会計ベース"
      D             "フラグ＝2の場合処理  END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-GYOKU-GET-2-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       MEG-GK2-CUR-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZSK00-S2,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-6-B
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZSK00-S2,
                 WK-FUND-CD             OF  WK-MSG-1-6-B
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZSK00-S2,
                 WK-PTF-CD              OF  WK-MSG-1-6-B
           MOVE  WK-KAISI-KJN-YMD-YKJT
             TO  H-LAST-KJY-YMD-UKE     OF  H-TKMZSK00-S2,
                 WK-LAST-KJY-YMD-UKE    OF  WK-MSG-1-6-B
           MOVE  WK-IN-KJN-YMD
             TO  H-SBN-CALC-FROM-UKE    OF  H-TKMZSK00-S2,
                 WK-SBN-CALC-FROM-UKE   OF  WK-MSG-1-6-B
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-SELECT-1-6-B,
                 WK-TKMZSK00            OF  WK-MSG-1-6-B
           INITIALIZE  SQLSTMT5                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-6-B       TO  SQLSTMT5                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT5=["SQLSTMT5"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ２ー２=["FLG-TKMZSK00-CR22-OPEN"]"             @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZSK00-CR22-OPEN  =  CNS-OFF                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S5  FROM :SQLSTMT5  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-053
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6-B       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZSK00_CURSOR22 CURSOR  FOR S5 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-054
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6-B       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-GK2-CUR-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       MEG-GK2-CUR-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZSK00_CURSOR22
                 USING :H-TKMZSK00-S2.H-RIYO-CMP-CD,
                       :H-TKMZSK00-S2.H-FUND-CD,
                       :H-TKMZSK00-S2.H-PTF-CD,
                       :H-TKMZSK00-S2.H-LAST-KJY-YMD-UKE,
                       :H-TKMZSK00-S2.H-SBN-CALC-FROM-UKE
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZSK00-CR22-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR22-OPEN=["
      D             FLG-TKMZSK00-CR22-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-055
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-6-B       DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-GK2-CUR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       MEG-GK2-CUR-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZSK00-2
           EXEC  SQL
               FETCH
                    TKMZSK00_CURSOR22
               INTO :H-TKMZSK00-2.H-MEG-CD,
                    :H-TKMZSK00-2.H-SEC-SBT-CD,
                    :H-TKMZSK00-2.H-TATE-FLG,
                    :H-TKMZSK00-2.H-GYOKU-ID,
                    :H-TKMZSK00-2.H-SBN-CALC-FROM-UKE,
                    :H-TKMZSK00-2.H-SIJO-TUKA-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード    =["H-MEG-CD
      D                                 OF  H-TKMZSK00-2"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["H-SEC-SBT-CD
      D                                 OF  H-TKMZSK00-2"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["H-TATE-FLG
      D                                 OF  H-TKMZSK00-2"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ        =["H-GYOKU-ID
      D                                 OF  H-TKMZSK00-2"]"
      D    DISPLAY  CNS-PGM-ID":差分計算開始日（受渡）=["
      D             H-SBN-CALC-FROM-UKE
      D                                 OF  H-TKMZSK00-2"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード =["H-SIJO-TUKA-CD
      D                                 OF  H-TKMZSK00-2"]"
      *-----------------------------------------------------------------
      *--------  INSERT用ワーク銘柄別断面情報の編集を行う
               INITIALIZE                   WK-COM
               MOVE  H-MEG-CD           OF  H-TKMZSK00-2
                 TO  WK-MEG-CD          OF  WK-COM
               MOVE  H-SEC-SBT-CD       OF  H-TKMZSK00-2
                 TO  WK-SEC-SBT-CD      OF  WK-COM
               MOVE  H-TATE-FLG         OF  H-TKMZSK00-2
                 TO  WK-TATE-FLG        OF  WK-COM
               MOVE  H-GYOKU-ID         OF  H-TKMZSK00-2
                 TO  WK-GYOKU-ID        OF  WK-COM
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZSK00-2
                 TO  WK-SIJO-TUKA-CD    OF  WK-COM
               IF  WK-KAISI-KJN-YMD-YKJT  < H-SBN-CALC-FROM-UKE
                 OF  H-TKMZSK00-2
                 AND H-SBN-CALC-FROM-UKE
                 OF  H-TKMZSK00-2
                 <= WK-IN-KJN-YMD
               THEN
                 MOVE  H-SBN-CALC-FROM-UKE    OF  H-TKMZSK00-2
                   TO  WK-SABON-UPDATE-FROM   OF  WK-COM
               ELSE
                 MOVE  ZERO
                   TO  WK-SABON-UPDATE-FROM   OF  WK-COM
               END-IF
               EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00-2
                 WHEN  CNS-SEC-SBT-CD-CASH
                 WHEN  CNS-SEC-SBT-CD-MA99
                 WHEN  CNS-SEC-SBT-CD-MAR
                 WHEN  CNS-SEC-SBT-CD-MABF
                 WHEN  CNS-SEC-SBT-CD-MABO
                 WHEN  CNS-SEC-SBT-CD-MAB
                 WHEN  CNS-SEC-SBT-CD-MAFB
                 WHEN  CNS-SEC-SBT-CD-MASF
                 WHEN  CNS-SEC-SBT-CD-MASO
                 WHEN  CNS-SEC-SBT-CD-MAS
                 WHEN  CNS-SEC-SBT-CD-MAFS
                   MOVE  CNS-MEG-CD-SHRU-3
                     TO  WK-MEG-CD-SHRU   OF  WK-COM
                 WHEN OTHER
                   IF  H-SEC-SBT-CD       OF  H-TKMZSK00-2
                    =  CNS-SEC-SBT-CD-PRI
                   THEN
                     MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   ELSE
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   END-IF
               END-EVALUATE
               MOVE  CNS-SAI-CALC-KBN-1
                 TO  WK-SAI-CALC-KBN    OF  WK-COM
               IF  WK-MEG-CD-SHRU       OF  WK-COM
                 = CNS-MEG-CD-SHRU-1
               THEN
                 EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00-2
                   WHEN  CNS-SEC-SBT-CD-S
                   WHEN  CNS-SEC-SBT-CD-DSMS
                   WHEN  CNS-SEC-SBT-CD-FSMS
                   WHEN  CNS-SEC-SBT-CD-ET
                   WHEN  CNS-SEC-SBT-CD-ETB
                   WHEN  CNS-SEC-SBT-CD-ETS
                   WHEN  CNS-SEC-SBT-CD-ETCB
                   WHEN  CNS-SEC-SBT-CD-ETDB
                   WHEN  CNS-SEC-SBT-CD-ETDS
                   WHEN  CNS-SEC-SBT-CD-ETDC
                   WHEN  CNS-SEC-SBT-CD-ETFS
                   WHEN  CNS-SEC-SBT-CD-ETFB
                   WHEN  CNS-SEC-SBT-CD-ETF
                   WHEN  CNS-SEC-SBT-CD-REIT
                   WHEN  CNS-SEC-SBT-CD-XMOS
                   WHEN  CNS-SEC-SBT-CD-SM
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  CNS-SEC-SBT-CD-B
                   WHEN  CNS-SEC-SBT-CD-MB
                   WHEN  CNS-SEC-SBT-CD-DBMS
                   WHEN  CNS-SEC-SBT-CD-FBMS
                   WHEN  CNS-SEC-SBT-CD-CB
                   WHEN  CNS-SEC-SBT-CD-WB
                   WHEN  CNS-SEC-SBT-CD-CBMS
                   WHEN  CNS-SEC-SBT-CD-XMOB
                    MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  OTHER
                     MOVE  CNS-MEG-CD-SHRU-3
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                 END-EVALUATE
               ELSE
                 MOVE  SPACE
                   TO  WK-MEG-CD-SHRU2       OF  WK-COM
               END-IF
               MOVE  CNS-X-1
                 TO  WK-YUKO-MEG-FLG         OF  WK-COM
               COMPUTE  HST-CNT = HST-CNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-YUKO-MEG-FLG=["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
               PERFORM  DATA-EDIT-RTN
      *----------  件数達到１００件時插入ＤＢ
               IF  HST-CNT = CNS-100
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO    FLG-FETCH-SYUURYOU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ
               IF HST-CNT NOT = CNS-0
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-056
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-6-B     DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-GK2-CUR-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      *MEG-GK2-CUR-CLOSE-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZSK00_CURSOR22
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR22-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR22-OPEN=["
      *D             FLG-TKMZSK00-CR22-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-POS-057
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-6-B       DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *MEG-GK2-CUR-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *   3.2.2.3 有効でない断面削除
      ******************************************************************
       DEL-MUKO-DANMEI-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  有効でない断面削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  1)残高履歴から削除
           PERFORM  DEL-TKMZZR00-RTN
      *----------  2)資金残履歴から削除
           PERFORM  DEL-TKMZSR00-RTN
      *----------  3)元本残高から削除
           PERFORM  DEL-TKMZGZ00-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  有効でない断面削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-MUKO-DANMEI-EXT.
           EXIT.
      ******************************************************************
      *   1)残高履歴から削除
      ******************************************************************
       DEL-TKMZZR00-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高履歴から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  基準日
           MOVE  WK-IN-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZZR00-DELETE,
                 WK-KJN-YMD             OF  WK-MSG-1-10
      *----------  最終有効日
           MOVE  WK-IN-KJN-YMD
             TO  H-LAST-YUKO-YMD        OF  H-TKMZZR00-DELETE,
                 WK-LAST-YUKO-YMD       OF  WK-MSG-1-10
      *----------  利用会社コード
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZZR00-DELETE,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-10
      *----------  ファンドコード
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZZR00-DELETE,
                 WK-FUND-CD             OF  WK-MSG-1-10
      *----------  ポートフォリオコード
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZZR00-DELETE,
                 WK-PTF-CD              OF  WK-MSG-1-10
      *----------  残高履歴TBL
           MOVE  WK-TABLE-ID4
             TO  SQL-TKMZZR00           OF  SQL-DELETE-1-10,
                 WK-TKMZZR00            OF  WK-MSG-1-10
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-DELETE-1-10,
                 WK-TKMZSK00            OF  WK-MSG-1-10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日     =["H-KJN-YMD
      D                                 OF  H-TKMZZR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":最終有効日 =["H-LAST-YUKO-YMD
      D                                 OF  H-TKMZZR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["H-RIYO-CMP-CD
      D                                 OF  H-TKMZZR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["H-FUND-CD
      D                                 OF  H-TKMZZR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["H-PTF-CD
      D                                 OF  H-TKMZZR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-10    =["WK-MSG-1-10"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT6                                         @3212SEINO@@
           MOVE  SQL-DELETE-1-10        TO  SQLSTMT6                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT6    =["SQLSTMT6"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           IF    FLG-DELETE-TKMZZR00  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE S6  FROM :SQLSTMT6 END-EXEC                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-058
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-MSG-1-10        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           EXEC SQL EXECUTE S6
           USING  :H-TKMZZR00-DELETE.H-KJN-YMD,
                  :H-TKMZZR00-DELETE.H-LAST-YUKO-YMD,
                  :H-TKMZZR00-DELETE.H-RIYO-CMP-CD,
                  :H-TKMZZR00-DELETE.H-FUND-CD,
                  :H-TKMZZR00-DELETE.H-PTF-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZZR00         @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZZR00         @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-059
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-MSG-1-10      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高履歴を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高履歴から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZZR00-EXT.
           EXIT.
      ******************************************************************
      *   2)資金残履歴から削除
      ******************************************************************
       DEL-TKMZSR00-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金残履歴から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  基準日
           MOVE  WK-IN-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZSR00-DELETE,
                 WK-KJN-YMD             OF  WK-MSG-1-13
      *----------  最終有効日
           MOVE  WK-IN-KJN-YMD
             TO  H-LAST-YUKO-YMD        OF  H-TKMZSR00-DELETE,
                 WK-LAST-YUKO-YMD       OF  WK-MSG-1-13
      *----------  利用会社コード
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZSR00-DELETE,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-13
      *----------  ファンドコード
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZSR00-DELETE,
                 WK-FUND-CD             OF  WK-MSG-1-13
      *----------  ポートフォリオコード
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZSR00-DELETE,
                 WK-PTF-CD              OF  WK-MSG-1-13
      *----------  残高履歴TBL
           MOVE  WK-TABLE-ID5
             TO  SQL-TKMZSR00           OF  SQL-DELETE-1-13,
                 WK-TKMZSR00            OF  WK-MSG-1-13
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-DELETE-1-13,
                 WK-TKMZSK00            OF  WK-MSG-1-13
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日     =["H-KJN-YMD
      D                                 OF  H-TKMZSR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":最終有効日 =["H-LAST-YUKO-YMD
      D                                 OF  H-TKMZSR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["H-RIYO-CMP-CD
      D                                 OF  H-TKMZSR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["H-FUND-CD
      D                                 OF  H-TKMZSR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["H-PTF-CD
      D                                 OF  H-TKMZSR00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-13    =["WK-MSG-1-13"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT7                                         @3212SEINO@@
           MOVE  SQL-DELETE-1-13        TO  SQLSTMT7                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT7    =["SQLSTMT7"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           IF    FLG-DELETE-TKMZSR00  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE S7  FROM :SQLSTMT7 END-EXEC                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-060
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-MSG-1-10        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           EXEC SQL EXECUTE S7
           USING  :H-TKMZSR00-DELETE.H-KJN-YMD,
                  :H-TKMZSR00-DELETE.H-LAST-YUKO-YMD,
                  :H-TKMZSR00-DELETE.H-RIYO-CMP-CD,
                  :H-TKMZSR00-DELETE.H-FUND-CD,
                  :H-TKMZSR00-DELETE.H-PTF-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZSR00         @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZSR00         @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-061
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-MSG-1-10      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金残履歴を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金残履歴から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZSR00-EXT.
           EXIT.
      ******************************************************************
      *   3)元本残高から削除
      ******************************************************************
       DEL-TKMZGZ00-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  元本残高から削除処理 START  ***"
      *-----------------------------------------------------------------
      *----------  基準日
           MOVE  WK-IN-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZGZ00-DELETE,
                 WK-KJN-YMD             OF  WK-MSG-1-14
      *----------  最終有効日
           MOVE  WK-IN-KJN-YMD
             TO  H-LAST-YUKO-YMD        OF  H-TKMZGZ00-DELETE,
                 WK-LAST-YUKO-YMD       OF  WK-MSG-1-14
      *----------  利用会社コード
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZGZ00-DELETE,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-14
      *----------  ファンドコード
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZGZ00-DELETE,
                 WK-FUND-CD             OF  WK-MSG-1-14
      *----------  ポートフォリオコード
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZGZ00-DELETE,
                 WK-PTF-CD              OF  WK-MSG-1-14
      *----------  元本残高TBL
           MOVE  WK-TABLE-ID6
             TO  SQL-TKMZGZ00           OF  SQL-DELETE-1-14,
                 WK-TKMZGZ00            OF  WK-MSG-1-14
      *----------  取引差分更新管理TBL
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-DELETE-1-14,
                 WK-TKMZSK00            OF  WK-MSG-1-14
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日     =["H-KJN-YMD
      D                                 OF  H-TKMZGZ00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":最終有効日 =["H-LAST-YUKO-YMD
      D                                 OF  H-TKMZGZ00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード =["H-RIYO-CMP-CD
      D                                 OF  H-TKMZGZ00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード =["H-FUND-CD
      D                                 OF  H-TKMZGZ00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード =["H-PTF-CD
      D                                 OF  H-TKMZGZ00-DELETE"]"
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-14    =["WK-MSG-1-14"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT8                                         @3212SEINO@@
           MOVE  SQL-DELETE-1-14        TO  SQLSTMT8                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT8    =["SQLSTMT8"]"              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           IF    FLG-DELETE-TKMZGZ00  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE S8  FROM :SQLSTMT8 END-EXEC                 @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-062
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-SQL-MSG-DELETE,
                     WK-MSG-1-14        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高を物理削除（PREPARE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           EXEC SQL EXECUTE S8
           USING  :H-TKMZGZ00-DELETE.H-KJN-YMD,
                  :H-TKMZGZ00-DELETE.H-LAST-YUKO-YMD,
                  :H-TKMZGZ00-DELETE.H-RIYO-CMP-CD,
                  :H-TKMZGZ00-DELETE.H-FUND-CD,
                  :H-TKMZGZ00-DELETE.H-PTF-CD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZGZ00         @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  CNS-SQL-NOTFOUND
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZGZ00         @3212SEINO@@
      *----------------------<DEBUG>------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00"]"                              @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-063
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-DELETE,
                       WK-MSG-1-14      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":元本残高を物理削除（EXECUTE)  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  元本残高から削除処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       DEL-TKMZGZ00-EXT.
           EXIT.
      ******************************************************************
      *   3.2.2.4 コピー断面探し出す
      ******************************************************************
       FIND-COPY-DANMEI-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  コピー断面探し出す処理 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  COPY-DM-CUR-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  COPY-DM-CUR-OPEN-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF             TO   FLG-FETCH-SYUURYOU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FIND-COPY-DANMEI-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  COPY-DM-CUR-FET-RTN
             UNTIL  FLG-FETCH-SYUURYOU = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FIND-COPY-DANMEI-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *-----------  カーソルクローズ処理
      *    PERFORM  COPY-DM-CUR-CLOSE-RTN                               @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  コピー断面探し出す処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       FIND-COPY-DANMEI-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       COPY-DM-CUR-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           MOVE  WK-IN-SYORI-YMD
             TO  H-SYORI-YMD            OF  H-TKMZSK00-S3,
                 WK-SYORI-YMD           OF  WK-MSG-1-11
           MOVE  WK-IN-KIDOU-ID
             TO  H-KIDOU-ID             OF  H-TKMZSK00-S3,
                 WK-KIDOU-ID            OF  WK-MSG-1-11
           MOVE  WK-IN-RIYO-CMP-CD
             TO  H-RIYO-CMP-CD          OF  H-TKMZSK00-S3,
                 WK-RIYO-CMP-CD         OF  WK-MSG-1-11,
                 WK-RIYO-CMP-CD-W       OF  WK-MSG-1-11
           MOVE  WK-IN-FUND-CD
             TO  H-FUND-CD              OF  H-TKMZSK00-S3,
                 WK-FUND-CD             OF  WK-MSG-1-11,
                 WK-FUND-CD-W           OF  WK-MSG-1-11
           MOVE  WK-IN-PTF-CD
             TO  H-PTF-CD               OF  H-TKMZSK00-S3,
                 WK-PTF-CD              OF  WK-MSG-1-11,
                 WK-PTF-CD-W            OF  WK-MSG-1-11
           MOVE  WK-IN-KJN-YMD
             TO  H-KJN-YMD              OF  H-TKMZSK00-S3,
                 WK-KJN-YMD             OF  WK-MSG-1-11
           MOVE  WK-TABLE-ID1
             TO  SQL-TKMZSK00           OF  SQL-SELECT-1-11,
                 WK-TKMZSK00            OF  WK-MSG-1-11
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-SELECT-1-11,
                 WK-TKMZBW03            OF  WK-MSG-1-11
           INITIALIZE  SQLSTMT9                                         @3212SEINO@@
      *----ＳＱＬ文
           MOVE  SQL-SELECT-1-11        TO  SQLSTMT9                    @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-11=["WK-MSG-1-11"]"
      D    DISPLAY  CNS-PGM-ID":SQLSTMT9=["SQLSTMT9"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ３=["FLG-TKMZSK00-CR3-OPEN"]"                  @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START    @3212SEINO@@
      *--                                                               @3212SEINO@@
           IF  FLG-TKMZSK00-CR3-OPEN  =  CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC  SQL  PREPARE  S9  FROM :SQLSTMT9  END-EXEC             @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-064
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  TKMZSK00_CURSOR3  CURSOR  FOR S9 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-065
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *--                                                               @3212SEINO@@
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END      @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       COPY-DM-CUR-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       COPY-DM-CUR-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN TKMZSK00_CURSOR3
                 USING :H-TKMZSK00-S3.H-SYORI-YMD,
                       :H-TKMZSK00-S3.H-KIDOU-ID,
                       :H-TKMZSK00-S3.H-RIYO-CMP-CD,
                       :H-TKMZSK00-S3.H-FUND-CD,
                       :H-TKMZSK00-S3.H-PTF-CD,
                       :H-TKMZSK00-S3.H-KJN-YMD,
                       :H-TKMZSK00-S3.H-RIYO-CMP-CD,
                       :H-TKMZSK00-S3.H-FUND-CD,
                       :H-TKMZSK00-S3.H-PTF-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  FLG-TKMZSK00-CR3-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR3-OPEN=["
      D             FLG-TKMZSK00-CR3-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-066
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-SELECT,
                     WK-MSG-1-11        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       COPY-DM-CUR-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    カーソルフェッチ処理                                        *
      ******************************************************************
       COPY-DM-CUR-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE                   H-TKMZSK00
           EXEC  SQL
               FETCH
                    TKMZSK00_CURSOR3
               INTO :H-TKMZSK00-3.H-MEG-CD,
                    :H-TKMZSK00-3.H-SEC-SBT-CD,
                    :H-TKMZSK00-3.H-TATE-FLG,
                    :H-TKMZSK00-3.H-GYOKU-ID,
                    :H-TKMZSK00-3.H-SIJO-TUKA-CD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード    =["H-MEG-CD
      D                                 OF  H-TKMZSK00-3"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["H-SEC-SBT-CD
      D                                 OF  H-TKMZSK00-3"]"
      D    DISPLAY  CNS-PGM-ID":資産/負債・買建/売建フラグ=["H-TATE-FLG
      D                                 OF  H-TKMZSK00-3"]"
      D    DISPLAY  CNS-PGM-ID":玉ＩＤ        =["H-GYOKU-ID
      D                                 OF  H-TKMZSK00-3"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード=["H-SIJO-TUKA-CD
      D                                 OF  H-TKMZSK00-3"]"
      *-----------------------------------------------------------------
      *--------  INSERT用ワーク銘柄別断面情報の編集を行う
               INITIALIZE                   WK-COM
               MOVE  H-MEG-CD           OF  H-TKMZSK00-3
                 TO  WK-MEG-CD          OF  WK-COM
               MOVE  H-SEC-SBT-CD       OF  H-TKMZSK00-3
                 TO  WK-SEC-SBT-CD      OF  WK-COM
               MOVE  H-TATE-FLG         OF  H-TKMZSK00-3
                 TO  WK-TATE-FLG        OF  WK-COM
               MOVE  H-GYOKU-ID         OF  H-TKMZSK00-3
                 TO  WK-GYOKU-ID        OF  WK-COM
               MOVE  H-SIJO-TUKA-CD     OF  H-TKMZSK00-3
                 TO  WK-SIJO-TUKA-CD    OF  WK-COM
               MOVE  ZERO
                 TO  WK-SABON-UPDATE-FROM   OF  WK-COM
               EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00-3
                 WHEN  CNS-SEC-SBT-CD-CASH
                 WHEN  CNS-SEC-SBT-CD-MA99
                 WHEN  CNS-SEC-SBT-CD-MAR
                 WHEN  CNS-SEC-SBT-CD-MABF
                 WHEN  CNS-SEC-SBT-CD-MABO
                 WHEN  CNS-SEC-SBT-CD-MAB
                 WHEN  CNS-SEC-SBT-CD-MAFB
                 WHEN  CNS-SEC-SBT-CD-MASF
                 WHEN  CNS-SEC-SBT-CD-MASO
                 WHEN  CNS-SEC-SBT-CD-MAS
                 WHEN  CNS-SEC-SBT-CD-MAFS
                   MOVE  CNS-MEG-CD-SHRU-3
                     TO  WK-MEG-CD-SHRU   OF  WK-COM
                 WHEN OTHER
                   IF  H-SEC-SBT-CD       OF  H-TKMZSK00-3
                    =  CNS-SEC-SBT-CD-PRI
                   THEN
                     MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   ELSE
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU OF  WK-COM
                   END-IF
               END-EVALUATE
               MOVE  CNS-SAI-CALC-KBN-2
                 TO  WK-SAI-CALC-KBN    OF  WK-COM
               IF  WK-MEG-CD-SHRU       OF  WK-COM
                 = CNS-MEG-CD-SHRU-1
               THEN
                 EVALUATE  H-SEC-SBT-CD       OF  H-TKMZSK00-3
                   WHEN  CNS-SEC-SBT-CD-S
                   WHEN  CNS-SEC-SBT-CD-DSMS
                   WHEN  CNS-SEC-SBT-CD-FSMS
                   WHEN  CNS-SEC-SBT-CD-ET
                   WHEN  CNS-SEC-SBT-CD-ETB
                   WHEN  CNS-SEC-SBT-CD-ETS
                   WHEN  CNS-SEC-SBT-CD-ETCB
                   WHEN  CNS-SEC-SBT-CD-ETDB
                   WHEN  CNS-SEC-SBT-CD-ETDS
                   WHEN  CNS-SEC-SBT-CD-ETDC
                   WHEN  CNS-SEC-SBT-CD-ETFS
                   WHEN  CNS-SEC-SBT-CD-ETFB
                   WHEN  CNS-SEC-SBT-CD-ETF
                   WHEN  CNS-SEC-SBT-CD-REIT
                   WHEN  CNS-SEC-SBT-CD-XMOS
                   WHEN  CNS-SEC-SBT-CD-SM
                     MOVE  CNS-MEG-CD-SHRU-1
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  CNS-SEC-SBT-CD-B
                   WHEN  CNS-SEC-SBT-CD-MB
                   WHEN  CNS-SEC-SBT-CD-DBMS
                   WHEN  CNS-SEC-SBT-CD-FBMS
                   WHEN  CNS-SEC-SBT-CD-CB
                   WHEN  CNS-SEC-SBT-CD-WB
                   WHEN  CNS-SEC-SBT-CD-CBMS
                   WHEN  CNS-SEC-SBT-CD-XMOB
                    MOVE  CNS-MEG-CD-SHRU-2
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                   WHEN  OTHER
                     MOVE  CNS-MEG-CD-SHRU-3
                       TO  WK-MEG-CD-SHRU2   OF  WK-COM
                 END-EVALUATE
               ELSE
                 MOVE  SPACE
                   TO  WK-MEG-CD-SHRU2       OF  WK-COM
               END-IF
               MOVE  CNS-X-1
                 TO  WK-YUKO-MEG-FLG         OF  WK-COM
               COMPUTE  HST-CNT = HST-CNT + CNS-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-YUKO-MEG-FLG=["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
               PERFORM  DATA-EDIT-RTN
      *----------  件数達到１００件時插入ＤＢ
               IF  HST-CNT = CNS-100
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON           TO    FLG-FETCH-SYUURYOU
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU=["
      D             FLG-FETCH-SYUURYOU"]"
      D    DISPLAY  CNS-PGM-ID":HST-CNT=["HST-CNT"]"
      *-----------------------------------------------------------------
      *----------  取到最後一件時插入ＤＢ
               IF HST-CNT NOT = CNS-0
               THEN
      *----------  データを運用成果残高テーブルに挿入PREPARE処理
                 PERFORM  INSERT-PREPARE-RTN
      *----------  編集したデータを運用成果残高テーブルに挿入する
                 PERFORM  DATA-INSERT-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-067
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  CNS-SQL-MSG-SELECT,
                       WK-MSG-1-11      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       COPY-DM-CUR-FET-EXT.
           EXIT.
      ******************************************************************
      *   カーソルクローズ処理                                         *
      ******************************************************************
      *COPY-DM-CUR-CLOSE-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 START  ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE TKMZSK00_CURSOR3
      *    END-EXEC
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE-CLOSE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE                  = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR3-OPEN
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR3-OPEN=["
      *D             FLG-TKMZSK00-CR3-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *-----------------------DEBUG-------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQL処理エラー（CLOSE)"
      *-----------------------------------------------------------------
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-POS-068
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *      MOVE  CNS-DETAIL-1
      *        TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *      STRING  CNS-SQL-MSG-SELECT,
      *              WK-MSG-1-11        DELIMITED  BY  SIZE
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      *D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション             =["
      *D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      *D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      *D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      *D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      *D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *      PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  カーソルクローズ処理 END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *COPY-DM-CUR-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *   3.2.4.銘柄別断面情報データ増幅処理
      ******************************************************************
       MGBT-DMN-INFO-ADD-RTN  SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.4.銘柄別断面情報データ増幅処理"
      D             "START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT23                                        @3212SEINO@@
      *----------  テーブルID
           MOVE  WK-TABLE-ID3
             TO  SQL-TBL-TKMZBW03        OF  S-INSERT-TKMZBW03,
                 SQL-TBL-TKMZBW03        OF  S-VALUES-TKMZBW03,
                 WK-TBL-TKMZBW03         OF  WK-MSG-1-18
      *----------  銘柄種類
           MOVE  CNS-MEG-CD-SHRU-1
             TO  H-MEG-CD-SHRU           OF  H-TKMZBW03-18
      *----------  処理実行日
           MOVE  WK-IN-SYORI-YMD
             TO  WK-SQL-SYORI-YMD        OF  WK-MSG-1-18,
                 H-SYORI-YMD             OF  H-TKMZBW03-18
      *----------  起動ID
           MOVE  WK-IN-KIDOU-ID
             TO  WK-SQL-KIDOU-ID         OF  WK-MSG-1-18,
                 H-KIDOU-ID              OF  H-TKMZBW03-18
      *----------  利用会社コード
           MOVE  WK-IN-RIYO-CMP-CD
             TO  WK-SQL-RIYO-CMP-CD      OF  WK-MSG-1-18,
                 H-RIYO-CMP-CD           OF  H-TKMZBW03-18
      *----------  ファンドコード
           MOVE  WK-IN-FUND-CD
             TO  WK-SQL-FUND-CD          OF  WK-MSG-1-18,
                 H-FUND-CD               OF  H-TKMZBW03-18
      *----------  ポートフォリオコード
           MOVE  WK-IN-PTF-CD
             TO  WK-SQL-PTF-CD           OF  WK-MSG-1-18,
                 H-PTF-CD                OF  H-TKMZBW03-18
      *----------  基準日
           MOVE  WK-IN-KJN-YMD
             TO  WK-SQL-KJN-YMD          OF  WK-MSG-1-18,
                 H-KJN-YMD               OF  H-TKMZBW03-18
      *----------  ＳＱＬ文
           MOVE  SQL-INSERT-TKMZBW03     TO  SQLSTMT23                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT23=["SQLSTMT23"]"                @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報INSカーソルオープンフ"    @3212SEINO@@
      D             "ラグ2=["FLG-INSERT-TKMZBW03-CR2"]"                 @3212SEINO@@
      *-----------------------------------------------------------------
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           IF    FLG-INSERT-TKMZBW03-CR2  =  CNS-OFF                    @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL
               PREPARE S23 FROM :SQLSTMT23                              @3212SEINO@@
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報データ増幅処理"
      D             "PREPARE SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報データ増幅処理PREPARE正常"
      *-----------------------------------------------------------------
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報データ増幅処理PREPARE異常"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID            OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-069
               TO  ERR-POS               OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD                OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD         OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
             STRING  CNS-SQL-MSG-INSERT,
                     WK-MSG-1-18         DELIMITED  BY  SIZE
               INTO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
      *----  ※前回PREPAREしている場合はPREPAREをスキップ               @3212SEINO@@
           EXEC SQL
               EXECUTE S23
                 USING :H-TKMZBW03-18.H-MEG-CD-SHRU,
                       :H-TKMZBW03-18.H-SYORI-YMD,
                       :H-TKMZBW03-18.H-KIDOU-ID,
                       :H-TKMZBW03-18.H-RIYO-CMP-CD,
                       :H-TKMZBW03-18.H-FUND-CD,
                       :H-TKMZBW03-18.H-PTF-CD,
                       :H-TKMZBW03-18.H-KJN-YMD
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報データ増幅処理"
      D             " INSERT SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報データ増幅処理INSERT正常"
      *-----------------------------------------------------------------
      *----  性能改善対応：PREPARE回数削減対応                          @3212SEINO@@
               MOVE  CNS-ON              TO  FLG-INSERT-TKMZBW03-CR2    @3212SEINO@@
      *-----------------------DEBUG-------------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報INSカーソルオープンフ"    @3212SEINO@@
      D             "ラグ2=["FLG-INSERT-TKMZBW03-CR2"]"                 @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理計算データ INSERT  異常"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-070
                 TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-SQL-MSG-INSERT,
                       WK-MSG-1-18       DELIMITED  BY  SIZE
                 INTO  FREE-MSG          OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERR-PGM-ID                  =["
      D             ERR-PGM-ID           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ERR-POS                     =["
      D             ERR-POS              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD                      =["
      D             RTN-CD               OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD               =["
      D             DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":DETAIL-RTN-CD-FLG           =["
      D             DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":FREE-MSG                    =["
      D             FREE-MSG             OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.4.銘柄別断面情報データ増幅処理"
      D             "END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MGBT-DMN-INFO-ADD-EXT.
           EXIT.
      ******************************************************************
      *   3.2.5 有効銘柄チェック処理                                   *
      ******************************************************************
       YUKO-MEG-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  有効銘柄チェック処理 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  YUKO-MEG-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  YUKO-MEG-OPEN-RTN
      *-----------  カーソルフェッチ処理
           MOVE  CNS-OFF             TO   FLG-FETCH-SYUURYOU-45
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FETCH-SYUURYOU-45=["
      D             FLG-FETCH-SYUURYOU-45"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [YUKO-MEG-FETCH-RTN]"          GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  YUKO-MEG-FET-RTN
             UNTIL  FLG-FETCH-SYUURYOU-45 = CNS-ON
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [YUKO-MEG-FETCH-RTN]"          GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  有効銘柄チェック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       YUKO-MEG-FETCH-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       YUKO-MEG-DEC-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT45
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-FETCH-45
      *----ＳＱＬ文
           MOVE  SQL-FETCH-45           TO  SQLSTMT45
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT45=["SQLSTMT45"]"
      D    DISPLAY  CNS-PGM-ID":V1=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V2=["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":V3=["WK-IN-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":V4=["WK-IN-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":V5=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ_3"
      D             "=["TKMZBW03-45-OPEN-FLG"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
           IF  TKMZBW03-45-OPEN-FLG  =  CNS-OFF
           THEN
           EXEC  SQL  PREPARE  S45  FROM :SQLSTMT45  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S45=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-071
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT45
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CR45  CURSOR  FOR S45 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-072
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT45
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE
             CONTINUE
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソル定義処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       YUKO-MEG-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       YUKO-MEG-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN CR45
                 USING :WK-IN-FUND-CD,
                       :WK-IN-PTF-CD,
                       :WK-IN-SYORI-YMD,
                       :WK-IN-KIDOU-ID,
                       :WK-IN-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  TKMZBW03-45-OPEN-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZBW03-45-OPEN-FLG=["
      D             TKMZBW03-45-OPEN-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-073
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT45
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       YUKO-MEG-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.5.2『銘柄別断面情報』カーソルフェッチする               *
      ******************************************************************
       YUKO-MEG-FET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.5.2『銘柄別断面情報』"
      D                       "カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW03-45
           EXEC  SQL
               FETCH
                    CR45
               INTO :H-TKMZBW03-45
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR45-FETCH=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":処理実行日 =["
      D                H-SYORI-YMD     OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":起動ID  =["
      D                H-KIDOU-ID      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード  =["
      D                H-RIYO-CMP-CD   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード  =["
      D                H-FUND-CD       OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード  =["
      D                H-PTF-CD        OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日  =["
      D                H-KAISI-KJN-YMD OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":基準日 =["
      D                H-KJN-YMD       OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード  =["
      D                H-MEG-CD        OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード  =["
      D                H-SEC-SBT-CD    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ  =["
      D                H-TATE-FLG      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":玉ID  =["
      D                H-GYOKU-ID      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":市場通貨コード  =["
      D                H-SIJO-TUKA-CD  OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日 =["
      D                H-SABON-UPDATE-FROM   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":銘柄種類 =["
      D                H-MEG-CD-SHRU   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":再計算区分  =["
      D                H-SAI-CALC-KBN  OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":銘柄種類２  =["
      D                H-MEG-CD-SHRU2  OF  H-TKMZBW03-45"]"
      *-----------------------------------------------------------------
               INITIALIZE  EST-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG=["EST-FLG"]"
      D    DISPLAY  CNS-PGM-ID"H-SEC-SBT-CD  OF  H-TKMZBW03-45=["
      D                        H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      *-----------------------------------------------------------------
               IF H-SEC-SBT-CD OF H-TKMZBW03-45(1:2)
                = CNS-SEC-SBT-CD-MA
               THEN
      *----------  ⅰ)直前履歴のチェック処理2を行う
                 PERFORM  SELECT-462TKMZZR00-RTN
               ELSE
      *----------  ⅰ)直前履歴のチェック処理を行う
                 PERFORM  SELECT-46-TKMZZR00-RTN
               END-IF
      *----------  ⅱ)取引のチェック処理を行う
               IF  EST-FLG = CNS-OFF
               THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID"H-SEC-SBT-CD  OF  H-TKMZBW03-45=["
      D                        H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      *-----------------------------------------------------------------
                 IF H-SEC-SBT-CD OF H-TKMZBW03-45(1:2)
                  = CNS-SEC-SBT-CD-MA
                 THEN
                   PERFORM  SELECT-472TKMXTR00-RTN
                 ELSE
                   PERFORM  SELECT-47-TKMXTR00-RTN
                 END-IF
               ELSE
                 CONTINUE
               END-IF
      *----------  ⅲ)未収補正のチェック処理を行う
               IF  EST-FLG = CNS-OFF
               THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":「別紙1-45 SQL説明」.銘柄種類２=["
      D                       H-MEG-CD-SHRU2  OF  H-TKMZBW03-45"]"
      *-----------------------------------------------------------------
                 IF  H-MEG-CD-SHRU2  OF  H-TKMZBW03-45 = CNS-X-1
                   OR  H-MEG-CD-SHRU2  OF  H-TKMZBW03-45 = CNS-X-3
                 THEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID"H-SEC-SBT-CD  OF  H-TKMZBW03-45=["
      D                        H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      *-----------------------------------------------------------------
                   IF H-SEC-SBT-CD OF H-TKMZBW03-45(1:2)
                     = CNS-SEC-SBT-CD-MA
                   THEN
                     PERFORM  SELECT-482TKMZMS00-RTN
                   ELSE
                     PERFORM  SELECT-48-TKMZMS00-RTN
                   END-IF
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
                 CONTINUE
               END-IF
      *----------  ⅳ)経過利息のチェック処理を行う
               IF  EST-FLG = CNS-OFF
               THEN
                 IF  H-MEG-CD-SHRU2  OF  H-TKMZBW03-45 = CNS-X-2
                 THEN
                   PERFORM  SELECT-49-TKMZKR00-RTN
                 ELSE
                   CONTINUE
                 END-IF
               ELSE
                 CONTINUE
               END-IF
      *----------  ⅴ)未収配当変更日のチェック処理を行う
               IF  EST-FLG = CNS-OFF
               THEN
                 PERFORM  SELECT-50-TKJCKP00-RTN
               ELSE
                 CONTINUE
               END-IF
             WHEN  CNS-SQL-NOTFOUND
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  "**** カーソルフェッチ処理(NOTFOUND) ****"
      *-----------------------------------------------------------------
               MOVE  CNS-ON
                 TO  FLG-FETCH-SYUURYOU-45
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-074
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT45
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  3.2.5.2『銘柄別断面情報』"
      D                       "カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       YUKO-MEG-FET-EXT.
           EXIT.
      ******************************************************************
      *  ⅰ)直前履歴のチェック処理を行う。「別紙1-46 SQL説明」を参照   *
      ******************************************************************
       SELECT-46-TKMZZR00-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  直前履歴のチェック処理 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZZR00-46-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZZR00-46-OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZZR00-46-FET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  直前履歴のチェック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-46-TKMZZR00-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZZR00-46-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                    ":***  直前履歴のカーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT46
           MOVE  WK-TABLE-ID4
             TO  SQL-TKMZZR00           OF  SQL-SELECT-46
           MOVE  SQL-SELECT-46-SEC-1
             TO  SQL-SELECT-46-SEC      OF  SQL-SELECT-46
      *----ＳＱＬ文
           MOVE  SQL-SELECT-46          TO  SQLSTMT46
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT46=["SQLSTMT46"]"
      D    DISPLAY  CNS-PGM-ID":V6=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V7=["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":V8=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V9=["H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V10=["H-TATE-FLG   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V11=["H-GYOKU-ID   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V12=["WK-IN-KAISI-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ"
      D             "=["TKMZZR00-46-OPEN-FLG"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
           IF  TKMZZR00-46-OPEN-FLG  =  CNS-OFF
           THEN
           EXEC  SQL  PREPARE  S46  FROM :SQLSTMT46  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S46=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-075
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT46
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CR46  CURSOR  FOR S46 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-076
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT46
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE
             CONTINUE
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**  直前履歴のカーソル定義処理 END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-46-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMZZR00-46-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN CR46
                 USING :WK-IN-FUND-CD,
                       :WK-IN-PTF-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-SEC-SBT-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR46-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  TKMZZR00-46-OPEN-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-46-OPEN-FLG=["
      D             TKMZZR00-46-OPEN-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-077
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT46
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-46-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    直前履歴のチェック処理                                      *
      ******************************************************************
       TKMZZR00-46-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  直前履歴の"
      D                       "カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-46
           EXEC  SQL
               FETCH
                    CR46
               INTO :H-FETCH-46
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR46-SELECT=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR46-FETCHファンド=["H-FETCH-46"]"
      *-----------------------------------------------------------------
               MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
               PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-078
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT46
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  直前履歴の"
      D                       "カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-46-FET-EXT.
           EXIT.
      ******************************************************************
      *  ⅰ)直前履歴のチェック処理2を行う。「別紙1-46 SQL説明」を参照  *
      ******************************************************************
       SELECT-462TKMZZR00-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  直前履歴のチェック処理2 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZZR00-462DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZZR00-462OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZZR00-462FET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  直前履歴のチェック処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-462TKMZZR00-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZZR00-462DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                   ":***  直前履歴のカーソル定義処理2 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT46-2
           MOVE  WK-TABLE-ID4
             TO  SQL-TKMZZR00           OF  SQL-SELECT-46
           MOVE  SQL-SELECT-46-SEC-2
             TO  SQL-SELECT-46-SEC      OF  SQL-SELECT-46
      *----ＳＱＬ文
           MOVE  SQL-SELECT-46          TO  SQLSTMT46-2
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT46-2=["SQLSTMT46-2"]"
      D    DISPLAY  CNS-PGM-ID":V6=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V7=["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":V8=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V10=["H-TATE-FLG   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V11=["H-GYOKU-ID   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V12=["WK-IN-KAISI-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ2"
      D             "=["TKMZZR00-46-OPEN-FLG-2"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
           IF  TKMZZR00-46-OPEN-FLG-2  =  CNS-OFF
           THEN
           EXEC  SQL  PREPARE  S46_2  FROM :SQLSTMT46-2  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S46-2=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-101
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT46-2
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CR46_2  CURSOR  FOR S46_2 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-102
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT46-2
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE
             CONTINUE
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**  直前履歴のカーソル定義処理2 END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-462DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMZZR00-462OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理2 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN CR46_2
                 USING :WK-IN-FUND-CD,
                       :WK-IN-PTF-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR46-OPEN-2=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  TKMZZR00-46-OPEN-FLG-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZR00-46-OPEN-FLG-2=["
      D             TKMZZR00-46-OPEN-FLG-2"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-103
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT46-2
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  カーソルオープン処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-462OPEN-EXT.
           EXIT.
      ******************************************************************
      *    直前履歴のチェック処理2                                     *
      ******************************************************************
       TKMZZR00-462FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  直前履歴の"
      D                       "カーソルフェッチ処理2 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-46
           EXEC  SQL
               FETCH
                    CR46_2
               INTO :H-FETCH-46
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR46-SELECT-2=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR46-2-FETCHファンド=["H-FETCH-46"]"
      *-----------------------------------------------------------------
               MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
               PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-104
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT46-2
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  直前履歴の"
      D                       "カーソルフェッチ処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZZR00-462FET-EXT.
           EXIT.
      ******************************************************************
      *  ⅱ)取引のチェック処理を行う。「別紙1-47 SQL説明」を参照       *
      ******************************************************************
       SELECT-47-TKMXTR00-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引のチェック処理 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMXTR00-47-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMXTR00-47-OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMXTR00-47-FET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引のチェック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-47-TKMXTR00-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMXTR00-47-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引のカーソル定義処理 START  ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.基本会計ベース"
      D             "フラグ=["WK-IN-KH-KAIKEI-BASE-FLG"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT47-1
                       SQLSTMT47-2
           MOVE  WK-TABLE-ID7
             TO  SQL-TKMXTR00           OF  SQL-SELECT-47
           MOVE  SQL-SELECT-47-SEC-1
             TO  SQL-SELECT-47-SEC      OF  SQL-SELECT-47
      *----ＳＱＬ文
      *-----------  1：約定ベースの場合
           IF  WK-IN-KH-KAIKEI-BASE-FLG = CNS-X-1
           THEN
             STRING  SQL-SELECT-47,
      *---------- 20120928 修正開始
                     SQL-SELECT-47-YKJ,
                     SQL-SELECT-47-ROWNUM DELIMITED  BY  SIZE
      *---------- 20120928 修正終了
               INTO  SQLSTMT47-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT47-1=["SQLSTMT47-1"]"
      D    DISPLAY  CNS-PGM-ID":V13=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V15=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V16=["H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V17=["H-TATE-FLG    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V18=["H-GYOKU-ID    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V19=["WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":V20=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(約定)"
      D             "=["TKMXTR00-47-OPEN-FLG-1"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
             IF  TKMXTR00-47-OPEN-FLG-1  =  CNS-OFF
             THEN
               EXEC  SQL  PREPARE  S47_1  FROM :SQLSTMT47-1  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S47-1=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  =  CNS-SQL-NORMAL
               THEN
                 CONTINUE
               ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-079
                   TO  ERR-POS              OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD               OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-1
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               END-IF
               EXEC  SQL  DECLARE  CR47_1  CURSOR  FOR S47_1 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE-CR47-1=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE                  = CNS-SQL-NORMAL
               THEN
                 CONTINUE
               ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-080
                   TO  ERR-POS              OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD               OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-1
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               END-IF
             ELSE
               CONTINUE
             END-IF
           ELSE
      *-----------  2：受渡ベースの場合
             STRING  SQL-SELECT-47,
                     SQL-SELECT-47-UKE,
      *---------- 20120928 修正開始
                     SQL-SELECT-47-ROWNUM DELIMITED  BY  SIZE
      *---------- 20120928 修正終了
                 INTO  SQLSTMT47-2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT47-2=["SQLSTMT47-2"]"
      D    DISPLAY  CNS-PGM-ID":V13=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V15=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V16=["H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V17=["H-TATE-FLG    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V18=["H-GYOKU-ID    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V19=["WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":V21=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ-2"
      D             "=["TKMXTR00-47-OPEN-FLG-2"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
             IF  TKMXTR00-47-OPEN-FLG-2  =  CNS-OFF
             THEN
               EXEC  SQL  PREPARE  S47_2  FROM :SQLSTMT47-2  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S47-2=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  =  CNS-SQL-NORMAL
               THEN
                 CONTINUE
               ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-097
                   TO  ERR-POS              OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD               OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-2
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               END-IF
               EXEC  SQL  DECLARE  CR47_2  CURSOR  FOR S47_2 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE                  = CNS-SQL-NORMAL
               THEN
                 CONTINUE
               ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-098
                   TO  ERR-POS              OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD               OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-2
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               END-IF
             ELSE
               CONTINUE
             END-IF
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**  取引のカーソル定義処理 END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-47-DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMXTR00-47-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  取引のカーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
      *-----------  1：約定ベースの場合
           IF  WK-IN-KH-KAIKEI-BASE-FLG = CNS-X-1
           THEN
             EXEC  SQL
               OPEN CR47_1
                 USING :WK-IN-FUND-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-SEC-SBT-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD-NEXT,
                       :WK-IN-KJN-YMD
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR47-1-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON               TO  TKMXTR00-47-OPEN-FLG-1
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00-47-OPEN-FLG-1=["
      D             TKMXTR00-47-OPEN-FLG-1"]"
      *-----------------------------------------------------------------
             ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-081
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT47-1
                 DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE
             EXEC  SQL
               OPEN CR47_2
                 USING :WK-IN-FUND-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-SEC-SBT-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD-NEXT,
                       :WK-IN-KJN-YMD
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR47-2-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON               TO  TKMXTR00-47-OPEN-FLG-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00-47-OPEN-FLG-2=["
      D             TKMXTR00-47-OPEN-FLG-2"]"
      *-----------------------------------------------------------------
             ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-099
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT47-2
                 DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引のカーソルオープン処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-47-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    取引のチェック処理                                          *
      ******************************************************************
       TKMXTR00-47-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引の"
      D                       "カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-47-1
                       H-FETCH-47-2
      *-----------  1：約定ベースの場合
           IF  WK-IN-KH-KAIKEI-BASE-FLG = CNS-X-1
           THEN
             EXEC  SQL
                 FETCH
                     CR47_1
                 INTO :H-FETCH-47-1
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR47-1-SELECT=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR47-1-FETCHファンド=["H-FETCH-47-1"]"
      *-----------------------------------------------------------------
                 MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
                 PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
                 CONTINUE
               WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-082
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-1
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
           ELSE
             EXEC  SQL
                 FETCH
                     CR47_2
                 INTO :H-FETCH-47-2
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR47-2-SELECT=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR47-2-FETCHファンド=["H-FETCH-47-2"]"
      *-----------------------------------------------------------------
                 MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
                 PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
                 CONTINUE
               WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-100
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-2
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引の"
      D                       "カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-47-FET-EXT.
           EXIT.
      ******************************************************************
      *  ⅱ)取引のチェック処理2を行う。「別紙1-47 SQL説明」を参照      *
      ******************************************************************
       SELECT-472TKMXTR00-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引のチェック処理2 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMXTR00-472DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMXTR00-472OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMXTR00-472FET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引のチェック処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-472TKMXTR00-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMXTR00-472DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引のカーソル定義処理2 START  ***"
      D    DISPLAY  CNS-PGM-ID":ARG1.基準日断面情報.基本会計ベース"
      D             "フラグ=["WK-IN-KH-KAIKEI-BASE-FLG"]"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT47-3
                       SQLSTMT47-4
           MOVE  WK-TABLE-ID7
             TO  SQL-TKMXTR00           OF  SQL-SELECT-47
           MOVE  SQL-SELECT-47-SEC-2
             TO  SQL-SELECT-47-SEC      OF  SQL-SELECT-47
      *----ＳＱＬ文
      *-----------  1：約定ベースの場合
           IF  WK-IN-KH-KAIKEI-BASE-FLG = CNS-X-1
           THEN
             STRING  SQL-SELECT-47,
                     SQL-SELECT-47-YKJ,
                     SQL-SELECT-47-ROWNUM DELIMITED  BY  SIZE
               INTO  SQLSTMT47-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT47-3=["SQLSTMT47-3"]"
      D    DISPLAY  CNS-PGM-ID":V13=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V15=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V17=["H-TATE-FLG    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V18=["H-GYOKU-ID    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V19=["WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":V20=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(約定)3"
      D             "=["TKMXTR00-47-OPEN-FLG-3"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
             IF  TKMXTR00-47-OPEN-FLG-3  =  CNS-OFF
             THEN
               EXEC  SQL  PREPARE  S47_3  FROM :SQLSTMT47-3  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S47-3=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  =  CNS-SQL-NORMAL
               THEN
                 CONTINUE
               ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-105
                   TO  ERR-POS              OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD               OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-3
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               END-IF
               EXEC  SQL  DECLARE  CR47_3  CURSOR  FOR S47_3 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE-CR47-3=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE                  = CNS-SQL-NORMAL
               THEN
                 CONTINUE
               ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-106
                   TO  ERR-POS              OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD               OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-3
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               END-IF
             ELSE
               CONTINUE
             END-IF
           ELSE
      *-----------  2：受渡ベースの場合
             STRING  SQL-SELECT-47,
                     SQL-SELECT-47-UKE,
      *---------- 20120928 修正開始
                     SQL-SELECT-47-ROWNUM DELIMITED  BY  SIZE
      *---------- 20120928 修正終了
                 INTO  SQLSTMT47-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT47-4=["SQLSTMT47-4"]"
      D    DISPLAY  CNS-PGM-ID":V13=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V15=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V16=["H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V17=["H-TATE-FLG    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V18=["H-GYOKU-ID    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V19=["WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":V21=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ-4"
      D             "=["TKMXTR00-47-OPEN-FLG-4"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
             IF  TKMXTR00-47-OPEN-FLG-4  =  CNS-OFF
             THEN
               EXEC  SQL  PREPARE  S47_4  FROM :SQLSTMT47-4  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S47-4=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE  =  CNS-SQL-NORMAL
               THEN
                 CONTINUE
               ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-107
                   TO  ERR-POS              OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD               OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-4
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               END-IF
               EXEC  SQL  DECLARE  CR47_4  CURSOR  FOR S47_4 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
               IF  SQLCODE                  = CNS-SQL-NORMAL
               THEN
                 CONTINUE
               ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-108
                   TO  ERR-POS              OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD               OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-4
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
               END-IF
             ELSE
               CONTINUE
             END-IF
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**  取引のカーソル定義処理2 END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-472DEC-EXT.
           EXIT.
      ******************************************************************
      *   カーソルオープン処理                                         *
      ******************************************************************
       TKMXTR00-472OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  取引のカーソルオープン処理2 START  ***"
      *-----------------------------------------------------------------
      *-----------  1：約定ベースの場合
           IF  WK-IN-KH-KAIKEI-BASE-FLG = CNS-X-1
           THEN
             EXEC  SQL
               OPEN CR47_3
                 USING :WK-IN-FUND-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD-NEXT,
                       :WK-IN-KJN-YMD
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR47-3-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON               TO  TKMXTR00-47-OPEN-FLG-3
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00-47-OPEN-FLG-3=["
      D             TKMXTR00-47-OPEN-FLG-3"]"
      *-----------------------------------------------------------------
             ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-109
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT47-3
                 DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           ELSE
             EXEC  SQL
               OPEN CR47_4
                 USING :WK-IN-FUND-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD-NEXT,
                       :WK-IN-KJN-YMD
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR47-4-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
             IF  SQLCODE                  = CNS-SQL-NORMAL
             THEN
               MOVE  CNS-ON               TO  TKMXTR00-47-OPEN-FLG-4
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMXTR00-47-OPEN-FLG-4=["
      D             TKMXTR00-47-OPEN-FLG-4"]"
      *-----------------------------------------------------------------
             ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-110
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT47-4
                 DELIMITED  BY  SIZE
                 INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 取引のカーソルオープン処理2 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-472OPEN-EXT.
           EXIT.
      ******************************************************************
      *    取引のチェック処理                                          *
      ******************************************************************
       TKMXTR00-472FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引の"
      D                       "カーソルフェッチ処理2 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-47-1
                       H-FETCH-47-2
      *-----------  1：約定ベースの場合
           IF  WK-IN-KH-KAIKEI-BASE-FLG = CNS-X-1
           THEN
             EXEC  SQL
                 FETCH
                     CR47_3
                 INTO :H-FETCH-47-1
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR47-3-SELECT=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR47-3-FETCHファンド=["H-FETCH-47-1"]"
      *-----------------------------------------------------------------
                 MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
                 PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
                 CONTINUE
               WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-111
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-3
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
           ELSE
             EXEC  SQL
                 FETCH
                     CR47_4
                 INTO :H-FETCH-47-2
             END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR47-4-SELECT=["SQLCODE"]"
      *-----------------------------------------------------------------
             EVALUATE  SQLCODE
               WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR47-4-FETCHファンド=["H-FETCH-47-2"]"
      *-----------------------------------------------------------------
                 MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
                 PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
               WHEN  CNS-SQL-NOTFOUND
                 CONTINUE
               WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
                 MOVE  CNS-PGM-ID
                   TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-POS-112
                   TO  ERR-POS            OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-RTN-900
                   TO  RTN-CD             OF  PARM-SCZY1170-ARG1
                 MOVE  SQLCODE
                   TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
                 MOVE  CNS-DETAIL-1
                   TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
                 STRING  SQLSTMT47-4
                   DELIMITED  BY  SIZE
                   INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                 PERFORM  ERR-RTN
             END-EVALUATE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  取引の"
      D                       "カーソルフェッチ処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMXTR00-472FET-EXT.
           EXIT.
      ******************************************************************
      *  ⅲ)未収補正のチェック処理を行う（「別紙1-48 SQL説明」を参照） *
      ******************************************************************
       SELECT-48-TKMZMS00-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収補正のチェック処理 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZMS00-48-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZMS00-48-OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZMS00-48-FET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収補正のチェック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-48-TKMZMS00-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZMS00-48-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                    ":***  未収補正のカーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT48
           MOVE  WK-TABLE-ID13
             TO  SQL-TKMZMS00           OF  SQL-SELECT-48
           MOVE  WK-TABLE-ID13
             TO  SQL-TKMZMS00-1         OF  SQL-SELECT-48
           MOVE  WK-TABLE-ID13
             TO  SQL-TKMZMS00-2         OF  SQL-SELECT-48
           MOVE  SQL-SELECT-48-SEC-1
             TO  SQL-SELECT-48-SEC    OF  SQL-SELECT-48
      *----ＳＱＬ文
           MOVE  SQL-SELECT-48          TO  SQLSTMT48
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT48=["SQLSTMT48"]"
      D    DISPLAY  CNS-PGM-ID":V22=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V23=["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":V24=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V25=["H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V26=["H-TATE-FLG    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V27=["H-GYOKU-ID    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V28=["WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":V29=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":未収補正カーソルオープンフラグ"
      D             "=["TKMZMS00-48-OPEN-FLG"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
           IF  TKMZMS00-48-OPEN-FLG  =  CNS-OFF
           THEN
           EXEC  SQL  PREPARE  S48  FROM :SQLSTMT48  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S48=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-083
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT48
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CR48  CURSOR  FOR S48 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-084
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT48
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE
             CONTINUE
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**  未収補正のカーソル定義処理 END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-48-DEC-EXT.
           EXIT.
      ******************************************************************
      *   未収補正のカーソルオープン処理                               *
      ******************************************************************
       TKMZMS00-48-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収補正のカーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN CR48
                 USING :WK-IN-FUND-CD,
                       :WK-IN-PTF-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-SEC-SBT-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD-NEXT,
                       :WK-IN-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR48-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  TKMZMS00-48-OPEN-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-48-OPEN-FLG=["
      D             TKMZMS00-48-OPEN-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-085
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT48
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収補正のカーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-48-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    未収補正のチェック処理                                      *
      ******************************************************************
       TKMZMS00-48-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収補正の"
      D                       "カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-48
           EXEC  SQL
               FETCH
                    CR48
               INTO :H-FETCH-48
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR48-SELECT=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR48-FETCHファンド=["H-FETCH-48"]"
      *-----------------------------------------------------------------
               MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
               PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-086
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT48
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収補正の"
      D                       "カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-48-FET-EXT.
           EXIT.
      ******************************************************************
      *  ⅲ)未収補正のチェック処理2を行う（「別紙1-48 SQL説明」を参照）*
      ******************************************************************
       SELECT-482TKMZMS00-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収補正のチェック処理2 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZMS00-482DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZMS00-482OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZMS00-482FET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収補正のチェック処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-482TKMZMS00-EXT.
           EXIT.
      ******************************************************************
      *    カーソル定義処理                                            *
      ******************************************************************
       TKMZMS00-482DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                   ":***  未収補正のカーソル定義処理2 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT48-2
           MOVE  WK-TABLE-ID13
             TO  SQL-TKMZMS00           OF  SQL-SELECT-48
           MOVE  WK-TABLE-ID13
             TO  SQL-TKMZMS00-1         OF  SQL-SELECT-48
           MOVE  WK-TABLE-ID13
             TO  SQL-TKMZMS00-2         OF  SQL-SELECT-48
           MOVE  SQL-SELECT-48-SEC-2
             TO  SQL-SELECT-48-SEC    OF  SQL-SELECT-48
      *----ＳＱＬ文
           MOVE  SQL-SELECT-48          TO  SQLSTMT48-2
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT48-2=["SQLSTMT48-2"]"
      D    DISPLAY  CNS-PGM-ID":V22=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V23=["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":V24=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V26=["H-TATE-FLG    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V27=["H-GYOKU-ID    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V28=["WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":V29=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":未収補正カーソルオープンフラグ2"
      D             "=["TKMZMS00-48-OPEN-FLG-2"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
           IF  TKMZMS00-48-OPEN-FLG-2  =  CNS-OFF
           THEN
           EXEC  SQL  PREPARE  S48_2  FROM :SQLSTMT48-2  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S48-2=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-113
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT48-2
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CR48_2  CURSOR  FOR S48_2 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-114
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT48-2
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE
             CONTINUE
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**  未収補正のカーソル定義処理2 END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-482DEC-EXT.
           EXIT.
      ******************************************************************
      *   未収補正のカーソルオープン処理                               *
      ******************************************************************
       TKMZMS00-482OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収補正のカーソルオープン処理2 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN CR48_2
                 USING :WK-IN-FUND-CD,
                       :WK-IN-PTF-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD-NEXT,
                       :WK-IN-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR48-OPEN-2=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  TKMZMS00-48-OPEN-FLG-2
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMS00-48-OPEN-FLG-2=["
      D             TKMZMS00-48-OPEN-FLG-2"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-115
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT48-2
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収補正のカーソルオープン処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-482OPEN-EXT.
           EXIT.
      ******************************************************************
      *    未収補正のチェック処理                                      *
      ******************************************************************
       TKMZMS00-482FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収補正の"
      D                       "カーソルフェッチ処理2 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-48
           EXEC  SQL
               FETCH
                    CR48_2
               INTO :H-FETCH-48
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR48-SELECT-2=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR48-2-FETCHファンド=["H-FETCH-48"]"
      *-----------------------------------------------------------------
               MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
               PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-116
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT48-2
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収補正の"
      D                       "カーソルフェッチ処理2 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZMS00-482FET-EXT.
           EXIT.
      ******************************************************************
      *  ⅳ)経過利息のチェック処理を行う（「別紙1-49 SQL説明」を参照） *
      ******************************************************************
       SELECT-49-TKMZKR00-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  経過利息のチェック処理 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKMZKR00-49-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKMZKR00-49-OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKMZKR00-49-FET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  経過利息のチェック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-49-TKMZKR00-EXT.
           EXIT.
      ******************************************************************
      *    経過利息のカーソル定義処理                                  *
      ******************************************************************
       TKMZKR00-49-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                    ":***  経過利息のカーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT49
           MOVE  WK-TABLE-ID14
             TO  SQL-TKMZKR00           OF  SQL-SELECT-49
      *----ＳＱＬ文
           MOVE  SQL-SELECT-49          TO  SQLSTMT49
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT49=["SQLSTMT49"]"
      D    DISPLAY  CNS-PGM-ID":V30=["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V31=["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":V32=["H-MEG-CD      OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V33=["H-SEC-SBT-CD  OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V34=["H-TATE-FLG    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V35=["H-GYOKU-ID    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V36=["WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":V37=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":経過利息カーソルオープンフラグ"
      D             "=["TKMZKR00-49-OPEN-FLG"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
           IF  TKMZKR00-49-OPEN-FLG  =  CNS-OFF
           THEN
           EXEC  SQL  PREPARE  S49  FROM :SQLSTMT49  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S49=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-087
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT49
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CR49  CURSOR  FOR S49 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-088
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT49
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE
             CONTINUE
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**  経過利息のカーソル定義処理 END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-49-DEC-EXT.
           EXIT.
      ******************************************************************
      *   経過利息のカーソルオープン処理                               *
      ******************************************************************
       TKMZKR00-49-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  経過利息のカーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN CR49
                 USING :WK-IN-FUND-CD,
                       :WK-IN-PTF-CD,
                       :H-TKMZBW03-45.H-MEG-CD,
                       :H-TKMZBW03-45.H-SEC-SBT-CD,
                       :H-TKMZBW03-45.H-TATE-FLG,
                       :H-TKMZBW03-45.H-GYOKU-ID,
                       :WK-IN-KAISI-KJN-YMD-NEXT,
                       :WK-IN-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR49-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  TKMZKR00-49-OPEN-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKR00-49-OPEN-FLG=["
      D             TKMZKR00-49-OPEN-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-089
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT49
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  経過利息のカーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-49-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    経過利息のチェック処理                                      *
      ******************************************************************
       TKMZKR00-49-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  経過利息の"
      D                       "カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-49
           EXEC  SQL
               FETCH
                    CR49
               INTO :H-FETCH-49
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR49-SELECT=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR49-FETCHファンド=["H-FETCH-49"]"
      *-----------------------------------------------------------------
               MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
               PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               CONTINUE
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-090
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT49
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  経過利息の"
      D                       "カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKMZKR00-49-FET-EXT.
           EXIT.
      ******************************************************************
      *  ⅴ)未収配当変更日のチェック処理を行う                         *
      *    「別紙1-50 SQL説明」を参照                                  *
      ******************************************************************
       SELECT-50-TKJCKP00-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収配当変更日のチェック処理 START  ***"
      *-----------------------------------------------------------------
      *-----------  カーソル定義処理
           PERFORM  TKJCKP00-50-DEC-RTN
      *-----------  カーソルオープン処理
           PERFORM  TKJCKP00-50-OPEN-RTN
      *-----------  カーソルフェッチ処理
           PERFORM  TKJCKP00-50-FET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収配当変更日のチェック処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SELECT-50-TKJCKP00-EXT.
           EXIT.
      ******************************************************************
      *    未収配当変更日のカーソル定義処理                            *
      ******************************************************************
       TKJCKP00-50-DEC-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  未収配当変更日のカーソル定義処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT50
           MOVE  WK-TABLE-ID15
             TO  SQL-TKJCKP00           OF  SQL-SELECT-50
      *----ＳＱＬ文
           MOVE  SQL-SELECT-50          TO  SQLSTMT50
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT50=["SQLSTMT50"]"
      D    DISPLAY  CNS-PGM-ID":V38=["H-MEG-CD    OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V39=["WK-IN-KAISI-KJN-YMD-NEXT"]"
      D    DISPLAY  CNS-PGM-ID":V40=["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":未収配当カーソルオープンフラグ"
      D             "=["TKJCKP00-50-OPEN-FLG"]"
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ START
           IF  TKJCKP00-50-OPEN-FLG  =  CNS-OFF
           THEN
           EXEC  SQL  PREPARE  S50  FROM :SQLSTMT50  END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-PREPARE-S50=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-091
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT50
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL  DECLARE  CR50  CURSOR  FOR S50 END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-DECLARE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（DECLARE)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-092
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT50
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
           ELSE
             CONTINUE
           END-IF
      *--
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップ END
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":**  未収配当変更日のカーソル定義処理 END  **"
      *-----------------------------------------------------------------
           CONTINUE.
       TKJCKP00-50-DEC-EXT.
           EXIT.
      ******************************************************************
      *   未収配当変更日のカーソルオープン処理                         *
      ******************************************************************
       TKJCKP00-50-OPEN-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D        ":***  未収配当変更日のカーソルオープン処理 START  ***"
      *-----------------------------------------------------------------
           EXEC  SQL
               OPEN CR50
                 USING :H-TKMZBW03-45.H-MEG-CD,
                       :WK-IN-KAISI-KJN-YMD-NEXT,
                       :WK-IN-KJN-YMD
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR50-OPEN=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-ON               TO  TKJCKP00-50-OPEN-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKJCKP00-50-OPEN-FLG=["
      D             TKJCKP00-50-OPEN-FLG"]"
      *-----------------------------------------------------------------
           ELSE
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（OPEN)"
      *-----------------------------------------------------------------
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-093
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             STRING  SQLSTMT50
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D           ":***  未収配当変更日のカーソルオープン処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKJCKP00-50-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    未収配当変更日のチェック処理                                *
      ******************************************************************
       TKJCKP00-50-FET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収配当変更日の"
      D                       "カーソルフェッチ処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-FETCH-50
           EXEC  SQL
               FETCH
                    CR50
               INTO :H-FETCH-50
           END-EXEC
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE-CR50-SELECT=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":CR50-FETCH内部銘柄コード=["H-FETCH-50"]"
      *-----------------------------------------------------------------
               MOVE  CNS-ON         TO    EST-FLG
      *----------  ⅶ) WK有効銘柄フラグを初期化
               PERFORM  WK-YUKO-MEG-FLG-RTN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":EST-FLG =["EST-FLG"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-X-0
                 TO  WK-YUKO-MEG-FLG
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK有効銘柄フラグ =["WK-YUKO-MEG-FLG"]"
      *-----------------------------------------------------------------
      *----------  ⅵ)銘柄別断面情報の更新処理
               PERFORM  UPDATE-51-TKMZBW03-RTN
             WHEN  OTHER
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQL処理エラー（FETCH)"
      *-----------------------------------------------------------------
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-094
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
               STRING  SQLSTMT50
               DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  未収配当変更日の"
      D                       "カーソルフェッチ処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKJCKP00-50-FET-EXT.
           EXIT.
      ******************************************************************
      *   ⅵ)銘柄別断面情報の更新処理（「別紙1-51 SQL説明」を参照）    *
      ******************************************************************
       UPDATE-51-TKMZBW03-RTN SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  銘柄別断面情報の更新処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT51
           MOVE  WK-TABLE-ID3
             TO  SQL-TKMZBW03           OF  SQL-UPDATE-51
           MOVE  SQL-UPDATE-51          TO  SQLSTMT51
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT51    =["SQLSTMT51"]"
      D    DISPLAY  CNS-PGM-ID":V41 =["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID":V42 =["WK-IN-FUND-CD"]"
      D    DISPLAY  CNS-PGM-ID":V43 =["WK-IN-PTF-CD"]"
      D    DISPLAY  CNS-PGM-ID":V44 =["WK-IN-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":V45 =["WK-IN-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":V46 =["WK-IN-KJN-YMD"]"
      D    DISPLAY  CNS-PGM-ID":V47 =["H-MEG-CD     OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V48 =["H-SEC-SBT-CD OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V49 =["H-TATE-FLG   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V50 =["H-GYOKU-ID   OF  H-TKMZBW03-45"]"
      D    DISPLAY  CNS-PGM-ID":V51=["H-MEG-CD-SHRU OF  H-TKMZBW03-45"]"
      *-----------------------------------------------------------------
           EXEC SQL PREPARE S51  FROM :SQLSTMT51 END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-------------------</DEBUG>--------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-095
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SQLSTMT51
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報の更新処理(PREPARE) 異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC SQL EXECUTE S51
                USING   :WK-YUKO-MEG-FLG,
                        :WK-IN-FUND-CD,
                        :WK-IN-PTF-CD,
                        :WK-IN-SYORI-YMD,
                        :WK-IN-KIDOU-ID,
                        :WK-IN-KJN-YMD,
                        :H-TKMZBW03-45.H-MEG-CD,
                        :H-TKMZBW03-45.H-SEC-SBT-CD,
                        :H-TKMZBW03-45.H-TATE-FLG,
                        :H-TKMZBW03-45.H-GYOKU-ID,
                        :H-TKMZBW03-45.H-MEG-CD-SHRU
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":EXECUTE-SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-096
               TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SQLSTMT51
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報の更新処理（EXECUTE) 異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  銘柄別断面情報の更新処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       UPDATE-51-TKMZBW03-EXT.
           EXIT.
      ******************************************************************
      *  ⅶ)WK有効銘柄フラグを初期化                                   *
      ******************************************************************
       WK-YUKO-MEG-FLG-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK有効銘柄フラグを初期化処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-YUKO-MEG-FLG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":WK有効銘柄フラグ =["WK-YUKO-MEG-FLG"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  WK有効銘柄フラグを初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-YUKO-MEG-FLG-EXT.
           EXIT.
      ******************************************************************
      *                 3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***   後処理  START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD  OF  PARM-SCZY1170-ARG1 = ["
      D                         RTN-CD  OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1510-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG   = ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1510-ARG3 = ["
      D             PARM-SMZJ1510-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D             COUNTER             OF PARM-SMZJ1510-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D       ERR-PGM-ID
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D       ERR-POS
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D       RTN-CD
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D       DETAIL-RTN-CD
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D       DETAIL-RTN-CD-FLG
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D       FREE-MSG
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D           ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *                 3.4.1 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR19-OPEN=["
      D             FLG-TKMZSK00-CR19-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフラ"   @3212SEINO@@
      D             "グ_1=["FLG-TKMZSK00-CR1-OPEN"]"                    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":基準日断面情報カーソルオープンフラグ=[" @3212SEINO@@
      D             FLG-TKMZBW02-CR-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ=[" @3212SEINO@@
      D             FLG-TKMZBW03-CR-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ２ー１=["FLG-TKMZSK00-CR21-OPEN"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ２ー２=["FLG-TKMZSK00-CR22-OPEN"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ３=["FLG-TKMZSK00-CR3-OPEN"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00"]"                              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00"]"                              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00"]"                              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報INSカーソルオープンフ"    @3212SEINO@@
      D             "ラグ1=["FLG-INSERT-TKMZBW03-CR1"]"                 @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報INSカーソルオープンフ"    @3212SEINO@@
      D             "ラグ2=["FLG-INSERT-TKMZBW03-CR2"]"                 @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D             ":銘柄別断面情報カーソルオープンフラグ_3=["
      D             TKMZBW03-45-OPEN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ=["
      D             TKMZZR00-46-OPEN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ2=["
      D             TKMZZR00-46-OPEN-FLG-2"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(約定)=["
      D             TKMXTR00-47-OPEN-FLG-1"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(受渡)=["
      D             TKMXTR00-47-OPEN-FLG-2"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(約定)3=["
      D             TKMXTR00-47-OPEN-FLG-3"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(受渡)4=["
      D             TKMXTR00-47-OPEN-FLG-4"]"
      D    DISPLAY  CNS-PGM-ID":未収補正カーソルオープンフラグ=["
      D             TKMZMS00-48-OPEN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":未収補正カーソルオープンフラグ2=["
      D             TKMZMS00-48-OPEN-FLG-2"]"
      D    DISPLAY  CNS-PGM-ID":経過利息カーソルオープンフラグ=["
      D             TKMZKR00-49-OPEN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":未収配当カーソルオープンフラグ=["
      D             TKJCKP00-50-OPEN-FLG"]"
      *-----------------------------------------------------------------
      *----------  20100212(GIPS2.0)  START
      *----------  取引差分更新管理カーソル19をクローズする
           IF  FLG-TKMZSK00-CR19-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZSK00_CURSOR19"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZSK00_CURSOR19
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR19-OPEN
           ELSE
             CONTINUE
           END-IF
      *----------  20100212(GIPS2.0)  END
      *----------  取引差分更新管理カーソル３をクローズする
           IF  FLG-TKMZSK00-CR3-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZSK00_CURSOR3"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZSK00_CURSOR3
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR3-OPEN
           ELSE
             CONTINUE
           END-IF
      *----------  取引差分更新管理カーソル２をクローズする
           IF  FLG-TKMZSK00-CR22-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZSK00_CURSOR22"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZSK00_CURSOR22
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR22-OPEN
           ELSE
             CONTINUE
           END-IF
           IF  FLG-TKMZSK00-CR21-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZSK00_CURSOR21"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZSK00_CURSOR21
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR21-OPEN
           ELSE
             CONTINUE
           END-IF
      *----------  銘柄別断面情報カーソルをクローズする
           IF  FLG-TKMZBW03-CR-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW03_CURSOR"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZBW03_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZBW03-CR-OPEN
           ELSE
             CONTINUE
           END-IF
      *----------  基準日断面情報カーソルをクローズする
           IF  FLG-TKMZBW02-CR-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZBW02_CURSOR"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZBW02_CURSOR
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZBW02-CR-OPEN
           ELSE
             CONTINUE
           END-IF
      *----------  取引差分更新管理カーソル１をクローズする
           IF  FLG-TKMZSK00-CR1-OPEN  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE TKMZSK00_CURSOR1"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE TKMZSK00_CURSOR1
             END-EXEC
             MOVE  CNS-OFF              TO  FLG-TKMZSK00-CR1-OPEN
           ELSE
               CONTINUE
           END-IF
      *----------  残高履歴DELカーソルオープンフラグ                    @3212SEINO@@
           IF  FLG-DELETE-TKMZZR00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZZR00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  資金残履歴DELカーソルオープンフラグ                  @3212SEINO@@
           IF  FLG-DELETE-TKMZSR00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZSR00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  元本残高DELカーソルオープンフラグ                    @3212SEINO@@
           IF  FLG-DELETE-TKMZGZ00  =  CNS-ON                           @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZGZ00         @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  銘柄別断面情報INSカーソルオープンフラグ1             @3212SEINO@@
           IF  FLG-INSERT-TKMZBW03-CR1  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-INSERT-TKMZBW03-CR1     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  銘柄別断面情報INSカーソルオープンフラグ2             @3212SEINO@@
           IF  FLG-INSERT-TKMZBW03-CR2  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-INSERT-TKMZBW03-CR2     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  銘柄別断面情報カーソルオープンフラグ_3
           IF  TKMZBW03-45-OPEN-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR45"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR45
             END-EXEC
             MOVE  CNS-OFF              TO  TKMZBW03-45-OPEN-FLG
           ELSE
               CONTINUE
           END-IF
      *----------  残高履歴カーソルオープンフラグ
           IF  TKMZZR00-46-OPEN-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR46"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR46
             END-EXEC
             MOVE  CNS-OFF              TO  TKMZZR00-46-OPEN-FLG
           ELSE
               CONTINUE
           END-IF
      *----------  残高履歴カーソルオープンフラグ2
           IF  TKMZZR00-46-OPEN-FLG-2  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR46_2"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR46_2
             END-EXEC
             MOVE  CNS-OFF              TO  TKMZZR00-46-OPEN-FLG-2
           ELSE
               CONTINUE
           END-IF
      *----------  取引カーソルオープンフラグ
           IF  TKMXTR00-47-OPEN-FLG-1  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR47_1"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR47_1
             END-EXEC
             MOVE  CNS-OFF              TO  TKMXTR00-47-OPEN-FLG-1
           ELSE
               CONTINUE
           END-IF
      *----------  取引カーソルオープンフラグ
           IF  TKMXTR00-47-OPEN-FLG-2  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR47_2"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR47_2
             END-EXEC
             MOVE  CNS-OFF              TO  TKMXTR00-47-OPEN-FLG-2
           ELSE
               CONTINUE
           END-IF
      *----------  取引カーソルオープンフラグ3
           IF  TKMXTR00-47-OPEN-FLG-3  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR47_3"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR47_3
             END-EXEC
             MOVE  CNS-OFF              TO  TKMXTR00-47-OPEN-FLG-3
           ELSE
               CONTINUE
           END-IF
      *----------  取引カーソルオープンフラグ4
           IF  TKMXTR00-47-OPEN-FLG-4  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR47_4"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR47_4
             END-EXEC
             MOVE  CNS-OFF              TO  TKMXTR00-47-OPEN-FLG-4
           ELSE
               CONTINUE
           END-IF
      *----------  未収補正カーソルオープンフラグ
           IF  TKMZMS00-48-OPEN-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR48"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR48
             END-EXEC
             MOVE  CNS-OFF              TO  TKMZMS00-48-OPEN-FLG
           ELSE
               CONTINUE
           END-IF
      *----------  未収補正カーソルオープンフラグ2
           IF  TKMZMS00-48-OPEN-FLG-2  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR48_2"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR48_2
             END-EXEC
             MOVE  CNS-OFF              TO  TKMZMS00-48-OPEN-FLG-2
           ELSE
               CONTINUE
           END-IF
      *----------  経過利息カーソルオープンフラグ
           IF  TKMZKR00-49-OPEN-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR49"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR49
             END-EXEC
             MOVE  CNS-OFF              TO  TKMZKR00-49-OPEN-FLG
           ELSE
               CONTINUE
           END-IF
      *----------  未収配当カーソルオープンフラグ
           IF  TKJCKP00-50-OPEN-FLG  =  CNS-ON
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ERROR処理 CLOSE CR50"
      *-----------------------------------------------------------------
             EXEC SQL
                 CLOSE CR50
             END-EXEC
             MOVE  CNS-OFF              TO  TKJCKP00-50-OPEN-FLG
           ELSE
               CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-TKMZSK00-CR19-OPEN=["
      D             FLG-TKMZSK00-CR19-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフラ"   @3212SEINO@@
      D             "グ_1=["FLG-TKMZSK00-CR1-OPEN"]"                    @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":基準日断面情報カーソルオープンフラグ=[" @3212SEINO@@
      D             FLG-TKMZBW02-CR-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ=[" @3212SEINO@@
      D             FLG-TKMZBW03-CR-OPEN"]"                             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ２ー１=["FLG-TKMZSK00-CR21-OPEN"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ２ー２=["FLG-TKMZSK00-CR22-OPEN"]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":取引差分更新管理カーソルオープンフ"     @3212SEINO@@
      D             "ラグ３=["FLG-TKMZSK00-CR3-OPEN"]"                  @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高履歴DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZZR00"]"                              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金残履歴DELカーソルオープンフラグ=["  @3212SEINO@@
      D             FLG-DELETE-TKMZSR00"]"                              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":元本残高DELカーソルオープンフラグ=["    @3212SEINO@@
      D             FLG-DELETE-TKMZGZ00"]"                              @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報INSカーソルオープンフ"    @3212SEINO@@
      D             "ラグ1=["FLG-INSERT-TKMZBW03-CR1"]"                 @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報INSカーソルオープンフ"    @3212SEINO@@
      D             "ラグ2=["FLG-INSERT-TKMZBW03-CR2"]"                 @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D             ":銘柄別断面情報カーソルオープンフラグ_3=["
      D             TKMZBW03-45-OPEN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ=["
      D             TKMZZR00-46-OPEN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":残高履歴カーソルオープンフラグ2=["
      D             TKMZZR00-46-OPEN-FLG-2"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(約定)=["
      D             TKMXTR00-47-OPEN-FLG-1"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(受渡)=["
      D             TKMXTR00-47-OPEN-FLG-2"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(約定)3=["
      D             TKMXTR00-47-OPEN-FLG-3"]"
      D    DISPLAY  CNS-PGM-ID":取引カーソルオープンフラグ(受渡)4=["
      D             TKMXTR00-47-OPEN-FLG-4"]"
      D    DISPLAY  CNS-PGM-ID":未収補正カーソルオープンフラグ=["
      D             TKMZMS00-48-OPEN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":未収補正カーソルオープンフラグ2=["
      D             TKMZMS00-48-OPEN-FLG-2"]"
      D    DISPLAY  CNS-PGM-ID":経過利息カーソルオープンフラグ=["
      D             TKMZKR00-49-OPEN-FLG"]"
      D    DISPLAY  CNS-PGM-ID":未収配当カーソルオープンフラグ=["
      D             TKJCKP00-50-OPEN-FLG"]"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1510-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG   = ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1510-ARG3 = ["
      D             PARM-SMZJ1510-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D             COUNTER             OF PARM-SMZJ1510-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D       ERR-PGM-ID
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D       ERR-POS
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D       RTN-CD
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D       DETAIL-RTN-CD
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D       DETAIL-RTN-CD-FLG
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D       FREE-MSG
      D          OF PARM-SMZJ1510-ARG3(COUNTER OF PARM-SMZJ1510-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D           ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1510処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
