      ******************************************************************
      * $Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * ＩＤ           : MDYJ2201
      * 名称           : 外接データマージ検知処理
      * 処理概要       : 夜間バッチGX接続処理中に
      *                 （GX接続は多重業務タスク並行稼動）生成した
      *                  接続ファイルをそのまま利用して、
      *                  マージ＆コピーの方法で
      *                  ODW接続ファイルを作成する
      * 参照ＤＢ       : 実行状況管理（TKDYAA31）
      * 更新ＤＢ       :
      * 引数           : IN  利用会社コード
      *                  IN  処理実行日
      *                  IN  業務タスクID
      *                  IN  起動ＩＤ
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- ----  ---------  ------  ------------------------
      * 20130808   新規  SCS        陳新梅  新規
      * 20130913   修正  SCS        陳新梅  一時停止バグの緊急対応
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    MDYJ2201.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  13-08-08.
       DATE-COMPILED.
      ******************************************************************
      *
      *        環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V  WITH  DEBUGGING  MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
           SELECT  FTP-FILE   ASSIGN  TO  FTPFILENAME
                   ORGANIZATION       IS LINE SEQUENTIAL
                   FILE       STATUS  IS  ST-FTPFILE.
           SELECT  LIST-FILE   ASSIGN TO  LISTFILENAME
                   ORGANIZATION       IS LINE SEQUENTIAL
                   FILE       STATUS  IS  ST-LISTFILE.
      ******************************************************************
      *
      *        デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       FILE                   SECTION.
       FD  FTP-FILE
                         DATA       RECORD  FTPFILENAME-REC
                         LABEL      RECORD    STANDARD.
       01  FTPFILENAME-REC         PIC  X(06).
       FD  LIST-FILE
                         DATA       RECORD  LISTFILENAME-REC
                         LABEL      RECORD    STANDARD.
       01  LISTFILENAME-REC        PIC  X(31).
      ******************************************************************
      *        作業場所節
      ******************************************************************
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                コンスタント  エリア
      ******************************************************************
      *----------  共通コンスタント定義の宣言
       01  CONSTANT-AREA.
         05  CNS-KOMONCNS.
           COPY "KOMONCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE  "MDYJ2201".
      *---------- 後続業務タスク[$業務タスクID$]の利用権限がありません。
         05  CNS-MSG-I900153       PIC  X(07)  VALUE  "I900153".
      *----------  NUMBER
         05  CNS-0                 PIC  9(01)  VALUE  0.
         05  CNS-1                 PIC  9(01)  VALUE  1.
         05  CNS-2                 PIC  9(01)  VALUE  2.
         05  CNS-3                 PIC  9(01)  VALUE  3.
         05  CNS-4                 PIC  9(01)  VALUE  4.
         05  CNS-7                 PIC  9(01)  VALUE  7.
         05  CNS-99                PIC  9(02)  VALUE  99.
      *----------  CHAR
         05  CNS-X-0               PIC  X(01)  VALUE  "0".
      *----------  ワークPATH区分
         05  CNS-PATH-KBN-05       PIC  X(02)  VALUE  "05".
         05  CNS-PATH-KBN-23       PIC  X(02)  VALUE  "23".
      *----------  業務タスクID
      *----------  'T7050JC'(GX時価)
         05  CNS-T7050JC           PIC  X(07)  VALUE  "T7050JC".
      *----------  'TD871JC'(ＯＤＷ接続－ＧＸ時価データコピー)
         05  CNS-TD871JC           PIC  X(07)  VALUE  "TD871JC".
      *----------  'T7070US'(GX取引)
         05  CNS-T7070US           PIC  X(07)  VALUE  "T7070US".
      *----------  'TD891US'(ＯＤＷ接続－ＧＸ取引データコピー)
         05  CNS-TD891US           PIC  X(07)  VALUE  "TD891US".
      *----------  'T7080US'(GX残高)
         05  CNS-T7080US           PIC  X(07)  VALUE  "T7080US".
      *----------  'TD901US'(ＯＤＷ接続－ＧＸ残高データコピー)
         05  CNS-TD901US           PIC  X(07)  VALUE  "TD901US".
      *----------  'T7100US'(GX集約)
         05  CNS-T7100US           PIC  X(07)  VALUE  "T7100US".
      *----------  'TD921US'(ＯＤＷ接続－ＧＸ集約データコピー)
         05  CNS-TD921US           PIC  X(07)  VALUE  "TD921US".
      *----------  'TD930US'(ODW現金異動)
         05  CNS-TD930US           PIC  X(07)  VALUE  "TD930US".
      *----------  'T7030JC'(ＧＸ銘柄分類データ接続)
         05  CNS-T7030JC           PIC  X(07)  VALUE  "T7030JC".
      *----------  'TD851JC'(ＯＤＷ接続－ＧＸ銘柄分類データコピー)
         05  CNS-TD851JC           PIC  X(07)  VALUE  "TD851JC".
      *----------  'T7040JC'(ＧＸ銘柄属性データ接続)
         05  CNS-T7040JC           PIC  X(07)  VALUE  "T7040JC".
      *----------  'TD861JC'(ＯＤＷ接続－ＧＸ銘柄属性データコピー)
         05  CNS-TD861JC           PIC  X(07)  VALUE  "TD861JC".
         05  CNS-TBL-TKDYAA31      PIC  X(08)  VALUE  "TKDYAA31".
      *----------  SCZY1150 用
      *----------  起動処理分類
         05  CNS-KIDOU-SYORI-KBN-A PIC  X(01)  VALUE  "A".
      *----------  READ
         05  CNS-READ              PIC  X(04)  VALUE  "READ".
      *----------  file err msg
         05  CNS-ERR-OPEN          PIC  X(22)
                                        VALUE  "ファイルオープンエラー".
         05  CNS-ERR-READ          PIC  X(22)
                                        VALUE  "ファイル読み込むエラー".
         05  CNS-ERR-WRITE         PIC  X(22)
                                        VALUE  "ファイル書き込むエラー".
         05  CNS-ERR-CLOSE         PIC  X(22)
                                        VALUE  "ファイルクローズエラー".
      *----------  CBLDCADMのリターンコード
         05  CNS-X-00000           PIC  X(05)  VALUE  "00000".
      *----------  リターンコード
         05  CNS-RTN-210           PIC  X(03)  VALUE  "210".
         05  CNS-FREE-MSG1         PIC  X(16)
                                              VALUE  "後続業務タスク「".
         05  CNS-FREE-MSG2         PIC  X(20)
                                          VALUE  "」が起動されません。".
      ******************************************************************
      *                   ワーク  エリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
      *----------  接続引数
      *----------  利用会社コード
         05  WK-RIYO-CMP-CD        PIC  X(04).
      *----------  処理実行日
         05  WK-SYORI-YMD          PIC  X(08).
         05  WK-SYORI-YMD-9
             REDEFINES  WK-SYORI-YMD
                                   PIC  9(08).
      *----------  業務タスクID
         05  WK-GYOMU-TASK-ID      PIC  X(07).
      *----------  起動ID
         05  WK-KIDOU-ID           PIC  X(04).
      *----------  ワークリターンコード
         05  WK-RTN-CD             PIC  9(02).
      *----------  ワークPATH区分
         05  WK-PATH-KBN           PIC  X(02).
      *----------  ワークBLパス
         05  WK-BL-PATH            PIC  X(256).
      *----------  ワークNASパス
         05  WK-NAS-PATH           PIC  X(256).
      *----------  ワークDB接続情報
         05  WK-DB-SETUZOKU-JYOUHOU
                                   PIC  X(80).
      *----------  ワークIDX
         05  WK-IDX                PIC  9(03).
      *----------  ワーク起動ログインユーザ会社コード
         05  WK-KIDOU-LOGIN-CMP-CD PIC  X(04).
      *----------  ワークタスクスケジュールID
         05  WK-TSK-SCHE-ID        PIC  X(07).
      *----------  ワーク明細リストファイル名
         05  WK-LIST-FILE-NAME     PIC  X(31).
      *----------  ワーク後続業務タスクID
         05  WK-GOU-GYOMU-TASK-ID  PIC  X(07).
      *----------  ワークENDファイル一覧
         05  WK-END-FILE-LIST-G.
           10  WK-END-FILE-LIST    OCCURS  99.
      *----------  ワークENDファイル起動ＩＤ
             15  WK-END-FILE-KIDOUID
                                   PIC  X(04).
      *----------  エンターキー
             15  WK-ENTER-KEY      PIC  X(01).
      *----------  ワークすべて起動ID
         05  WK-ALL-KIDOU-ID-G.
           10  WK-ALL-KIDOU-ID     OCCURS  99.
             15  FILLER            PIC  X(01)  VALUE  "_".
      *----------  ワークすべて起動ID明細
             15  WK-ALL-KIDOU-ID-DETIAL
                                   PIC  X(04).
             15  FILLER            PIC  X(01)  VALUE  "_".
             15  FILLER            PIC  X(01)  VALUE  "|".
      *----------  ワーク読み込む件数
         05  WK-READ-CNT           PIC  9(03).
      *----------  ワーク最大タイムスタンプ起動ＩＤ
         05  WK-MAX-TIMESTAMP-KIDOUID
                                   PIC  X(04).
      *----------  ワークすべて起動ID件数
         05  WK-ALL-KIDOUID-CNT    PIC  9(03).
      *----------  ワーク長さ
         05  WK-LENG               PIC  9(03).
      *----------  CBLDCADM用
         05  WK-COMMAND            PIC  X(1000).
      *---------- CBLDCADM('COMMAND')
         05  WK-ADM-ARG1.
           10  ADM-CALL            PIC  X(08).
           10  STATUS-CODE         PIC  X(05).
           10  FILLER              PIC  X(03).
           10  FLAGS               PIC  S9(09) COMP VALUE ZERO.
           10  DESCRIPTOR          PIC  S9(09) COMP.
         05  WK-ADM-ARG2.
           10  LINK-DATA-LENG      PIC  9(09)  COMP.
           10  LINK-DATA           PIC  X(1000).
         05  WK-ADM-ARG3.
           10  RESULT-LENG         PIC  9(09)  COMP.
           10  RESULT              PIC  X(1024).
         05  WK-ADM-ARG4.
           10  ERR-RESULT-LENG     PIC  9(09)  COMP.
           10  ERR-RESULT          PIC  X(1024).
      *----------  ワークエラー種別
         05  WK-ERR-SYUBETU        PIC  X(01).
      *----------  ワークメッセージ件数
         05  WK-MSG-CNT            PIC  9(09).
      *---------- ワーク業務エラー情報
         05  WK-GYOMU-ERR-INFO.
           10  WK-MESSAGE-AREA     OCCURS  999.
      *---------- ファンドコード
             15  WK-GYOMU-FUND-CD  PIC  X(12).
      *---------- ポートフォリオコード
             15  WK-GYOMU-PTF-CD   PIC  X(04).
      *---------- 評価系列コード
             15  WK-GYOMU-HYK-KRTU-CD
                                   PIC  X(04).
      *---------- 帳票ID
             15  WK-GYOMU-REP-ID   PIC  X(08).
      *---------- 帳票任意コード
             15  WK-GYOMU-REP-ANY-CD
                                   PIC  X(50).
      *---------- 基準日From
             15  WK-GYOMU-KJN-YMD-FROM
                                   PIC  X(08).
      *---------- 基準日To
             15  WK-GYOMU-KJN-YMD-TO
                                   PIC  X(08).
      *---------- メッセージID
             15  WK-GYOMU-MSG-ID   PIC  X(07).
      *---------- 置換文字
             15  WK-GYOMU-TIKAN-MOJI.
               20  WK-GYOMU-TK-MOJI  OCCURS  5
                                   PIC  X(30).
      *---------- フリーメッセージ
             15  WK-GYOMU-FREE-MSG
                                   PIC  X(200).
      *----------  ERR-POS用
         05  WK-ERR-POS            PIC  X(04).
      *----------  ファイルステータス
         05  ST-FTPFILE            PIC  X(02).
         05  ST-LISTFILE           PIC  X(02).
         05  WK-TBL-TKDYAA31       PIC  X(13).
      *----------  ワーク電文情報
       01  WK-DEBUN-INFO.
      *----------  AIFA情報
         05  WK-AIFA.
             COPY  "WOMCMAIFA.CPY".
      *----------  共通ヘッダ
         05  WK-HEADER.
             COPY  "CZCOMMONHEADER.cpy".
      ******************************************************************
      *                SQL  エリア
      ******************************************************************
       01  SQL-AREA.
         05  SQL-SELECT-TKDYAA31.
      *---------- 利用会社コード
           10  FILLER              PIC  X(26)
               VALUE  "BEGIN SELECT A.RIYO_CMP_CD".
           10  FILLER              PIC  X(09)
               VALUE  " INTO :V1".
      *----------  FROM
           10  FILLER              PIC  X(06)
               VALUE  " FROM ".
           10  SQL-TBL-TKDYAA31-1  PIC  X(13).
      *----------  A
           10  FILLER              PIC  X(04)
               VALUE  " A, ".
           10  SQL-TBL-TKDYAA31-2  PIC  X(13).
      *----------  B
           10  FILLER              PIC  X(03)
               VALUE  " B ".
      *----------  WHERE
           10  FILLER              PIC  X(07)
               VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(20)
               VALUE  "A.RIYO_CMP_CD = :V2 ".
      *----------  処理実行日
           10  FILLER              PIC  X(22)
               VALUE  "AND A.SYORI_YMD = :V3 ".
      *----------  起動ID
           10  FILLER              PIC  X(21)
               VALUE  "AND A.KIDOU_ID = :V4 ".
      *----------  業務タスクID
           10  FILLER              PIC  X(26)
               VALUE  "AND A.GYOMU_TASK_ID = :V5 ".
      *----------  一時停止区分
           10  FILLER              PIC  X(36)
               VALUE  "AND A.ITIJI_TEISHI_KBN IN ('0','3') ".
      *----------  利用会社コード
           10  FILLER              PIC  X(24)
               VALUE  "AND B.RIYO_CMP_CD = :V6 ".
      *----------  処理実行日
           10  FILLER              PIC  X(22)
               VALUE  "AND B.SYORI_YMD = :V7 ".
      *----------  業務タスクID
           10  FILLER              PIC  X(32)
               VALUE  "AND B.GYOMU_TASK_ID = 'T7170DY' ".
      *----------  自動運用カレンダーID
           10  FILLER              PIC  X(35)
               VALUE  "AND B.AUTO_CAL_ID  = A.AUTO_CAL_ID ".
      *----------  自動運用カレンダーID
           10  FILLER              PIC  X(26)
               VALUE  "AND B.AUTO_CAL_ID  <> ' ' ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(40)
               VALUE  "AND (B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO1 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(38)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO2 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(38)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO3 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(38)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO4 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(38)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO5 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(38)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO6 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(38)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO7 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(38)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO8 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(38)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO9 ".
      *----------  タスクスケジュールNo
           10  FILLER              PIC  X(39)
               VALUE  "OR B.TSK_SCHE_NO  = A.SK_TSK_SCHE_NO10)".
      *----------  ROWNUM = 1
           10  FILLER              PIC  X(20)
               VALUE  " AND ROWNUM = 1;END;".
      ******************************************************************
      *                SQL通信領域
      ******************************************************************
      *----------  SQLコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN    DECLARE  SECTION  END-EXEC.
       01  HST-AREA.
      *----------  ORACLE接続ユーザ領域
         05  H-ORA-USER            PIC  X(80).
         05  HST-TKDYAA31-SELECT.
      *----------  利用会社コード
           10  HST-RIYO-CMP-CD     PIC  X(04).
         05  HST-TKDYAA31-WHERE.
      *----------  利用会社コード
           10  HST-RIYO-CMP-CD     PIC  X(04).
      *----------  処理実行日
           10  HST-SYORI-YMD       PIC  X(08).
      *----------  業務タスクID
           10  HST-GYOMU-TASK-ID   PIC  X(07).
      *----------  起動ID
           10  HST-KIDOU-ID        PIC  X(04).
      *----------  SQLSTMT
         05  SQLSTMT               PIC  X(1000).
           EXEC  SQL  END      DECLARE  SECTION  END-EXEC.
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FLAG-AREA.
      *----------  ORACLE接続フラグ(0：DBに接続していない；1：DBに接続している)
         05  FLG-ORA-CONNECT       PIC  9(01).
      *----------  RPCオープンフラグ
         05  FLG-RPC-OPEN          PIC  9(01).
      *----------  ファイル終了フラグ
         05  FLG-END-INFILE        PIC  9(01).
      *----------  FTP要否の判定用のTMPファイルオープンフラグ
         05  FLG-FILE2-OPEN        PIC  9(01).
      *----------  ワーク該当起動ＩＤのgzファイル個数フラグ
         05  FLG-GZ-FILE-KT        PIC  9(01).
      *----------  明細リストファイルオープンフラグ
         05  FLG-FILE3-OPEN        PIC  9(01).
      *----------  ワークマージ要否フラグ
         05  FLG-MAJI              PIC  9(01).
      *----------  ワーク存在フラグ
         05  FLG-EXSIT             PIC  9(01).
      *----------  ワーク総個数フラグ
         05  FLG-ZONG-CNT          PIC  9(01).
      *----------  ワーク子業務タスク起動フラグ
         05  FLG-SUB-GYOMU-TASK-KIDOU
                                   PIC  9(01).
      ******************************************************************
      *                サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *---------- テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  SCZY7020 バッチ終了メッセージ出力ルーチン
       01  PARM-SCZY7020-INOUT.
           COPY  "SCZY7020.cpy".
      *----------  SCZY7090 バッチ引数一括取得ルーチン
       01  PARM-SCZY7090-INOUT.
           COPY  "SCZY7090.cpy".
      *----------  SCZY7100 バッチＤＢ接続情報取得ルーチン
       01  PARM-SCZY7100-INOUT.
           COPY  "SCZY7100.cpy".
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-INOUT.
           COPY  "SCZY1170.cpy".
      *----------  SCZY7010 バッチ開始メッセージ出力ルーチン
       01  PARM-SCZY7010-IN.
           COPY  "SCZY7010.cpy".
      *----------  SCZY7040 バッチ処理件数出力ルーチン
       01  PARM-SCZY7040-INOUT.
           COPY  "SCZY7040.cpy".
      *----------  SCZY7060 実行状況管理SELメイン.xls
       01  PARM-SCZY7060-INOUT.
           COPY  "SCZY7060.cpy".
      *----------  SCZY7080 メッセージＩＮＳルーチン
       01  PARM-SCZY7080-INOUT.
           COPY  "SCZY7080.cpy".
      *----------  【SCZY1150】実行状況管理ＩＮＳルーチン
       01  PARM-SCZY1150-INOUT.
           COPY  "SCZY1150.cpy".
      *----------  【SCZY4903】PATH取得ルーチン
       01  PARM-SCZY4903-INOUT.
           COPY  "SCZY4903.cpy".
      *----------  SDYJ2301 外接データマージルーチン
       01  PARM-SDYJ2301-INOUT.
           COPY  "SDYJ2301.cpy".
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      *----------  CBLDCRPC('OPEN ')処理用
       01  PARM-OPEN-ARG.
         05  REQUEST               PIC  X(08)  VALUE  "OPEN    ".
         05  STATUS-CODE           PIC  X(05)  VALUE  SPACE.
         05  FILLER                PIC  X(03).
         05  FLAGS                 PIC  S9(09) COMP-5  VALUE  ZERO.
      *----------  CBLDCRPC('CLOSE ')処理用
       01  PARM-CLOSE-ARG.
         05  REQUEST               PIC  X(08)  VALUE  "CLOSE   ".
         05  STATUS-CODE           PIC  X(05)  VALUE  SPACE.
         05  FILLER                PIC  X(03).
         05  FLAGS                 PIC  S9(09) COMP-5  VALUE  ZERO.
      ******************************************************************
      *
      *        手続き部
      *
      ******************************************************************
       PROCEDURE              DIVISION.
      ******************************************************************
      *    処理全体
      ******************************************************************
       MDYJ2201-RTN           SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MDYJ2201-RTN]"                GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D            ":◆◇◆◇◆◇◆◇  MDYJ2201 START  ◇◆◇◆◇◆◇◆"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD        =["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  3.3 後処理
           PERFORM  END-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":◆◇◆◇◆◇◆◇  MDYJ2201 END  ◇◆◇◆◇◆◇◆"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MDYJ2201-RTN]"                GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       MDYJ2201-EXT.
           EXIT.
      ******************************************************************
      *    3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  前処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.1.1.ワークエリアの初期化
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2.開始メッセージ出力処理
           PERFORM  PUT-BIGN-MSG-RTN
      *----------  3.1.3.引数取得
           PERFORM  GET-EXEC-ARG-RTN
      *----------  3.1.4.環境変数取得
           PERFORM  GET-FILE-PATH-RTN
      *----------  3.1.5.ＤＢ接続情報取得
           PERFORM  GET-DB-VAR-RTN
      *---------   3.1.6.ＤＢ接続処理
           PERFORM  CONNECT-ORA-RTN
      *----------  3.1.7 テーブルID取得処理
           PERFORM  TBL-ID-INIT-RTN
      *----------  3.1.8 CBLDADM利用準備
           PERFORM  CBLDCRPC-OPEN-RTN
      *----------  3.1.9.電文情報取得処理
           PERFORM  GET-DENBUN-INFO-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.1.1.ワークエリアの初期化
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワークエリアの初期化  START  ***"
      *-----------------------------------------------------------------
      *----------  ワークエリアの初期化
           INITIALIZE     WORK-AREA
                          SQL-AREA
                          HST-AREA
                          FLAG-AREA
                          FTPFILENAME-REC
                          LISTFILENAME-REC
                          PARM-SCZY1160-INOUT
                          PARM-SCZY7020-INOUT
                          PARM-SCZY7090-INOUT
                          PARM-SCZY7100-INOUT
                          PARM-SCZY1170-INOUT
                          PARM-SCZY7010-IN
                          PARM-SCZY7040-INOUT
                          PARM-SCZY7060-INOUT
                          PARM-SCZY7080-INOUT
                          PARM-SCZY1150-INOUT
                          PARM-SCZY4903-INOUT
                          PARM-SDYJ2301-INOUT
                          WK-DEBUN-INFO
                          PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WORK-AREA           =["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA            =["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HST-AREA            =["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FLAG-AREA           =["FLAG-AREA"]"
      D    DISPLAY  CNS-PGM-ID":FTPFILENAME-REC     =["
      D             FTPFILENAME-REC"]"
      D    DISPLAY  CNS-PGM-ID":LISTFILENAME-REC    =["
      D             LISTFILENAME-REC"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7020-INOUT =["
      D             PARM-SCZY7020-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7090-INOUT =["
      D             PARM-SCZY7090-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7100-INOUT =["
      D             PARM-SCZY7100-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-INOUT =["
      D             PARM-SCZY1170-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7010-IN    =["
      D             PARM-SCZY7010-IN    "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7040-INOUT =["
      D             PARM-SCZY7040-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7060-INOUT =["
      D             PARM-SCZY7060-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY7080-INOUT =["
      D             PARM-SCZY7080-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY4903-INOUT =["
      D             PARM-SCZY7090-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1150-INOUT =["
      D             PARM-SCZY1150-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":PARM-SDYJ2301-INOUT =["
      D             PARM-SDYJ2301-INOUT "]"
      D    DISPLAY  CNS-PGM-ID":WK-DEBUN-INFO       =["WK-DEBUN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG         =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":***  ワークエリアの初期化  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2.開始メッセージ出力処理
      ******************************************************************
       PUT-BIGN-MSG-RTN       SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  開始メッセージ出力処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7010-IN
      *----------  プログラムID
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7010-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7010-ARG:"
      D    DISPLAY  CNS-PGM-ID":プログラムID           =["
      D             PGM-ID              OF  PARM-SCZY7010-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7010 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7010"             USING  PARM-SCZY7010-IN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7010 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  開始メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PUT-BIGN-MSG-EXT.
           EXIT.
      ******************************************************************
      *    3.1.3.引数取得
      ******************************************************************
       GET-EXEC-ARG-RTN       SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"*****   引数取得処理  START   *****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7090-INOUT
                       PARM-RTNPKG
      *----------  引数NO（引数の何番目）
           MOVE  CNS-4
             TO  ARG-NUM                OF  PARM-SCZY7090-ARG1
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":引数NO=["
      D             ARG-NUM             OF  PARM-SCZY7090-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7090 START  ***"
      *-----------------------------------------------------------------
           CALL   "SCZY7090"            USING  PARM-SCZY7090-INOUT
                                               PARM-RTNPKG
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7090 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CODE OF SCZY7090=["RTN-CD
      D        OF PARM-RTNPKG(COUNTER   OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             INITIALIZE  PARM-RTNPKG
      *----------  ワーク利用会社コード
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-1)
               TO  WK-RIYO-CMP-CD
      *----------  ワーク処理実行日
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-2)
               TO  WK-SYORI-YMD
      *----------  ワーク起動ＩＤ
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-3)
               TO  WK-GYOMU-TASK-ID
      *----------  ワーク業務タスクID
             MOVE  ARG-STRING           OF  PARM-SCZY7090-ARG2(CNS-4)
               TO  WK-KIDOU-ID
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*****   バッチ引数の取得正常   *****"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク処理実行日    =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク起動ＩＤ      =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク業務タスクID  =["WK-GYOMU-TASK-ID"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":バッチ引数取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード ← 16(システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  SPACE                TO  FREE-MSG
                                        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  3.4 エラー処理
             PERFORM  ERR-RTN
           END-IF
      *----------  取得した引数チェック処理
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":** 取得した引数チェック処理 START **"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク処理実行日    =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク業務タスクID  =["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク起動ＩＤ      =["WK-KIDOU-ID"]"
      *-----------------------------------------------------------------
           IF  WK-RIYO-CMP-CD   NOT=  SPACE  AND
               WK-SYORI-YMD     NOT=  SPACE  AND
               WK-KIDOU-ID      NOT=  SPACE  AND
               WK-GYOMU-TASK-ID NOT=  SPACE
           THEN
             CONTINUE
           ELSE
      *----------  ワークリターンコード← 16（システムエラー)
             MOVE  CNS-RTN-BT16       TO  WK-RTN-CD
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-PARM-ERR         TO  FREE-MSG
                                        OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  「3.4.エラー処理」へ進む
               PERFORM  ERR-RTN
           END-IF
      *---------- 3)ワーク明細リストファイル名を作成する
           PERFORM  LIST-FILE-NM-SK-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":** 取得した引数チェック処理 END **"
      D    DISPLAY  CNS-PGM-ID":***  引数取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-EXEC-ARG-EXT.
           EXIT.
      ******************************************************************
      *    3.1.4.環境変数取得
      ******************************************************************
       GET-FILE-PATH-RTN      SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"*****   環境変数取得処理  START   *****"
      *-----------------------------------------------------------------
      *----------  1)ワークBLパス
      *              ワークPATH区分←"05"(※$APL_FTP_DIR)
           MOVE  CNS-POS-003            TO  WK-ERR-POS
           MOVE  CNS-PATH-KBN-05        TO  WK-PATH-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークPATH区分=["WK-PATH-KBN"]"
      *-----------------------------------------------------------------
           PERFORM  CALL-SCZY4903-RTN
      *----------  ワークBLパス ← 【SCZY4903】ARG2の返却PATH
           MOVE  RTN-PATH               OF  PARM-SCZY4903-ARG2
             TO  WK-BL-PATH
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4903.ARG2の返却PATH=["
      D             RTN-PATH               OF  PARM-SCZY4903-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ワークBLパス           =["WK-BL-PATH"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-PATH-KBN
                       WK-ERR-POS
      *
      *----------  2)ワークNASパス
      *         ワークPATH区分←"23"(※$NAS_APL_DIR/利用会社コード/work)
           MOVE  CNS-POS-004            TO  WK-ERR-POS
           MOVE  CNS-PATH-KBN-23        TO  WK-PATH-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークPATH区分=["WK-PATH-KBN"]"
      *-----------------------------------------------------------------
           PERFORM  CALL-SCZY4903-RTN
      *----------  ワークBLパス ← 【SCZY4903】ARG2の返却PATH
           MOVE  RTN-PATH               OF  PARM-SCZY4903-ARG2
             TO  WK-NAS-PATH
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4903.ARG2の返却PATH=["
      D             RTN-PATH               OF  PARM-SCZY4903-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ワークNASパス          =["WK-NAS-PATH"]"
      *-----------------------------------------------------------------
           INITIALIZE  WK-PATH-KBN
                       WK-ERR-POS
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  環境変数取得処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-FILE-PATH-EXT.
           EXIT.
      ******************************************************************
      *    【SCZY4903】PATH取得ルーチンをコール
      ******************************************************************
       CALL-SCZY4903-RTN      SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"***** 【SCZY4903】をコール  START  *****"
      *-----------------------------------------------------------------
      *----------  ファイルパスを取得する
           INITIALIZE  PARM-SCZY4903-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY4903-ARG1
      *----------  PATH区分
           MOVE  WK-PATH-KBN
             TO  PATH-KBN               OF  PARM-SCZY4903-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワークPATH区分      =["WK-PATH-KBN"]"
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD  OF  PARM-SCZY4903-ARG1=["
      D             RIYO-CMP-CD         OF  PARM-SCZY4903-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":PATH-KBN     OF  PARM-SCZY4903-ARG1=["
      D             PATH-KBN            OF  PARM-SCZY4903-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4903 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY4903"             USING  PARM-SCZY4903-ARG1
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY4903 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY4903)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             INITIALIZE  PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4903 PATH取得ルーチンをコールして、"
      D             "ファイルパスを取得できる."
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY4903 PATH取得ルーチンをコールして、"
      D             "ファイルパスを取得できない."
      *-----------------------------------------------------------------
      *----------  ワークリターンコード ← 16(システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  WK-ERR-POS
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID"***** 【SCZY4903】をコール  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY4903-EXT.
           EXIT.
      ******************************************************************
      *    3.1.5.バッチＤＢ接続情報取得
      ******************************************************************
       GET-DB-VAR-RTN         SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ＤＢ接続情報取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7100-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7100-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7100-ARG:"
      D    DISPLAY  CNS-PGM-ID":利用会社コード         =["
      D             RIYO-CMP-CD         OF  PARM-SCZY7100-ARG1 "]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7100 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7100"             USING  PARM-SCZY7100-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7100 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7100)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             INITIALIZE  PARM-RTNPKG
      *----------  DB接続情報
             MOVE  DB-SETUZOKU-JYOUHOU  OF PARM-SCZY7100-ARG2
               TO  WK-DB-SETUZOKU-JYOUHOU
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢ接続情報取得 正常"
      D    DISPLAY  CNS-PGM-ID":WK-DB-SETUZOKU-JYOUHOU=["
      D             WK-DB-SETUZOKU-JYOUHOU"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢ接続情報取得 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード ← 16(システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-005
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF PARM-RTNPKG
                                           (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   ＤＢ接続情報取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GET-DB-VAR-EXT.
           EXIT.
      ******************************************************************
      *    3.1.6.ORACLE接続
      ******************************************************************
       CONNECT-ORA-RTN        SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   ORACLE接続  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬエラー処理の設定
           MOVE  WK-DB-SETUZOKU-JYOUHOU
             TO  H-ORA-USER
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":H-ORA-USER = [" H-ORA-USER"]"
      *--------------------<DEBUG>--------------------------------------
      *----------  ORACLE接続
           EXEC SQL
             CONNECT :H-ORA-USER
           END-EXEC
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODE=「0：正常終了」 の場合
           IF  SQLCODE = CNS-SQL-NORMAL
      *----------  ORACLE接続フラグON(接続成功)
           THEN
             MOVE  CNS-ON               TO  FLG-ORA-CONNECT
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ORACLE接続成功 :SQLCODE=["SQLCODE"]"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  SQLCODE≠「0：正常終了」 の場合
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID":ORACLE接続エラー:SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード ← 16(システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-006
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  "CONNECT エラー"
               DELIMITED BY SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"*****   ORACLE接続  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CONNECT-ORA-EXT.
           EXIT.
      ******************************************************************
      *              CBLDADM利用準備
      ******************************************************************
       CBLDCRPC-OPEN-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** CBLDADM利用準備 START ***"
      D    DISPLAY  CNS-PGM-ID ":CBLDCRPC REQUEST =["
      D             REQUEST  OF PARM-OPEN-ARG"]"
      D    DISPLAY  CNS-PGM-ID ":****  CALL CBLDCRPC START  ****"
      *-----------------------------------------------------------------
      *----------  ＲＰＣ環境の初期化
           DISPLAY  'DCSVNAME'  UPON   ENVIRONMENT-NAME
           DISPLAY  ' '         UPON   ENVIRONMENT-VALUE
           CALL  "CBLDCRPC"     USING  PARM-OPEN-ARG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  CALL CBLDCRPC END  ****"
      D    DISPLAY  CNS-PGM-ID ":リターンコード=["
      D             STATUS-CODE OF PARM-OPEN-ARG"]"
      *-----------------------------------------------------------------
           IF  STATUS-CODE    OF PARM-OPEN-ARG NOT = "00000"
           THEN
      *----------  ワークリターンコード ← 16(システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CBLDCRPC OPENエラー"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID          OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-007
               TO  ERR-POS             OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD              OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  STATUS-CODE             OF PARM-OPEN-ARG
               TO  DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  "CBLDCRPCオープンエラー"
               TO  FREE-MSG            OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":CBLDCRPC OPEN正常"
      *-----------------------------------------------------------------
             MOVE  CNS-ON  TO  FLG-RPC-OPEN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-RPC-OPEN=["FLG-RPC-OPEN"]"
      D    DISPLAY  CNS-PGM-ID ":*** CBLDADM利用準備 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CBLDCRPC-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.1.9.電文情報取得処理
      ******************************************************************
       GET-DENBUN-INFO-RTN    SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [GET-DENBUN-INFO-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  電文情報取得処理 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7060-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD          OF  PARM-SCZY7060-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD            OF  PARM-SCZY7060-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID             OF  PARM-SCZY7060-ARG1
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD       OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日    =["
      D             SYORI-YMD         OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":起動ID        =["
      D             KIDOU-ID          OF  PARM-SCZY7060-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7060 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7060"           USING  PARM-SCZY7060-INOUT
                                             PARM-RTNPKG
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7060 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7060)       =["
      D             RTN-CD            OF  PARM-RTNPKG
      D                     (COUNTER  OF  PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD                 OF  PARM-RTNPKG
                            (COUNTER  OF  PARM-RTNPKG)
               = CNS-RTN-000
           THEN
             INITIALIZE  PARM-RTNPKG
      *----------  電文情報
             MOVE  DENBUN-INFO         OF  PARM-SCZY7060-INOUT
               TO  WK-DEBUN-INFO
      *----------  ワーク起動ログインユーザ会社コード
             MOVE  KIDOU-LOGIN-CMP-CD  OF  PARM-SCZY7060-INOUT
               TO  WK-KIDOU-LOGIN-CMP-CD
      *----------  ワークタスクスケジュールID
             MOVE  TSK-SCHE-ID         OF  PARM-SCZY7060-INOUT
               TO  WK-TSK-SCHE-ID
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":取得した電文情報=["
      D             DENBUN-INFO         OF  PARM-SCZY7060-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":取得した実行状況管理情報．"
      D             "起動ログインユーザ会社コード=["
      D             KIDOU-LOGIN-CMP-CD  OF  PARM-SCZY7060-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":取得した実行状況管理情報．"
      D             "タスクスケジュールID=["
      D             TSK-SCHE-ID         OF  PARM-SCZY7060-INOUT"]"
      D    DISPLAY  CNS-PGM-ID":ワーク電文情報=["WK-DEBUN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":ワーク起動ログインユーザ会社コード=["
      D             WK-KIDOU-LOGIN-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワークタスクスケジュールID        =["
      D             WK-TSK-SCHE-ID"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  ワークリターンコード ← 16(システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-008
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF PARM-RTNPKG
                                           (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  SPACE                TO  FREE-MSG
                                        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":*** 電文情報取得処理 END ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [GET-DENBUN-INFO-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       GET-DENBUN-INFO-EXT.
           EXIT.
      ******************************************************************
      *    3.2.主処理
      ******************************************************************
       MAIN-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MAIN-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.2.0.ODW送信ファイルの業務タスクのチェック処理
           PERFORM  TKDYAA31-CK-RTN
      *----------  3.2.1.明細リストファイルの存在チェック
           PERFORM  LSFILE-EXIST-CK-RTN
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID頭2桁判定："
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      *-----------------------------------------------------------------
      *----------  3.2.2.TMPファイル(02.finish)をオープンする
           IF  WK-GYOMU-TASK-ID(1:2) = "TD"
           THEN
             PERFORM  FILE2-OPEN-RTN
           ELSE
             CONTINUE
           END-IF
      *----------  3.2.3.RXサーバから、NASパスへ、gzファイルのコピー処理
           PERFORM  GZ-FILE-CPY-RTN
      *----------  3.2.4.NASサーバにENDファイル(01.finish)を作成
           PERFORM  NAS-END-FILE-RTN
      *----------  3.2.5.明細リストファイルに載っている対象のENDファイル
      *            が揃っているかのチェックを行う
           PERFORM  LIST-FILE-CHECK-RTN
      *----------  3.2.6.ファイルマージ処理を行う
           PERFORM  FILE-MAJI-SYORI-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  主処理  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MAIN-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.明細リストファイルの存在チェック
      ******************************************************************
       LSFILE-EXIST-CK-RTN    SECTION.
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  明細リストファイルの存在チェック START  ***"
      *-----------------------------------------------------------------
      *---------- 2)RXサーバで明細リストファイルの個数を取得
           PERFORM  LIST-FILE-KT-GET-RTN
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  明細リストファイルの存在チェック END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       LSFILE-EXIST-CK-EXT.
           EXIT.
      ******************************************************************
      *    ワーク明細リストファイル名
      *    ワーク後続業務タスクID
      ******************************************************************
       LIST-FILE-NM-SK-RTN    SECTION.
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  ワーク明細リストファ"
      D            "イル名、ワーク後続業務タスクID編集  START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日    =["WK-SYORI-YMD"]"
      *-----------------------------------------------------------------
           EVALUATE  WK-GYOMU-TASK-ID
      *----------  ワーク業務タスクID＝'T7050JC'(GX時価)
             WHEN  CNS-T7050JC
               STRING  "RX",
                       WK-RIYO-CMP-CD,
                       "_",
                       WK-SYORI-YMD,
                       "_T7170DY_01.list"
                       DELIMITED BY SPACE
                       INTO  WK-LIST-FILE-NAME
               END-STRING
               MOVE  CNS-TD871JC        TO  WK-GOU-GYOMU-TASK-ID
      *----------  ワーク業務タスクID＝'T7070US'(GX取引)
             WHEN  CNS-T7070US
               STRING  "RX",
                       WK-RIYO-CMP-CD,
                       "_",
                       WK-SYORI-YMD,
                       "_T7170DY_02.list"
                       DELIMITED BY SPACE
                       INTO  WK-LIST-FILE-NAME
               END-STRING
               MOVE  CNS-TD891US        TO  WK-GOU-GYOMU-TASK-ID
      *----------  ワーク業務タスクID＝'T7080US'(GX残高)
             WHEN  CNS-T7080US
               STRING  "RX",
                       WK-RIYO-CMP-CD,
                       "_",
                       WK-SYORI-YMD,
                       "_T7170DY_03.list"
                       DELIMITED BY SPACE
                       INTO  WK-LIST-FILE-NAME
               END-STRING
               MOVE  CNS-TD901US        TO  WK-GOU-GYOMU-TASK-ID
      *----------  ワーク業務タスクID＝'T7100US'(GX集約)
             WHEN  CNS-T7100US
               STRING  "RX",
                       WK-RIYO-CMP-CD,
                       "_",
                       WK-SYORI-YMD,
                       "_T7170DY_04.list"
                       DELIMITED BY SPACE
                       INTO  WK-LIST-FILE-NAME
               END-STRING
               MOVE  CNS-TD921US        TO  WK-GOU-GYOMU-TASK-ID
      *----------  ワーク業務タスクID＝'TD930US'(ODW現金異動)
             WHEN  CNS-TD930US
               STRING  "RX",
                       WK-RIYO-CMP-CD,
                       "_",
                       WK-SYORI-YMD,
                       "_T7170DY_05.list"
                       DELIMITED BY SPACE
                       INTO  WK-LIST-FILE-NAME
               END-STRING
      *----------  ワーク業務タスクID＝'T7030JC'(ＧＸ銘柄分類データ接続)
             WHEN  CNS-T7030JC
               STRING  "RX",
                       WK-RIYO-CMP-CD,
                       "_",
                       WK-SYORI-YMD,
                       "_T7170DY_06.list"
                       DELIMITED BY SPACE
                       INTO  WK-LIST-FILE-NAME
               END-STRING
               MOVE  CNS-TD851JC        TO  WK-GOU-GYOMU-TASK-ID
      *----------  ワーク業務タスクID＝'T7040JC'(ＧＸ銘柄属性データ接続)
             WHEN  CNS-T7040JC
               STRING  "RX",
                       WK-RIYO-CMP-CD,
                       "_",
                       WK-SYORI-YMD,
                       "_T7170DY_07.list"
                       DELIMITED BY SPACE
                       INTO  WK-LIST-FILE-NAME
               END-STRING
               MOVE  CNS-TD861JC        TO  WK-GOU-GYOMU-TASK-ID
             WHEN  OTHER
      *----------  ワークリターンコード← 16（システムエラー)
               MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-030
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  ZERO
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  CNS-PARM-ERR         TO  FREE-MSG
                                          OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  「3.4.エラー処理」へ進む
               PERFORM  ERR-RTN
           END-EVALUATE
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク明細リストファイル名=["
      D                         WK-LIST-FILE-NAME"]"
      D    DISPLAY  CNS-PGM-ID":ワーク後続業務タスクID    =["
      D                         WK-GOU-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":***  ワーク明細リストファ"
      D            "イル名、ワーク後続業務タスクID編集  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       LIST-FILE-NM-SK-EXT.
           EXIT.
      ******************************************************************
      *    RXサーバで明細リストファイルの個数を取得
      ******************************************************************
       LIST-FILE-KT-GET-RTN   SECTION.
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D      ":***  RXサーバで明細リストファイルの個数を取得 START  ***"
      *-----------------------------------------------------------------
      *----------  1) ワークコマンドの初期化
           INITIALIZE  WK-COMMAND
                       WK-ERR-POS
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
           MOVE  CNS-POS-009            TO  WK-ERR-POS
           STRING  "/bin/ls "
                   DELIMITED    BY  SIZE
                   WK-NAS-PATH
                   DELIMITED    BY  SPACE
                   " | grep '"
                   DELIMITED    BY  SIZE
                   WK-LIST-FILE-NAME
                   DELIMITED    BY  SPACE
                   "' | wc -l"
                   DELIMITED    BY  SIZE
             INTO  WK-COMMAND
           END-STRING
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークNASパス=["WK-NAS-PATH"]"
      D    DISPLAY  CNS-PGM-ID":ワーク明細リストファイル名=["
      D                         WK-LIST-FILE-NAME"]"
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
           PERFORM  CALL-CBLDCADM-RTN
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":データ名J(1:1)=["
      D             RESULT              OF  WK-ADM-ARG3(1:1)"]"
      *-----------------------------------------------------------------
           IF  RESULT  OF  WK-ADM-ARG3(1:1) = CNS-X-0
           THEN
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-034
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-800
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  ZERO
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-PARM-ERR         TO  FREE-MSG
                                        OF  PARM-SCZY1170-ARG1
      *----------  「3.4.エラー処理」へ進む
             PERFORM  ERR-RTN
           ELSE
             CONTINUE
           END-IF
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D      ":***  RXサーバで明細リストファイルの個数を取得 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       LIST-FILE-KT-GET-EXT.
           EXIT.
      ******************************************************************
      *    FTP要否の判定用のTMPファイル(02.finish)をオープンする
      ******************************************************************
       FILE2-OPEN-RTN         SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE2-OPEN-RTN]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  FTP要否の判定用のTMPファイル"
      D            "(02.finish)をオープン  START  ***"
      *-----------------------------------------------------------------
           STRING  WK-NAS-PATH,
                   "/RX",
                   WK-RIYO-CMP-CD,
                   "_",
                   WK-SYORI-YMD,
                   "_",
                   WK-KIDOU-ID,
                   "_",
                   WK-GYOMU-TASK-ID,
                   "_02.finish"
                   DELIMITED BY SPACE
                   INTO  FTPFILENAME
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-NAS-PATH=["WK-NAS-PATH"]"
      D    DISPLAY  CNS-PGM-ID":FTPFILENAME=["FTPFILENAME"]"
      *-----------------------------------------------------------------
           OPEN OUTPUT FTP-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファイルステータス(OPEN)=["ST-FTPFILE"]"
      *-----------------------------------------------------------------
           IF  ST-FTPFILE = CNS-FILE-NORMAL
           THEN
             MOVE  CNS-ON           TO  FLG-FILE2-OPEN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルをOPEN ERROR !"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-16                  TO  WK-RTN-CD
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID                  OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-010
               TO  ERR-POS                     OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-200
               TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(ST-FTPFILE)
               TO  DETAIL-RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERR-OPEN
               TO  FREE-MSG                    OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルオープンフラグ=["
      D              FLG-FILE2-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":***  FTP要否の判定用のTMPファイル"
      D            "(02.finish)をオープン  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE2-OPEN-RTN]"              GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       FILE2-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    3.2.4.RXサーバから、NASパスへ、gzファイルのコピー処理
      ******************************************************************
       GZ-FILE-CPY-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [GZ-FILE-CPY-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  RXサーバから、NASパスへ、"
      D             "gzファイルのコピー処理 START  ***"
      *-----------------------------------------------------------------
      *----------  1) RXサーバで該当起動ＩＤのgzファイルの存在チェック
           INITIALIZE  WK-COMMAND
                       WK-ERR-POS
           MOVE  CNS-POS-011            TO  WK-ERR-POS
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークコマンド    =["WK-COMMAND"]"
      *-----------------------------------------------------------------
           STRING  "/bin/ls "
                   DELIMITED    BY  SIZE
                   WK-BL-PATH
                   DELIMITED    BY  SPACE
                   " | grep 'RX"
                   DELIMITED    BY  SIZE
                   WK-RIYO-CMP-CD
                   DELIMITED    BY  SPACE
                   "_"
                   DELIMITED    BY  SIZE
                   WK-SYORI-YMD
                   DELIMITED    BY  SPACE
                   "_"
                   DELIMITED    BY  SIZE
                   WK-KIDOU-ID
                   DELIMITED    BY  SPACE
                   "_"
                   DELIMITED    BY  SIZE
                   WK-GYOMU-TASK-ID
                   DELIMITED    BY  SPACE
                   "_' | grep '\.gz' | wc -l"
                   DELIMITED    BY  SIZE
             INTO  WK-COMMAND
           END-STRING
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークBLパス        =["WK-BL-PATH"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日    =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク起動ID        =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワークコマンド    =["WK-COMMAND"]"
      *-----------------------------------------------------------------
           PERFORM  CALL-CBLDCADM-RTN
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":データ名J(1:1)=["
      D             RESULT              OF  WK-ADM-ARG3(1:1)"]"
      *-----------------------------------------------------------------
           IF  RESULT  OF  WK-ADM-ARG3(1:1) = CNS-X-0
           THEN
             MOVE  CNS-0                TO  FLG-GZ-FILE-KT
           ELSE
             MOVE  CNS-1                TO  FLG-GZ-FILE-KT
           END-IF
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ワーク該当起動ＩＤのgzファイル個数フラグ=["
      D             FLG-GZ-FILE-KT"]"
      *-----------------------------------------------------------------
           IF  FLG-GZ-FILE-KT = CNS-1
           THEN
             INITIALIZE  WK-COMMAND
                         WK-ERR-POS
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
             MOVE  CNS-POS-012            TO  WK-ERR-POS
             STRING  "/bin/cp -pf "
                     DELIMITED    BY  SIZE
                     WK-BL-PATH
                     DELIMITED    BY  SPACE
                     "/RX"
                     DELIMITED    BY  SIZE
                     WK-RIYO-CMP-CD
                     DELIMITED    BY  SPACE
                     "_"
                     DELIMITED    BY  SIZE
                     WK-SYORI-YMD
                     DELIMITED    BY  SPACE
                     "_"
                     DELIMITED    BY  SIZE
                     WK-KIDOU-ID
                     DELIMITED    BY  SPACE
                     "_"
                     DELIMITED    BY  SIZE
                     WK-GYOMU-TASK-ID
                     DELIMITED    BY  SPACE
                     "_*.gz "
                     DELIMITED    BY  SIZE
                     WK-NAS-PATH
                     DELIMITED    BY  SPACE
               INTO  WK-COMMAND
             END-STRING
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークBLパス        =["WK-BL-PATH"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日    =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク起動ID        =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワークNASパス     =["WK-NAS-PATH"]"
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
             PERFORM  CALL-CBLDCADM-RTN
           ELSE
             CONTINUE
           END-IF
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  RXサーバから、NASパスへ、"
      D             "gzファイルのコピー処理 END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [GZ-FILE-CPY-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       GZ-FILE-CPY-EXT.
           EXIT.
      ******************************************************************
      *    3.2.5.NASサーバにENDファイル(01.finish)を作成
      ******************************************************************
       NAS-END-FILE-RTN       SECTION.
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  NASサーバにENDファイル"
      D             "(01.finish)を作成 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-COMMAND
                       WK-ERR-POS
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
           MOVE  CNS-POS-013            TO  WK-ERR-POS
           STRING  "/bin/touch "
                   DELIMITED    BY  SIZE
                   WK-NAS-PATH
                   DELIMITED    BY  SPACE
                   "/RX"
                   DELIMITED    BY  SIZE
                   WK-RIYO-CMP-CD
                   DELIMITED    BY  SPACE
                   "_"
                   DELIMITED    BY  SIZE
                   WK-SYORI-YMD
                   DELIMITED    BY  SPACE
                   "_"
                   DELIMITED    BY  SIZE
                   WK-GYOMU-TASK-ID
                   DELIMITED    BY  SPACE
                   "_`date +%Y%m%d%H%M%S%N`_"
                   DELIMITED    BY  SIZE
                   WK-KIDOU-ID
                   DELIMITED    BY  SPACE
                   "_01.finish"
                   DELIMITED    BY  SIZE
             INTO  WK-COMMAND
           END-STRING
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日    =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク起動ID        =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワークNASパス     =["WK-NAS-PATH"]"
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
           PERFORM  CALL-CBLDCADM-RTN
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  NASサーバにENDファイル"
      D             "(01.finish)を作成 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       NAS-END-FILE-EXT.
           EXIT.
      ******************************************************************
      *    3.2.6.明細リストファイルに載っている対象のENDファイル
      *          が揃っているかのチェックを行う
      ******************************************************************
       LIST-FILE-CHECK-RTN    SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [LIST-FILE-CHECK-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  明細リストファイルに載っている"
      D    "対象のENDファイルが揃っているかのチェックを行う START  ***"
      *-----------------------------------------------------------------
      *---------- 1)明細リストファイルをオープンする
           PERFORM  FILE3-OPEN-RTN
      *---------- 2)全てのENDファイルのタイムスタンプを取得
           PERFORM  END-FILE-TS-GET-RTN
      *---------- 3)明細リストファイルをREAD
           PERFORM  FILE3-READ-RTN
      *---------- 4)NASパスへコピーしたgzファイルの総個数を取得
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID"ワークマージ要否フラグ判定："
      D    DISPLAY  CNS-PGM-ID"ワークマージ要否フラグ=["FLG-MAJI"]"
      *-----------------------------------------------------------------
           IF  FLG-MAJI = CNS-1
           THEN
             PERFORM  CPY-FILE-KT-GET-RTN
           ELSE
             PERFORM  END-RTN
           END-IF
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  明細リストファイルに載っている"
      D    "対象のENDファイルが揃っているかのチェックを行う END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [LIST-FILE-CHECK-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       LIST-FILE-CHECK-EXT.
           EXIT.
      ******************************************************************
      *    明細リストファイルをオープンする
      ******************************************************************
       FILE3-OPEN-RTN         SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE3-OPEN-RTN]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  明細リストファイルをOPEN  START  ***"
      *-----------------------------------------------------------------
           STRING  WK-NAS-PATH,
                   "/"
                   WK-LIST-FILE-NAME
                   DELIMITED BY SPACE
                 INTO  LISTFILENAME
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークNASパス=["WK-NAS-PATH"]"
      D    DISPLAY  CNS-PGM-ID":ワーク明細リストファイル名=["
      D                         WK-LIST-FILE-NAME"]"
      D    DISPLAY  CNS-PGM-ID":LISTFILENAME=["LISTFILENAME"]"
      *-----------------------------------------------------------------
           OPEN INPUT LIST-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファイルステータス(OPEN)=["
      D             ST-LISTFILE"]"
      *-----------------------------------------------------------------
           IF  ST-LISTFILE = CNS-FILE-NORMAL
           THEN
             MOVE  CNS-ON           TO  FLG-FILE3-OPEN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":明細リストファイルをOPEN ERROR !"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-16                  TO  WK-RTN-CD
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID                  OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-014
               TO  ERR-POS                     OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-200
               TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(ST-LISTFILE)
               TO  DETAIL-RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERR-OPEN
               TO  FREE-MSG                    OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":明細リストファイルオープンフラグ=["
      D              FLG-FILE3-OPEN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  明細リストファイルをOPEN  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE3-OPEN-RTN]"              GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       FILE3-OPEN-EXT.
           EXIT.
      ******************************************************************
      *    全てのENDファイルのタイムスタンプを取得
      ******************************************************************
       END-FILE-TS-GET-RTN    SECTION.
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D       ":***  全てのENDファイルのタイムスタンプを取得 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-COMMAND
                       WK-ERR-POS
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
           MOVE  CNS-POS-015            TO  WK-ERR-POS
           STRING  "/bin/ls "
                   DELIMITED    BY  SIZE
                   WK-NAS-PATH
                   DELIMITED    BY  SPACE
                   " | grep '"
                   DELIMITED    BY  SIZE
                   "RX"
                   DELIMITED    BY  SIZE
                   WK-RIYO-CMP-CD
                   DELIMITED    BY  SPACE
                   "_"
                   DELIMITED    BY  SIZE
                   WK-SYORI-YMD
                   DELIMITED    BY  SPACE
                   "_"
                   DELIMITED    BY  SIZE
                   WK-GYOMU-TASK-ID
                   "' | grep '01\.finish'"
                   DELIMITED    BY  SIZE
                   " | awk -F_ '{print $5}'"
                   DELIMITED    BY  SIZE
             INTO  WK-COMMAND
           END-STRING
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日    =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワークNASパス     =["WK-NAS-PATH"]"
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
           PERFORM  CALL-CBLDCADM-RTN
           MOVE  RESULT                 OF  WK-ADM-ARG3(1:495)
             TO  WK-END-FILE-LIST-G
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークENDファイル起動ＩＤ一覧=["
      D             WK-END-FILE-LIST-G"]"
      D    DISPLAY  CNS-PGM-ID
      D       ":***  全てのENDファイルのタイムスタンプを取得 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-FILE-TS-GET-EXT.
           EXIT.
      ******************************************************************
      *  明細リストファイルをREAD
      ******************************************************************
       FILE3-READ-RTN         SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE3-READ-RTN]"              GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  明細リストファイルをREAD  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-READ-CNT
                       FLG-END-INFILE
                       WK-IDX
           MOVE  CNS-1                   TO  FLG-MAJI
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークマージ要否フラグ=["FLG-MAJI"]"
      *-----------------------------------------------------------------
           PERFORM WITH TEST BEFORE UNTIL  FLG-END-INFILE = CNS-ON
               OR  FLG-MAJI = CNS-0
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                    ":** 明細リストファイルREADのLOOP START **"
      *-----------------------------------------------------------------
               READ LIST-FILE
               AT END
                  MOVE  CNS-ON           TO  FLG-END-INFILE
               END-READ
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファイルステータス(READ)=["
      D             ST-LISTFILE"]"
      *-----------------------------------------------------------------
               IF  FLG-END-INFILE  NOT = CNS-ON
               THEN
                 IF  ST-LISTFILE  =  CNS-FILE-NORMAL
                 THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク読み込む件数(BEFORE)=["
      D             WK-READ-CNT"]"
      *-----------------------------------------------------------------
                   COMPUTE  WK-READ-CNT = WK-READ-CNT + CNS-1
                   MOVE  CNS-0          TO  FLG-EXSIT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク読み込む件数(AFTER) =["
      D             WK-READ-CNT"]"
      D    DISPLAY  CNS-PGM-ID":ワーク存在フラグ=["FLG-EXSIT"]"
      *-----------------------------------------------------------------
                   MOVE  CNS-1          TO  WK-IDX
                   PERFORM
                     UNTIL WK-IDX > CNS-99
                        OR WK-END-FILE-KIDOUID(WK-IDX) = SPACE
                        OR FLG-EXSIT = CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":** 存在チェックLOOP START **"
      D    DISPLAY  CNS-PGM-ID":存在チェックLOOPのLOOP変数WK-IDX=["
      D                         WK-IDX"]"
      D    DISPLAY  CNS-PGM-ID":明細リストファイルから取得の"
      D              "データレコード=["LISTFILENAME-REC"]"
      D    DISPLAY  CNS-PGM-ID":明細リストファイルから取得の"
      D              "データレコード(17:4)=["LISTFILENAME-REC(17:4)"]"
      D    DISPLAY  CNS-PGM-ID":ワークENDファイル起動ＩＤ("WK-IDX")=["
      D             WK-END-FILE-KIDOUID(WK-IDX)"]"
      *-----------------------------------------------------------------
                     IF  LISTFILENAME-REC(17:4)
                       = WK-END-FILE-KIDOUID(WK-IDX)
                     THEN
                       MOVE  CNS-1      TO  FLG-EXSIT
                     ELSE
                       CONTINUE
                     END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク存在フラグ=["FLG-EXSIT"]"
      *-----------------------------------------------------------------
                     COMPUTE  WK-IDX = WK-IDX + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":** 存在チェックLOOP END **"
      *-----------------------------------------------------------------
                   END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":存在チェックLOOPのLOOP変数WK-IDX=["
      D                         WK-IDX"]"
      D    IF  WK-IDX > 99
      D    THEN
      D      CONTINUE
      D    ELSE
      D    DISPLAY  CNS-PGM-ID":ワークENDファイル起動ＩＤ("WK-IDX")=["
      D            WK-END-FILE-KIDOUID(WK-IDX)"]"
      D    END-IF
      D    DISPLAY  CNS-PGM-ID":ワーク存在フラグ判定："
      D    DISPLAY  CNS-PGM-ID":ワーク存在フラグ=["FLG-EXSIT"]"
      *-----------------------------------------------------------------
                   IF  FLG-EXSIT = CNS-0
                   THEN
                     MOVE  CNS-0      TO  FLG-MAJI
                   ELSE
                     CONTINUE
                   END-IF
      *-----------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークマージ要否フラグ=["FLG-MAJI"]"
      *-----------------------------------------------------------------
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":明細リストファイルをREAD ERROR !"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
                   MOVE  CNS-RTN-16               TO  WK-RTN-CD
      *----------  エラー検知プログラムID
                   MOVE  CNS-PGM-ID
                     TO  ERR-PGM-ID               OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-016
                     TO  ERR-POS                  OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-210
                     TO  RTN-CD                   OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-0
                     TO  DETAIL-RTN-CD-FLG        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
                   MOVE  FUNCTION NUMVAL(ST-LISTFILE)
                     TO  DETAIL-RTN-CD            OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
                   MOVE  CNS-ERR-READ
                     TO  FREE-MSG                 OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
                   PERFORM  ERR-RTN
                 END-IF
               ELSE
                 CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":** 明細リストファイルREADのLOOP END **"
      *-----------------------------------------------------------------
           END-PERFORM
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ファイルステータス(READ)=["
      D             ST-LISTFILE"]"
      D    DISPLAY  CNS-PGM-ID":ワークマージ要否フラグ=["FLG-MAJI"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  明細リストファイルをREAD  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE3-READ-RTN]"              GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       FILE3-READ-EXT.
           EXIT.
      ******************************************************************
      *    NASパスへコピーしたgzファイルの総個数を取得
      ******************************************************************
       CPY-FILE-KT-GET-RTN    SECTION.
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":***  NASパスへコピーした"
      D             "gzファイルの総個数を取得 START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-IDX
           MOVE  CNS-1                  TO  WK-IDX
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [CPY-FILE-KT-GET-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  UNTIL  WK-IDX > CNS-99
                       OR  WK-END-FILE-KIDOUID(WK-IDX) = SPACE
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D                ":** 最大タイムスタンプ起動ＩＤ取得LOOP START **"
      D    DISPLAY  CNS-PGM-ID
      D              ":最大タイムスタンプ起動ＩＤ取得LOOPの変数WK-IDX=["
      D              WK-IDX"]"
      D    DISPLAY  CNS-PGM-ID":ワークENDファイル起動ＩＤ("WK-IDX")=["
      D            WK-END-FILE-KIDOUID(WK-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワークすべて起動ID件数(BEFORE)=["
      D             WK-ALL-KIDOUID-CNT"]"
      *-----------------------------------------------------------------
      *----------  ワーク最大タイムスタンプ起動ＩＤ
             MOVE  WK-END-FILE-KIDOUID(WK-IDX)
               TO  WK-MAX-TIMESTAMP-KIDOUID
      *----------  ワークすべて起動ID件数
             COMPUTE  WK-ALL-KIDOUID-CNT = WK-ALL-KIDOUID-CNT + CNS-1
      *----------  ワークすべて起動ID明細(ワークすべて起動ID件数)
             MOVE  WK-END-FILE-KIDOUID(WK-IDX)
               TO  WK-ALL-KIDOU-ID-DETIAL(WK-ALL-KIDOUID-CNT)
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークすべて起動ID件数(AFTER)=["
      D             WK-ALL-KIDOUID-CNT"]"
      D    DISPLAY  CNS-PGM-ID":ワーク最大タイムスタンプ起動ＩＤ=["
      D             WK-MAX-TIMESTAMP-KIDOUID"]"
      D    DISPLAY  CNS-PGM-ID":ワークすべて起動ID明細("
      D             WK-ALL-KIDOUID-CNT")=["
      D             WK-ALL-KIDOU-ID-DETIAL(WK-ALL-KIDOUID-CNT)"]"
      *-----------------------------------------------------------------
              COMPUTE  WK-IDX = WK-IDX + CNS-1
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D                ":** 最大タイムスタンプ起動ＩＤ取得LOOP END **"
      *-----------------------------------------------------------------
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [CPY-FILE-KT-GET-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID
      D              ":最大タイムスタンプ起動ＩＤ取得LOOPの変数WK-IDX=["
      D              WK-IDX"]"
      D    IF  WK-IDX > 99
      D    THEN
      D      CONTINUE
      D    ELSE
      D    DISPLAY  CNS-PGM-ID":ワークENDファイル起動ＩＤ("WK-IDX")=["
      D            WK-END-FILE-KIDOUID(WK-IDX)"]"
      D    END-IF
      *-----------------------------------------------------------------
      *----------  ワーク長さ
           COMPUTE  WK-LENG = WK-ALL-KIDOUID-CNT*CNS-7 - CNS-1
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク長さ=["WK-LENG"]"
      *-----------------------------------------------------------------
      *----------  ワークコマンド
           INITIALIZE  WK-COMMAND
                       WK-ERR-POS
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
           MOVE  CNS-POS-017            TO  WK-ERR-POS
           STRING  "/bin/ls "
                   DELIMITED    BY  SIZE
                   WK-NAS-PATH
                   DELIMITED    BY  SPACE
                   " | grep 'RX"
                   DELIMITED    BY  SIZE
                   WK-RIYO-CMP-CD
                   DELIMITED    BY  SPACE
                   "_"
                   DELIMITED    BY  SIZE
                   WK-SYORI-YMD
                   DELIMITED    BY  SPACE
                   "_' | grep '_"
                   DELIMITED    BY  SIZE
                   WK-GYOMU-TASK-ID
                   DELIMITED    BY  SPACE
                   "_' | grep '\.gz' | grep -E '"
                   DELIMITED    BY  SIZE
                   WK-ALL-KIDOU-ID-G(1:WK-LENG)
                   DELIMITED    BY  SPACE
                   "' | wc -l"
                   DELIMITED    BY  SIZE
             INTO  WK-COMMAND
           END-STRING
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日    =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワークNASパス     =["WK-NAS-PATH"]"
      D    DISPLAY  CNS-PGM-ID":ワークすべて起動ID(1:ワーク長さ)=["
      D             WK-ALL-KIDOU-ID-G(1:WK-LENG)"]"
      D    DISPLAY  CNS-PGM-ID":ワークコマンド=["WK-COMMAND"]"
      *-----------------------------------------------------------------
           PERFORM  CALL-CBLDCADM-RTN
           IF  RESULT  OF  WK-ADM-ARG3(1:1) = CNS-X-0
           THEN
             MOVE  CNS-0                TO  FLG-ZONG-CNT
           ELSE
             MOVE  CNS-1                TO  FLG-ZONG-CNT
           END-IF
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク総個数フラグ=["FLG-ZONG-CNT"]"
      D    DISPLAY  CNS-PGM-ID":***  NASパスへコピーした"
      D             "gzファイルの総個数を取得 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CPY-FILE-KT-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2.7.ファイルマージ処理を行う
      ******************************************************************
       FILE-MAJI-SYORI-RTN    SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE-MAJI-SYORI-RTN]"         GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイルマージ処理を行う START  ***"
      D    DISPLAY  CNS-PGM-ID":ワークマージ要否フラグ=["FLG-MAJI"]"
      D    DISPLAY  CNS-PGM-ID":ワーク最大タイムスタンプ起動ＩＤ=["
      D             WK-MAX-TIMESTAMP-KIDOUID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク起動ＩＤ=["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク総個数フラグ=["FLG-ZONG-CNT"]"
      *-----------------------------------------------------------------
           IF    FLG-MAJI = CNS-1
             AND WK-MAX-TIMESTAMP-KIDOUID = WK-KIDOU-ID
             AND FLG-ZONG-CNT = CNS-1
           THEN
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID頭2桁判定："
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      *-----------------------------------------------------------------
             EVALUATE  WK-GYOMU-TASK-ID(1:2)
      *----------  ワーク業務タスクID頭2桁＝’T7’（GX機能）の場合
               WHEN  "T7"
                 MOVE  CNS-1        TO  FLG-SUB-GYOMU-TASK-KIDOU
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク子業務タスク起動フラグ=["
      D             FLG-SUB-GYOMU-TASK-KIDOU"]"
      *-----------------------------------------------------------------
      *----------  ワーク業務タスクID頭2桁＝’TD’（ODW機能）の場合、
               WHEN  "TD"
      *----------  SDYJ2301 外接データマージルーチンをコール
                 PERFORM  CALL-SDYJ2301-RTN
      *----------  'Finish'をFTP要否の判定用のTMPファイルに書き込む
                 PERFORM  FILE2-WRITE-RTN
               WHEN  OTHER
                 CONTINUE
             END-EVALUATE
           ELSE
             CONTINUE
           END-IF
      *-----------------------------<DEBUG>-----------------------------
      D    DISPLAY  CNS-PGM-ID":*** ファイルマージ処理を行う END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE-MAJI-SYORI-RTN]"         GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       FILE-MAJI-SYORI-EXT.
           EXIT.
      ******************************************************************
      *    【SDYJ2301】外接データマージルーチンをコール
      ******************************************************************
       CALL-SDYJ2301-RTN      SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"***** 【SDYJ2301】をコール  START  *****"
      *-----------------------------------------------------------------
      *----------  ファイルパスを取得する
           INITIALIZE  PARM-SDYJ2301-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SDYJ2301-ARG1
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-YMD              OF  PARM-SDYJ2301-ARG1
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SDYJ2301-ARG1
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SDYJ2301-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日  =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク起動ID      =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":SDYJ2301.ARG1.利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SDYJ2301-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SDYJ2301.ARG1.処理実行日    =["
      D             SYORI-YMD           OF  PARM-SDYJ2301-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SDYJ2301.ARG1.業務タスクID  =["
      D             GYOMU-TASK-ID       OF  PARM-SDYJ2301-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SDYJ2301.ARG1.起動ID        =["
      D             KIDOU-ID            OF  PARM-SDYJ2301-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SDYJ2301 START  ***"
      *-----------------------------------------------------------------
           CALL  "SDYJ2301"             USING  PARM-SDYJ2301-ARG1
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SDYJ2301 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SDYJ2301)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             INITIALIZE  PARM-RTNPKG
           ELSE
      *----------  ワークリターンコード ← 16(システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-018
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID"***** 【SDYJ2301】をコール  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SDYJ2301-EXT.
           EXIT.
      ******************************************************************
      *    'Finish'をFTP要否の判定用のTMPファイルに書き込む
      ******************************************************************
       FILE2-WRITE-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE2-WRITE-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  'Finish'をFTP要否の判定用の"
      D            "TMPファイルに書き込む  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  FTPFILENAME-REC
           MOVE  "Finish"               TO  FTPFILENAME-REC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FTPFILENAME-REC=["FTPFILENAME-REC"]"
      *-----------------------------------------------------------------
           WRITE FTPFILENAME-REC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ファイルステータス(WRITE)=["ST-FTPFILE"]"
      *-----------------------------------------------------------------
           IF  ST-FTPFILE = CNS-FILE-NORMAL
           THEN
             CONTINUE
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルをWRITE ERROR !"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-16                  TO  WK-RTN-CD
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID                  OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-019
               TO  ERR-POS                     OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-220
               TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(ST-FTPFILE)
               TO  DETAIL-RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERR-WRITE
               TO  FREE-MSG                    OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  'Finish'をFTP要否の判定用の"
      D            "TMPファイルに書き込む  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE2-WRITE-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       FILE2-WRITE-EXT.
           EXIT.
      ******************************************************************
      *    CBLDCADMシステム運用の管理をコール
      ******************************************************************
       CALL-CBLDCADM-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CBLDCADMシステム運用の管理をコール"
      D             " START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  WK-ADM-ARG1
                       WK-ADM-ARG2
                       WK-ADM-ARG3
                       WK-ADM-ARG4
           MOVE  "COMMAND "
             TO  ADM-CALL               OF  WK-ADM-ARG1
           MOVE  1000
             TO  LINK-DATA-LENG         OF  WK-ADM-ARG2
           MOVE  WK-COMMAND
             TO  LINK-DATA              OF  WK-ADM-ARG2
           MOVE  1024                   TO  RESULT-LENG
                                        OF  WK-ADM-ARG3
           MOVE  1024                   TO  ERR-RESULT-LENG
                                        OF  WK-ADM-ARG4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CBLDCADMの入力："
      D    DISPLAY  CNS-PGM-ID":データ名A=["
      D             ADM-CALL            OF  WK-ADM-ARG1   "]"
      D    DISPLAY  CNS-PGM-ID":データ名Z=["
      D             FLAGS               OF  WK-ADM-ARG1   "]"
      D    DISPLAY  CNS-PGM-ID":データ名E=["
      D             LINK-DATA-LENG      OF  WK-ADM-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":データ名G=["
      D             LINK-DATA           OF  WK-ADM-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":*** CALL CBLDCADM  START  ***"
      *-----------------------------------------------------------------
           CALL  "CBLDCADM"             USING  WK-ADM-ARG1
                                               WK-ADM-ARG2
                                               WK-ADM-ARG3
                                               WK-ADM-ARG4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** CALL CBLDCADM  END  ***"
      D    DISPLAY  CNS-PGM-ID":CBLDCADMの出力："
      D    DISPLAY  CNS-PGM-ID":データ名B(ステータスコード)  =["
      D             STATUS-CODE         OF  WK-ADM-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":データ名C(シェルの終了コード)=["
      D             DESCRIPTOR          OF  WK-ADM-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":データ名J                    =["
      D             RESULT              OF  WK-ADM-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":データ名H(データ名Jの長さ)   =["
      D             RESULT-LENG         OF  WK-ADM-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":データ名M                    =["
      D             ERR-RESULT          OF  WK-ADM-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":データ名K(データ名Mの長さ)   =["
      D             ERR-RESULT-LENG     OF  WK-ADM-ARG4"]"
      *-----------------------------------------------------------------
      *----------  ステータスコード＝'00000'(正常)の場合
           IF  STATUS-CODE              OF  WK-ADM-ARG1
            NOT= CNS-X-00000
           THEN
      *----------  ワークリターンコード ← 16（システムエラー)
               MOVE  CNS-RTN-BT16       TO  WK-RTN-CD
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  STATUS-CODE        OF  WK-ADM-ARG1
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  ERR-RESULT         OF  WK-ADM-ARG4
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-----------------------------------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CBLDCADMシステム運用の管理をコール"
      D             " END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-CBLDCADM-EXT.
           EXIT.
      ******************************************************************
      *    3.3.後処理
      ******************************************************************
       END-RTN                SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [END-RTN]"                     GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  START  ***"
      D    DISPLAY  CNS-PGM-ID ":RPCオープンフラグ=["FLG-RPC-OPEN"]"
      *-----------------------------------------------------------------
      *----------  3.3.1.CBLDADM利用終了処理
           IF  FLG-RPC-OPEN = CNS-ON
           THEN
             PERFORM  CBLDCRPC-CLOSE-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":CBLDCRPC(CLOSE)処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RPCオープンフラグ=["FLG-RPC-OPEN"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルオープンフラグ=["
      D             FLG-FILE2-OPEN"]"
      *-----------------------------------------------------------------
      *----------  3.3.3.FTP要否の判定用のTMPファイルをクローズする
           IF  FLG-FILE2-OPEN = CNS-ON
           THEN
             PERFORM  FILE2-CLOSE-RTN
           ELSE
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルをクローズしない"
      *-----------------------------------------------------------------
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルオープンフラグ=["
      D             FLG-FILE2-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":明細リストファイルオープンフラグ=["
      D             FLG-FILE3-OPEN"]"
      *-----------------------------------------------------------------
      *----------  3.3.4.明細リストファイルをクローズする
           IF  FLG-FILE3-OPEN = CNS-ON
           THEN
             PERFORM  FILE3-CLOSE-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":明細リストファイルをクローズしない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":明細リストファイルオープンフラグ=["
      D             FLG-FILE3-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":ワーク子業務タスク起動フラグ=["
      D             FLG-SUB-GYOMU-TASK-KIDOU"]"
      *-----------------------------------------------------------------
      *----------  3.3.5.後続業務タスク登録処理
           IF  FLG-SUB-GYOMU-TASK-KIDOU = CNS-1
           THEN
             PERFORM  CALL-SCZY1150-RTN
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":FLG-ORA-CONNECT  =["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  3.3.6.ＤＢコミットリリース処理
           IF  FLG-ORA-CONNECT  =  CNS-ON
           THEN
             PERFORM  COMMIT-ORA-REL-RTN
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":ＤＢコミットリリースしない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  3.3.7.処理件数メッセージ出力処理
           PERFORM  SYORI-CNT-MSG-RTN
      *----------  3.3.3.終了メッセージ出力処理
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
           IF  WK-RTN-CD = CNS-RTN-BT0  OR
               WK-RTN-CD = CNS-RTN-BT2
           THEN
             MOVE  CNS-N                TO  WK-ERR-SYUBETU
           ELSE
             MOVE  CNS-U                TO  WK-ERR-SYUBETU
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークエラー種別=["WK-ERR-SYUBETU"]"
      *-----------------------------------------------------------------
           PERFORM  END-MSG-OUT-RTN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  後処理  END  ***"
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [END-RTN]"                     GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           STOP RUN  WK-RTN-CD.
      ******************************************************************
      *              CBLDADM利用終了処理
      ******************************************************************
       CBLDCRPC-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":*** CBLDADM利用終了処理 START ***"
      D    DISPLAY  CNS-PGM-ID ":CBLDCRPC REQUEST =["
      D             REQUEST  OF PARM-CLOSE-ARG"]"
      D    DISPLAY  CNS-PGM-ID ":****  CALL CBLDCRPC START  ****"
      *-----------------------------------------------------------------
      *----------  ＲＰＣ環境の初期化
           CALL  "CBLDCRPC"             USING  PARM-CLOSE-ARG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":リターンコード=["
      D             STATUS-CODE OF PARM-CLOSE-ARG"]"
      D    DISPLAY  CNS-PGM-ID ":****  CALL CBLDCRPC END  ****"
      *-----------------------------------------------------------------
           IF  STATUS-CODE    OF PARM-CLOSE-ARG NOT = "00000"
           THEN
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-020
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  STATUS-CODE          OF PARM-OPEN-ARG
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  "CBLDCRPCクローズエラー"
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           ELSE
             MOVE  CNS-OFF  TO  FLG-RPC-OPEN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":**** CBLDADM利用終了処理END ****"
      *-----------------------------------------------------------------
           CONTINUE.
       CBLDCRPC-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *  FTP要否の判定用のTMPファイルをクローズする
      ******************************************************************
       FILE2-CLOSE-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE2-CLOSE-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       "*** FTP要否の判定用のTMPファイルをクローズ処理 START ***"
      D    DISPLAY  CNS-PGM-ID":FLG-FILE2-OPEN=["FLG-FILE2-OPEN"]"
      *-----------------------------------------------------------------
           CLOSE  FTP-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ST-FTPFILE(CLOSE)=["ST-FTPFILE"]"
      *-----------------------------------------------------------------
           IF  ST-FTPFILE = "00"
           THEN
             MOVE  CNS-OFF            TO  FLG-FILE2-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE2-OPEN=["FLG-FILE2-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルをCLOSE ERROR !"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-16                  TO  WK-RTN-CD
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID                  OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-021
               TO  ERR-POS                     OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-230
               TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(ST-FTPFILE)
               TO  DETAIL-RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERR-CLOSE
               TO  FREE-MSG                    OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D       "*** FTP要否の判定用のTMPファイルをクローズ処理 END ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE2-CLOSE-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       FILE2-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *  明細リストファイルをクローズする
      ******************************************************************
       FILE3-CLOSE-RTN        SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE3-CLOSE-RTN]"             GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":*** 明細リストファイルをクローズ処理 START ***"
      D    DISPLAY  CNS-PGM-ID":FLG-FILE3-OPEN=["FLG-FILE3-OPEN"]"
      *-----------------------------------------------------------------
           CLOSE  LIST-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ST-LISTFILE(CLOSE)=["ST-LISTFILE"]"
      *-----------------------------------------------------------------
           IF  ST-LISTFILE = "00"
           THEN
             MOVE  CNS-OFF            TO  FLG-FILE3-OPEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-FILE3-OPEN=["FLG-FILE3-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":明細リストファイルをCLOSE ERROR !"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
             MOVE  CNS-RTN-16                  TO  WK-RTN-CD
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID                  OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-022
               TO  ERR-POS                     OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-230
               TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  FUNCTION NUMVAL(ST-LISTFILE)
               TO  DETAIL-RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
             MOVE  CNS-ERR-CLOSE
               TO  FREE-MSG                    OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             "*** 明細リストファイルをクローズ処理 END ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [FILE3-CLOSE-RTN]"             GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       FILE3-CLOSE-EXT.
           EXIT.
      ******************************************************************
      *    【SCZY1150】実行状況管理ＩＮＳルーチンをコール
      ******************************************************************
       CALL-SCZY1150-RTN      SECTION.
      *-------------------------DEBUG-----------------------------------
      D    DISPLAY  CNS-PGM-ID"***** 【SCZY1150】をコール  START  *****"
      *-----------------------------------------------------------------
      *----------  ファイルパスを取得する
           INITIALIZE  PARM-SCZY1150-INOUT
                       PARM-RTNPKG
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  SYORI-JIKOU-YMD        OF  PARM-SCZY1150-ARG1
      *----------  ログインユーザ会社コード
           MOVE  WK-KIDOU-LOGIN-CMP-CD
             TO  LOGIN-CMP-CD           OF  PARM-SCZY1150-ARG1
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1150-ARG1
      *----------  起動処理分類
           MOVE  CNS-KIDOU-SYORI-KBN-A
             TO  KIDOU-SYORI-KBN        OF  PARM-SCZY1150-ARG2
      *----------  タスクスケジュールID
           MOVE  WK-TSK-SCHE-ID
             TO  TASK-SCHEDULE-ID       OF  PARM-SCZY1150-ARG3
      *----------  タスクスケジュールID
           MOVE  SPACE
             TO  TASK-SCHEDULE-UN-CD    OF  PARM-SCZY1150-ARG3
      *----------  業務タスクID
           MOVE  WK-GOU-GYOMU-TASK-ID
             TO  GYOMU-TASK-ID          OF  PARM-SCZY1150-ARG4
      *----------  帳票作成単位
           MOVE  SPACE
             TO  REP-CREATE-TANI        OF  PARM-SCZY1150-ARG4
      *----------  ファイル種別
           MOVE  SPACE
             TO  REP-OUT-KBN            OF  PARM-SCZY1150-ARG4
      *----------  プリンタID
           MOVE  SPACE
             TO  PRINTER-ID             OF  PARM-SCZY1150-ARG4
      *----------  入力電文
           MOVE  WK-DEBUN-INFO
             TO  INPUT-DENBUN           OF  PARM-SCZY1150-ARG4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日                  =["
      D             WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク起動ログインユーザ会社コード=["
      D             WK-KIDOU-LOGIN-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード              =["
      D             WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワークタスクスケジュールID        =["
      D             WK-TSK-SCHE-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク後続業務タスクID            =["
      D             WK-GOU-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク電文情報                    =["
      D             WK-DEBUN-INFO"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.処理実行日                      =["
      D             SYORI-JIKOU-YMD     OF  PARM-SCZY1150-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.ログインユーザ会社コード        =["
      D             LOGIN-CMP-CD        OF  PARM-SCZY1150-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ARG1.利用会社コード                  =["
      D             RIYO-CMP-CD         OF  PARM-SCZY1150-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.起動経路                        =["
      D             KIDOU-KIRO          OF  PARM-SCZY1150-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG2.起動処理分類                    =["
      D             KIDOU-SYORI-KBN     OF  PARM-SCZY1150-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":ARG3.タスクスケジュールID            =["
      D             TASK-SCHEDULE-ID    OF  PARM-SCZY1150-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":ARG3.タスクスケジュールユニークコード=["
      D             TASK-SCHEDULE-UN-CD OF  PARM-SCZY1150-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":ARG4.業務タスクID                    =["
      D             GYOMU-TASK-ID       OF  PARM-SCZY1150-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":ARG4.帳票作成単位                    =["
      D             REP-CREATE-TANI     OF  PARM-SCZY1150-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":ARG4.ファイル種別                    =["
      D             REP-OUT-KBN         OF  PARM-SCZY1150-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":ARG4.プリンタID                      =["
      D             PRINTER-ID          OF  PARM-SCZY1150-ARG4"]"
      D    DISPLAY  CNS-PGM-ID":ARG4.入力電文                        =["
      D             INPUT-DENBUN        OF  PARM-SCZY1150-ARG4"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1150"             USING  PARM-SCZY1150-ARG1
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1150 END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1150)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG =["
      D             COUNTER             OF PARM-RTNPKG "]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
      *----------  (正常)の場合
             WHEN  CNS-RTN-000
               INITIALIZE  PARM-RTNPKG
      *----------  (権限なし)の場合
             WHEN  CNS-RTN-130
               INITIALIZE  PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークメッセージ件数=["WK-MSG-CNT"]"
      *-----------------------------------------------------------------
               COMPUTE  WK-MSG-CNT = WK-MSG-CNT + CNS-1
               MOVE  CNS-MSG-I900153
                 TO  WK-GYOMU-MSG-ID   OF  WK-MESSAGE-AREA(WK-MSG-CNT)
               MOVE  WK-GOU-GYOMU-TASK-ID
                 TO  WK-GYOMU-TIKAN-MOJI
                                      OF  WK-MESSAGE-AREA(WK-MSG-CNT)
               STRING  CNS-FREE-MSG1,
                       WK-GOU-GYOMU-TASK-ID,
                       CNS-FREE-MSG2
                       DELIMITED BY SIZE
                   INTO  WK-GYOMU-FREE-MSG
                                      OF  WK-MESSAGE-AREA(WK-MSG-CNT)
               END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークメッセージ件数=["WK-MSG-CNT"]"
      D    DISPLAY  CNS-PGM-ID":WK-MESSAGE-AREA.WK-GYOMU-MSG-ID("
      D             WK-MSG-CNT")=["WK-GYOMU-MSG-ID
      D                               OF  WK-MESSAGE-AREA(WK-MSG-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MESSAGE-AREA.WK-GYOMU-TIKAN-MOJI("
      D             WK-MSG-CNT")=["WK-GYOMU-TIKAN-MOJI
      D                               OF  WK-MESSAGE-AREA(WK-MSG-CNT)"]"
      D    DISPLAY  CNS-PGM-ID":WK-MESSAGE-AREA.WK-GYOMU-FREE-MSG("
      D             WK-MSG-CNT")=["WK-GYOMU-FREE-MSG
      D                               OF  WK-MESSAGE-AREA(WK-MSG-CNT)"]"
      *-----------------------------------------------------------------
      *----------  「3.5.1.メッセージ登録処理」を行う
               PERFORM  CALL-SCZY7080-RTN
             WHEN  OTHER
      *----------  ワークリターンコード ← 16(システムエラー)
               MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-023
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-EVALUATE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID"***** 【SCZY1150】をコール  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY1150-EXT.
           EXIT.
      ******************************************************************
      *    3.5.1.メッセージ登録処理
      ******************************************************************
       CALL-SCZY7080-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***メッセージ登録処理 START ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7080-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD
               TO  RIYO-CMP-CD          OF  PARM-SCZY7080-ARG1
      *----------  処理実行日
             MOVE  WK-SYORI-YMD
               TO  SYORI-YMD            OF  PARM-SCZY7080-ARG1
      *----------  起動ID
             MOVE  WK-KIDOU-ID
               TO  KIDOU-ID             OF  PARM-SCZY7080-ARG1
      *----------  業務タスクID
             MOVE  WK-GYOMU-TASK-ID
               TO  GYOMU-TASK-ID        OF  PARM-SCZY7080-ARG1
      *----------  メッセージエリア
             MOVE  WK-GYOMU-ERR-INFO    TO  PARM-SCZY7080-ARG2
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク利用会社コード=["WK-RIYO-CMP-CD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク処理実行日    =["WK-SYORI-YMD"]"
      D    DISPLAY  CNS-PGM-ID":ワーク起動ID        =["WK-KIDOU-ID"]"
      D    DISPLAY  CNS-PGM-ID":ワーク業務タスクID=["WK-GYOMU-TASK-ID"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7080.利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7080.処理実行日=["
      D             SYORI-YMD           OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7080.起動ID    =["
      D             KIDOU-ID            OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7080.業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY7080-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7080.ARG2.メッセージID(1)=["
      D             MSG-ID              OF  PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7080.ARG2.置換文字(1)(1) =["
      D             TIKAN-MOJI          OF  PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7080.ARG2.フリーメッセージ(1) =["
      D             FREE-MSG             OF  PARM-SCZY7080-ARG2(1)"]"
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7080"             USING  PARM-SCZY7080-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  CALL SCZY7080  END  ***"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY7080)        =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG=["
      D             COUNTER              OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG=["PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
             INITIALIZE  PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***メッセージ登録処理 正常***"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***メッセージ登録処理 エラー***"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード ← 16（システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード =["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-024
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE                TO  FREE-MSG
                                        OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
           INITIALIZE  WK-GYOMU-ERR-INFO
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***メッセージ登録処理 END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       CALL-SCZY7080-EXT.
           EXIT.
      ******************************************************************
      *    3.3.6.ＤＢコミットリリース処理
      ******************************************************************
       COMMIT-ORA-REL-RTN     SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [COMMIT-ORA-REL-RTN]"          GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミットリリース処理  START  ***"
      *-----------------------------------------------------------------
      *----------  COMMIT
           EXEC SQL
               COMMIT RELEASE
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(COMMIT RELEASE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             MOVE  CNS-OFF              TO  FLG-ORA-CONNECT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミットリリース処理 正常"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢコミットリリース処理 システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード ← 16（システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  CNS-COM-RELEASE-ERR
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢコミットリリース処理  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [COMMIT-ORA-REL-RTN]"          GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       COMMIT-ORA-REL-EXT.
           EXIT.
      ******************************************************************
      *    3.3.7.処理件数メッセージ出力処理
      ******************************************************************
       SYORI-CNT-MSG-RTN      SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  処理件数メッセージ出力処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7040-INOUT
      *----------  接続用パラメータの設定
      *----------  テーブル・ファイル数
           MOVE  CNS-1
             TO  TABLE-FILE-NUM         OF  ARG1
                                        OF  PARM-SCZY7040-INOUT
      *----------  識別子(1)
           MOVE  WK-LIST-FILE-NAME
             TO  IDENT-ID               OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-1)
      *----------  対象処理(1)
           MOVE  CNS-READ
             TO  OBJECT-DISPOSAL        OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-1)
      *----------  取得件数(1)
           MOVE  WK-READ-CNT
             TO  DISPOSAL-NUM           OF  ARG2
                                        OF  PARM-SCZY7040-INOUT(CNS-1)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク明細リストファイル名 =["
      D             WK-LIST-FILE-NAME"]"
      D    DISPLAY  CNS-PGM-ID":ワーク読み込む件数         =["
      D             WK-READ-CNT"]"
      D    DISPLAY  CNS-PGM-ID":SCZY7040-ARG:"
      D    DISPLAY  CNS-PGM-ID":テーブル・ファイル数=["
      D             TABLE-FILE-NUM      OF ARG1
      D                                 OF PARM-SCZY7040-INOUT   "]"
      D    DISPLAY  CNS-PGM-ID":識別子(1)       =["
      D             IDENT-ID            OF  ARG2
      D                               OF  PARM-SCZY7040-INOUT(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":対象処理(1)     =["
      D             OBJECT-DISPOSAL     OF  ARG2
      D                               OF  PARM-SCZY7040-INOUT(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":取得件数(1)     =["
      D             DISPOSAL-NUM        OF  ARG2
      D                               OF  PARM-SCZY7040-INOUT(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7040 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7040"             USING  PARM-SCZY7040-INOUT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7040 END  ***"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  処理件数メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SYORI-CNT-MSG-EXT.
           EXIT.
      ******************************************************************
      *    3.3.8.終了メッセージ出力処理
      ******************************************************************
       END-MSG-OUT-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  終了メッセージ出力処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":WK-ERR-SYUBETU=["WK-ERR-SYUBETU"]"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY7020-INOUT
      *----------  エラー種別
           MOVE  WK-ERR-SYUBETU
             TO  ERR-SYUBETU            OF  PARM-SCZY7020-ARG1
      *----------  プログラムID
           MOVE  CNS-PGM-ID
             TO  PGM-ID                 OF  PARM-SCZY7020-ARG2
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY7020-ARG2
      *----------  基準日
           MOVE  WK-SYORI-YMD
             TO  KJN-YMD                OF  PARM-SCZY7020-ARG2
      *----------  実行処理ID
           MOVE  WK-GYOMU-TASK-ID
             TO  JIKOU-SYORI-ID         OF  PARM-SCZY7020-ARG2
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  KIDOU-ID               OF  PARM-SCZY7020-ARG2
           IF  WK-ERR-SYUBETU  =  CNS-N  OR
               WK-ERR-SYUBETU  =  CNS-U
           THEN
             INITIALIZE  PARM-RTNPKG
           ELSE
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SCZY7020-ARG:"
      D    DISPLAY  CNS-PGM-ID":ワークエラー種別=["
      D             WK-ERR-SYUBETU"]"
      D    DISPLAY  CNS-PGM-ID":エラー種別    =["
      D             ERR-SYUBETU         OF  PARM-SCZY7020-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":プログラムID  =["
      D             PGM-ID              OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":実行処理ID    =["
      D             JIKOU-SYORI-ID      OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":基準日        =["
      D             KJN-YMD             OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":起動ID        =["
      D             KIDOU-ID            OF  PARM-SCZY7020-ARG2"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG   =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 START  ***"
      *-----------------------------------------------------------------
           CALL  "SCZY7020"             USING  PARM-SCZY7020-INOUT
                                               PARM-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY7020 END  ***"
      D    DISPLAY  CNS-PGM-ID":***  終了メッセージ出力処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-MSG-OUT-EXT.
           EXIT.
      ******************************************************************
      *    3.4.エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [ERR-RTN]"                     GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      D    DISPLAY  CNS-PGM-ID ":RPCオープンフラグ=["FLG-RPC-OPEN"]"
      *-----------------------------------------------------------------
      *----------  3.4.1.CBLDADM利用終了処理
           IF  FLG-RPC-OPEN = CNS-ON
           THEN
             MOVE  CNS-OFF                TO  FLG-RPC-OPEN
      *----------  ＲＰＣ環境の初期化
             CALL  "CBLDCRPC"             USING  PARM-CLOSE-ARG
      *----------  ＲＰＣ環境の初期化
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RPCオープンフラグ=["FLG-RPC-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":CBLDCRPC(CLOSE)処理する"
      D    DISPLAY  CNS-PGM-ID":STATUS-CODE(CBLDCRPC) =["
      D             STATUS-CODE    OF PARM-CLOSE-ARG"]"
      *-----------------------------------------------------------------
             IF  STATUS-CODE    OF PARM-CLOSE-ARG NOT = "00000"
             THEN
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-026
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  STATUS-CODE          OF PARM-OPEN-ARG
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  "CBLDCRPCクローズエラー"
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             ELSE
               CONTINUE
             END-IF
           ELSE
             CONTINUE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":CBLDCRPC(CLOSE)処理しない"
      *-----------------------------------------------------------------
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RPCオープンフラグ=["FLG-RPC-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
           IF  FLG-ORA-CONNECT  =  CNS-ON
           THEN
             PERFORM  ROLLBACK-ORA-REL-RTN
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":**** ＤＢロールバックリリース処理"
      D            "しない****"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルオープンフラグ=["
      D             FLG-FILE2-OPEN"]"
      *-----------------------------------------------------------------
      *----------  3.4.4.FTP要否の判定用のTMPファイルをクローズする
           IF  FLG-FILE2-OPEN = CNS-ON
           THEN
             MOVE  CNS-OFF            TO  FLG-FILE2-OPEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルをクローズする"
      *-----------------------------------------------------------------
             CLOSE  FTP-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ST-FTPFILE(CLOSE)=["ST-FTPFILE"]"
      *-----------------------------------------------------------------
             IF  ST-FTPFILE = "00"
             THEN
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルをCLOSE ERROR !"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-16                  TO  WK-RTN-CD
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                  OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-027
                 TO  ERR-POS                     OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-230
                 TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(ST-FTPFILE)
                 TO  DETAIL-RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  CNS-ERR-CLOSE
                 TO  FREE-MSG                    OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルをクローズしない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":FTP要否の判定用のTMPファイルオープンフラグ=["
      D             FLG-FILE2-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":明細リストファイルオープンフラグ=["
      D             FLG-FILE3-OPEN"]"
      *-----------------------------------------------------------------
      *----------  3.4.5.明細リストファイルをクローズする
           IF  FLG-FILE3-OPEN = CNS-ON
           THEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":明細リストファイルをクローズする"
      *-----------------------------------------------------------------
             MOVE  CNS-OFF            TO  FLG-FILE3-OPEN
             CLOSE  LIST-FILE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ST-LISTFILE(CLOSE)=["ST-LISTFILE"]"
      *-----------------------------------------------------------------
             IF  ST-LISTFILE = "00"
             THEN
               CONTINUE
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":明細リストファイルをCLOSE ERROR !"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード
               MOVE  CNS-RTN-16                  TO  WK-RTN-CD
      *----------  エラー検知プログラムID
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID                  OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-028
                 TO  ERR-POS                     OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-230
                 TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG           OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  FUNCTION NUMVAL(ST-LISTFILE)
                 TO  DETAIL-RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  CNS-ERR-CLOSE
                 TO  FREE-MSG                    OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD"]"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名      =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                  =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード              =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード          =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ            =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
             END-IF
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":明細リストファイルをクローズしない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":明細リストファイルオープンフラグ=["
      D             FLG-FILE3-OPEN"]"
      *-----------------------------------------------------------------
      *---------- 3.4.6.SCZY1170リターンパッケージセットルーチンをコール
           PERFORM  ERR-MSG-OUT-RTN
      *---------- 3.4.7.終了メッセージ出力処理
           MOVE  CNS-S                  TO  WK-ERR-SYUBETU
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークエラー種別=["WK-ERR-SYUBETU"]"
      *-----------------------------------------------------------------
           PERFORM  END-MSG-OUT-RTN
      *----------  プログラム終了(リターンコード=16)
           MOVE  CNS-RTN-BT16           TO  WK-RTN-CD
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID":ワークリターンコード=["WK-RTN-CD "]"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [ERR-RTN]"                     GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           STOP RUN  WK-RTN-CD.
      ******************************************************************
      *    3.4.4.ＤＢロールバックリリース処理
      ******************************************************************
       ROLLBACK-ORA-REL-RTN   SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [ROLLBACK-ORA-REL-RTN]"        GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  ＤＢロールバックリリース処理  START  ***"
      *-----------------------------------------------------------------
           MOVE  CNS-OFF              TO  FLG-ORA-CONNECT
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-ORA-CONNECT=["FLG-ORA-CONNECT"]"
      *-----------------------------------------------------------------
      *----------  ROLLBACK
           EXEC SQL
               ROLLBACK RELEASE
           END-EXEC
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(ROLLBACK RELEASE)=["SQLCODE"]"
      *-----------------------------------------------------------------
      *----------  SQLCODEのチェック
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢロールバックリリース処理 正常"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":ＤＢロールバックリリース処理"
      D             " システムエラー"
      *-----------------------------------------------------------------
      *----------  ワークリターンコード ← 16（システムエラー)
             MOVE  CNS-RTN-BT16         TO  WK-RTN-CD
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-RTN-CD=["WK-RTN-CD"]"
      *-----------------------------------------------------------------
      *----------  エラー検知プログラムID
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-029
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  CNS-ROLLBACK-ERR
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
           END-IF
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D               ":***  ＤＢロールバックリリース処理  END  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *-------------------<DEBUG>---------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [ROLLBACK-ORA-REL-RTN]"        GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       ROLLBACK-ORA-REL-EXT.
           EXIT.
      ******************************************************************
      *    エラー情報追加処理
      ******************************************************************
       ERR-MSG-OUT-RTN        SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー情報追加処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名          =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                      =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                  =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード              =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチンをコールする
           CALL   "SCZY1170"            USING  PARM-SCZY1170-ARG1
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  CALL SCZY1170 END  ***"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG           =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER OF PARM-RTNPKG=["
      D             COUNTER             OF PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":***  エラー情報追加処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-MSG-OUT-EXT.
           EXIT.
      ******************************************************************
      *        テーブルID取得処理
      ******************************************************************
       TBL-ID-INIT-RTN        SECTION.
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  START  ****"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *---------- テーブルID取得処理
           MOVE  WK-RIYO-CMP-CD
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  実行状況管理
           MOVE  CNS-TBL-TKDYAA31
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":利用会社コード=["RIYO-CMP-CD
      D                                 OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID ":テーブルID1=["TBL-ID
      D                                 OF  PARM-SCZY1160-ARG1(1)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":RTN-CD(SCZY1160)=["RTN-CD
      D    OF  PARM-RTNPKG(COUNTER      OF PARM-RTNPKG)"]"
      *-----------------------------------------------------------------
           IF  RTN-CD  OF  PARM-RTNPKG(COUNTER   OF PARM-RTNPKG)
             =  CNS-RTN-000
           THEN
             INITIALIZE  PARM-RTNPKG
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKDYAA31
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY CNS-PGM-ID ":編集後テーブルID1=["WK-TBL-TKDYAA31"]"
      *-----------------------------------------------------------------
           ELSE
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-031
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  RTN-CD               OF  PARM-RTNPKG
                                            (COUNTER   OF PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-----------------------<DEBUG>-----------------------------------
      D    DISPLAY  CNS-PGM-ID ":****  テーブルID取得処理  END  ****"
      *-----------------------------------------------------------------
           CONTINUE.
       TBL-ID-INIT-EXT.
           EXIT.
      ******************************************************************
      *    3.2.0.ODW送信ファイルの業務タスクのチェック処理
      ******************************************************************
       TKDYAA31-CK-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** ODW送信ファイルの業務タスク"
      D                              "のチェック処理  START ***"
      *-----------------------------------------------------------------
      *----------  SQL作成(PREPARE)
           PERFORM  PREPARE-RTN
      *----------  SQL作成(EXECUTE)
           PERFORM  EXECUTE-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  ODW送信ファイルの業務タスク"
      D                                "のチェック処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TKDYAA31-CK-EXT.
           EXIT.
      ******************************************************************
      *    SQL作成(PREPARE)
      ******************************************************************
       PREPARE-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SQL作成(PREPARE) START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
                       SQL-SELECT-TKDYAA31
      *----------  テーブルTKDYAA31
           MOVE  WK-TBL-TKDYAA31
             TO  SQL-TBL-TKDYAA31-1     OF  SQL-SELECT-TKDYAA31
           MOVE  WK-TBL-TKDYAA31
             TO  SQL-TBL-TKDYAA31-2     OF  SQL-SELECT-TKDYAA31
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD
             TO  HST-RIYO-CMP-CD        OF  HST-TKDYAA31-WHERE
      *----------  処理実行日
           MOVE  WK-SYORI-YMD
             TO  HST-SYORI-YMD          OF  HST-TKDYAA31-WHERE
      *----------  起動ID
           MOVE  WK-KIDOU-ID
             TO  HST-KIDOU-ID           OF  HST-TKDYAA31-WHERE
      *----------  業務タスクID
           MOVE  WK-GYOMU-TASK-ID
             TO  HST-GYOMU-TASK-ID      OF  HST-TKDYAA31-WHERE
           MOVE  SQL-SELECT-TKDYAA31
             TO  SQLSTMT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLSTMT         =["SQLSTMT"]"
      D    DISPLAY  CNS-PGM-ID  ":利用会社コード=["
      D             HST-RIYO-CMP-CD OF HST-TKDYAA31-WHERE"]"
      D    DISPLAY  CNS-PGM-ID ":処理実行日    =["
      D             HST-SYORI-YMD OF HST-TKDYAA31-WHERE"]"
      D    DISPLAY  CNS-PGM-ID ":起動ＩＤ      =["
      D             HST-KIDOU-ID OF HST-TKDYAA31-WHERE"]"
      D    DISPLAY  CNS-PGM-ID ":業務タスクID  =["
      D             HST-GYOMU-TASK-ID OF HST-TKDYAA31-WHERE"]"
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
           EXEC  SQL
             PREPARE  S1  FROM  :SQLSTMT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(PREPARE)       =["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE = CNS-SQL-NORMAL
           THEN
             CONTINUE
           ELSE
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
             MOVE  CNS-POS-032
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
             MOVE  SQLSTMT
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SQL作成(PREPARE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       PREPARE-EXT.
           EXIT.
      ******************************************************************
      *    SQL作成(EXECUTE)
      ******************************************************************
       EXECUTE-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SQL作成(EXECUTE) START  ***"
      *-----------------------------------------------------------------
           EXEC SQL EXECUTE S1
           USING  :HST-TKDYAA31-SELECT.HST-RIYO-CMP-CD,
                  :HST-TKDYAA31-WHERE.HST-RIYO-CMP-CD,
                  :HST-TKDYAA31-WHERE.HST-SYORI-YMD,
                  :HST-TKDYAA31-WHERE.HST-KIDOU-ID,
                  :HST-TKDYAA31-WHERE.HST-GYOMU-TASK-ID,
                  :HST-TKDYAA31-WHERE.HST-RIYO-CMP-CD,
                  :HST-TKDYAA31-WHERE.HST-SYORI-YMD
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(EXECUTE)= [" SQLCODE "]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               CONTINUE
             WHEN  CNS-SQL-NOTFOUND
               PERFORM  END-RTN
             WHEN  OTHER
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
               MOVE  CNS-POS-033
                 TO  ERR-POS              OF  PARM-SCZY1170-ARG1
               MOVE  CNS-RTN-900
                 TO  RTN-CD               OF  PARM-SCZY1170-ARG1
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
               MOVE  CNS-DETAIL-1
                 TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
               MOVE  SQLSTMT
                 TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名 =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション             =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード         =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード     =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ=["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ       =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** SQL作成(EXECUTE)  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       EXECUTE-EXT.
           EXIT.
