      ******************************************************************
      *$Header$
      ******************************************************************
      *
      * システムＩＤ   : T-STAR
      * システム名称   : 次期TSTARシステム
      * プログラムＩＤ : SMZJ1710
      * プログラム名称 : 再計算データ削除
      * 処理概要       : 銘柄別断面情報より、再計算断面を削除する。
      * 参照ＤＢ       :
      * 引数           : IN  銘柄別断面情報
      *                : OUT RTNパッケージ
      * 改訂履歴
      * 年月日     区分  所属       担当者  内容
      * ---------- -------------------------------------------
      * 20080129   新規  SCS        于 瓊   新規作成
      * 20080610   修正  SCS        張 克   テーマMZ-001対応
      * 20081230   修正  SCS        徐曉俊  連結テスト障害対応（0001050）
      * 20090311   修正  SCS        王飛    残タスク199 202対応
      * 20090317   修正  SCS        王飛    障害対応（0001541）
      * 20090723   修正  SCS        顧建鋒  総障1412
      * 20090727   修正  SCS        王飛    テーマ1771
      * 20090921   修正  SCS        王飛    総合障害2690
      * 20091222   修正  SCS        王飛    テーマ1075
      * 20100225   修正  SCS        李娟    GIPS2.0性能
      * 20100316   修正  SCS        陳曄    GIPS2.0性能
      * 20110421   修正  SCS        シャ建  性能改善対応
      * 20120409   修正  SCS        孫炯    テーマ3380
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SMZJ1710.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-01-29.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id$".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
         05  CNS-MZCNS.
           COPY "MZCNS.cpy".
      *----------  プログラム名
         05  CNS-PGM-ID            PIC  X(08)  VALUE "SMZJ1710".
      *----------  銘柄別断面情報.銘柄種類
         05  CNS-MEG-CD-SHRU-1     PIC  X(01)  VALUE  "1".
         05  CNS-MEG-CD-SHRU-2     PIC  X(01)  VALUE  "2".
         05  CNS-MEG-CD-SHRU-3     PIC  X(01)  VALUE  "3".
      *----------  再計算区分:'1'(再計算)
         05  CNS-SAI-CALC-KBN-1    PIC  X(01)  VALUE  "1".
      *----------  銘柄別断面情報.銘柄種類２
         05  CNS-MEG-CD-SHRU2-2    PIC  X(01)  VALUE  "2".
      *----------  銘柄別断面情報テーブル
         05  CNS-TBL-TKMZBW03      PIC  X(08)  VALUE  "TKMZBW03".
      *----------  残高異動テーブル
         05  CNS-TBL-TKMZZI00      PIC  X(08)  VALUE  "TKMZZI00".
      *----------  資金簿価異動テーブル
         05  CNS-TBL-TKMZSI00      PIC  X(08)  VALUE  "TKMZSI00".
      *----------  前払金管理テーブル
         05  CNS-TBL-TKMZMB00      PIC  X(08)  VALUE  "TKMZMB00".
      *----------  勘定異動テーブル
         05  CNS-TBL-TKMZKI00      PIC  X(08)  VALUE  "TKMZKI00".
         05  CNS-SQL-MSG-DELETE    PIC  X(17)  VALUE
                                               " SQL-MSG(DELETE):".
         05  CNS-ERR-33            PIC  X(22)  VALUE
               "SQL処理エラー（DELETE)".
         05  CNS-SQL-MSG-SELECT    PIC  X(17)  VALUE
                                               " SQL-MSG(SELECT):".
         05  CNS-ERR-34            PIC  X(22)  VALUE
               "SQL処理エラー（SELECT)".
         05  CNS-1                 PIC  9(01)  VALUE   1.
         05  CNS-2                 PIC  9(01)  VALUE   2.
      *----------  20100316  START
         05  CNS-X-CASH            PIC  X(04)  VALUE  "CASH".
         05  CNS-X-MA99            PIC  X(04)  VALUE  "MA99".
      *----------  20100316  END
      ******************************************************************
      *                フラグエリア
      ******************************************************************
       01  FLG-AREA.
      *---------- 銘柄別断面情報カーソルオープンフラグ
      *  05  FLG-MEG-OPEN          PIC  S9(01).                         @3212SEINO@@
      *----------  カーソルフェッチフラグ
         05  FLG-FETCH             PIC  9(01).
      *----------  20100316  START
         05  FLG-SKIP-6            PIC  9(01).
      *----------  20100316  END
      ******************************************************************@3212SEINO@@
      *         フラグエリア２(PREPARE,DECLAREスキップ判定用)           @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FLG-AREA2.                                                   @3212SEINO@@
      *---------- 銘柄別断面情報カーソルオープンフラグ                  @3212SEINO@@
         05  FLG-MEG-OPEN          PIC  S9(01).                         @3212SEINO@@
      *---------- 残高異動カーソルオープンフラグ１                      @3212SEINO@@
         05  FLG-DELETE-TKMZZI00-CR1                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 残高異動カーソルオープンフラグ２                      @3212SEINO@@
         05  FLG-DELETE-TKMZZI00-CR2                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 資金簿価異動カーソルオープンフラグ１                  @3212SEINO@@
         05  FLG-DELETE-TKMZSI00-CR1                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 資金簿価異動カーソルオープンフラグ２                  @3212SEINO@@
         05  FLG-DELETE-TKMZSI00-CR2                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 前払金管理カーソルオープンフラグ１                    @3212SEINO@@
         05  FLG-DELETE-TKMZMB00-CR1                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 前払金管理カーソルオープンフラグ２                    @3212SEINO@@
         05  FLG-DELETE-TKMZMB00-CR2                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 勘定異動カーソルオープンフラグ１                      @3212SEINO@@
         05  FLG-DELETE-TKMZKI00-CR1                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 勘定異動カーソルオープンフラグ２                      @3212SEINO@@
         05  FLG-DELETE-TKMZKI00-CR2                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 勘定異動カーソルオープンフラグ３                      @3212SEINO@@
         05  FLG-DELETE-TKMZKI00-CR3                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      *---------- 勘定異動カーソルオープンフラグ４                      @3212SEINO@@
         05  FLG-DELETE-TKMZKI00-CR4                                    @3212SEINO@@
                                   PIC  S9(01).                         @3212SEINO@@
      ******************************************************************@3212SEINO@@
      *                複数回起動チェック用スイッチ                     @3212SEINO@@
      ******************************************************************@3212SEINO@@
       01  FIRST-SW                PIC  X(03)  VALUE 'YES'.             @3212SEINO@@
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WORK-AREA.
         05  WK-RUN-SDATETIME      PIC  X(14).                          GUT2013
         05  WK-RUN-EDATETIME      PIC  X(14).                          GUT2013
         05  WK-DATA-IN.
      *----------  勘定異動／残高作成
           10  WK-KJIDO-ZANSK      PIC  9(01).
      *----------  基準日断面情報
           10  WK-KJN-YMD-DAME-JYHO-PARM.
      *----------  処理実行日
             15  WK-SYORI-YMD      PIC  S9(08).
      *----------  起動ID
             15  WK-KIDOU-ID       PIC  X(04).
      *----------  利用会社コード
             15  WK-RIYO-CMP-CD    PIC  X(04).
      *----------  ファンドコード
             15  WK-FUND-CD        PIC  X(12).
      *----------  ポートフォリオコード
             15  WK-PTF-CD         PIC  X(04).
      *----------  基準日
             15  WK-KJN-YMD        PIC  S9(08).
      *----------  銘柄別断面情報テーブル
         05  WK-TBL-TKMZBW03       PIC  X(13).
      *----------  ワーク残高異動テーブル
         05  WK-TBL-TKMZZI00       PIC  X(13).
      *----------  ワーク資金簿価異動テーブル
         05  WK-TBL-TKMZSI00       PIC  X(13).
      *----------  ワーク前払金管理テーブル
         05  WK-TBL-TKMZMB00       PIC  X(13).
      *----------  ワーク勘定異動テーブル
         05  WK-TBL-TKMZKI00       PIC  X(13).
      *---------- ポジション1
         05  WK-ERR-POS1           PIC  X(04).
      *---------- ポジション2
         05  WK-ERR-POS2           PIC  X(04).
      *---------- ポジション3
         05  WK-ERR-POS3           PIC  X(04).
      *---------- ポジション4
         05  WK-ERR-POS4           PIC  X(04).
      *---------- CNT-IDX
         05  WK-CNT-IDX            PIC  S9(06).
      *---------- ワーク合計件数
         05  WK-GOUKEI-KENSU       PIC  S9(06).
      *---------- ワーク区間件数
         05  WK-KUKAN-KENSU        PIC  S9(06).
      *----------  SELECTリーメッセージ
         05  WK-SELECT-FREE-MSG    PIC  X(2000).
         05  WK-SEL-AREA.
      *---------- ワーク銘柄別断面情報ホスト表
           10  WK-MEG-BETU-HST.
             15  WK-MEG-BETU-TBL   OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  開始基準日
               20  WK-KAISI-KJN-YMD
                                   PIC  S9(08).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  銘柄種類
               20  WK-MEG-CD-SHRU  PIC  X(01).
      *----------  銘柄種類２
               20  WK-MEG-CD-SHRU2 PIC  X(01).
      *----------  差分更新From日
               20  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *----------  再計算区分
               20  WK-SAI-CALC-KBN PIC  X(01).
      *---------- ワークCount_残高異動_1
           10  WK-ZANTK-COUNT1     PIC  S9(03).
      *---------- ワーク残高異動_DEL_BUF1
           10  WK-ZANTK-DEL-BUF1.
             15  WK-ZANTK-TBL      OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  開始基準日
               20  WK-KAISI-KJN-YMD
                                   PIC  S9(08).
      *---------- ワークCount_残高異動_2
           10  WK-ZANTK-COUNT2     PIC  S9(03).
      *---------- ワーク残高異動_DEL_BUF2
           10  WK-ZANTK-DEL-BUF2.
             15  WK-ZANTK-TBL      OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  差分更新From日
               20  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *---------- ワークCount_資金簿価異動_1
           10  WK-BOKA-COUNT1      PIC  S9(03).
      *---------- ワーク資金簿価異動_DEL_BUF1
           10  WK-BOKA-DEL-BUF1.
             15  WK-BOKA-TBL       OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  開始基準日
               20  WK-KAISI-KJN-YMD
                                   PIC  S9(08).
      *---------- ワークCount_資金簿価異動_2
           10  WK-BOKA-COUNT2      PIC  S9(03).
      *---------- ワーク資金簿価異動_DEL_BUF2
           10  WK-BOKA-DEL-BUF2.
             15  WK-BOKA-TBL       OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  差分更新From日
               20  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *---------- ワークCount_前払金管理_1
           10  WK-MAIBAI-COUNT1    PIC  S9(03).
      *---------- ワーク前払金管理_DEL_BUF1
           10  WK-MAIBAI-DEL-BUF1.
             15  WK-MAIBAI-TBL     OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  開始基準日
               20  WK-KAISI-KJN-YMD
                                   PIC  S9(08).
      *---------- ワークCount_前払金管理_2
           10  WK-MAIBAI-COUNT2    PIC  S9(03).
      *---------- ワーク前払金管理_DEL_BUF2
           10  WK-MAIBAI-DEL-BUF2.
             15  WK-MAIBAI-TBL     OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  差分更新From日
               20  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *---------- ワークCount_勘定異動_1
           10  WK-KANJYO-COUNT1    PIC  S9(03).
      *---------- ワーク勘定異動_DEL_BUF1
           10  WK-KANJYO-DEL-BUF1.
             15  WK-KANJYO-TBL     OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  開始基準日
               20  WK-KAISI-KJN-YMD
                                   PIC  S9(08).
      *---------- ワークCount_勘定異動_2
           10  WK-KANJYO-COUNT2    PIC  S9(03).
      *---------- ワーク勘定異動_DEL_BUF2
           10  WK-KANJYO-DEL-BUF2.
             15  WK-KANJYO-TBL     OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  差分更新From日
               20  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *---------- ワークCount_勘定異動_3
           10  WK-KANJYO-COUNT3    PIC  S9(03).
      *---------- ワーク勘定異動_DEL_BUF3
           10  WK-KANJYO-DEL-BUF3.
             15  WK-KANJYO-TBL     OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  開始基準日
               20  WK-KAISI-KJN-YMD
                                   PIC  S9(08).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  証券種別コード1
               20  WK-SEC-SBT-CD-1 PIC  X(04).
      *---------- ワークCount_勘定異動_4
           10  WK-KANJYO-COUNT4    PIC  S9(03).
      *---------- ワーク勘定異動_DEL_BUF4
           10  WK-KANJYO-DEL-BUF4.
             15  WK-KANJYO-TBL     OCCURS  100.
      *----------  利用会社コード
               20  WK-RIYO-CMP-CD  PIC  X(04).
      *----------  ファンドコード
               20  WK-FUND-CD      PIC  X(12).
      *----------  ポートフォリオコード
               20  WK-PTF-CD       PIC  X(04).
      *----------  銘柄コード
               20  WK-MEG-CD       PIC  X(15).
      *----------  資産負債・買建売建フラグ
               20  WK-TATE-FLG     PIC  X(01).
      *----------  玉ID
               20  WK-GYOKU-ID     PIC  X(10).
      *----------  基準日
               20  WK-KJN-YMD      PIC  S9(08).
      *----------  差分更新From日
               20  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *----------  証券種別コード
               20  WK-SEC-SBT-CD   PIC  X(04).
      *----------  証券種別コード1
               20  WK-SEC-SBT-CD-1 PIC  X(04).
      ******************************************************************
      *    ＯＲＡＣＬＥホスト変数定義
      ******************************************************************
      *----------  ＳＱＬコミュニケーション領域
           EXEC  SQL  INCLUDE  SQLCA             END-EXEC.
           EXEC  SQL  INCLUDE  ORACA             END-EXEC.
           EXEC  SQL  BEGIN   DECLARE   SECTION  END-EXEC.
       01  HST-AREA.
      *----------  銘柄別断面情報TBL(別紙1-15)
         05  H-TKMZBW03.
           10  H-TKMZBW03-SELECT   OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD     PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD         PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD          PIC  X(04).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD   PIC  S9(08).
      *----------  基準日
             15  H-KJN-YMD         PIC  S9(08).
      *----------  銘柄コード
             15  H-MEG-CD          PIC  X(15).
      *----------  証券種別コード
             15  H-SEC-SBT-CD      PIC  X(04).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG        PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID        PIC  X(10).
      *----------  銘柄種類
             15  H-MEG-CD-SHRU     PIC  X(01).
      *----------  銘柄種類２
             15  H-MEG-CD-SHRU2    PIC  X(01).
      *----------  差分更新From日
             15  H-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *----------  再計算区分
             15  H-SAI-CALC-KBN    PIC  X(01).
      *----------  銘柄別断面情報TBL(別紙1-15)
         05  H-TKMZBW03-WHERE.
      *----------  利用会社コード
           10  H-RIYO-CMP-CD-W     PIC  X(04).
      *----------  ファンドコード
           10  H-FUND-CD-W         PIC  X(12).
      *----------  ポートフォリオコード
           10  H-PTF-CD-W          PIC  X(04).
      *----------  処理実行日
           10  H-SYORI-YMD-W       PIC  S9(08).
      *----------  起動ID
           10  H-KIDOU-ID-W        PIC  X(04).
      *----------  基準日
           10  H-KJN-YMD-W         PIC  S9(08).
      *----------  勘定異動TBL(別紙1-16)
         05  H-TKMZKI00-D-1.
           10  H-TKMZKI00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  証券種別コード
             15  H-SEC-SBT-CD-D    PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG-D      PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID-D      PIC  X(10).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD-D PIC  S9(08).
      *----------  勘定異動TBL(別紙1-17)
         05  H-TKMZKI00-D-2.
           10  H-TKMZKI00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  証券種別コード
             15  H-SEC-SBT-CD-D    PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG-D      PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID-D      PIC  X(10).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  差分更新From日
             15  H-SABON-UPDATE-FROM-D
                                   PIC  S9(08).
      *----------  勘定異動TBL(別紙1-18)
         05  H-TKMZKI00-D-3.
           10  H-TKMZKI00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG-D      PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID-D      PIC  X(10).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD-D PIC  S9(08).
      *----------  証券種別コード
             15  H-SEC-SBT-CD      PIC  X(04).
      *----------  証券種別コード1
             15  H-SEC-SBT-CD-1    PIC  X(04).
      *----------  勘定異動TBL(別紙1-19)
         05  H-TKMZKI00-D-4.
           10  H-TKMZKI00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG-D      PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID-D      PIC  X(10).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  差分更新From日
             15  H-SABON-UPDATE-FROM-D
                                   PIC  S9(08).
      *----------  証券種別コード
             15  H-SEC-SBT-CD      PIC  X(04).
      *----------  証券種別コード1
             15  H-SEC-SBT-CD-1    PIC  X(04).
      *----------  残高異動TBL(別紙1-3)
         05  H-TKMZZI00-D.
           10  H-TKMZZI00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  証券種別コード
             15  H-SEC-SBT-CD-D    PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG-D      PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID-D      PIC  X(10).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD-D PIC  S9(08).
      *----------  残高異動TBL(別紙1-4)
         05  H-TKMZZI00-D-1.
           10  H-TKMZZI00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  証券種別コード
             15  H-SEC-SBT-CD-D    PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG-D      PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID-D      PIC  X(10).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  差分更新From日
             15  H-SABON-UPDATE-FROM-D
                                   PIC  S9(08).
      *----------  資金簿価異動TBL(別紙1-7)
         05  H-TKMZSI00-D.
           10  H-TKMZSI00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD-D PIC  S9(08).
      *----------  資金簿価異動TBL(別紙1-8)
         05  H-TKMZSI00-D-1.
           10  H-TKMZSI00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  差分更新From日
             15  H-SABON-UPDATE-FROM-D
                                   PIC  S9(08).
      *----------  前払金管理TBL(別紙1-9)
         05  H-TKMZMB00-D.
           10  H-TKMZMB00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  証券種別コード
             15  H-SEC-SBT-CD-D    PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG-D      PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID-D      PIC  X(10).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  開始基準日
             15  H-KAISI-KJN-YMD-D PIC  S9(08).
      *----------  前払金管理TBL(別紙1-10)
         05  H-TKMZMB00-D-1.
           10  H-TKMZMB00-TBL      OCCURS  100.
      *----------  利用会社コード
             15  H-RIYO-CMP-CD-D   PIC  X(04).
      *----------  ファンドコード
             15  H-FUND-CD-D       PIC  X(12).
      *----------  ポートフォリオコード
             15  H-PTF-CD-D        PIC  X(04).
      *----------  証券種別コード
             15  H-SEC-SBT-CD-D    PIC  X(04).
      *----------  銘柄コード
             15  H-MEG-CD-D        PIC  X(15).
      *----------  資産負債・買建売建フラグ
             15  H-TATE-FLG-D      PIC  X(01).
      *----------  玉ID
             15  H-GYOKU-ID-D      PIC  X(10).
      *----------  基準日
             15  H-KJN-YMD-D       PIC  S9(08).
      *----------  差分更新From日
             15  H-SABON-UPDATE-FROM-D
                                   PIC  S9(08).
         05  SQLSTMT               PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT1              PIC  X(350).                         @3212SEINO@@
         05  SQLSTMT2              PIC  X(350).                         @3212SEINO@@
         05  SQLSTMT3              PIC  X(250).                         @3212SEINO@@
         05  SQLSTMT4              PIC  X(250).                         @3212SEINO@@
         05  SQLSTMT5              PIC  X(350).                         @3212SEINO@@
         05  SQLSTMT6              PIC  X(350).                         @3212SEINO@@
         05  SQLSTMT7              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT8              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT9              PIC  X(400).                         @3212SEINO@@
         05  SQLSTMT10             PIC  X(400).                         @3212SEINO@@
           EXEC  SQL  END DECLARE       SECTION  END-EXEC.
      ******************************************************************
      *            SQL  エリア
      ******************************************************************
       01  SQL-AREA.
      *----------  銘柄別断面情報SQL文(別紙1-15)
         05  SQL-SELECT-1-15.
           10  FILLER              PIC  X(07)  VALUE  "SELECT ".
      *----------  利用会社コード
           10  FILLER              PIC  X(12)  VALUE  "RIYO_CMP_CD,".
      *----------  ファンドコード
           10  FILLER              PIC  X(08)  VALUE  "FUND_CD,".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(07)  VALUE  "PTF_CD,".
      *----------  開始基準日
           10  FILLER              PIC  X(14)  VALUE  "KAISI_KJN_YMD,".
      *----------  基準日
           10  FILLER              PIC  X(08)  VALUE  "KJN_YMD,".
      *----------  銘柄コード
           10  FILLER              PIC  X(07)  VALUE  "MEG_CD,".
      *----------  証券種別コード
           10  FILLER              PIC  X(11)  VALUE  "SEC_SBT_CD,".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(09)  VALUE  "TATE_FLG,".
      *----------  玉ID
           10  FILLER              PIC  X(09)  VALUE  "GYOKU_ID,".
      *----------  銘柄種類
           10  FILLER              PIC  X(12)  VALUE  "MEG_CD_SHRU,".
      *----------  銘柄種類２
           10  FILLER              PIC  X(13)  VALUE  "MEG_CD_SHRU2,".
      *----------  差分更新From日
           10  FILLER              PIC  X(18)  VALUE
                                               "SABON_UPDATE_FROM,".
      *----------  再計算区分
           10  FILLER              PIC  X(13)  VALUE  "SAI_CALC_KBN ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-15       PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_ZI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_ZI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_ZI".
      *----------  処理実行日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(12)  VALUE "SYORI_YMD = ".
           10  FILLER              PIC  X(15)  VALUE ":P_SYORI_YMD_ZI".
      *----------  起動ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "KIDOU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_KIDOU_ID_ZI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE  "KJN_YMD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_ZI".
      *----------  勘定異動SQL文(別紙1-16)
         05  SQL-DELETE-1-16.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-16       PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_ZI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_ZI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_ZI".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(45)
               VALUE "DECODE(TORI_JIYU,'REV ','FDAL',SEC_SBT_CD) = ".
           10  FILLER              PIC  X(16)  VALUE ":P_SEC_SBT_CD_ZI".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "MEG_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_ZI".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "TATE_FLG = ".
           10  FILLER              PIC  X(14)  VALUE ":P_TATE_FLG_ZI".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "GYOKU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_GYOKU_ID_ZI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(19)  VALUE
                                               "KANREN_KEIJOUBI <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_ZI".
      *----------  開始基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                               "KANREN_KEIJOUBI > ".
           10  FILLER              PIC  X(19)  VALUE
                                               ":P_KAISI_KJN_YMD_ZI".
      *----------  勘定異動SQL文(別紙1-17)
         05  SQL-DELETE-1-17.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-17       PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_ZI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_ZI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_ZI".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(45)
               VALUE "DECODE(TORI_JIYU,'REV ','FDAL',SEC_SBT_CD) = ".
           10  FILLER              PIC  X(16)  VALUE ":P_SEC_SBT_CD_ZI".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "MEG_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_ZI".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "TATE_FLG = ".
           10  FILLER              PIC  X(14)  VALUE ":P_TATE_FLG_ZI".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "GYOKU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_GYOKU_ID_ZI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(19)  VALUE
                                               "KANREN_KEIJOUBI <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_ZI".
      *----------  差分更新From日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(19)  VALUE
                                               "KANREN_KEIJOUBI >= ".
           10  FILLER              PIC  X(23)  VALUE
                                              ":P_SABON_UPDATE_FROM_ZI".
      *----------  勘定異動SQL文(別紙1-18)
         05  SQL-DELETE-1-18.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-18       PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_ZI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_ZI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_ZI".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "MEG_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_ZI".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "TATE_FLG = ".
           10  FILLER              PIC  X(14)  VALUE ":P_TATE_FLG_ZI".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "GYOKU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_GYOKU_ID_ZI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(19)  VALUE
                                               "KANREN_KEIJOUBI <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_ZI".
      *----------  開始基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                               "KANREN_KEIJOUBI > ".
           10  FILLER              PIC  X(19)  VALUE
                                               ":P_KAISI_KJN_YMD_ZI".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(14)  VALUE  " SEC_SBT_CD = ".
           10  FILLER              PIC  X(08)  VALUE  " DECODE(".
           10  FILLER              PIC  X(35)
               VALUE  ":P_SEC_SBT_CD_ZI,'    ',SEC_SBT_CD,".
           10  FILLER              PIC  X(19)
               VALUE  ":P_SEC_SBT_CD_1_ZI)".
      *----------  勘定異動SQL文(別紙1-19)
         05  SQL-DELETE-1-19.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-19       PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_ZI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_ZI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_ZI".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "MEG_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_ZI".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "TATE_FLG = ".
           10  FILLER              PIC  X(14)  VALUE ":P_TATE_FLG_ZI".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "GYOKU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_GYOKU_ID_ZI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(19)  VALUE
                                               "KANREN_KEIJOUBI <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_ZI".
      *----------  差分更新From日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(19)  VALUE
                                               "KANREN_KEIJOUBI >= ".
           10  FILLER              PIC  X(23)  VALUE
                                              ":P_SABON_UPDATE_FROM_ZI".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(14)  VALUE  " SEC_SBT_CD = ".
           10  FILLER              PIC  X(08)  VALUE  " DECODE(".
           10  FILLER              PIC  X(35)
               VALUE  ":P_SEC_SBT_CD_ZI,'    ',SEC_SBT_CD,".
           10  FILLER              PIC  X(19)
               VALUE  ":P_SEC_SBT_CD_1_ZI)".
      *----------  残高異動SQL文(別紙1-3)
         05  SQL-DELETE-1-3.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-3        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_ZI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_ZI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_ZI".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "SEC_SBT_CD = ".
           10  FILLER              PIC  X(16)  VALUE ":P_SEC_SBT_CD_ZI".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "MEG_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_ZI".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "TATE_FLG = ".
           10  FILLER              PIC  X(14)  VALUE ":P_TATE_FLG_ZI".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "GYOKU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_GYOKU_ID_ZI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                               "KEIJOU_KIJUNBI <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_ZI".
      *----------  開始基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(17)  VALUE
                                               "KEIJOU_KIJUNBI > ".
           10  FILLER              PIC  X(19)  VALUE
                                               ":P_KAISI_KJN_YMD_ZI".
      *----------  残高異動SQL文(別紙1-4)
         05  SQL-DELETE-1-4.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-4        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_ZI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_ZI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_ZI".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "SEC_SBT_CD = ".
           10  FILLER              PIC  X(16)  VALUE ":P_SEC_SBT_CD_ZI".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "MEG_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_ZI".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "TATE_FLG = ".
           10  FILLER              PIC  X(14)  VALUE ":P_TATE_FLG_ZI".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "GYOKU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_GYOKU_ID_ZI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                               "KEIJOU_KIJUNBI <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_ZI".
      *----------  差分更新From日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                               "KEIJOU_KIJUNBI >= ".
           10  FILLER              PIC  X(23)  VALUE
                                              ":P_SABON_UPDATE_FROM_ZI".
      *----------  資金簿価異動SQL文(別紙1-7)
         05  SQL-DELETE-1-7.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-7        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_SI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_SI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_SI".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "KS_KOZA_NO = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_SI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "IDO_YMD <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_SI".
      *----------  開始基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "IDO_YMD > ".
           10  FILLER              PIC  X(19)  VALUE
                                               ":P_KAISI_KJN_YMD_SI".
      *----------  資金簿価異動SQL文(別紙1-8)
         05  SQL-DELETE-1-8.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-8        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_SI".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_SI".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_SI".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "KS_KOZA_NO = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_SI".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "IDO_YMD <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_SI".
      *----------  差分更新From日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "IDO_YMD >= ".
           10  FILLER              PIC  X(23)  VALUE
                                              ":P_SABON_UPDATE_FROM_SI".
      *----------  前払金管理SQL文(別紙1-9)
         05  SQL-DELETE-1-9.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-9        PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_MB".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_MB".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_MB".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "SEC_SBT_CD = ".
           10  FILLER              PIC  X(16)  VALUE ":P_SEC_SBT_CD_MB".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "MEG_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_MB".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "TATE_FLG = ".
           10  FILLER              PIC  X(14)  VALUE ":P_TATE_FLG_MB".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "GYOKU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_GYOKU_ID_MB".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                               "KEIJOU_KIJUNBI <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_MB".
      *----------  開始基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(17)  VALUE
                                               "KEIJOU_KIJUNBI > ".
           10  FILLER              PIC  X(19)  VALUE
                                               ":P_KAISI_KJN_YMD_MB".
      *----------  前払金管理SQL文(別紙1-10)
         05  SQL-DELETE-1-10.
           10  FILLER              PIC  X(07)  VALUE  "DELETE ".
           10  FILLER              PIC  X(05)  VALUE  "FROM ".
           10  SQL-TBL-ID-10       PIC  X(13).
           10  FILLER              PIC  X(07)  VALUE  " WHERE ".
      *----------  利用会社コード
           10  FILLER              PIC  X(14)  VALUE  "RIYO_CMP_CD = ".
           10  FILLER              PIC  X(17)  VALUE
                                               ":P_RIYO_CMP_CD_MB".
      *----------  ファンドコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(10)  VALUE "FUND_CD = ".
           10  FILLER              PIC  X(13)  VALUE ":P_FUND_CD_MB".
      *----------  ポートフォリオコード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "PTF_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_PTF_CD_MB".
      *----------  証券種別コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(13)  VALUE "SEC_SBT_CD = ".
           10  FILLER              PIC  X(16)  VALUE ":P_SEC_SBT_CD_MB".
      *----------  銘柄コード
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(09)  VALUE "MEG_CD = ".
           10  FILLER              PIC  X(12)  VALUE ":P_MEG_CD_MB".
      *----------  資産負債・買建売建フラグ
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "TATE_FLG = ".
           10  FILLER              PIC  X(14)  VALUE ":P_TATE_FLG_MB".
      *----------  玉ID
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(11)  VALUE "GYOKU_ID = ".
           10  FILLER              PIC  X(14)  VALUE ":P_GYOKU_ID_MB".
      *----------  基準日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                               "KEIJOU_KIJUNBI <= ".
           10  FILLER              PIC  X(13)  VALUE ":P_KJN_YMD_MB".
      *----------  差分更新From日
           10  FILLER              PIC  X(05)  VALUE  " AND ".
           10  FILLER              PIC  X(18)  VALUE
                                               "KEIJOU_KIJUNBI >= ".
           10  FILLER              PIC  X(23)  VALUE
                                              ":P_SABON_UPDATE_FROM_MB".
      ******************************************************************
      *                エラーメッセージ
      ******************************************************************
       01  E-MSG-TBL.
      *---------- SELECT SQL文(別紙1-16)
         05  WK-MSG-1-16.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(45)
               VALUE "DECODE(TORI_JIYU,'REV ','FDAL',SEC_SBT_CD) = ".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(24)  VALUE
               "' AND KEIJOU_KIJUNBI <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               " AND KEIJOU_KIJUNBI > ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
      *---------- SELECT SQL文(別紙1-17)
         05  WK-MSG-1-17.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(45)
               VALUE "DECODE(TORI_JIYU,'REV ','FDAL',SEC_SBT_CD) = ".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(24)  VALUE
               "' AND KEIJOU_KIJUNBI <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(23)  VALUE
               " AND KEIJOU_KIJUNBI >= ".
           10  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *---------- SELECT SQL文(別紙1-18)
         05  WK-MSG-1-18.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(24)  VALUE
               "' AND KEIJOU_KIJUNBI <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               " AND KEIJOU_KIJUNBI > ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
           10  FILLER              PIC  X(14)  VALUE
               " SEC_SBT_CD = ".
           10  FILLER              PIC  X(09)  VALUE
               " DECODE('".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(21)  VALUE
               "','    ',SEC_SBT_CD,'".
           10  WK-SEC-SBT-CD-1     PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "')".
      *---------- SELECT SQL文(別紙1-19)
         05  WK-MSG-1-19.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZKI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(24)  VALUE
               "' AND KEIJOU_KIJUNBI <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(23)  VALUE
               " AND KEIJOU_KIJUNBI >= ".
           10  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
           10  FILLER              PIC  X(05)  VALUE
               " AND ".
           10  FILLER              PIC  X(14)  VALUE
               " SEC_SBT_CD = ".
           10  FILLER              PIC  X(09)  VALUE
               " DECODE('".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(21)  VALUE
               "','    ',SEC_SBT_CD,'".
           10  WK-SEC-SBT-CD-1     PIC  X(04).
           10  FILLER              PIC  X(02)  VALUE
               "')".
      *---------- SELECT SQL文(別紙1-3)
         05  WK-MSG-1-3.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZZI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(24)  VALUE
               "' AND KEIJOU_KIJUNBI <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               " AND KEIJOU_KIJUNBI > ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
      *---------- SELECT SQL文(別紙1-4)
         05  WK-MSG-1-4.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZZI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(24)  VALUE
               "' AND KEIJOU_KIJUNBI <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(23)  VALUE
               " AND KEIJOU_KIJUNBI >= ".
           10  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *---------- SELECT SQL文(別紙1-7)
         05  WK-MSG-1-7.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND KS_KOZA_NO ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND IDO_YMD <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(15)  VALUE
               " AND IDO_YMD > ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
      *---------- SELECT SQL文(別紙1-8)
         05  WK-MSG-1-8.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZSI00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND KS_KOZA_NO ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND IDO_YMD <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(16)  VALUE
               " AND IDO_YMD >= ".
           10  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      *---------- SELECT SQL文(別紙1-9)
         05  WK-MSG-1-9.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMB00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(24)  VALUE
               "' AND KEIJOU_KIJUNBI <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(22)  VALUE
               " AND KEIJOU_KIJUNBI > ".
           10  WK-KAISI-KJN-YMD    PIC  S9(08).
      *---------- SELECT SQL文(別紙1-10)
         05  WK-MSG-1-10.
           10  FILLER              PIC  X(08)  VALUE
               " TBL-ID(".
           10  WK-TKMZMB00         PIC  X(13).
           10  FILLER              PIC  X(02)  VALUE
               "),".
           10  FILLER              PIC  X(15)  VALUE
               " RIYO_CMP_CD ='".
           10  WK-RIYO-CMP-CD      PIC  X(04).
           10  FILLER              PIC  X(16)  VALUE
               "' AND FUND_CD ='".
           10  WK-FUND-CD          PIC  X(12).
           10  FILLER              PIC  X(15)  VALUE
               "' AND PTF_CD ='".
           10  WK-PTF-CD           PIC  X(04).
           10  FILLER              PIC  X(19)  VALUE
               "' AND SEC_SBT_CD ='".
           10  WK-SEC-SBT-CD       PIC  X(04).
           10  FILLER              PIC  X(15)  VALUE
               "' AND MEG_CD ='".
           10  WK-MEG-CD           PIC  X(15).
           10  FILLER              PIC  X(17)  VALUE
               "' AND TATE_FLG ='".
           10  WK-TATE-FLG         PIC  X(01).
           10  FILLER              PIC  X(17)  VALUE
               "' AND GYOKU_ID ='".
           10  WK-GYOKU-ID         PIC  X(10).
           10  FILLER              PIC  X(24)  VALUE
               "' AND KEIJOU_KIJUNBI <= ".
           10  WK-KJN-YMD          PIC  S9(08).
           10  FILLER              PIC  X(23)  VALUE
               " AND KEIJOU_KIJUNBI >= ".
           10  WK-SABON-UPDATE-FROM
                                   PIC  S9(08).
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1160 テーブルID取得ルーチン
       01  PARM-SCZY1160-INOUT.
           COPY  "SCZY1160.cpy".
      *----------  20100316  START
      *----------  SCZY3002 外部銘柄コード変換ルーチン
       01  PARM-SCZY3002-INOUT.
           COPY  "SCZY3002.cpy".
      *----------  20100316  END
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-IN.
      *----------  リターンパッケージセットルーチンコピー句
           COPY  "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY  "CZRTNPACKAGE.cpy".
       01  PARM-RTNPKG.
         05  PARM-RTNPKG-ARG.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SMZJ1710-INOUT.
           COPY  "SMZJ1710.cpy".
       01  PARM-SMZJ1710-RTNPKG.
         05  PARM-SMZJ1710-ARG3.
           COPY  "CZRTNPACKAGE.cpy".
      ******************************************************************
      *
      *                 手 続 き 部
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SMZJ1710-INOUT
                  PARM-SMZJ1710-RTNPKG.
      ******************************************************************
      *                 再計算データ削除
      ******************************************************************
       BASE-RTN               SECTION.
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1710処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1 前処理
           PERFORM  INIT-RTN
      *----------  3.2 主処理
           PERFORM  MAIN-RTN
      *----------  3.3 後処理
           PERFORM  END-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1710処理  正常終了  ***"
      *-----------------------------------------------------------------
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [BASE-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           CONTINUE.
       BASE-EXT.
           GOBACK.
      ******************************************************************
      *                 3.1 前処理
      ******************************************************************
       INIT-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  3.1.1 初期化処理
           PERFORM  INITIALIZE-RTN
      *----------  3.1.2 テーブルID取得処理
           PERFORM  TBLID-GET-RTN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": ***  前処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INIT-EXT.
           EXIT.
      ******************************************************************
      *        3.1.1 初期化処理
      ******************************************************************
       INITIALIZE-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID ":***  初期化処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化
           INITIALIZE     WORK-AREA
                          HST-AREA
                          SQL-AREA
                          FLG-AREA
                          E-MSG-TBL
                          PARM-SCZY1160-INOUT
      *----------  20100316  START
                          PARM-SCZY3002-INOUT
      *----------  20100316  END
                          PARM-SCZY1170-IN
                          PARM-SCZY1170-RTNPKG
                          PARM-RTNPKG
                          PARM-SMZJ1710-ARG3  OF  PARM-SMZJ1710-RTNPKG
      *-----------------------<DEBUG>-----------------------------------@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      *-----------------------------------------------------------------@3212SEINO@@
      *-----  初回ＣＡＬＬ時のみフラグエリア２の初期化を行う            @3212SEINO@@
           IF     FIRST-SW = 'YES'                                      @3212SEINO@@
           THEN                                                         @3212SEINO@@
                  INITIALIZE                FLG-AREA2                   @3212SEINO@@
                  MOVE  'NO '           TO  FIRST-SW                    @3212SEINO@@
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WORK-AREA        = ["WORK-AREA"]"
      D    DISPLAY  CNS-PGM-ID":HST-AREA         = ["HST-AREA"]"
      D    DISPLAY  CNS-PGM-ID":SQL-AREA         = ["SQL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":E-MSG-TBL        = ["E-MSG-TBL"]"
      D    DISPLAY  CNS-PGM-ID ":FLG-AREA2 =["FLG-AREA2 "]"             @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID ":FIRST-SW  =["FIRST-SW"]"               @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1160-INOUT = ["
      D             PARM-SCZY1160-INOUT"]"
      *----------  20100316  START
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY3002-INOUT = ["
      D             PARM-SCZY3002-INOUT"]"
      *----------  20100316  END
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-IN = ["PARM-SCZY1170-IN"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SCZY1170-RTNPKG= ["
      D             PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG = ["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1710-ARG3  = ["
      D             PARM-SMZJ1710-ARG3       OF  PARM-SMZJ1710-RTNPKG"]"
      *-----------------------------------------------------------------
      *----------  基準日断面情報
           MOVE  KJN-YMD-DAME-JYHO-PARM      OF  PARM-SMZJ1710-ARG1
             TO  WK-KJN-YMD-DAME-JYHO-PARM   OF  WK-DATA-IN
      *----------  勘定異動／残高作成
           MOVE  KJIDO-ZANSK                 OF  PARM-SMZJ1710-ARG1
             TO  WK-KJIDO-ZANSK              OF  WK-DATA-IN
      *----------  SCZY1170 RTN-CD 初期化
           MOVE  CNS-RTN-000
             TO  RTN-CD                      OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":基準日断面情報              =["
      D             WK-KJN-YMD-DAME-JYHO-PARM  OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":勘定異動／残高作成          =["
      D             WK-KJIDO-ZANSK           OF  WK-DATA-IN"]"
      D    DISPLAY  CNS-PGM-ID":SCZY1170 RTN-CD             =["
      D             RTN-CD                   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":***  初期化処理 END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       INITIALIZE-EXT.
           EXIT.
      ******************************************************************
      *    3.1.2 テーブルID取得処理
      ******************************************************************
       TBLID-GET-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY1160-INOUT
                       PARM-RTNPKG
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  RIYO-CMP-CD            OF  PARM-SCZY1160-ARG1
      *----------  残高異動テーブル
           MOVE  CNS-TBL-TKMZZI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(1)
      *----------  資金簿価異動テーブル
           MOVE  CNS-TBL-TKMZSI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(2)
      *----------  前払金管理テーブル
           MOVE  CNS-TBL-TKMZMB00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(3)
      *----------  勘定異動
           MOVE  CNS-TBL-TKMZKI00
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(4)
      *----------  銘柄別断面情報
           MOVE  CNS-TBL-TKMZBW03
             TO  TBL-ID                 OF  PARM-SCZY1160-ARG1(5)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RIYO-CMP-CD  OF PARM-SCZY1160-ARG1=["
      D             RIYO-CMP-CD         OF  PARM-SCZY1160-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(1)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(1)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(2)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(2)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(3)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(3)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(4)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(4)"]"
      D    DISPLAY  CNS-PGM-ID":TBL-ID   OF PARM-SCZY1160-ARG1(5)=["
      D             TBL-ID              OF  PARM-SCZY1160-ARG1(5)"]"
      *-----------------------------------------------------------------
           CALL  "SCZY1160"             USING  PARM-SCZY1160-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY1160)=["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF  PARM-RTNPKG)"]"
      D    DISPLAY  CNS-PGM-ID":COUNTER  OF  PARM-RTNPKG          =["
      D             COUNTER                         OF PARM-RTNPKG"]"
      *-----------------------------------------------------------------
           IF  RTN-CD      OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
            =  CNS-RTN-000
           THEN
      *----------  ワーク残高異動テーブル
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(1)
               TO  WK-TBL-TKMZZI00
      *----------  ワーク資金簿価異動テーブル
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(2)
               TO  WK-TBL-TKMZSI00
      *----------  ワーク前払金管理テーブル
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(3)
               TO  WK-TBL-TKMZMB00
      *----------  ワーク勘定異動テーブル
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(4)
               TO  WK-TBL-TKMZKI00
      *----------  ワーク銘柄別断面情報テーブル
             MOVE  HENSYUGO-TBL-ID      OF  PARM-SCZY1160-ARG2(5)
               TO  WK-TBL-TKMZBW03
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク残高異動テーブル    =["
      D             WK-TBL-TKMZZI00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動テーブル=["
      D             WK-TBL-TKMZSI00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク前払金管理テーブル  =["
      D             WK-TBL-TKMZMB00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク勘定異動テーブル    =["
      D             WK-TBL-TKMZKI00"]"
      D    DISPLAY  CNS-PGM-ID":ワーク銘柄別断面情報テーブル =["
      D             WK-TBL-TKMZBW03"]"
      *-----------------------------------------------------------------
           ELSE
      *----------  エラー
             MOVE  PARM-RTNPKG          TO  PARM-SCZY1170-RTNPKG
      *----------  エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
             MOVE  CNS-POS-001
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
             MOVE  CNS-RTN-901
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
             MOVE  RTN-CD      OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-0
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             MOVE  SPACE
               TO  FREE-MSG             OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":テーブルID取得処理  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D             ERR-PGM-ID          OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D             ERR-POS             OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D             RTN-CD              OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D             DETAIL-RTN-CD       OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D             DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D             FREE-MSG            OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
             PERFORM  ERR-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  テーブルID取得  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       TBLID-GET-EXT.
           EXIT.
      ******************************************************************
      *                 3.2 主処理
      ******************************************************************
       MAIN-RTN               SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID": *****  主処理  START  *****"
      *-----------------------------------------------------------------
      *----------  3.2.0. 銘柄別断面情報データを取得する
           PERFORM  MEG-BETU-GET-RTN
      *----------  3.2.1.銘柄別断面情報カーソルフェッチする
           MOVE  CNS-ON                 TO  FLG-FETCH
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-SDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MAIN-RTN]"                    GUT2013
           DISPLAY "セクションの開始時間:["WK-RUN-SDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
           PERFORM  UNTIL  FLG-FETCH  =  CNS-OFF
             PERFORM  MEG-BETU-FETCH-RTN
             MOVE  H-TKMZBW03             TO  WK-MEG-BETU-HST
             IF  WK-CNT-IDX = CNS-1
             THEN
               PERFORM  UNTIL  WK-CNT-IDX > WK-KUKAN-KENSU
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":下記3.2.1 ～3.2.6 処理を繰り返す"
      D    DISPLAY  CNS-PGM-ID":WK-CNT-IDX=["WK-CNT-IDX"]"
      D    DISPLAY  CNS-PGM-ID":ワーク区間件数=["WK-KUKAN-KENSU"]"
      *----------  20100316  START
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.銘柄コード=["
      D             WK-MEG-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.証券種別コード=["
      D             WK-SEC-SBT-CD   OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *----------  20100316  END
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.銘柄種類=["
      D             WK-MEG-CD-SHRU  OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  20100316  START
                 INITIALIZE  FLG-SKIP-6
                 IF  ( WK-MEG-CD    OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                   NOT = SPACE
                   AND  WK-MEG-CD   OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                   NOT = CNS-X-CASH )
                   AND  WK-SEC-SBT-CD OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                   = CNS-X-MA99
                 THEN
                   PERFORM  SCZY3002-RTN
                 ELSE
                   CONTINUE
                 END-IF
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-SKIP-6=["FLG-SKIP-6"]"
      *-----------------------------------------------------------------
                 IF  FLG-SKIP-6  =  CNS-1
                 THEN
                   CONTINUE
                 ELSE
                   EVALUATE  WK-MEG-CD-SHRU
                                     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
      *----------  銘柄別断面情報.銘柄種類＝'1'(物)
                     WHEN  CNS-MEG-CD-SHRU-1
      *----------  3.2.2. 対象銘柄は物の場合の処理
                       PERFORM  MONO-SHRI-RTN
      *----------  銘柄別断面情報.銘柄種類＝'2'(元本)
                     WHEN  CNS-MEG-CD-SHRU-2
      *----------  3.2.3. 対象銘柄は元本の場合の処理
                       PERFORM  GANPON-SHRI-RTN
      *----------  銘柄別断面情報.銘柄種類＝'3'(資金)
                     WHEN  CNS-MEG-CD-SHRU-3
      *----------  3.2.4. 対象銘柄は資金の場合の処理
                       PERFORM  SIKIN-SHRI-RTN
      *----------  上記以外の場合
                     WHEN  OTHER
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.銘柄種類が以上以外の場合"
      *-----------------------------------------------------------------
                       CONTINUE
                   END-EVALUATE
      *----------  3.2.5.勘定異動を削除
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動／残高作成=["WK-KJIDO-ZANSK"]"
      D    DISPLAY  CNS-PGM-ID":再計算区分=["WK-SAI-CALC-KBN
      D             OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
                   IF  WK-KJIDO-ZANSK   NOT = CNS-2
                   THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ARG1.勘定異動／残高作成≠2（作成しない）の場合"
      *-----------------------------------------------------------------
                     IF  WK-SAI-CALC-KBN
                     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                       = CNS-SAI-CALC-KBN-1
                     THEN
                       PERFORM  KNJ-DEL-RTN
                     ELSE
                       CONTINUE
                     END-IF
                   ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":ARG1.勘定異動／残高作成=2（作成しない）の場合"
      *-----------------------------------------------------------------
                     CONTINUE
                   END-IF
                 END-IF
      *----------  20100316  END
                 COMPUTE  WK-CNT-IDX = WK-CNT-IDX + CNS-1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-CNT-IDX=["WK-CNT-IDX"]"
      D    DISPLAY  CNS-PGM-ID":ワーク区間件数=["WK-KUKAN-KENSU"]"
      *-----------------------------------------------------------------
      *----------  3.2.6.CNT-IDX = ワーク区間件数 +1 の場合
                 IF  WK-CNT-IDX = WK-KUKAN-KENSU + CNS-1
                 THEN
                   PERFORM  SQL-DEL-RTN
                 ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":削除処理しない"
      *-----------------------------------------------------------------
                   CONTINUE
                 END-IF
               END-PERFORM
             ELSE
               CONTINUE
             END-IF
           END-PERFORM
           MOVE FUNCTION CURRENT-DATE(1:14) TO WK-RUN-EDATETIME
      *--------------------<DEBUG>--------------------------------------
           DISPLAY "プログラムID:        ["CNS-PGM-ID"]"                GUT2013
           DISPLAY "セクション:          [MAIN-RTN]"                    GUT2013
           DISPLAY "セクションの終了時間:["WK-RUN-EDATETIME"]"          GUT2013
      *-----------------------------------------------------------------
      *----------  ２度目以降のカーソルPREPARE,DECLAREスキップのため    @3212SEINO@@
      *----------  クローズ処理スキップ                                 @3212SEINO@@
      *----------  3.2.7.3.2.7銘柄別断面情報カーソルクローズ処理
      *    PERFORM  MEG-BETU-CLOSE-RTN                                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  主処理  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIN-EXT.
           EXIT.
      *----------  20100316  START
      ******************************************************************
      *    外部銘柄コード変換ルーチン
      ******************************************************************
       SCZY3002-RTN           SECTION.
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  外部銘柄コード変換ルーチン"
      D             "  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SCZY3002-INOUT
                       PARM-RTNPKG
      *---------- 利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-MEG-BETU-HST(WK-CNT-IDX)
             TO  RIYO-CMP-CD            OF  PARM-SCZY3002-ARG1
      *---------- 内部銘柄コード
           MOVE  WK-MEG-CD              OF  WK-MEG-BETU-HST(WK-CNT-IDX)
             TO  NAIBU-MEG-CD           OF  PARM-SCZY3002-ARG1
      *---------- 商品分類コード
           MOVE  SPACE
             TO  SYOHIN-BUNRUI-CD       OF  PARM-SCZY3002-ARG1
      *---------- 証券種別コード
           MOVE  SPACE
             TO  SEC-SBT-CD             OF  PARM-SCZY3002-ARG1
      *---------- 元証券種別コード
           MOVE  SPACE
             TO  MOTO-SEC-SBT-CD        OF  PARM-SCZY3002-ARG1
      *---------- 銘柄通貨コード
           MOVE  SPACE
             TO  MEG-TUKA-CD            OF  PARM-SCZY3002-ARG1
      *---------- コードリファレンス系列コード
           MOVE  SPACE
             TO  CD-REF-KRTU-CD         OF  PARM-SCZY3002-ARG1
      *---------- 業務タスクID
           MOVE  SPACE
             TO  GYOMU-TASK-ID          OF  PARM-SCZY3002-ARG1
      *---------- 基準日
           MOVE  WK-KJN-YMD             OF  WK-MEG-BETU-HST(WK-CNT-IDX)
             TO  KJN-YMD                OF  PARM-SCZY3002-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             RIYO-CMP-CD         OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":内部銘柄コード=["
      D             NAIBU-MEG-CD        OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":商品分類コード=["
      D             SYOHIN-BUNRUI-CD    OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             SEC-SBT-CD          OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":元証券種別コード=["
      D             MOTO-SEC-SBT-CD     OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":銘柄通貨コード=["
      D             MEG-TUKA-CD         OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":コードリファレンス系列コード=["
      D             CD-REF-KRTU-CD      OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":業務タスクID=["
      D             GYOMU-TASK-ID       OF  PARM-SCZY3002-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             KJN-YMD             OF  PARM-SCZY3002-ARG1"]"
      *-----------------------------------------------------------------
           CALL  "SCZY3002"             USING  PARM-SCZY3002-INOUT
                                               PARM-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-RTNPKG =["PARM-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":RTN-CD(SCZY3002)       =["
      D             RTN-CD OF PARM-RTNPKG(COUNTER   OF PARM-RTNPKG) "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD OF PARM-RTNPKG(COUNTER OF PARM-RTNPKG)
             WHEN  CNS-RTN-000
      *---------- ワーク銘柄別断面情報ホスト表[CNT-IDX].証券種別コード ←【SCZY3002】.証券種別コード
               MOVE  SEC-SBT-CD         OF  PARM-SCZY3002-ARG2
                 TO  WK-SEC-SBT-CD      OF  WK-MEG-BETU-HST(WK-CNT-IDX)
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報.証券種別コード=["
      D             WK-SEC-SBT-CD   OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
               MOVE  CNS-1              TO   FLG-SKIP-6
      *--------------------<DEBSUG>-------------------------------------
      D    DISPLAY  CNS-PGM-ID":FLG-SKIP-6=["FLG-SKIP-6"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *---------- エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *---------- ポジション
               MOVE  CNS-POS-034
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
               MOVE  CNS-RTN-901
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
               MOVE  RTN-CD  OF  PARM-RTNPKG(COUNTER  OF  PARM-RTNPKG)
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0
                 TO  DETAIL-RTN-CD-FLG  OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               MOVE  SPACE
                 TO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":外部銘柄コード変換処理エラー"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*** 外部銘柄コード変換ルーチン"
      D             " END ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SCZY3002-EXT.
           EXIT.
      *----------  20100316  END
      ******************************************************************
      *        3.2.0. 銘柄別断面情報データを取得する
      ******************************************************************
       MEG-BETU-GET-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  銘柄別断面情報データを取得する"
      D             "  START  *****"
      *-----------------------------------------------------------------
           INITIALIZE  SQLSTMT
                       H-TKMZBW03-WHERE
      *----------  銘柄別断面情報TBL
           MOVE  WK-TBL-TKMZBW03        TO  SQL-TBL-ID-15
      *----------  利用会社コード
           MOVE  WK-RIYO-CMP-CD         OF  WK-DATA-IN
             TO  H-RIYO-CMP-CD-W        OF  H-TKMZBW03-WHERE
      *----------  ファンドコード
           MOVE  WK-FUND-CD             OF  WK-DATA-IN
             TO  H-FUND-CD-W            OF  H-TKMZBW03-WHERE
      *----------  ポートフォリオコード
           MOVE  WK-PTF-CD              OF  WK-DATA-IN
             TO  H-PTF-CD-W             OF  H-TKMZBW03-WHERE
      *----------  処理実行日
           MOVE  WK-SYORI-YMD           OF  WK-DATA-IN
             TO  H-SYORI-YMD-W          OF  H-TKMZBW03-WHERE
      *----------  起動ID
           MOVE  WK-KIDOU-ID            OF  WK-DATA-IN
             TO  H-KIDOU-ID-W           OF  H-TKMZBW03-WHERE
      *----------  基準日
           MOVE  WK-KJN-YMD             OF  WK-DATA-IN
             TO  H-KJN-YMD-W            OF  H-TKMZBW03-WHERE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報TBL=["SQL-TBL-ID-15"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード   =["
      D             H-RIYO-CMP-CD-W      OF  H-TKMZBW03-WHERE"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード   =["
      D             H-FUND-CD-W          OF  H-TKMZBW03-WHERE"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD-W           OF  H-TKMZBW03-WHERE"]"
      D    DISPLAY  CNS-PGM-ID":処理実行日       =["
      D             H-SYORI-YMD-W        OF  H-TKMZBW03-WHERE"]"
      D    DISPLAY  CNS-PGM-ID":起動ID           =["
      D             H-KIDOU-ID-W         OF  H-TKMZBW03-WHERE"]"
      D    DISPLAY  CNS-PGM-ID":基準日           =["
      D             H-KJN-YMD-W          OF  H-TKMZBW03-WHERE"]"
      *-----------------------------------------------------------------
           MOVE  SQL-SELECT-1-15         TO  SQLSTMT
           STRING SQLSTMT(1:FUNCTION  LENGTH(SQL-SELECT-1-15))
                "[:P_RIYO_CMP_CD_ZI="
                 H-RIYO-CMP-CD-W         OF  H-TKMZBW03-WHERE
                "][:P_FUND_CD_ZI="
                 H-FUND-CD-W             OF  H-TKMZBW03-WHERE
                "][:P_PTF_CD_ZI="
                 H-PTF-CD-W              OF  H-TKMZBW03-WHERE
                "][:P_SYORI_YMD_ZI="
                 H-SYORI-YMD-W           OF  H-TKMZBW03-WHERE
                "][:P_KIDOU_ID_ZI="
                 H-KIDOU-ID-W            OF  H-TKMZBW03-WHERE
                "][:P_KJN_YMD_ZI="
                 H-KJN-YMD-W             OF  H-TKMZBW03-WHERE
                "]"
                DELIMITED BY SIZE
                INTO  WK-SELECT-FREE-MSG
           END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報 SQLSTMT    =["SQLSTMT"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ=["
      D             FLG-MEG-OPEN"]"
      *-----------------------------------------------------------------
      *--- PREPARE、DECLARE実行済の場合、PREPARE、DECLAREをスキップする @3212SEINO@@
           IF  FLG-MEG-OPEN = CNS-OFF                                   @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE SS FROM :SQLSTMT END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":銘柄別断面情報処理エラー（PREPARE)"
      *-----------------------------------------------------------------
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-002
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-34,
                     CNS-SQL-MSG-SELECT,
                     WK-SELECT-FREE-MSG
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
             END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           EXEC  SQL
             DECLARE  CR  CURSOR  FOR  SS
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報(CURSOR DECLARE)=["
      D             SQLCODE"]"
      *-----------------------------------------------------------------
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC  SQL
             OPEN  CR
             USING  :H-TKMZBW03-WHERE.H-RIYO-CMP-CD-W,
                    :H-TKMZBW03-WHERE.H-FUND-CD-W,
                    :H-TKMZBW03-WHERE.H-PTF-CD-W,
                    :H-TKMZBW03-WHERE.H-SYORI-YMD-W,
                    :H-TKMZBW03-WHERE.H-KIDOU-ID-W,
                    :H-TKMZBW03-WHERE.H-KJN-YMD-W
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON            TO  FLG-MEG-OPEN
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ=["
      D             FLG-MEG-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報処理正常(OPEN)"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-003
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-34,
                       CNS-SQL-MSG-SELECT,
                       WK-SELECT-FREE-MSG
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
               END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報処理エラー(OPEN)"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****  銘柄別断面情報データを取得する"
      D             "  END  *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-BETU-GET-EXT.
           EXIT.
      ******************************************************************
      *    3.2.1.銘柄別断面情報カーソルフェッチする
      ******************************************************************
       MEG-BETU-FETCH-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  銘柄別断面情報カーソルフェッチする"
      D             "START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  H-TKMZBW03
                       WK-SEL-AREA
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-SEL-AREA:["WK-SEL-AREA"]"
      D    DISPLAY  CNS-PGM-ID":H-TKMZBW03 :["H-TKMZBW03"]"
      *-----------------------------------------------------------------
      *----------  CURSOR FETCH
           EXEC SQL
             FETCH CR
             INTO  :H-TKMZBW03-SELECT
           END-EXEC
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR FETCH)=["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH処理 正常"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)=["SQLERRD(3)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク合計件数=["WK-GOUKEI-KENSU"]"
      *-----------------------------------------------------------------
      *----------  カーソルFETCH処理正常編集
               COMPUTE  WK-KUKAN-KENSU = SQLERRD(3) - WK-GOUKEI-KENSU
               MOVE  SQLERRD(3)               TO  WK-GOUKEI-KENSU
               MOVE  CNS-1                    TO  WK-CNT-IDX
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク区間件数=["WK-KUKAN-KENSU"]"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH処理 NOTFOUND"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)=["SQLERRD(3)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク合計件数=["WK-GOUKEI-KENSU"]"
      *-----------------------------------------------------------------
      *----------  カーソルFETCH処理正常編集
               COMPUTE  WK-KUKAN-KENSU = SQLERRD(3) - WK-GOUKEI-KENSU
               MOVE  CNS-1                    TO  WK-CNT-IDX
      *----------  FETCH終了フラグ←0
               MOVE  CNS-OFF                  TO  FLG-FETCH
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":FETCH終了フラグ=["FLG-FETCH"]"
      D    DISPLAY  CNS-PGM-ID":ワーク区間件数=["WK-KUKAN-KENSU"]"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-004
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-34,
                       CNS-SQL-MSG-SELECT,
                       WK-SELECT-FREE-MSG
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
               END-STRING
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":カーソルFETCH処理  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  銘柄別断面情報カーソルフェッチする"
      D             "END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MEG-BETU-FETCH-EXT.
           EXIT.
      ******************************************************************
      *        3.2.2. 対象銘柄は物の場合の処理
      ******************************************************************
       MONO-SHRI-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  対象銘柄は物の場合の処理  "
      D             "START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク差分更新From日=["
      D         WK-SABON-UPDATE-FROM  OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  3.2.2.2 ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空の場合
           IF  WK-SABON-UPDATE-FROM     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               =  ZERO
           THEN
             MOVE  CNS-POS-005          TO  WK-ERR-POS1
             MOVE  CNS-POS-006          TO  WK-ERR-POS2
             MOVE  CNS-POS-007          TO  WK-ERR-POS3
             MOVE  CNS-POS-008          TO  WK-ERR-POS4
      *----------  対象銘柄データを残高異動TBLより物理削除
             PERFORM  SB-UPD-FROM1-RTN
           ELSE
      *----------  3.2.2.3 ワーク銘柄別断面情報ホスト表[CNT-IDX]..差分更新From日は空ではない場合
             MOVE  CNS-POS-009          TO  WK-ERR-POS1
             MOVE  CNS-POS-010          TO  WK-ERR-POS2
             MOVE  CNS-POS-011          TO  WK-ERR-POS3
             MOVE  CNS-POS-012          TO  WK-ERR-POS4
      *----------  対象銘柄データを残高異動TBLより物理削除
             PERFORM  SB-UPD-FROM2-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  対象銘柄は物の場合の処理  "
      D             "正常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       MONO-SHRI-EXT.
           EXIT.
      ******************************************************************
      *   ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空の処理
      ******************************************************************
       SB-UPD-FROM1-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  ワーク銘柄別断面情報ホスト表"
      D             "[CNT-IDX].差分更新From日は空の処理  START  ***"
      *-----------------------------------------------------------------
      *----------  1)対象銘柄データを残高異動TBLより物理削除
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク再計算区分=["WK-SAI-CALC-KBN
      D             OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  ワーク銘柄別断面情報ホスト表[CNT-IDX].再計算区分 ＝ '1'(再計算)の場合
           IF  WK-SAI-CALC-KBN          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               = CNS-SAI-CALC-KBN-1
           THEN
      *----------  ワークCount_残高異動_1
             COMPUTE  WK-ZANTK-COUNT1 = WK-ZANTK-COUNT1 + CNS-1
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-RIYO-CMP-CD
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *----------  ファンドコード
             MOVE  WK-FUND-CD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-FUND-CD
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-PTF-CD
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD        OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SEC-SBT-CD
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *----------  銘柄コード
             MOVE  WK-MEG-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-MEG-CD
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-TATE-FLG
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-GYOKU-ID
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *----------  開始基準日
             MOVE  WK-KAISI-KJN-YMD     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KAISI-KJN-YMD
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *----------  基準日
             MOVE  WK-KJN-YMD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KJN-YMD
               OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_残高異動_1=["
      D             WK-ZANTK-COUNT1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["WK-TATE-FLG
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                =["WK-GYOKU-ID
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日          =["WK-KAISI-KJN-YMD
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-ZANTK-DEL-BUF1(WK-ZANTK-COUNT1)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク残高異動_DEL_BUF1処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":ワーク銘柄種類２ =["
      D          WK-MEG-CD-SHRU2     OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  2)ワーク銘柄別断面情報ホスト表[CNT-IDX].銘柄種類２＝'2'(債券)の場合
           IF  WK-MEG-CD-SHRU2          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               =  CNS-MEG-CD-SHRU2-2
           AND
               WK-SAI-CALC-KBN          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               = CNS-SAI-CALC-KBN-1
           THEN
      *----------  対象銘柄データを前払金管理TBLより物理削除
      *----------  ワークCount_前払金管理_1
             COMPUTE  WK-MAIBAI-COUNT1 = WK-MAIBAI-COUNT1 + CNS-1
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-RIYO-CMP-CD
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *----------  ファンドコード
             MOVE  WK-FUND-CD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-FUND-CD
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-PTF-CD
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD        OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SEC-SBT-CD
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *----------  銘柄コード
             MOVE  WK-MEG-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-MEG-CD
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-TATE-FLG
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-GYOKU-ID
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *----------  開始基準日
             MOVE  WK-KAISI-KJN-YMD     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KAISI-KJN-YMD
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *----------  基準日
             MOVE  WK-KJN-YMD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KJN-YMD
               OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_前払金管理_1=["
      D             WK-MAIBAI-COUNT1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["WK-TATE-FLG
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                =["WK-GYOKU-ID
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日          =["WK-KAISI-KJN-YMD
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-MAIBAI-DEL-BUF1(WK-MAIBAI-COUNT1)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク前払金管理_DEL_BUF1処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  ワーク銘柄別断面情報ホスト表"
      D             "[CNT-IDX].差分更新From日は空の処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SB-UPD-FROM1-EXT.
           EXIT.
      ******************************************************************
      *        ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空ではないの処理
      ******************************************************************
       SB-UPD-FROM2-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  ワーク銘柄別断面情報ホスト表"
      D         "[CNT-IDX].差分更新From日は空ではないの処理  START  ***"
      *-----------------------------------------------------------------
      *----------  1)対象銘柄データを残高異動TBLより物理削除
      *-------------------<DEBUG>---------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク再計算区分=["WK-SAI-CALC-KBN
      D             OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  ワーク銘柄別断面情報ホスト表[CNT-IDX].再計算区分 ＝ '1'(再計算)の場合
           IF  WK-SAI-CALC-KBN          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               = CNS-SAI-CALC-KBN-1
           THEN
      *----------  ワークCount_残高異動_2
             COMPUTE  WK-ZANTK-COUNT2 = WK-ZANTK-COUNT2 + CNS-1
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-RIYO-CMP-CD
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *----------  ファンドコード
             MOVE  WK-FUND-CD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-FUND-CD
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-PTF-CD
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD        OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SEC-SBT-CD
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *----------  銘柄コード
             MOVE  WK-MEG-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-MEG-CD
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-TATE-FLG
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-GYOKU-ID
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *----------  差分更新From日
             MOVE  WK-SABON-UPDATE-FROM OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SABON-UPDATE-FROM
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *----------  基準日
             MOVE  WK-KJN-YMD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KJN-YMD
               OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_残高異動_2=["
      D             WK-ZANTK-COUNT2"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["WK-TATE-FLG
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                =["WK-GYOKU-ID
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日  =["WK-SABON-UPDATE-FROM
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-ZANTK-DEL-BUF2(WK-ZANTK-COUNT2)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク残高異動_DEL_BUF2処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":ワーク銘柄種類２ =["
      D          WK-MEG-CD-SHRU2     OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  2)ワーク銘柄別断面情報ホスト表[CNT-IDX].銘柄種類２＝'2'(債券)の場合
           IF  WK-MEG-CD-SHRU2          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               =  CNS-MEG-CD-SHRU2-2
           AND
               WK-SAI-CALC-KBN          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               = CNS-SAI-CALC-KBN-1
           THEN
      *----------  対象銘柄データを前払金管理TBLより物理削除
      *----------  ワークCount_前払金管理_2
             COMPUTE  WK-MAIBAI-COUNT2 = WK-MAIBAI-COUNT2 + CNS-1
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-RIYO-CMP-CD
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *----------  ファンドコード
             MOVE  WK-FUND-CD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-FUND-CD
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-PTF-CD
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD        OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SEC-SBT-CD
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *----------  銘柄コード
             MOVE  WK-MEG-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-MEG-CD
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-TATE-FLG
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-GYOKU-ID
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *----------  差分更新From日
             MOVE  WK-SABON-UPDATE-FROM OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SABON-UPDATE-FROM
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *----------  基準日
             MOVE  WK-KJN-YMD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KJN-YMD
               OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_前払金管理_2=["
      D             WK-MAIBAI-COUNT2"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["WK-TATE-FLG
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                =["WK-GYOKU-ID
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日  =["WK-SABON-UPDATE-FROM
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-MAIBAI-DEL-BUF2(WK-MAIBAI-COUNT2)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク前払金管理_DEL_BUF2処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  ワーク銘柄別断面情報ホスト表"
      D         "[CNT-IDX].差分更新From日は空ではないの処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SB-UPD-FROM2-EXT.
           EXIT.
      ******************************************************************
      *        3.2.3. 対象銘柄は元本の場合の処理
      ******************************************************************
       GANPON-SHRI-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  対象銘柄は元本の場合の処理  "
      D             "START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク差分更新From日=["
      D         WK-SABON-UPDATE-FROM  OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  3.2.3.2 ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空の場合
           IF  WK-SABON-UPDATE-FROM     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               = ZERO
           THEN
             MOVE  CNS-POS-013          TO  WK-ERR-POS1
             MOVE  CNS-POS-014          TO  WK-ERR-POS2
             MOVE  CNS-POS-015          TO  WK-ERR-POS3
             MOVE  CNS-POS-016          TO  WK-ERR-POS4
      *----------  ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空の場合
             PERFORM  SB-UPD-FROM1-RTN
           ELSE
      *----------  3.2.3.3 ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空ではない場合
             MOVE  CNS-POS-017          TO  WK-ERR-POS1
             MOVE  CNS-POS-018          TO  WK-ERR-POS2
             MOVE  CNS-POS-019          TO  WK-ERR-POS3
             MOVE  CNS-POS-020          TO  WK-ERR-POS4
      *----------  ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空ではない場合
             PERFORM  SB-UPD-FROM2-RTN
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  対象銘柄は元本の場合の処理  "
      D             "正常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       GANPON-SHRI-EXT.
           EXIT.
      ******************************************************************
      *        3.2.4. 対象銘柄は資金の場合の処理
      ******************************************************************
       SIKIN-SHRI-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  対象銘柄は資金の場合の処理  "
      D             "START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク差分更新From日=["
      D         WK-SABON-UPDATE-FROM  OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  3.2.4.2 ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空の場合
           IF  WK-SABON-UPDATE-FROM     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               =  ZERO
           THEN
      *----------  1)対象銘柄データを資金簿価異動TBLより物理削除
      *----------  ワーク銘柄別断面情報ホスト表[CNT-IDX].再計算区分 ＝ '1'(再計算)の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク再計算区分=["WK-SAI-CALC-KBN
      D             OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  ワーク銘柄別断面情報ホスト表[CNT-IDX].再計算区分 ＝ '1'(再計算)の場合
             IF  WK-SAI-CALC-KBN        OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 = CNS-SAI-CALC-KBN-1
             THEN
      *----------  ワークCount_資金簿価異動_1
               COMPUTE  WK-BOKA-COUNT1 = WK-BOKA-COUNT1 + CNS-1
      *----------  利用会社コード
               MOVE  WK-RIYO-CMP-CD     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-RIYO-CMP-CD
                 OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)
      *----------  ファンドコード
               MOVE  WK-FUND-CD         OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-FUND-CD
                 OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)
      *----------  ポートフォリオコード
               MOVE  WK-PTF-CD          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-PTF-CD
                 OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)
      *----------  銘柄コード
               MOVE  WK-MEG-CD          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-MEG-CD
                 OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)
      *----------  開始基準日
               MOVE  WK-KAISI-KJN-YMD   OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-KAISI-KJN-YMD
                 OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)
      *----------  基準日
               MOVE  WK-KJN-YMD         OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-KJN-YMD
                 OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_資金簿価異動_1=["
      D             WK-BOKA-COUNT1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日          =["WK-KAISI-KJN-YMD
      D             OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-BOKA-DEL-BUF1(WK-BOKA-COUNT1)"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動_DEL_BUF1処理しない"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
           ELSE
      *----------  3.2.4.3 ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日は空ではない場合
      *----------  1)対象銘柄データを資金簿価異動TBLより物理削除
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク再計算区分=["WK-SAI-CALC-KBN
      D             OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  ワーク銘柄別断面情報ホスト表[CNT-IDX].再計算区分 ＝ '1'(再計算)の場合
             IF  WK-SAI-CALC-KBN        OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 = CNS-SAI-CALC-KBN-1
             THEN
      *----------  ワークCount_資金簿価異動_2
               COMPUTE  WK-BOKA-COUNT2 = WK-BOKA-COUNT2 + CNS-1
      *----------  利用会社コード
               MOVE  WK-RIYO-CMP-CD     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-RIYO-CMP-CD
                 OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)
      *----------  ファンドコード
               MOVE  WK-FUND-CD         OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-FUND-CD
                 OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)
      *----------  ポートフォリオコード
               MOVE  WK-PTF-CD          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-PTF-CD
                 OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)
      *----------  銘柄コード
               MOVE  WK-MEG-CD          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-MEG-CD
                 OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)
      *----------  差分更新From日
               MOVE  WK-SABON-UPDATE-FROM
                 OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-SABON-UPDATE-FROM
                 OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)
      *----------  基準日
               MOVE  WK-KJN-YMD         OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-KJN-YMD
                 OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_資金簿価異動_2=["
      D             WK-BOKA-COUNT2"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日  =["WK-SABON-UPDATE-FROM
      D             OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-BOKA-DEL-BUF2(WK-BOKA-COUNT2)"]"
      *-----------------------------------------------------------------
             ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク資金簿価異動_DEL_BUF2処理しない"
      *-----------------------------------------------------------------
               CONTINUE
             END-IF
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  対象銘柄は資金の場合の処理  "
      D             "正常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       SIKIN-SHRI-EXT.
           EXIT.
      ******************************************************************
      *        3.2.5.勘定異動を削除
      ******************************************************************
       KNJ-DEL-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID  ":***  勘定異動を削除の処理  START  ***"
      D    DISPLAY  CNS-PGM-ID":ワーク銘柄種類=["WK-MEG-CD-SHRU
      D             OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":ワーク差分更新From日=["
      D         WK-SABON-UPDATE-FROM  OF  WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      *-----------------------------------------------------------------
      *----------  対象銘柄データを勘定異動TBLより物理削除
      *----------  ①ワーク銘柄別断面情報ホスト表[CNT-IDX].銘柄種類≠'3'(資金)
      *----------  AND ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日 = 空の場合
           IF  WK-MEG-CD-SHRU           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               NOT =  CNS-MEG-CD-SHRU-3
           AND
               WK-SABON-UPDATE-FROM     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               = ZERO
           THEN
      *----------  ワークCount_勘定異動_1
             COMPUTE  WK-KANJYO-COUNT1 = WK-KANJYO-COUNT1 + CNS-1
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-RIYO-CMP-CD
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *----------  ファンドコード
             MOVE  WK-FUND-CD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-FUND-CD
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-PTF-CD
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD        OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SEC-SBT-CD
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *----------  銘柄コード
             MOVE  WK-MEG-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-MEG-CD
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-TATE-FLG
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-GYOKU-ID
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *----------  開始基準日
             MOVE  WK-KAISI-KJN-YMD     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KAISI-KJN-YMD
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *----------  基準日
             MOVE  WK-KJN-YMD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KJN-YMD
               OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_勘定異動_1=["
      D             WK-KANJYO-COUNT1"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["WK-TATE-FLG
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                =["WK-GYOKU-ID
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日          =["WK-KAISI-KJN-YMD
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-KANJYO-DEL-BUF1(WK-KANJYO-COUNT1)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク勘定異動_DEL_BUF1処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  ②ワーク銘柄別断面情報ホスト表[CNT-IDX].銘柄種類≠'3'(資金)
      *----------  AND ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日 <> 空の場合
           IF  WK-MEG-CD-SHRU           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               NOT =  CNS-MEG-CD-SHRU-3
           AND
               WK-SABON-UPDATE-FROM     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               NOT = ZERO
           THEN
      *----------  ワークCount_勘定異動_2
             COMPUTE  WK-KANJYO-COUNT2 = WK-KANJYO-COUNT2 + CNS-1
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-RIYO-CMP-CD
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *----------  ファンドコード
             MOVE  WK-FUND-CD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-FUND-CD
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-PTF-CD
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *----------  証券種別コード
             MOVE  WK-SEC-SBT-CD        OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SEC-SBT-CD
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *----------  銘柄コード
             MOVE  WK-MEG-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-MEG-CD
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-TATE-FLG
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-GYOKU-ID
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *----------  差分更新From日
             MOVE  WK-SABON-UPDATE-FROM
               OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SABON-UPDATE-FROM
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *----------  基準日
             MOVE  WK-KJN-YMD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KJN-YMD
               OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_勘定異動_2=["
      D             WK-KANJYO-COUNT2"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["WK-SEC-SBT-CD
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["WK-TATE-FLG
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                =["WK-GYOKU-ID
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日  =["WK-SABON-UPDATE-FROM
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-KANJYO-DEL-BUF2(WK-KANJYO-COUNT2)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク勘定異動_DEL_BUF2処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  対象銘柄データを勘定異動TBLより物理削除
      *----------  ③ワーク銘柄別断面情報ホスト表[CNT-IDX].銘柄種類２='3'(資金)
      *----------  AND ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日 = 空の場合
           IF  WK-MEG-CD-SHRU           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               =  CNS-MEG-CD-SHRU-3
           AND
               WK-SABON-UPDATE-FROM     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               = ZERO
           THEN
      *----------  ワークCount_勘定異動_3
             COMPUTE  WK-KANJYO-COUNT3 = WK-KANJYO-COUNT3 + CNS-1
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-RIYO-CMP-CD
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  ファンドコード
             MOVE  WK-FUND-CD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-FUND-CD
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-PTF-CD
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  銘柄コード
             MOVE  WK-MEG-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-MEG-CD
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  銘柄コード≠△　AND　銘柄コードの先頭４桁が数字ではない場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             WK-MEG-CD OF WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      *-----------------------------------------------------------------
             IF    WK-MEG-CD
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)  NOT = SPACE
               AND WK-MEG-CD
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)(1:4)
               IS  NOT  NUMERIC
             THEN
      *----------  証券種別コード
               MOVE  WK-SEC-SBT-CD      OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-SEC-SBT-CD
                 OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  証券種別コード1
               MOVE  WK-SEC-SBT-CD      OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-SEC-SBT-CD-1
                 OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報ホスト表.証券種別コード=["
      D         WK-SEC-SBT-CD OF WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D         WK-SEC-SBT-CD OF WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード1=["
      D       WK-SEC-SBT-CD-1 OF WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      *-----------------------------------------------------------------
             ELSE
      *----------  証券種別コード
               MOVE  SPACE
                 TO  WK-SEC-SBT-CD
                 OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  証券種別コード1
               MOVE  SPACE
                 TO  WK-SEC-SBT-CD-1
                 OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D         WK-SEC-SBT-CD OF WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード1=["
      D       WK-SEC-SBT-CD-1 OF WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      *-----------------------------------------------------------------
             END-IF
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-TATE-FLG
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-GYOKU-ID
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  開始基準日
             MOVE  WK-KAISI-KJN-YMD     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KAISI-KJN-YMD
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *----------  基準日
             MOVE  WK-KJN-YMD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KJN-YMD
               OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_勘定異動_3=["
      D             WK-KANJYO-COUNT3"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["WK-TATE-FLG
      D             OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                =["WK-GYOKU-ID
      D             OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日          =["WK-KAISI-KJN-YMD
      D             OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-KANJYO-DEL-BUF3(WK-KANJYO-COUNT3)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク勘定異動_DEL_BUF3処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *----------  ④ワーク銘柄別断面情報ホスト表[CNT-IDX].銘柄種類２='3'(資金)
      *----------  AND ワーク銘柄別断面情報ホスト表[CNT-IDX].差分更新From日 <> 空の場合
           IF  WK-MEG-CD-SHRU           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               =  CNS-MEG-CD-SHRU-3
           AND
               WK-SABON-UPDATE-FROM     OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               NOT = ZERO
           THEN
      *----------  ワークCount_勘定異動_4
             COMPUTE  WK-KANJYO-COUNT4 = WK-KANJYO-COUNT4 + CNS-1
      *----------  利用会社コード
             MOVE  WK-RIYO-CMP-CD       OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-RIYO-CMP-CD
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  ファンドコード
             MOVE  WK-FUND-CD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-FUND-CD
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  ポートフォリオコード
             MOVE  WK-PTF-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-PTF-CD
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  銘柄コード
             MOVE  WK-MEG-CD            OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-MEG-CD
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  銘柄コード≠△　AND　銘柄コードの先頭４桁が数字ではない場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             WK-MEG-CD OF WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      *-----------------------------------------------------------------
             IF    WK-MEG-CD
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)  NOT = SPACE
               AND WK-MEG-CD
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)(1:4)
               IS  NOT  NUMERIC
             THEN
      *----------  証券種別コード
               MOVE  WK-SEC-SBT-CD      OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-SEC-SBT-CD
                 OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  証券種別コード1
               MOVE  WK-SEC-SBT-CD      OF  WK-MEG-BETU-HST(WK-CNT-IDX)
                 TO  WK-SEC-SBT-CD-1
                 OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報ホスト表.証券種別コード=["
      D         WK-SEC-SBT-CD OF WK-MEG-BETU-HST(WK-CNT-IDX)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D         WK-SEC-SBT-CD OF WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード1=["
      D       WK-SEC-SBT-CD-1 OF WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      *-----------------------------------------------------------------
             ELSE
      *----------  証券種別コード
               MOVE  SPACE
                 TO  WK-SEC-SBT-CD
                 OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  証券種別コード1
               MOVE  SPACE
                 TO  WK-SEC-SBT-CD-1
                 OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D         WK-SEC-SBT-CD OF WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード1=["
      D       WK-SEC-SBT-CD-1 OF WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      *-----------------------------------------------------------------
             END-IF
      *----------  資産負債・買建売建フラグ
             MOVE  WK-TATE-FLG          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-TATE-FLG
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  玉ID
             MOVE  WK-GYOKU-ID          OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-GYOKU-ID
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  差分更新From日
             MOVE  WK-SABON-UPDATE-FROM
               OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-SABON-UPDATE-FROM
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *----------  基準日
             MOVE  WK-KJN-YMD           OF  WK-MEG-BETU-HST(WK-CNT-IDX)
               TO  WK-KJN-YMD
               OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_勘定異動_4=["
      D             WK-KANJYO-COUNT4"]"
      D    DISPLAY  CNS-PGM-ID":利用会社コード      =["WK-RIYO-CMP-CD
      D             OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード      =["WK-FUND-CD
      D             OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["WK-PTF-CD
      D             OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード          =["WK-MEG-CD
      D             OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["WK-TATE-FLG
      D             OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID                =["WK-GYOKU-ID
      D             OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日  =["WK-SABON-UPDATE-FROM
      D             OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      D    DISPLAY  CNS-PGM-ID":基準日              =["WK-KJN-YMD
      D             OF  WK-KANJYO-DEL-BUF4(WK-KANJYO-COUNT4)"]"
      *-----------------------------------------------------------------
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワーク勘定異動_DEL_BUF4処理しない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   勘定異動を削除の処理END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       KNJ-DEL-EXT.
           EXIT.
      ******************************************************************
      *     3.2.6.CNT-IDX = ワーク区間件数 +1 の場合、下記処理する
      ******************************************************************
       SQL-DEL-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   削除の処理  START   *****"
      D    DISPLAY  CNS-PGM-ID":ワークCount_残高異動_1=["
      D             WK-ZANTK-COUNT1"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_残高異動_1 > 0 の場合
           IF  WK-ZANTK-COUNT1 > ZERO
           THEN
      *----------  対象銘柄データを残高異動TBLより物理削除
             PERFORM  ZANTK-DEL1-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_残高異動_2=["
      D             WK-ZANTK-COUNT2"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_残高異動_2 > 0 の場合
           IF  WK-ZANTK-COUNT2 > ZERO
           THEN
      *----------  対象銘柄データを残高異動TBLより物理削除
             PERFORM  ZANTK-DEL2-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_資金簿価異動_1=["
      D             WK-BOKA-COUNT1"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_資金簿価異動_1 > 0 の場合
           IF  WK-BOKA-COUNT1 > ZERO
           THEN
      *----------  対象銘柄データを資金簿価異動TBLより物理削除
             PERFORM  BOKA-DEL1-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_資金簿価異動_2=["
      D             WK-BOKA-COUNT2"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_資金簿価異動_2 > 0 の場合
           IF  WK-BOKA-COUNT2 > ZERO
           THEN
      *----------  対象銘柄データを資金簿価異動TBLより物理削除
             PERFORM  BOKA-DEL2-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_前払金管理_1=["
      D             WK-MAIBAI-COUNT1"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_前払金管理_1 > 0 の場合
           IF  WK-MAIBAI-COUNT1 > ZERO
           THEN
      *----------  対象銘柄データを前払金管理TBLより物理削除
             PERFORM  MAIBAI-DEL1-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_前払金管理_2=["
      D             WK-MAIBAI-COUNT2"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_前払金管理_2 > 0 の場合
           IF  WK-MAIBAI-COUNT2 > ZERO
           THEN
      *----------  対象銘柄データを前払金管理TBLより物理削除
             PERFORM  MAIBAI-DEL2-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_勘定異動_1=["
      D             WK-KANJYO-COUNT1"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_勘定異動_1 > 0 の場合
           IF  WK-KANJYO-COUNT1 > ZERO
           THEN
      *----------  対象銘柄データを勘定異動TBLより物理削除
             PERFORM  KANJYO-DEL1-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_勘定異動_2=["
      D             WK-KANJYO-COUNT2"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_勘定異動_2 > 0 の場合
           IF  WK-KANJYO-COUNT2 > ZERO
           THEN
      *----------  対象銘柄データを勘定異動TBLより物理削除
             PERFORM  KANJYO-DEL2-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_勘定異動_3=["
      D             WK-KANJYO-COUNT3"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_勘定異動_3 > 0 の場合
           IF  WK-KANJYO-COUNT3 > ZERO
           THEN
      *----------  対象銘柄データを勘定異動TBLより物理削除
             PERFORM  KANJYO-DEL3-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":ワークCount_勘定異動_4=["
      D             WK-KANJYO-COUNT4"]"
      *-----------------------------------------------------------------
      *----------  ワークCount_勘定異動_4 > 0 の場合
           IF  WK-KANJYO-COUNT4 > ZERO
           THEN
      *----------  対象銘柄データを勘定異動TBLより物理削除
             PERFORM  KANJYO-DEL4-RTN
           ELSE
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   削除の処理   END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       SQL-DEL-EXT.
      ******************************************************************
      *     対象銘柄データを残高異動TBLより物理削除
      ******************************************************************
       ZANTK-DEL1-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを残高異動TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT1                                         @3212SEINO@@
                       H-TKMZZI00-D
      *----------  テーブルID
           MOVE  WK-TBL-TKMZZI00        TO  SQL-TBL-ID-3
           MOVE  WK-ZANTK-DEL-BUF1      TO  H-TKMZZI00-D
           MOVE  SQL-DELETE-1-3         TO  SQLSTMT1                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動-1 SQLSTMT1    =["SQLSTMT1"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR1 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZZI00-CR1 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D1 FROM :SQLSTMT1 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-1-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZZI00-1-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-ZANTK1-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  WK-ERR-POS1
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-3         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D1                                          @3212SEINO@@
             USING  :H-TKMZZI00-D.H-TKMZZI00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZZI00-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-1-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZZI00-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZZI00-1-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-ZANTK1-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-3       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動-1データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを残高異動TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       ZANTK-DEL1-EXT.
      ******************************************************************
      *     対象銘柄データを残高異動TBL削除MSG処理1
      ******************************************************************
       WK-MSG-ZANTK1-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高異動TBL削除MSG処理1  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  残高異動TBL
           MOVE  WK-TBL-TKMZZI00
             TO  WK-TKMZZI00            OF  WK-MSG-1-3
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D        OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-3
      *----------  ファンドコード
           MOVE  H-FUND-CD-D            OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-3
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D             OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-3
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD-D         OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-3
      *----------  銘柄コード
           MOVE  H-MEG-CD-D             OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-3
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG-D           OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-3
      *----------  玉ID
           MOVE  H-GYOKU-ID-D           OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-3
      *----------  基準日
           MOVE  H-KJN-YMD-D            OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-3
      *----------  開始基準日
           MOVE  H-KAISI-KJN-YMD-D      OF  H-TKMZZI00-D(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-3  =["WK-MSG-1-3"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高異動TBL削除MSG処理1   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-ZANTK1-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを残高異動TBLより物理削除
      ******************************************************************
       ZANTK-DEL2-RTN         SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを残高異動TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT2                                         @3212SEINO@@
                       H-TKMZZI00-D-1
      *----------  テーブルID
           MOVE  WK-TBL-TKMZZI00        TO  SQL-TBL-ID-4
           MOVE  WK-ZANTK-DEL-BUF2      TO  H-TKMZZI00-D-1
           MOVE  SQL-DELETE-1-4         TO  SQLSTMT2                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動-2 SQLSTMT2    =["SQLSTMT2"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR2 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZZI00-CR2 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D2 FROM :SQLSTMT2 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-2-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZZI00-2-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-ZANTK2-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  WK-ERR-POS1
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-4         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D2                                          @3212SEINO@@
             USING  :H-TKMZZI00-D-1.H-TKMZZI00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZZI00-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZZI00-2-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZZI00-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZZI00-2-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-ZANTK2-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS2
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-4       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動-2データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを残高異動TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       ZANTK-DEL2-EXT.
      ******************************************************************
      *     対象銘柄データを残高異動TBL削除MSG処理2
      ******************************************************************
       WK-MSG-ZANTK2-RTN      SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高異動TBL削除MSG処理2  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  残高異動TBL
           MOVE  WK-TBL-TKMZZI00
             TO  WK-TKMZZI00            OF  WK-MSG-1-4
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-4
      *----------  ファンドコード
           MOVE  H-FUND-CD-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-4
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-4
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-4
      *----------  銘柄コード
           MOVE  H-MEG-CD-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-4
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-4
      *----------  玉ID
           MOVE  H-GYOKU-ID-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-4
      *----------  基準日
           MOVE  H-KJN-YMD-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-4
      *----------  差分更新From日
           MOVE  H-SABON-UPDATE-FROM-D
             OF  H-TKMZZI00-D-1(SQLERRD(3) + 1)
             TO  WK-SABON-UPDATE-FROM   OF  WK-MSG-1-4
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-4  =["WK-MSG-1-4"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  残高異動TBL削除MSG処理2   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-ZANTK2-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを資金簿価異動TBLより物理削除
      ******************************************************************
       BOKA-DEL1-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを資金簿価異動TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT3                                         @3212SEINO@@
                       H-TKMZSI00-D
      *----------  テーブルID
           MOVE  WK-TBL-TKMZSI00        TO  SQL-TBL-ID-7
           MOVE  WK-BOKA-DEL-BUF1       TO  H-TKMZSI00-D
           MOVE  SQL-DELETE-1-7         TO  SQLSTMT3                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動-1 SQLSTMT3   =["SQLSTMT3"]"@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ１=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR1 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZSI00-CR1 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D3 FROM :SQLSTMT3 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-1-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZSI00-1-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-BOKA1-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-021
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-7         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D3                                          @3212SEINO@@
             USING  :H-TKMZSI00-D.H-TKMZSI00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZSI00-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ１=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-1-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZSI00-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ１=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZSI00-1-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-BOKA1-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-022
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-7       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動-1データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを資金簿価異動TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       BOKA-DEL1-EXT.
      ******************************************************************
      *     対象銘柄データを資金簿価異動TBL削除MSG処理1
      ******************************************************************
       WK-MSG-BOKA1-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金簿価異動TBL削除MSG処理1  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  資金簿価異動TBL
           MOVE  WK-TBL-TKMZSI00
             TO  WK-TKMZSI00            OF  WK-MSG-1-7
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D        OF  H-TKMZSI00-D(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-7
      *----------  ファンドコード
           MOVE  H-FUND-CD-D            OF  H-TKMZSI00-D(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-7
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D             OF  H-TKMZSI00-D(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-7
      *----------  銘柄コード
           MOVE  H-MEG-CD-D             OF  H-TKMZSI00-D(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-7
      *----------  基準日
           MOVE  H-KJN-YMD-D            OF  H-TKMZSI00-D(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-7
      *----------  開始基準日
           MOVE  H-KAISI-KJN-YMD-D      OF  H-TKMZSI00-D(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-7
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-7  =["WK-MSG-1-7"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金簿価異動TBL削除MSG処理1   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-BOKA1-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを資金簿価異動TBLより物理削除
      ******************************************************************
       BOKA-DEL2-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを資金簿価異動TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT4                                         @3212SEINO@@
                       H-TKMZSI00-D-1
      *----------  テーブルID
           MOVE  WK-TBL-TKMZSI00        TO  SQL-TBL-ID-8
           MOVE  WK-BOKA-DEL-BUF2       TO  H-TKMZSI00-D-1
           MOVE  SQL-DELETE-1-8         TO  SQLSTMT4                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動-2 SQLSTMT4   =["SQLSTMT4"]"@3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ２=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR2 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZSI00-CR2 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D4 FROM :SQLSTMT4 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-2-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZSI00-2-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-BOKA2-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-023
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-8         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D4                                          @3212SEINO@@
             USING  :H-TKMZSI00-D-1.H-TKMZSI00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZSI00-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ２=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZSI00-2-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZSI00-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ２=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZSI00-2-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-BOKA2-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-024
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-8       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":資金簿価異動-2データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを資金簿価異動TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       BOKA-DEL2-EXT.
      ******************************************************************
      *     対象銘柄データを資金簿価異動TBL削除MSG処理2
      ******************************************************************
       WK-MSG-BOKA2-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金簿価異動TBL削除MSG処理2  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  資金簿価異動TBL
           MOVE  WK-TBL-TKMZSI00
             TO  WK-TKMZSI00            OF  WK-MSG-1-8
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D
             OF  H-TKMZSI00-D-1(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-8
      *----------  ファンドコード
           MOVE  H-FUND-CD-D
             OF  H-TKMZSI00-D-1(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-8
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D
             OF  H-TKMZSI00-D-1(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-8
      *----------  銘柄コード
           MOVE  H-MEG-CD-D
             OF  H-TKMZSI00-D-1(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-8
      *----------  基準日
           MOVE  H-KJN-YMD-D
             OF  H-TKMZSI00-D-1(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-8
      *----------  差分更新From日
           MOVE  H-SABON-UPDATE-FROM-D
             OF  H-TKMZSI00-D-1(SQLERRD(3) + 1)
             TO  WK-SABON-UPDATE-FROM   OF  WK-MSG-1-8
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-8  =["WK-MSG-1-8"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  資金簿価異動TBL削除MSG処理2   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-BOKA2-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを前払金管理TBLより物理削除
      ******************************************************************
       MAIBAI-DEL1-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを前払金管理TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT5                                         @3212SEINO@@
                       H-TKMZMB00-D
      *----------  テーブルID
           MOVE  WK-TBL-TKMZMB00        TO  SQL-TBL-ID-9
           MOVE  WK-MAIBAI-DEL-BUF1     TO  H-TKMZMB00-D
           MOVE  SQL-DELETE-1-9         TO  SQLSTMT5                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理-1 SQLSTMT5    =["SQLSTMT5"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ１=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR1 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZMB00-CR1 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D5 FROM :SQLSTMT5 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-1-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZMB00-1-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-MAIBAI1-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  WK-ERR-POS3
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-9         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D5                                          @3212SEINO@@
             USING  :H-TKMZMB00-D.H-TKMZMB00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZMB00-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ１=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-1-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZMB00-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ１=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZMB00-1-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-MAIBAI1-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS4
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-9       DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理-1データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを前払金管理TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIBAI-DEL1-EXT.
      ******************************************************************
      *     対象銘柄データを前払金管理TBL削除MSG処理1
      ******************************************************************
       WK-MSG-MAIBAI1-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  前払金管理TBL削除MSG処理1  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  前払金管理TBL
           MOVE  WK-TBL-TKMZMB00
             TO  WK-TKMZMB00            OF  WK-MSG-1-9
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D        OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-9
      *----------  ファンドコード
           MOVE  H-FUND-CD-D            OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-9
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D             OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-9
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD-D         OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-9
      *----------  銘柄コード
           MOVE  H-MEG-CD-D             OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-9
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG-D           OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-9
      *----------  玉ID
           MOVE  H-GYOKU-ID-D           OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-9
      *----------  基準日
           MOVE  H-KJN-YMD-D            OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-9
      *----------  開始基準日
           MOVE  H-KAISI-KJN-YMD-D      OF  H-TKMZMB00-D(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-9
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-9  =["WK-MSG-1-9"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  前払金管理TBL削除MSG処理1   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-MAIBAI1-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを前払金管理TBLより物理削除
      ******************************************************************
       MAIBAI-DEL2-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを前払金管理TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT6                                         @3212SEINO@@
                       H-TKMZMB00-D-1
      *----------  テーブルID
           MOVE  WK-TBL-TKMZMB00        TO  SQL-TBL-ID-10
           MOVE  WK-MAIBAI-DEL-BUF2     TO  H-TKMZMB00-D-1
           MOVE  SQL-DELETE-1-10        TO  SQLSTMT6                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理-2 SQLSTMT6    =["SQLSTMT6"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR2 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZMB00-CR2 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D6 FROM :SQLSTMT6 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-2-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZMB00-2-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-MAIBAI2-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  WK-ERR-POS3
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-10         DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D6                                          @3212SEINO@@
             USING  :H-TKMZMB00-D-1.H-TKMZMB00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZMB00-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZMB00-2-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZMB00-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZMB00-2-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-MAIBAI2-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  WK-ERR-POS4
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-10      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":前払金管理-2データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを前払金管理TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       MAIBAI-DEL2-EXT.
      ******************************************************************
      *     対象銘柄データを前払金管理TBL削除MSG処理2
      ******************************************************************
       WK-MSG-MAIBAI2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  前払金管理TBL削除MSG処理2  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  前払金管理TBL
           MOVE  WK-TBL-TKMZMB00
             TO  WK-TKMZMB00            OF  WK-MSG-1-10
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-10
      *----------  ファンドコード
           MOVE  H-FUND-CD-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-10
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-10
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-10
      *----------  銘柄コード
           MOVE  H-MEG-CD-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-10
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-10
      *----------  玉ID
           MOVE  H-GYOKU-ID-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-10
      *----------  基準日
           MOVE  H-KJN-YMD-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-10
      *----------  差分更新From日
           MOVE  H-SABON-UPDATE-FROM-D
             OF  H-TKMZMB00-D-1(SQLERRD(3) + 1)
             TO  WK-SABON-UPDATE-FROM   OF  WK-MSG-1-10
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-10  =["WK-MSG-1-10"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  前払金管理TBL削除MSG処理2   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-MAIBAI2-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを勘定異動TBLより物理削除
      ******************************************************************
       KANJYO-DEL1-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを勘定異動TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT7                                         @3212SEINO@@
                       H-TKMZKI00-D-1
      *----------  テーブルID
           MOVE  WK-TBL-TKMZKI00        TO  SQL-TBL-ID-16
           MOVE  WK-KANJYO-DEL-BUF1     TO  H-TKMZKI00-D-1
           MOVE  SQL-DELETE-1-16        TO  SQLSTMT7                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動-1 SQLSTMT7    =["SQLSTMT7"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR1 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZKI00-CR1 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D7 FROM :SQLSTMT7 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-1-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZKI00-1-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-KANJYO1-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-025
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-16        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D7                                          @3212SEINO@@
             USING  :H-TKMZKI00-D-1.H-TKMZKI00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKI00-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-1-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKI00-CR1     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZKI00-1-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-KANJYO1-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-026
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-16      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動-1データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを勘定異動TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       KANJYO-DEL1-EXT.
      ******************************************************************
      *     対象銘柄データを勘定異動TBL削除MSG処理1
      ******************************************************************
       WK-MSG-KANJYO1-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定異動TBL削除MSG処理1  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  勘定異動TBL
           MOVE  WK-TBL-TKMZKI00
             TO  WK-TKMZKI00            OF  WK-MSG-1-16
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-16
      *----------  ファンドコード
           MOVE  H-FUND-CD-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-16
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-16
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-16
      *----------  銘柄コード
           MOVE  H-MEG-CD-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-16
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-16
      *----------  玉ID
           MOVE  H-GYOKU-ID-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-16
      *----------  基準日
           MOVE  H-KJN-YMD-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-16
      *----------  開始基準日
           MOVE  H-KAISI-KJN-YMD-D
             OF  H-TKMZKI00-D-1(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-16
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-16  =["WK-MSG-1-16"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定異動TBL削除MSG処理1   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-KANJYO1-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを勘定異動TBLより物理削除
      ******************************************************************
       KANJYO-DEL2-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを勘定異動TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT8                                         @3212SEINO@@
                       H-TKMZKI00-D-2
      *----------  テーブルID
           MOVE  WK-TBL-TKMZKI00        TO  SQL-TBL-ID-17
           MOVE  WK-KANJYO-DEL-BUF2     TO  H-TKMZKI00-D-2
           MOVE  SQL-DELETE-1-17        TO  SQLSTMT8                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動-2 SQLSTMT8    =["SQLSTMT8"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR2 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZKI00-CR2 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D8 FROM :SQLSTMT8 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-2-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZKI00-2-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-KANJYO2-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-027
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-17        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           EXEC SQL EXECUTE D8                                          @3212SEINO@@
             USING  :H-TKMZKI00-D-2.H-TKMZKI00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKI00-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-2-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKI00-CR2     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZKI00-2-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-KANJYO2-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-028
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-17      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動-2データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを勘定異動TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       KANJYO-DEL2-EXT.
      ******************************************************************
      *     対象銘柄データを勘定異動TBL削除MSG処理2
      ******************************************************************
       WK-MSG-KANJYO2-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定異動TBL削除MSG処理2  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  勘定異動TBL
           MOVE  WK-TBL-TKMZKI00
             TO  WK-TKMZKI00            OF  WK-MSG-1-17
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-17
      *----------  ファンドコード
           MOVE  H-FUND-CD-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-17
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-17
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-17
      *----------  銘柄コード
           MOVE  H-MEG-CD-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-17
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-17
      *----------  玉ID
           MOVE  H-GYOKU-ID-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-17
      *----------  基準日
           MOVE  H-KJN-YMD-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-17
      *----------  差分更新From日
           MOVE  H-SABON-UPDATE-FROM-D
             OF  H-TKMZKI00-D-2(SQLERRD(3) + 1)
             TO  WK-SABON-UPDATE-FROM   OF  WK-MSG-1-17
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-17  =["WK-MSG-1-17"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定異動TBL削除MSG処理2   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-KANJYO2-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを勘定異動TBLより物理削除
      ******************************************************************
       KANJYO-DEL3-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを勘定異動TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT9                                         @3212SEINO@@
                       H-TKMZKI00-D-3
      *----------  テーブルID
           MOVE  WK-TBL-TKMZKI00        TO  SQL-TBL-ID-18
           MOVE  WK-KANJYO-DEL-BUF3     TO  H-TKMZKI00-D-3
           MOVE  SQL-DELETE-1-18        TO  SQLSTMT9                    @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動-3 SQLSTMT9    =["SQLSTMT9"]"   @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ３=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR3 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZKI00-CR3 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D9 FROM :SQLSTMT9 END-EXEC                  @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-3-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZKI00-3-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-KANJYO3-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-029
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-18        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD-D    OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD-D        OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD-D         OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD-D         OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG-D       OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID=["
      D             H-GYOKU-ID-D       OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             H-KJN-YMD-D        OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":開始基準日=["
      D             H-KAISI-KJN-YMD-D  OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD       OF  H-TKMZKI00-D-3(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード1=["
      D             H-SEC-SBT-CD-1     OF  H-TKMZKI00-D-3(CNS-1)"]"
      *-----------------------------------------------------------------
           EXEC SQL EXECUTE D9                                          @3212SEINO@@
             USING  :H-TKMZKI00-D-3.H-TKMZKI00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKI00-CR3     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ３=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR3 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-3-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKI00-CR3     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ３=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR3 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZKI00-3-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-KANJYO3-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-030
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-18      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動-3データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを勘定異動TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       KANJYO-DEL3-EXT.
      ******************************************************************
      *     対象銘柄データを勘定異動TBL削除MSG処理3
      ******************************************************************
       WK-MSG-KANJYO3-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定異動TBL削除MSG処理3  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  勘定異動TBL
           MOVE  WK-TBL-TKMZKI00
             TO  WK-TKMZKI00            OF  WK-MSG-1-18
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-18
      *----------  ファンドコード
           MOVE  H-FUND-CD-D
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-18
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-18
      *----------  銘柄コード
           MOVE  H-MEG-CD-D
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-18
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG-D
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-18
      *----------  玉ID
           MOVE  H-GYOKU-ID-D
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-18
      *----------  基準日
           MOVE  H-KJN-YMD-D
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-18
      *----------  開始基準日
           MOVE  H-KAISI-KJN-YMD-D
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-KAISI-KJN-YMD       OF  WK-MSG-1-18
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-18
      *----------  証券種別コード1
           MOVE  H-SEC-SBT-CD-1
             OF  H-TKMZKI00-D-3(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD-1        OF  WK-MSG-1-18
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-18  =["WK-MSG-1-18"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定異動TBL削除MSG処理3   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-KANJYO3-EXT.
           EXIT.
      ******************************************************************
      *     対象銘柄データを勘定異動TBLより物理削除
      ******************************************************************
       KANJYO-DEL4-RTN        SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを勘定異動TBL"
      D             "より物理削除  START   *****"
      *-----------------------------------------------------------------
      *----------  ＳＱＬ文作成
           INITIALIZE  SQLSTMT10                                        @3212SEINO@@
                       H-TKMZKI00-D-4
      *----------  テーブルID
           MOVE  WK-TBL-TKMZKI00        TO  SQL-TBL-ID-19
           MOVE  WK-KANJYO-DEL-BUF4     TO  H-TKMZKI00-D-4
           MOVE  SQL-DELETE-1-19        TO  SQLSTMT10                   @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動-4 SQLSTMT10    =["SQLSTMT10"]" @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ４=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR4 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *--- PREPARE実行済の場合、PREPAREをスキップする                   @3212SEINO@@
           IF  FLG-DELETE-TKMZKI00-CR4 = CNS-OFF                        @3212SEINO@@
           THEN                                                         @3212SEINO@@
           EXEC SQL PREPARE D10 FROM :SQLSTMT10 END-EXEC                @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PREPARE-SQLCODE=["SQLCODE"]"
      *-----------------------------------------------------------------
           IF  SQLCODE                  =  CNS-SQL-NORMAL
           THEN
             CONTINUE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-4-DELETE-SQL処理正常（PREPARE)"
      *-----------------------------------------------------------------
           ELSE
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D                     ":TKMZKI00-4-DELETE-SQL処理エラー（PREPARE)"
      *-----------------------------------------------------------------
             INITIALIZE  SQLERRD(3)
             PERFORM  WK-MSG-KANJYO4-RTN
      *---------- エラー検知プログラム名
             MOVE  CNS-PGM-ID
               TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *---------- ポジション
             MOVE  CNS-POS-031
               TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *---------- リターンコード
             MOVE  CNS-RTN-900
               TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコード
             MOVE  SQLCODE
               TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *---------- 詳細リターンコードデコードフラグ
             MOVE  CNS-DETAIL-1
               TO  DETAIL-RTN-CD-FLG    OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
             STRING  CNS-ERR-33,
                     CNS-SQL-MSG-DELETE,
                     WK-MSG-1-19        DELIMITED  BY  SIZE
               INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *---------- エラー処理
             PERFORM  ERR-RTN
           END-IF
           ELSE                                                         @3212SEINO@@
             CONTINUE                                                   @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":利用会社コード=["
      D             H-RIYO-CMP-CD-D    OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ファンドコード=["
      D             H-FUND-CD-D        OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":ポートフォリオコード=["
      D             H-PTF-CD-D         OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":銘柄コード=["
      D             H-MEG-CD-D         OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":資産負債・買建売建フラグ=["
      D             H-TATE-FLG-D       OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":玉ID=["
      D             H-GYOKU-ID-D       OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":基準日=["
      D             H-KJN-YMD-D        OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":差分更新From日=["
      D             H-SABON-UPDATE-FROM-D  OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード=["
      D             H-SEC-SBT-CD       OF  H-TKMZKI00-D-4(CNS-1)"]"
      D    DISPLAY  CNS-PGM-ID":証券種別コード1=["
      D             H-SEC-SBT-CD-1     OF  H-TKMZKI00-D-4(CNS-1)"]"
      *-----------------------------------------------------------------
           EXEC SQL EXECUTE D10                                         @3212SEINO@@
             USING  :H-TKMZKI00-D-4.H-TKMZKI00-TBL
           END-EXEC
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY CNS-PGM-ID":SQLCODE =["SQLCODE"]"
      *-----------------------------------------------------------------
           EVALUATE  SQLCODE
             WHEN  CNS-SQL-NORMAL
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKI00-CR4     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *-----------------------DEBUG-------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ４=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR4 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":TKMZKI00-4-DELETE-SQL処理正常（DELETE)"
      *-----------------------------------------------------------------
             WHEN  CNS-SQL-NOTFOUND
               MOVE  CNS-ON             TO  FLG-DELETE-TKMZKI00-CR4     @3212SEINO@@
      *        CONTINUE                                                 @3212SEINO@@
      *----------------------<DEBUG>------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ４=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR4 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID
      D                    ":TKMZKI00-4-DELETE-SQL処理NOTFOUND（DELETE)"
      *-----------------------------------------------------------------
             WHEN  OTHER
               PERFORM  WK-MSG-KANJYO4-RTN
      *----------  エラー検知プログラム名
               MOVE  CNS-PGM-ID
                 TO  ERR-PGM-ID         OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-032
                 TO  ERR-POS            OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-900
                 TO  RTN-CD             OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
               MOVE  SQLCODE
                 TO  DETAIL-RTN-CD      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-1
                TO  DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
               STRING  CNS-ERR-33,
                       CNS-SQL-MSG-DELETE,
                       WK-MSG-1-19      DELIMITED  BY  SIZE
                 INTO  FREE-MSG         OF  PARM-SCZY1170-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":勘定異動-4データを物理削除  異常"
      D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  ERR-RTN
           END-EVALUATE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":*****   対象銘柄データを勘定異動TBL"
      D             "より物理削除  END   *****"
      *-----------------------------------------------------------------
           CONTINUE.
       KANJYO-DEL4-EXT.
      ******************************************************************
      *     対象銘柄データを勘定異動TBL削除MSG処理4
      ******************************************************************
       WK-MSG-KANJYO4-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定異動TBL削除MSG処理4  START ***"
      D    DISPLAY  CNS-PGM-ID":SQLERRD(3)   =["SQLERRD(3)"]"
      *-----------------------------------------------------------------
      *----------  勘定異動TBL
           MOVE  WK-TBL-TKMZKI00
             TO  WK-TKMZKI00            OF  WK-MSG-1-19
      *----------  利用会社コード
           MOVE  H-RIYO-CMP-CD-D
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-RIYO-CMP-CD         OF  WK-MSG-1-19
      *----------  ファンドコード
           MOVE  H-FUND-CD-D
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-FUND-CD             OF  WK-MSG-1-19
      *----------  ポートフォリオコード
           MOVE  H-PTF-CD-D
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-PTF-CD              OF  WK-MSG-1-19
      *----------  銘柄コード
           MOVE  H-MEG-CD-D
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-MEG-CD              OF  WK-MSG-1-19
      *----------  資産負債・買建売建フラグ
           MOVE  H-TATE-FLG-D
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-TATE-FLG            OF  WK-MSG-1-19
      *----------  玉ID
           MOVE  H-GYOKU-ID-D
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-GYOKU-ID            OF  WK-MSG-1-19
      *----------  基準日
           MOVE  H-KJN-YMD-D
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-KJN-YMD             OF  WK-MSG-1-19
      *----------  差分更新From日
           MOVE  H-SABON-UPDATE-FROM-D
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-SABON-UPDATE-FROM   OF  WK-MSG-1-19
      *----------  証券種別コード
           MOVE  H-SEC-SBT-CD
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD          OF  WK-MSG-1-19
      *----------  証券種別コード1
           MOVE  H-SEC-SBT-CD-1
             OF  H-TKMZKI00-D-4(SQLERRD(3) + 1)
             TO  WK-SEC-SBT-CD-1        OF  WK-MSG-1-19
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":WK-MSG-1-19  =["WK-MSG-1-19"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":***  勘定異動TBL削除MSG処理4   END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       WK-MSG-KANJYO4-EXT.
           EXIT.
      ******************************************************************
      *    3.2.7銘柄別断面情報カーソルクローズ処理
      ******************************************************************
      *MEG-BETU-CLOSE-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  銘柄別断面情報カーソルクローズ"
      *D             "  START  ***"
      *-----------------------------------------------------------------
      *    EXEC  SQL
      *        CLOSE CR
      *    END-EXEC
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":SQLCODE(CURSOR CLOSE)  =["SQLCODE"]"
      *-----------------------------------------------------------------
      *    IF  SQLCODE = CNS-SQL-NORMAL
      *    THEN
      *      MOVE  CNS-OFF              TO  FLG-MEG-OPEN
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ=["
      *D             FLG-MEG-OPEN"]"
      *-----------------------------------------------------------------
      *    ELSE
      *----------  エラー検知プログラム名
      *      MOVE  CNS-PGM-ID
      *        TO  ERR-PGM-ID           OF  PARM-SCZY1170-ARG1
      *----------  ポジション
      *      MOVE  CNS-POS-033
      *        TO  ERR-POS              OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
      *      MOVE  CNS-RTN-900
      *        TO  RTN-CD               OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコード
      *      MOVE  SQLCODE
      *        TO  DETAIL-RTN-CD        OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
      *      MOVE  CNS-DETAIL-1
      *       TO  DETAIL-RTN-CD-FLG     OF  PARM-SCZY1170-ARG1
      *---------- フリーメッセージ
      *      STRING  CNS-ERR-34,
      *              CNS-SQL-MSG-SELECT,
      *              WK-SELECT-FREE-MSG
      *        INTO  FREE-MSG           OF  PARM-SCZY1170-ARG1
      *      END-STRING
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルクローズ  異常"
      *D    DISPLAY  CNS-PGM-ID":エラー検知プログラム名            =["
      *D               ERR-PGM-ID        OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":ポジション                        =["
      *D               ERR-POS           OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":リターンコード                    =["
      *D               RTN-CD            OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコード                =["
      *D               DETAIL-RTN-CD     OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":詳細リターンコードデコードフラグ  =["
      *D               DETAIL-RTN-CD-FLG OF  PARM-SCZY1170-ARG1"]"
      *D    DISPLAY  CNS-PGM-ID":フリーメッセージ                  =["
      *D               FREE-MSG          OF  PARM-SCZY1170-ARG1"]"
      *-----------------------------------------------------------------
      *----------  エラー処理
      *       PERFORM  ERR-RTN
      *    END-IF
      *-------------------<DEBUG>---------------------------------------
      *D    DISPLAY  CNS-PGM-ID":***  銘柄別断面情報カーソルクローズ"
      *D             "  END  ***"
      *-----------------------------------------------------------------
      *    CONTINUE.
      *MEG-BETU-CLOSE-EXT.
      *    EXIT.
      ******************************************************************
      *                 3.3.1 後処理
      ******************************************************************
       END-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***   後処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1710-ARG1=["
      D             PARM-SMZJ1710-ARG1  OF PARM-SMZJ1710-INOUT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1710-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ1710-ARG3     = ["
      D      PARM-SMZJ1710-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ1710-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ1710-ARG3(COUNTER  OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ1710-ARG3(COUNTER  OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ1710-ARG3(COUNTER  OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ1710-ARG3(COUNTER  OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ1710-ARG3(COUNTER  OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ1710-ARG3(COUNTER  OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID": ***   後処理  END  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       END-EXT.
           EXIT.
      ******************************************************************
      *                 3.4.1 エラー処理
      ******************************************************************
       ERR-RTN                SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":***  エラー処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE  PARM-SMZJ1710-ARG1    OF PARM-SMZJ1710-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":PARM-SMZJ1710-ARG1=["
      D             PARM-SMZJ1710-ARG1       OF PARM-SMZJ1710-INOUT"]"
      D    DISPLAY  CNS-PGM-ID
      D             ":リターンパッケージセットルーチンSCZY1170開始"
      *-----------------------------------------------------------------
           CALL  "SCZY1170"             USING  PARM-SCZY1170-IN
                                               PARM-SCZY1170-RTNPKG
           MOVE  PARM-SCZY1170-RTNPKG   TO  PARM-SMZJ1710-ARG3
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":  PARM-SCZY1170-RTNPKG   = ["
      D      PARM-SCZY1170-RTNPKG"]"
      D    DISPLAY  CNS-PGM-ID":  PARM-SMZJ1710-ARG3     = ["
      D      PARM-SMZJ1710-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  COUNT = ["
      D      COUNTER OF PARM-SMZJ1710-ARG3"]"
      D    DISPLAY  CNS-PGM-ID":  エラー検知プログラム名 = ["
      D      ERR-PGM-ID
      D      OF PARM-SMZJ1710-ARG3(COUNTER   OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  ポジション = ["
      D      ERR-POS
      D      OF PARM-SMZJ1710-ARG3(COUNTER   OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  リターンコード = ["
      D      RTN-CD
      D      OF PARM-SMZJ1710-ARG3(COUNTER   OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコード = ["
      D      DETAIL-RTN-CD
      D      OF PARM-SMZJ1710-ARG3(COUNTER   OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  詳細リターンコードデコードフラグ = ["
      D      DETAIL-RTN-CD-FLG
      D      OF PARM-SMZJ1710-ARG3(COUNTER   OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID":  フリーメッセージ = ["
      D      FREE-MSG
      D      OF PARM-SMZJ1710-ARG3(COUNTER   OF PARM-SMZJ1710-ARG3)"]"
      D    DISPLAY  CNS-PGM-ID
      D             ": リターンパッケージセットルーチンSCZY1170終了"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ=["
      D             FLG-MEG-OPEN"]"
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ１=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ２=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ１=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ３=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR3 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ４=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR4 "]"                         @3212SEINO@@
      *-----------------------------------------------------------------
      *----------  残高異動カーソルオープンフラグ１                     @3212SEINO@@
           IF  FLG-DELETE-TKMZZI00-CR1  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZZI00-CR1     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  残高異動カーソルオープンフラグ２                     @3212SEINO@@
           IF  FLG-DELETE-TKMZZI00-CR2  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZZI00-CR2     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  資金簿価異動カーソルオープンフラグ１                 @3212SEINO@@
           IF  FLG-DELETE-TKMZSI00-CR1  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZSI00-CR1     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  資金簿価異動カーソルオープンフラグ２                 @3212SEINO@@
           IF  FLG-DELETE-TKMZSI00-CR2  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZSI00-CR2     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  前払金管理カーソルオープンフラグ１                   @3212SEINO@@
           IF  FLG-DELETE-TKMZMB00-CR1  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZMB00-CR1     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  前払金管理カーソルオープンフラグ２                   @3212SEINO@@
           IF  FLG-DELETE-TKMZMB00-CR2  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZMB00-CR2     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  勘定異動カーソルオープンフラグ１                     @3212SEINO@@
           IF  FLG-DELETE-TKMZKI00-CR1  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZKI00-CR1     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  勘定異動カーソルオープンフラグ２                     @3212SEINO@@
           IF  FLG-DELETE-TKMZKI00-CR2  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZKI00-CR2     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  勘定異動カーソルオープンフラグ３                     @3212SEINO@@
           IF  FLG-DELETE-TKMZKI00-CR3  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZKI00-CR3     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
      *----------  勘定異動カーソルオープンフラグ４                     @3212SEINO@@
           IF  FLG-DELETE-TKMZKI00-CR4  =  CNS-ON                       @3212SEINO@@
           THEN                                                         @3212SEINO@@
             MOVE  CNS-OFF              TO  FLG-DELETE-TKMZKI00-CR4     @3212SEINO@@
           ELSE                                                         @3212SEINO@@
               CONTINUE                                                 @3212SEINO@@
           END-IF                                                       @3212SEINO@@
           IF  FLG-MEG-OPEN = CNS-ON
           THEN
             EXEC  SQL
                 CLOSE CR
             END-EXEC
             MOVE  CNS-OFF                   TO  FLG-MEG-OPEN
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルをクローズする"
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルオープンフラグ=["
      D             FLG-MEG-OPEN"]"
      *-----------------------------------------------------------------
           ELSE
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  CNS-PGM-ID":銘柄別断面情報カーソルをクローズしない"
      *-----------------------------------------------------------------
             CONTINUE
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":残高異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZZI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ１=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":資金簿価異動カーソルオープンフラグ２=[" @3212SEINO@@
      D             FLG-DELETE-TKMZSI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ１=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":前払金管理カーソルオープンフラグ２=["   @3212SEINO@@
      D             FLG-DELETE-TKMZMB00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ１=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR1 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ２=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR2 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ３=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR3 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID":勘定異動カーソルオープンフラグ４=["     @3212SEINO@@
      D             FLG-DELETE-TKMZKI00-CR4 "]"                         @3212SEINO@@
      D    DISPLAY  CNS-PGM-ID": ***  エラー処理  END  ***"
      D    DISPLAY  CNS-PGM-ID": ***  SMZJ1710処理  異常終了  ***"
      *-----------------------------------------------------------------
           CONTINUE.
       ERR-EXT.
           GOBACK.
