      *<INMDYJ2001—pCOBOLCopy‹å>*
           10  INMDYJ2001.
             20  FILLER SIGN IS LEADING SEPARATE CHARACTER.
               30  I-KJN-YMD PIC X(8).
               30  I-ERR-KENCHI-ID PIC X(7).
