      ******************************************************************
      *$Header: /TSTAR2/apl/debug/JC/MAKE/src/bt/sub/SCZY3004/SCZY3004.pco,v 1.1.1.1 2008/09/12 15:13:26 admin Exp $
      ******************************************************************
      *
      *     システムＩＤ   : TSTAR
      *     システム名称   : 次期TSTARシステム
      *     プログラム名称 : 銘柄属性取得ルーチン
      *     処理概要       : ①入力引数より、コード変換サブルーチンを
      *                    : コールし、銘柄コードリファレンステーブル
      *                    : の情報を取得する。
      *                    : ②①取得の証券種別コードより、CMのサブ
      *                    : ルーチンをコールし、属性取得対象のテーブル
      *                    : を確定する。
      *                    : ③取得対象テーブルによって、「利用会社コー
      *                    : ド」、「内部銘柄コード」、「基本属性取得用
      *                    : 基準日」、「付加属性取得用基準日」を利用
      *                    : して、各テーブル取得対応のサブルーチンを
      *                    : コールし、銘柄属性履歴情報データを取得する
      *                    : ④①と③のデータを纏めて編集し、各商品銘柄
      *                    : 属性共通構造体に格納する。
      *     参照ＤＢ       :
      *     引数           : IN  利用会社コード
      *                    : IN  内部銘柄コード
      *                    : IN  商品分類コード
      *                    : IN  証券種別コード
      *                    : IN  元証券種別コード
      *                    : IN  銘柄通貨コード
      *                    : IN  コードリファレンス系列コード
      *                    : IN  業務タスクID
      *                    : IN  基本属性取得用基準日
      *                    : IN  付加属性取得用基準日
      *                    : OUT 各商品銘柄属性共通構造体
      *                    : OUT RTNパッケージ
      *     改訂履歴
      *     年月日     区分  所属       担当者  内容
      *     ---------- ----  ---------  ------  ------------------------
      *     20080526   新規  ITS        譚海瑞  新規作成
      *     20100720   変更  ISC        李勇    テーマ2924-1
      ******************************************************************
      ******************************************************************
       IDENTIFICATION         DIVISION.
       PROGRAM-ID.    SCZY3004.
       AUTHOR.        Nomura.
       DATE-WRITTEN.  08-05-26.
       DATE-COMPILED.
      ******************************************************************
      *
      *                 環  境  部
      *
      ******************************************************************
       ENVIRONMENT            DIVISION.
       CONFIGURATION          SECTION.
       SOURCE-COMPUTER.       L1000V.
      *SOURCE-COMPUTER.       L1000V   WITH DEBUGGING MODE.
       OBJECT-COMPUTER.       RP5470.
       INPUT-OUTPUT           SECTION.
       FILE-CONTROL.
      ******************************************************************
      *
      *                 デ  ー  タ  部
      *
      ******************************************************************
       DATA                   DIVISION.
       WORKING-STORAGE        SECTION.
       01  IDNAME                  PIC  X(80)  VALUE
       "$Id: SCZY3004.pco,v 1.1.1.1 2008/09/12 15:13:26 admin Exp $".
      ******************************************************************
      *                 コンスタント  エリア
      ******************************************************************
       01  CONSTANT-AREA.
      *----------  プログラム名
         05  CNS-PROGRAM-ID        PIC  X(08)  VALUE "SCZY3004".
      *----------  TSTAR共通用コンスタント
         05  CNS-JCCNS.
           COPY "JCCNS.cpy".
      *----------  TSTAR業務コードコンスタント
         05  CNS-JCGYOMU.
           COPY "JCGYOMU.cpy".
      *----------  TSTAR業務MESSAGEコンスタント
         05  CNS-JCMSG.
           COPY "JCMSG.cpy".
      *
      ******************************************************************
      *                 ワ－クエリア
      ******************************************************************
       01  WK-AREA.
      *----------  ワーク証券種別コード
         05  WK-SEC-SBT-CD         PIC  X(04).
      *----------  ワーク属性管理区分
         05  WK-ZOUKUSEI-KANRI-KBN PIC  X(02).
      *
      *----------  ワークRTNパッケージ
       01  WK-RTNPKG.
         05  WK-PARM-RTNPKG.
           COPY "CZRTNPACKAGE.cpy".
      ******************************************************************
      *                 メッセージエリア
      ******************************************************************
       01  MSG-AREA.
      *----------  パラメータ存在エラー
         05  MSG-SONZAI.
      *----------  パラメータ利用会社コード
           10  FILLER              PIC  X(13)  VALUE "RIYO-CMP-CD=[".
           10  MSG-RIYO-CMP-CD     PIC  X(04).
      *----------  パラメータ内部銘柄コード
           10  FILLER              PIC  X(15)  VALUE "]NAIBU-MEG-CD=[".
           10  MSG-NAIBU-MEG-CD    PIC  X(15).
      *----------  パラメータ基本属性取得用基準日
           10  FILLER              PIC  X(18)  VALUE
               "]KIHON-KIJYUN-BI=[".
           10  MSG-KIHON-KIJYUN-BI PIC  S9(08).
           10  FILLER              PIC  X(01)  VALUE "]".
      ******************************************************************
      *                 サブプログラム  パラメ－タ  エリア
      ******************************************************************
      *----------  SCZY1170 リターンパッケージセットルーチン
       01  PARM-SCZY1170-INOUT.
      *----------  リターンパッケージセットルーチンコピー句
           COPY "SCZY1170.cpy".
       01  PARM-SCZY1170-RTNPKG.
         05  PARM-SCZY1170-ARG2.
      *----------  RTNパッケージ
           COPY "CZRTNPACKAGE.cpy".
      *
      *----------  SCZY3002 内部⇒外部銘柄コード変換ルーチン
       01  PARM-SCZY3002-INOUT.
      *----------  内部⇒外部銘柄コード変換ルーチンコピー句
           COPY "SCZY3002.cpy".
      *
      *----------  SCZY4158 取引属性全項目取得ルーチン
       01  PARM-SCZY4158-INOUT.
      *----------  取引属性全項目取得ルーチンコピー句
           COPY "SCZY4158.cpy".
      *
      *----------  SCZY3005 銘柄属性取得(株式)ルーチン
       01  PARM-SCZY3005-INOUT.
      *----------  銘柄属性取得(株式)ルーチンコピー句
           COPY "SCZY3005.cpy".
      *
      *----------  SCZY3006 銘柄属性取得(債券)ルーチン
       01  PARM-SCZY3006-INOUT.
      *----------  銘柄属性取得(債券)ルーチンコピー句
           COPY "SCZY3006.cpy".
      *
      *----------  SCZY3007 銘柄属性取得(先物OP)ルーチン
       01  PARM-SCZY3007-INOUT.
      *----------  銘柄属性取得(先物OP)ルーチンコピー句
           COPY "SCZY3007.cpy".
      *
      *----------  SCZY3008 銘柄属性取得(その他オフ)ルーチン
       01  PARM-SCZY3008-INOUT.
      *----------  銘柄属性取得(その他オフ)ルーチンコピー句
           COPY "SCZY3008.cpy".
      *
      *----------  SCZY3009 銘柄属性取得(その他オン)ルーチン
       01  PARM-SCZY3009-INOUT.
      *----------  銘柄属性取得(その他オン)ルーチンコピー句
           COPY "SCZY3009.cpy".
      *
      *----------  SCZY4156 商品属性全項目取得ルーチン
       01  PARM-SCZY4156-INOUT.
      *----------  商品属性全項目取得ルーチンコピー句
           COPY "SCZY4156.cpy".
      *----------  SJCC0006 元証券種別取得ルーチン
       01  PARM-SJCC0006-INOUT.
      *----------  元証券種別取得ルーチンコピー句
           COPY "SJCC0006.cpy".
      *
      ******************************************************************
      *                 連絡節
      ******************************************************************
       LINKAGE                SECTION.
       01  PARM-SCZY3004-INOUT.
             COPY "SCZY3004.cpy".
       01  PARM-SCZY3004-RTNPKG.
         05  PARM-SCZY3004-ARG3.
      *----------  RTNパッケージ
             COPY "CZRTNPACKAGE.cpy".
      *
      ******************************************************************
      *
      *                 PROCEDURE      DIVISION
      *
      ******************************************************************
       PROCEDURE              DIVISION
           USING  PARM-SCZY3004-INOUT
                  PARM-SCZY3004-RTNPKG.
      ******************************************************************
      *                 メイン処理
      ******************************************************************
       PRG-SCZY3004-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY3004処理  START  ***"
      *-----------------------------------------------------------------
      *----------  前処理
           PERFORM  PRG-START-RTN
      *----------  主処理
           PERFORM  PRG-MAIN-RTN
      *----------  終了処理
           PERFORM  PRG-END-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  SCZY3004処理  END  ***".
      *-----------------------------------------------------------------
       PRG-SCZY3004-EXT.
           GOBACK.
      ******************************************************************
      *                 前処理
      ******************************************************************
       PRG-START-RTN          SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  前処理  START  ***"
      *-----------------------------------------------------------------
      *----------  初期化処理
           PERFORM  PRG-INIT-RTN
      *----------  パラメータチェック処理
           PERFORM  PRG-PRMT-CHK-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  前処理  END  ***".
      *-----------------------------------------------------------------
       PRG-START-EXT.
           EXIT.
      ******************************************************************
      *                 初期化処理
      ******************************************************************
       PRG-INIT-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  初期化処理  START  ***"
      *-----------------------------------------------------------------
           INITIALIZE         WK-AREA
                              WK-RTNPKG
                              MSG-AREA
                              PARM-SCZY1170-INOUT
                              PARM-SCZY1170-RTNPKG
                              PARM-SCZY3002-INOUT
                              PARM-SCZY4158-INOUT
                              PARM-SCZY3005-INOUT
                              PARM-SCZY3006-INOUT
                              PARM-SCZY3007-INOUT
                              PARM-SCZY3008-INOUT
                              PARM-SCZY3009-INOUT
                              PARM-SCZY4156-INOUT
                              PARM-SCZY3004-ARG2
                              PARM-SCZY3004-ARG3
                              PARM-SJCC0006-INOUT
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D             RIYO-CMP-CD       OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "内部銘柄コード   =["
      D             NAIBU-MEG-CD      OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "商品分類コード   =["
      D             SYOUHIN-CD        OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "証券種別コード   =["
      D             SYOUKEN-CD        OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "元証券種別コード =["
      D             GEN-SYOUKEN-CD    OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "銘柄通貨コード   =["
      D             MEIGAR-TUKA-CD    OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "コードリファレンス系列コード=["
      D             KEIRETU-CD        OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "業務タスクID     =["
      D             GYOUMU-TASKU-CD   OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "基本属性取得用基準日=["
      D             KIHON-KIJYUN-BI   OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "付加属性取得用基準日=["
      D             FUKA-KIJYUN-BI    OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "パラメータチェック"
      *-----------------------------------------------------------------
      *----------  パラメータチェック
      *----------  利用会社コードが初始値の場合、エラー
           IF  ( RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      =   SPACE
      *----------  基本属性取得用基準日が初始値の場合、エラー
                 OR
                 KIHON-KIJYUN-BI      OF  PARM-SCZY3004-ARG1
                                      =   ZERO )
           THEN
      *----------  パラメータエラー
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-001      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  パラメータ利用会社コード
               MOVE  RIYO-CMP-CD      OF  PARM-SCZY3004-ARG1
                                      TO  MSG-RIYO-CMP-CD
      *----------  パラメータ内部銘柄コード
               MOVE  NAIBU-MEG-CD     OF  PARM-SCZY3004-ARG1
                                      TO  MSG-NAIBU-MEG-CD
      *----------  パラメータ基本属性取得用基準日
               MOVE  KIHON-KIJYUN-BI  OF  PARM-SCZY3004-ARG1
                                      TO  MSG-KIHON-KIJYUN-BI
      *----------  フリーメッセージ
               MOVE  MSG-PARM-ERR     TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  MSG-SONZAI       TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1(101:74)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "エラー:パラメータエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  COM-ERR-RTN
           ELSE
      *----------  パラメータ存在チェックOK
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "パラメータ存在チェックOK"
      *-----------------------------------------------------------------
               CONTINUE
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  初期化処理  END  ***".
      *-----------------------------------------------------------------
       PRG-INIT-EXT.
           EXIT.
      ******************************************************************
      *                 パラメータチェック処理
      ******************************************************************
       PRG-PRMT-CHK-RTN       SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  パラメータチェック処理  START  *****"
      D    DISPLAY  "コードリファレンス系列コード=["
      D             KEIRETU-CD        OF  PARM-SCZY3004-ARG1         "]"
      D    DISPLAY  "業務タスクID     =["
      D             GYOUMU-TASKU-CD   OF  PARM-SCZY3004-ARG1         "]"
      *-----------------------------------------------------------------
      *-----------  ARG1.コードリファレンス系列コード＝SPACEの場合
           IF  KEIRETU-CD             OF  PARM-SCZY3004-ARG1
                                      =   SPACE
           THEN
      *-----------  ARG1.業務タスクID＝SPACEの場合
               IF  GYOUMU-TASKU-CD    OF  PARM-SCZY3004-ARG1
                                      =   SPACE
               THEN
                   CONTINUE
               ELSE
      *-----------  ARG1.業務タスクID　←　SPACE
                   MOVE  SPACE        TO  GYOUMU-TASKU-CD
                                      OF  PARM-SCZY3004-ARG1
      *20100720 変更 テーマ2924-1 START
      D    DISPLAY  "業務タスクID     =["
      *20100720 変更 テーマ2924-1 END
      D                 GYOUMU-TASKU-CD   OF  PARM-SCZY3004-ARG1     "]"
               END-IF
           ELSE
               CONTINUE
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  パラメータチェック処理  END  *****".
      *-----------------------------------------------------------------
       PRG-PRMT-CHK-EXT.
           EXIT.
      ******************************************************************
      *                 主処理
      ******************************************************************
       PRG-MAIN-RTN           SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  主処理  START  *****"
      *-----------------------------------------------------------------
      *----------  ARG1.証券種別コード≠SPACEの場合
           IF  SYOUKEN-CD             OF  PARM-SCZY3004-ARG1
                                      NOT = SPACE
           THEN
      *----------  証券種別管理対象かどうかチェック処理
               PERFORM  APL-SEC-SBT-CHK-RTN
           ELSE
      *----------  ARG1.内部銘柄コード＝SPACEの場合
               IF  NAIBU-MEG-CD       OF  PARM-SCZY3004-ARG1
                                      =   SPACE
               THEN
      *----------  パラメータエラー
      *----------  エラー検知プログラム名
                   MOVE  CNS-PROGRAM-ID
                                      TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-028  TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-800  TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-0 TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  パラメータ利用会社コード
                   MOVE  RIYO-CMP-CD  OF  PARM-SCZY3004-ARG1
                                      TO  MSG-RIYO-CMP-CD
      *----------  パラメータ内部銘柄コード
                   MOVE  NAIBU-MEG-CD OF  PARM-SCZY3004-ARG1
                                      TO  MSG-NAIBU-MEG-CD
      *----------  パラメータ基本属性取得用基準日
                   MOVE  KIHON-KIJYUN-BI
                                      OF  PARM-SCZY3004-ARG1
                                      TO  MSG-KIHON-KIJYUN-BI
      *----------  フリーメッセージ
                   MOVE  MSG-PARM-ERR TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
                   MOVE  MSG-SONZAI   TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1(101:74)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "エラー:パラメータエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
                   PERFORM  COM-ERR-RTN
               ELSE
                   CONTINUE
               END-IF
           END-IF
      *----------  銘柄コードリファレンス情報取得処理
           PERFORM  APL-NAI-GAI-CHG-RTN
      *----------  CASHと取引事由の判定処理
           PERFORM  APL-CTT-HANTEI-RTN
      *----------  取得対象テーブル確定処理
           PERFORM  APL-ZOKUSEI-GET-RTN
      *----------  銘柄種類判定処理
           PERFORM  APL-MEG-HANTEI-RTN.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "*****  主処理  END  *****".
      *-----------------------------------------------------------------
       PRG-MAIN-EXT.
           EXIT.
      ******************************************************************
      *                 後処理
      ******************************************************************
       PRG-END-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   後処理  START  ***"
      *-----------------------------------------------------------------
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード   =["
      D              RTN-CD           OF  PARM-SCZY1170-ARG1         "]"
      *-----------------------------------------------------------------
      *----------  RTNパッケージのリターンコードが「111」の場合
           IF  ( RTN-CD               OF  PARM-SCZY1170-ARG1
                                      =   CNS-RTN-111
                 OR
                 RTN-CD               OF  PARM-SCZY1170-ARG1
                                      =   CNS-RTN-112 )
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTNパッケージのリターンコードが「111」の場合"
      *-----------------------------------------------------------------
               CONTINUE
           ELSE
               MOVE  CNS-RTN-000      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
           END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンコード   =["
      D              RTN-CD           OF  PARM-SCZY1170-ARG1         "]"
      *-----------------------------------------------------------------
      *
      *----------  リターンパッケージセットルーチン
           PERFORM  APL-SET-RTNPKG-RTN
      *----------  戻したRTNパッケージをARG2にセットする
           MOVE  PARM-SCZY1170-RTNPKG TO  PARM-SCZY3004-RTNPKG.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   後処理  END  ***".
      *-----------------------------------------------------------------
       PRG-END-EXT.
           GOBACK.
      ******************************************************************
      *                 エラー処理
      ******************************************************************
       COM-ERR-RTN            SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***  エラー処理  START  ***"
      *-----------------------------------------------------------------
      *----------  リターンパッケージセットルーチン
           PERFORM  APL-SET-RTNPKG-RTN
      *----------  戻したRTNパッケージをARG2にセットする
           MOVE  PARM-SCZY1170-RTNPKG TO  PARM-SCZY3004-RTNPKG.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "***   エラー処理  END  ***".
      *-----------------------------------------------------------------
       COM-ERR-EXT.
           GOBACK.
      ******************************************************************
      *                 リターンパッケージセットルーチン処理
      ******************************************************************
       APL-SET-RTNPKG-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンパッケージセットルーチン処理開始"
      D    DISPLAY  "SCZY1170 リターンパッケージセットルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY1170 リターンパッケージセットルーチン
           CALL  "SCZY1170"           USING  PARM-SCZY1170-INOUT
                                             PARM-SCZY1170-RTNPKG.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "リターンパッケージセットルーチン処理終了".
      *-----------------------------------------------------------------
       APL-SET-RTNPKG-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄コードリファレンス情報取得処理
      ******************************************************************
       APL-NAI-GAI-CHG-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄コードリファレンス情報取得処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3004-ARG1
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  商品分類コード
           MOVE  SYOUHIN-CD           OF  PARM-SCZY3004-ARG1
                                      TO  SYOHIN-BUNRUI-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  証券種別コード
           MOVE  SYOUKEN-CD           OF  PARM-SCZY3004-ARG1
                                      TO  SEC-SBT-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  元証券種別コード
           MOVE  GEN-SYOUKEN-CD       OF  PARM-SCZY3004-ARG1
                                      TO  MOTO-SEC-SBT-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  銘柄通貨コード
           MOVE  MEIGAR-TUKA-CD       OF  PARM-SCZY3004-ARG1
                                      TO  MEG-TUKA-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  コードリファレンス系列コード
           MOVE  KEIRETU-CD           OF  PARM-SCZY3004-ARG1
                                      TO  CD-REF-KRTU-CD
                                      OF  PARM-SCZY3002-ARG1
      *----------  業務タスクID
           MOVE  GYOUMU-TASKU-CD      OF  PARM-SCZY3004-ARG1
                                      TO  GYOMU-TASK-ID
                                      OF  PARM-SCZY3002-ARG1
      *----------  基準日
           MOVE  KIHON-KIJYUN-BI      OF  PARM-SCZY3004-ARG1
                                      TO  KJN-YMD
                                      OF  PARM-SCZY3002-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "内部銘柄コード   =["
      D              NAIBU-MEG-CD     OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "商品分類コード   =["
      D              SYOHIN-BUNRUI-CD OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "証券種別コード   =["
      D              SEC-SBT-CD       OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "元証券種別コード =["
      D              MOTO-SEC-SBT-CD  OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "銘柄通貨コード   =["
      D              MEG-TUKA-CD      OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "コードリファレンス系列コード=["
      D              CD-REF-KRTU-CD   OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "業務タスクID     =["
      D              GYOMU-TASK-ID    OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "基準日           =["
      D              KJN-YMD          OF  PARM-SCZY3002-ARG1         "]"
      D    DISPLAY  "SCZY3002 内部⇒外部銘柄コード変換ルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY3002 内部⇒外部銘柄コード変換ルーチン
           CALL  "SCZY3002"           USING  PARM-SCZY3002-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SCZY3002=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SCZY3002正常終了"
      D    DISPLAY  "【SCZY3002】が返却した「証券種別コード」 =["
      D             SEC-SBT-CD       OF  PARM-SCZY3002-ARG2          "]"
      D    DISPLAY  "【SCZY3002】が返却した「元証券種別コード」 =["
      D             MOTO-SEC-SBT-CD  OF  PARM-SCZY3002-ARG2          "]"
      D    DISPLAY  "ARG1.証券種別コード =["
      D             SYOUKEN-CD           OF  PARM-SCZY3004-ARG1      "]"
      D    DISPLAY  "【SJCC0006】取得した元証券種別コード（１） =["
      D             MOTO-SEC-SBT-CD      OF  CODE-AREA(1)            "]"
      *-----------------------------------------------------------------
               IF  SYOUKEN-CD            OF  PARM-SCZY3004-ARG1
                                         NOT = CNS-MAR
                 AND  MOTO-SEC-SBT-CD    OF  CODE-AREA(1)
                                         NOT = SYOUKEN-CD
                                         OF  PARM-SCZY3004-ARG1
               THEN
      *----------  ARG1.証券種別コード≠'MAR ':証拠金且つ
      *----------    【SJCC0006】取得した元証券種別コード（１）
      *----------     ≠ARG1.証券種別コードの場合、
      *----------  ワーク証券種別コード←  元証券種別コード
                   MOVE  MOTO-SEC-SBT-CD
                                      OF  PARM-SCZY3002-ARG2
                                      TO  WK-SEC-SBT-CD
               ELSE
      *----------  ワーク証券種別コード←  証券種別コード
                   MOVE  SEC-SBT-CD   OF  PARM-SCZY3002-ARG2
                                      TO  WK-SEC-SBT-CD
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク証券種別コード=[" WK-SEC-SBT-CD           "]"
      D    DISPLAY  "コードリファレンス系列コード＝["
      D              CD-REF-KRTU-CD   OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "外部銘柄コード＝["
      D              GAIBU-MEG-CD     OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "商品分類コード＝["
      D              SYOHIN-BUNRUI-CD OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "証券種別コード＝["
      D              SEC-SBT-CD       OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "銘柄通貨コード＝["
      D              MEG-TUKA-CD      OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "投資対象国コード＝[" TOUSI-TARGET-KUNI-CD
      D                               OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "発行体国コード＝["   HAKKO-TAI-KUNI-CD
      D                               OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "株式種別＝["
      D              KABU-SBT         OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "回＝["
      D              KAYI             OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "号＝["
      D              GOU              OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "満期日＝["
      D              MNK-YMD          OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "限月＝["
      D              GENGETSU         OF  PARM-SCZY3002-ARG2         "]"
      D    DISPLAY  "ストライクプライス＝["
      D              STRIKEPRICE      OF  PARM-SCZY3002-ARG2         "]"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-110
      *----------  データなし
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-024      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3005エラー：データなし"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-004      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3002エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄コードリファレンス情報取得処理終了".
      *-----------------------------------------------------------------
       APL-NAI-GAI-CHG-EXT.
           EXIT.
      ******************************************************************
      *                 CASHと取引事由の判定処理
      ******************************************************************
       APL-CTT-HANTEI-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CASHと取引事由の判定処理開始"
      D    DISPLAY  "ARG1.内部銘柄コード=["
      D             NAIBU-MEG-CD      OF  PARM-SCZY3004-ARG1         "]"
      *-----------------------------------------------------------------
           IF  NAIBU-MEG-CD           OF  PARM-SCZY3004-ARG1(1:4)
                                      =   CNS-SEC-SBT-CD-27
           THEN
      *----------  ARG1.内部銘柄コード＝'CASH'の場合
      *----------  銘柄属性取得(CASH OR 取引事由)データ編集処理
               PERFORM  APL-MGR-CTT-EDIT-RTN
      *----------  後処理
               PERFORM  PRG-END-RTN
           ELSE
      *----------  以外の場合
      D    DISPLAY "ARG1.内部銘柄コードの一桁目=["  NAIBU-MEG-CD
      D                               OF  PARM-SCZY3004-ARG1(1:1)    "]"
      *----------  ARG1.内部銘柄コードの一桁目は数字の場合
               IF  NAIBU-MEG-CD       OF  PARM-SCZY3004-ARG1(1:1)
                                      IS  NUMERIC
               THEN
                   CONTINUE
               ELSE
      *----------  ARG1.内部銘柄コードの一桁目は数字ではない場合
      *----------  銘柄基本属性（CASHと取引事由）データ取得処理
                   PERFORM  APL-MGR-CTT-GET-RTN
               END-IF
           END-IF.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "CASHと取引事由の判定処理終了".
      *-----------------------------------------------------------------
       APL-CTT-HANTEI-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(CASH OR 取引事由)データ編集処理
      ******************************************************************
       APL-MGR-CTT-EDIT-RTN   SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(CASH OR 取引事由)データ編集処理開始"
      *-----------------------------------------------------------------
      *----------  ARG2.各商品銘柄属性共通構造体  ←  初期値
           INITIALIZE  ALL-SYOHIN-KOUZOUTAI
                                      OF  PARM-SCZY3004-ARG2
      *
      *---------- コードリファレンス系列コード（リファレンス情報）
           MOVE  CD-REF-KRTU-CD       OF  PARM-SCZY3002-ARG2
                                      TO  RF-KEIRETU-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 外部銘柄コード（リファレンス情報）
           MOVE  GAIBU-MEG-CD         OF  PARM-SCZY3002-ARG2
                                      TO  RF-GAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 商品分類コード（リファレンス情報）
           MOVE  SYOHIN-BUNRUI-CD     OF  PARM-SCZY3002-ARG2
                                      TO  RF-SYOHIN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 証券種別コード（リファレンス情報）
           MOVE  SEC-SBT-CD           OF  PARM-SCZY3002-ARG2
                                      TO  RF-SEC-SBT-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄通貨コード（リファレンス情報）
           MOVE  MEG-TUKA-CD          OF  PARM-SCZY3002-ARG2
                                      TO  RF-MEG-TUKA-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 投資対象国コード（リファレンス情報）
           MOVE  TOUSI-TARGET-KUNI-CD OF  PARM-SCZY3002-ARG2
                                      TO  RF-TOUSI-TARGET-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体国コード（リファレンス情報）
           MOVE  HAKKO-TAI-KUNI-CD    OF  PARM-SCZY3002-ARG2
                                      TO  RF-HAKKO-TAI-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 株式種別（リファレンス情報）
           MOVE  KABU-SBT             OF  PARM-SCZY3002-ARG2
                                      TO  RF-KABU-SBT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 回（リファレンス情報）
           MOVE  KAYI                 OF  PARM-SCZY3002-ARG2
                                      TO  RF-KAYI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 号（リファレンス情報）
           MOVE  GOU                  OF  PARM-SCZY3002-ARG2
                                      TO  RF-GOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 満期日（リファレンス情報）
           MOVE  MNK-YMD              OF  PARM-SCZY3002-ARG2
                                      TO  RF-MNK-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 限月（リファレンス情報）
           MOVE  GENGETSU             OF  PARM-SCZY3002-ARG2
                                      TO  RF-GENGETSU
                                      OF  PARM-SCZY3004-ARG2
      *---------- ストライクプライス（リファレンス情報）
           MOVE  STRIKEPRICE          OF  PARM-SCZY3002-ARG2
                                      TO  RF-STRIKEPRICE
                                      OF  PARM-SCZY3004-ARG2.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(CASH OR 取引事由)データ編集処理終了".
      *-----------------------------------------------------------------
       APL-MGR-CTT-EDIT-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄基本属性（CASHと取引事由）データ取得処理
      ******************************************************************
       APL-MGR-CTT-GET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄基本属性（CASHと取引事由）データ取得処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY4158-ARG1
      *----------  取引事由コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3004-ARG1(1:4)
                                      TO  TRHK-JIYU-CD
                                      OF  PARM-SCZY4158-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SCZY4158-ARG1         "]"
      D    DISPLAY  "取引事由コード   =["
      D              TRHK-JIYU-CD     OF  PARM-SCZY4158-ARG1         "]"
      D    DISPLAY  "SCZY4158 取引属性全項目取得ルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY4158 取引属性全項目取得ルーチン
           CALL  "SCZY4158"           USING  PARM-SCZY4158-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SCZY4158=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SCZY4158正常終了"
      *-----------------------------------------------------------------
      *----------  銘柄属性取得(CASH OR 取引事由)データ編集処理
               PERFORM  APL-MGR-CTT-EDIT-RTN
      *----------  後処理
               PERFORM  PRG-END-RTN
             WHEN  CNS-RTN-110
      *----------  データなし
               CONTINUE
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-002      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY4158エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄基本属性（CASHと取引事由）データ取得処理終了".
      *-----------------------------------------------------------------
       APL-MGR-CTT-GET-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄基本属性（株式型）データ取得処理
      ******************************************************************
       APL-MGR-KS-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄基本属性（株式型）データ取得処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY3005-ARG1
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3004-ARG1
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3005-ARG1
      *---------- 基準日
           MOVE  KIHON-KIJYUN-BI      OF  PARM-SCZY3004-ARG1
                                      TO  KIJYUN-BI
                                      OF  PARM-SCZY3005-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SCZY3005-ARG1         "]"
      D    DISPLAY  "内部銘柄コード   =["
      D              NAIBU-MEG-CD     OF  PARM-SCZY3005-ARG1         "]"
      D    DISPLAY  "基準日           =["
      D              KIJYUN-BI        OF  PARM-SCZY3005-ARG1         "]"
      D    DISPLAY  "SCZY3005 銘柄属性取得(株式)ルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY3005 銘柄属性取得(株式)ルーチン
           CALL  "SCZY3005"           USING  PARM-SCZY3005-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SCZY3005=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SCZY3005正常終了"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-RTN-110
      *----------  データなし
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-007      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3005エラー：データなし"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-009      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3005エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄基本属性（株式型）データ取得処理終了".
      *-----------------------------------------------------------------
       APL-MGR-KS-GET-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(債券)データ取得処理
      ******************************************************************
       APL-MGR-BD-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(債券)データ取得処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY3006-ARG1
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3004-ARG1
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3006-ARG1
      *---------- 基本属性取得用基準日
           MOVE  KIHON-KIJYUN-BI      OF  PARM-SCZY3004-ARG1
                                      TO  KIHON-KIJYUN-BI
                                      OF  PARM-SCZY3006-ARG1
      *---------- 付加属性取得用基準日
           MOVE  FUKA-KIJYUN-BI       OF  PARM-SCZY3004-ARG1
                                      TO  FUKA-KIJYUN-BI
                                      OF  PARM-SCZY3006-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SCZY3006-ARG1         "]"
      D    DISPLAY  "内部銘柄コード   =["
      D              NAIBU-MEG-CD     OF  PARM-SCZY3006-ARG1         "]"
      D    DISPLAY  "基本属性取得用基準日=["
      D              KIHON-KIJYUN-BI  OF  PARM-SCZY3006-ARG1         "]"
      D    DISPLAY  "付加属性取得用基準日=["
      D              FUKA-KIJYUN-BI   OF  PARM-SCZY3006-ARG1         "]"
      D    DISPLAY  "SCZY3006 銘柄属性取得(債券)ルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY3006 銘柄属性取得(債券)ルーチン
           CALL  "SCZY3006"           USING  PARM-SCZY3006-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SCZY3006=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SCZY3006正常終了"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-RTN-110
      *----------  データなし
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-010      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3006エラー：データなし"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
             WHEN  CNS-RTN-111
      *----------  一部該当データなし
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-022      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-111      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  MSG-RENDOU-KEISU-GET-NASI
                                      TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3006エラー：債券属性を取得する場合、"
      D             "連動係数を取れませんでした。"
      *-----------------------------------------------------------------
             WHEN  CNS-RTN-112
      *----------  一部該当データなし
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-029      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-112      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  フリーメッセージ
               MOVE  MSG-HENDOU-RRT-GET-NASI
                                      TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3006エラー：債券属性を取得する場合、"
      D             "変動利率を取れませんでした。"
      *-----------------------------------------------------------------
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-012      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3006エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(債券)データ取得処理終了".
      *-----------------------------------------------------------------
       APL-MGR-BD-GET-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(先物OP)データ取得処理
      ******************************************************************
       APL-MGR-OP-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(先物OP)データ取得処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY3007-ARG1
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3004-ARG1
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3007-ARG1
      *---------- 基準日
           MOVE  KIHON-KIJYUN-BI      OF  PARM-SCZY3004-ARG1
                                      TO  KIJYUN-BI
                                      OF  PARM-SCZY3007-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SCZY3007-ARG1         "]"
      D    DISPLAY  "内部銘柄コード   =["
      D              NAIBU-MEG-CD     OF  PARM-SCZY3007-ARG1         "]"
      D    DISPLAY  "基準日           =["
      D              KIJYUN-BI        OF  PARM-SCZY3007-ARG1         "]"
      D    DISPLAY  "SCZY3007 銘柄属性取得(先物OP)ルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY3007 銘柄属性取得(先物OP)ルーチン
           CALL  "SCZY3007"           USING  PARM-SCZY3007-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SCZY3007=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SCZY3007正常終了"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-RTN-110
      *----------  データなし
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-013      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3007エラー：データなし"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-015      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3007エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(先物OP)データ取得処理終了".
      *-----------------------------------------------------------------
       APL-MGR-OP-GET-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(その他オフ)データ取得処理
      ******************************************************************
       APL-MGR-OF-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(その他オフ)データ取得処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY3008-ARG1
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3004-ARG1
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3008-ARG1
      *---------- 基準日
           MOVE  KIHON-KIJYUN-BI      OF  PARM-SCZY3004-ARG1
                                      TO  KIJYUN-BI
                                      OF  PARM-SCZY3008-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SCZY3008-ARG1         "]"
      D    DISPLAY  "内部銘柄コード   =["
      D              NAIBU-MEG-CD     OF  PARM-SCZY3008-ARG1         "]"
      D    DISPLAY  "基準日           =["
      D              KIJYUN-BI        OF  PARM-SCZY3008-ARG1         "]"
      D    DISPLAY  "SCZY3008 銘柄属性取得(その他オフ)ルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY3008 銘柄属性取得(その他オフ)ルーチン
           CALL  "SCZY3008"           USING  PARM-SCZY3008-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SCZY3008=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SCZY3008正常終了"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-RTN-110
      *----------  データなし
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-016      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3008エラー：データなし"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-018      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3008エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(その他オフ)データ取得処理終了".
      *-----------------------------------------------------------------
       APL-MGR-OF-GET-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(その他オン)データ取得処理
      ******************************************************************
       APL-MGR-ON-GET-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(その他オン)データ取得処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY3009-ARG1
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3004-ARG1
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3009-ARG1
      *---------- 基準日
           MOVE  KIHON-KIJYUN-BI      OF  PARM-SCZY3004-ARG1
                                      TO  KIJYUN-BI
                                      OF  PARM-SCZY3009-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SCZY3009-ARG1         "]"
      D    DISPLAY  "内部銘柄コード   =["
      D              NAIBU-MEG-CD     OF  PARM-SCZY3009-ARG1         "]"
      D    DISPLAY  "基準日           =["
      D              KIJYUN-BI        OF  PARM-SCZY3009-ARG1         "]"
      D    DISPLAY  "SCZY3009 銘柄属性取得(その他オン)ルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY3009 銘柄属性取得(その他オン)ルーチン
           CALL  "SCZY3009"           USING  PARM-SCZY3009-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SCZY3009=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SCZY3009正常終了"
      *-----------------------------------------------------------------
               CONTINUE
             WHEN  CNS-RTN-110
      *----------  データなし
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-019      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3009エラー：データなし"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-021      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY3009エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(その他オン)データ取得処理終了".
      *-----------------------------------------------------------------
       APL-MGR-ON-GET-EXT.
           EXIT.
      ******************************************************************
      *                 取得対象テーブル確定処理
      ******************************************************************
       APL-ZOKUSEI-GET-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得対象テーブル確定処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SCZY4156-ARG1
      *----------  証券種別コード
           MOVE  WK-SEC-SBT-CD        TO  SEC-SBT-CD
                                      OF  PARM-SCZY4156-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SCZY4156-ARG1         "]"
      D    DISPLAY  "証券種別コード   =["
      D              SEC-SBT-CD       OF  PARM-SCZY4156-ARG1         "]"
      D    DISPLAY  "SCZY4156 商品属性全項目取得ルーチン"
      *-----------------------------------------------------------------
      *----------  SCZY4156 商品属性全項目取得ルーチン
           CALL  "SCZY4156"           USING  PARM-SCZY4156-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SCZY4156=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  正常の場合
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SCZY4156正常終了"
      *-----------------------------------------------------------------
      *----------  ワーク属性管理区分 ← 該当ルーチン戻った属性管理区分
               MOVE  ZOUKUSEI-KANRI-KBN
                                      OF  PARM-SCZY4156-ARG2
                                      TO  WK-ZOUKUSEI-KANRI-KBN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "ワーク属性管理区分=[" WK-ZOUKUSEI-KANRI-KBN     "]"
      *-----------------------------------------------------------------
      *----------  リターンコード＝'110'(該当データなし)の場合
             WHEN  CNS-RTN-110
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-031      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "検知プログラムID=[" ERR-PGM-ID
      D                               OF  PARM-SCZY1170-ARG1         "]"
      D    DISPLAY  "ポジション=[" ERR-POS
      D                               OF  PARM-SCZY1170-ARG1         "]"
      D    DISPLAY  "リターンコード=[" RTN-CD
      D                               OF  PARM-SCZY1170-ARG1         "]"
      D    DISPLAY  "詳細リターンコードデコードフラグ=["
      D           DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         "]"
      D    DISPLAY  "フリーメッセージ=[" FREE-MSG
      D                               OF  PARM-SCZY1170-ARG1         "]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY4156エラー：データなし"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  COM-ERR-RTN
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-006      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SCZY4156エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得対象テーブル確定処理終了".
      *-----------------------------------------------------------------
       APL-ZOKUSEI-GET-EXT.
           EXIT.
      ******************************************************************
      *                 証券種別管理対象かどうかチェック処理
      ******************************************************************
       APL-SEC-SBT-CHK-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "証券種別管理対象かどうかチェック処理開始"
      *-----------------------------------------------------------------
      *----------  ワークRTNパッケージを初期化する
           INITIALIZE         WK-RTNPKG
      *----------  利用会社コード
           MOVE  RIYO-CMP-CD          OF  PARM-SCZY3004-ARG1
                                      TO  RIYO-CMP-CD
                                      OF  PARM-SJCC0006-ARG1
      *---------- 証券種別コード
           MOVE  SYOUKEN-CD           OF  PARM-SCZY3004-ARG1
                                      TO  SEC-SBT-CD
                                      OF  PARM-SJCC0006-ARG1
      *---------- 元証券種別コード
           MOVE  GEN-SYOUKEN-CD       OF  PARM-SCZY3004-ARG1
                                      TO  MOTO-SEC-SBT-CD
                                      OF  PARM-SJCC0006-ARG1
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "利用会社コード   =["
      D              RIYO-CMP-CD      OF  PARM-SJCC0006-ARG1         "]"
      D    DISPLAY  "証券種別コード   =["
      D              SEC-SBT-CD       OF  PARM-SJCC0006-ARG1         "]"
      D    DISPLAY  "元証券種別コード =["
      D              MOTO-SEC-SBT-CD  OF  PARM-SJCC0006-ARG1         "]"
      D    DISPLAY  "SJCC0006 元証券種別取得ルーチン"
      *-----------------------------------------------------------------
      *----------  SJCC0006 元証券種別取得ルーチン
           CALL  "SJCC0006"           USING  PARM-SJCC0006-INOUT
                                             WK-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "RTN-CD(" COUNTER OF  WK-RTNPKG
      D             ") OF SJCC0006=[" RTN-CD
      D                               OF  WK-RTNPKG
      D              ( COUNTER        OF  WK-RTNPKG )                "]"
      *-----------------------------------------------------------------
           EVALUATE  RTN-CD           OF  WK-RTNPKG
                     ( COUNTER        OF  WK-RTNPKG )
             WHEN  CNS-RTN-000
      *----------  ARG1.内部銘柄コード＝SPACEの場合
               IF  NAIBU-MEG-CD       OF  PARM-SCZY3004-ARG1
                                      =   SPACE
               THEN
      *----------  パラメータエラー
      *----------  エラー検知プログラム名
                   MOVE  CNS-PROGRAM-ID
                                      TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
                   MOVE  CNS-POS-025  TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
                   MOVE  CNS-RTN-800  TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
                   MOVE  CNS-DETAIL-0 TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  パラメータ利用会社コード
                   MOVE  RIYO-CMP-CD  OF  PARM-SCZY3004-ARG1
                                      TO  MSG-RIYO-CMP-CD
      *----------  パラメータ内部銘柄コード
                   MOVE  NAIBU-MEG-CD OF  PARM-SCZY3004-ARG1
                                      TO  MSG-NAIBU-MEG-CD
      *----------  パラメータ基本属性取得用基準日
                   MOVE  KIHON-KIJYUN-BI
                                      OF  PARM-SCZY3004-ARG1
                                      TO  MSG-KIHON-KIJYUN-BI
      *----------  フリーメッセージ
                   MOVE  MSG-PARM-ERR TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
                   MOVE  MSG-SONZAI   TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1(101:74)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "エラー:パラメータエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
                   PERFORM  COM-ERR-RTN
               ELSE
                     CONTINUE
               END-IF
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "SJCC0006正常終了"
      *-----------------------------------------------------------------
      *----------  リターンコード＝'100'(チェックエラー)の場合
             WHEN  CNS-RTN-100
      *----------  パラメータエラー
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-026      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-800      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *----------  パラメータ利用会社コード
               MOVE  RIYO-CMP-CD      OF  PARM-SCZY3004-ARG1
                                      TO  MSG-RIYO-CMP-CD
      *----------  パラメータ内部銘柄コード
               MOVE  NAIBU-MEG-CD     OF  PARM-SCZY3004-ARG1
                                      TO  MSG-NAIBU-MEG-CD
      *----------  パラメータ基本属性取得用基準日
               MOVE  KIHON-KIJYUN-BI  OF  PARM-SCZY3004-ARG1
                                      TO  MSG-KIHON-KIJYUN-BI
      *----------  フリーメッセージ
               MOVE  MSG-PARM-ERR     TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  MSG-SONZAI       TO  FREE-MSG
                                      OF  PARM-SCZY1170-ARG1(101:74)
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "エラー:パラメータエラー"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  COM-ERR-RTN
      *----------  リターンコード＝'101'(入力証券種別は管理対象外)の場合
             WHEN  CNS-RTN-101
      *----------  ARG2.各商品銘柄属性共通構造体  ←  初期値
               INITIALIZE  ALL-SYOHIN-KOUZOUTAI
                                      OF  PARM-SCZY3004-ARG2
      *----------  後処理
               PERFORM  PRG-END-RTN
      *----------  リターンコード＝'110'(データなし)の場合
             WHEN  CNS-RTN-110
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-030      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-110      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "検知プログラムID=[" ERR-PGM-ID
      D                               OF  PARM-SCZY1170-ARG1         "]"
      D    DISPLAY  "ポジション=[" ERR-POS
      D                               OF  PARM-SCZY1170-ARG1         "]"
      D    DISPLAY  "リターンコード=[" RTN-CD
      D                               OF  PARM-SCZY1170-ARG1         "]"
      D    DISPLAY  "詳細リターンコードデコードフラグ=["
      D           DETAIL-RTN-CD-FLG   OF  PARM-SCZY1170-ARG1         "]"
      D    DISPLAY  "フリーメッセージ=[" FREE-MSG
      D                               OF  PARM-SCZY1170-ARG1         "]"
      *-----------------------------------------------------------------
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SJCC0006エラー：データなし"
      *-----------------------------------------------------------------
      *----------  エラー処理
               PERFORM  COM-ERR-RTN
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-027      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
               MOVE  WK-RTNPKG        TO  PARM-SCZY1170-RTNPKG
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "SJCC0006エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "証券種別管理対象かどうかチェック処理終了".
      *-----------------------------------------------------------------
       APL-SEC-SBT-CHK-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄種類判定処理
      ******************************************************************
       APL-MEG-HANTEI-RTN     SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄種類判定処理開始"
      *-----------------------------------------------------------------
           EVALUATE  WK-ZOUKUSEI-KANRI-KBN
             WHEN  CNS-MEG-ZOUKUSEI-KS
                                      OF  CONS-ZOUKUSEI-KANRI-KBN
      *----------  ワーク属性管理区分 ＝'KS'の場合
      *----------  銘柄基本属性（株式型）データ取得処理
               PERFORM  APL-MGR-KS-GET-RTN
      *----------  銘柄基本属性（株式）データ編集処理
               PERFORM  APL-MGR-KS-EDIT-RTN
      *
             WHEN  CNS-MEG-ZOUKUSEI-BD
                                      OF  CONS-ZOUKUSEI-KANRI-KBN
      *----------  ワーク属性管理区分 ＝'BD'の場合
      *----------  銘柄基本属性（債券型）データ取得処理
               PERFORM  APL-MGR-BD-GET-RTN
      *----------  銘柄属性取得(債券)データ編集処理
               PERFORM  APL-MGR-BD-EDIT-RTN
      *
             WHEN  CNS-MEG-ZOUKUSEI-OP
                                      OF  CONS-ZOUKUSEI-KANRI-KBN
      *----------  ワーク属性管理区分 ＝'OP'の場合
      *----------  銘柄基本属性（先物OP型）データ取得処理
               PERFORM  APL-MGR-OP-GET-RTN
      *----------  銘柄属性取得(先物OP)データ編集処理
               PERFORM  APL-MGR-OP-EDIT-RTN
      *
             WHEN  CNS-MEG-ZOUKUSEI-OF
                                      OF  CONS-ZOUKUSEI-KANRI-KBN
      *----------  ワーク属性管理区分 ＝'OF'の場合
      *----------  銘柄基本属性（その他オフ型）データ取得処理
               PERFORM  APL-MGR-OF-GET-RTN
      *----------  銘柄属性取得(その他オフ)データ編集処理
               PERFORM  APL-MGR-OF-EDIT-RTN
      *
             WHEN  CNS-MEG-ZOUKUSEI-ON
                                      OF  CONS-ZOUKUSEI-KANRI-KBN
      *----------  ワーク属性管理区分 ＝'ON'の場合
      *----------  銘柄基本属性（その他オン型）データ取得処理
               PERFORM  APL-MGR-ON-GET-RTN
      *----------  銘柄属性取得(その他オン)データ編集処理
               PERFORM  APL-MGR-ON-EDIT-RTN
      *
             WHEN  OTHER
      *----------  システムエラー（Oracle以外）
      *----------  エラー検知プログラム名
               MOVE  CNS-PROGRAM-ID   TO  ERR-PGM-ID
                                      OF  PARM-SCZY1170-ARG1
      *----------  ポジション
               MOVE  CNS-POS-023      TO  ERR-POS
                                      OF  PARM-SCZY1170-ARG1
      *----------  リターンコード
               MOVE  CNS-RTN-901      TO  RTN-CD
                                      OF  PARM-SCZY1170-ARG1
      *----------  詳細リターンコードデコードフラグ
               MOVE  CNS-DETAIL-0     TO  DETAIL-RTN-CD-FLG
                                      OF  PARM-SCZY1170-ARG1
      *--------------------<DEBUG>--------------------------------------
      D    DISPLAY  "エラー：システムエラー（Oracle以外）"
      *-----------------------------------------------------------------
               PERFORM  COM-ERR-RTN
           END-EVALUATE.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄種類判定処理終了".
      *-----------------------------------------------------------------
       APL-MEG-HANTEI-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄基本属性（株式）データ編集処理
      ******************************************************************
       APL-MGR-KS-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄基本属性（株式）データ編集処理開始"
      *-----------------------------------------------------------------
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3005-ARG2
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- コードリファレンス系列コード（リファレンス情報）
           MOVE  CD-REF-KRTU-CD       OF  PARM-SCZY3002-ARG2
                                      TO  RF-KEIRETU-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 外部銘柄コード（リファレンス情報）
           MOVE  GAIBU-MEG-CD         OF  PARM-SCZY3002-ARG2
                                      TO  RF-GAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 商品分類コード（リファレンス情報）
           MOVE  SYOHIN-BUNRUI-CD     OF  PARM-SCZY3002-ARG2
                                      TO  RF-SYOHIN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 証券種別コード（リファレンス情報）
           MOVE  SEC-SBT-CD           OF  PARM-SCZY3002-ARG2
                                      TO  RF-SEC-SBT-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄通貨コード（リファレンス情報）
           MOVE  MEG-TUKA-CD          OF  PARM-SCZY3002-ARG2
                                      TO  RF-MEG-TUKA-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 投資対象国コード（リファレンス情報）
           MOVE  TOUSI-TARGET-KUNI-CD OF  PARM-SCZY3002-ARG2
                                      TO  RF-TOUSI-TARGET-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体国コード（リファレンス情報）
           MOVE  HAKKO-TAI-KUNI-CD    OF  PARM-SCZY3002-ARG2
                                      TO  RF-HAKKO-TAI-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 株式種別（リファレンス情報）
           MOVE  KABU-SBT             OF  PARM-SCZY3002-ARG2
                                      TO  RF-KABU-SBT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 回（リファレンス情報）
           MOVE  KAYI                 OF  PARM-SCZY3002-ARG2
                                      TO  RF-KAYI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 号（リファレンス情報）
           MOVE  GOU                  OF  PARM-SCZY3002-ARG2
                                      TO  RF-GOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 満期日（リファレンス情報）
           MOVE  MNK-YMD              OF  PARM-SCZY3002-ARG2
                                      TO  RF-MNK-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 限月（リファレンス情報）
           MOVE  GENGETSU             OF  PARM-SCZY3002-ARG2
                                      TO  RF-GENGETSU
                                      OF  PARM-SCZY3004-ARG2
      *---------- ストライクプライス（リファレンス情報）
           MOVE  STRIKEPRICE          OF  PARM-SCZY3002-ARG2
                                      TO  RF-STRIKEPRICE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 適用開始日
           MOVE  TEKIYO-FROM          OF  PARM-SCZY3005-ARG2
                                      TO  TEKIYO-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄名称（日本語）
           IF  USE-MEG-NAME-J         OF  PARM-SCZY3005-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J       OF  PARM-SCZY3005-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J   OF  PARM-SCZY3005-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（日本語略称）
           IF  USE-MEG-NAME-J-RYAKU   OF  PARM-SCZY3005-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3005-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3005-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語）
           IF  USE-MEG-NAME-E         OF  PARM-SCZY3005-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E       OF  PARM-SCZY3005-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E   OF  PARM-SCZY3005-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語略称）
           IF  USE-MEG-NAME-E-RYAKU   OF  PARM-SCZY3005-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3005-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3005-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 発行体名称（日本語）
           MOVE  HAKKO-TAI-NAME-J     OF  PARM-SCZY3005-ARG2
                                      TO  HAKKO-TAI-NAME-J
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体名称（英語）
           MOVE  HAKKO-TAI-NAME-E     OF  PARM-SCZY3005-ARG2
                                      TO  HAKKO-TAI-NAME-E
                                      OF  PARM-SCZY3004-ARG2
      *---------- 上場区分
           MOVE  JYOJY-KBN            OF  PARM-SCZY3005-ARG2
                                      TO  JYOJY-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 保振対象区分
           MOVE  HOHURI-TARGET-KBN    OF  PARM-SCZY3005-ARG2
                                      TO  HOHURI-TARGET-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 現地源泉税非課税区分
           MOVE  LCL-GS-TAX-NOTAX-KBN OF  PARM-SCZY3005-ARG2
                                      TO  LCL-GS-TAX-NOTAX-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 売買単位
           MOVE  BUY-SEL-TANI         OF  PARM-SCZY3005-ARG2
                                      TO  BUY-SEL-TANI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 公募区分
           MOVE  PUB-KBN              OF  PARM-SCZY3005-ARG2
                                      TO  PUB-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行日
           MOVE  HAKKO-YMD            OF  PARM-SCZY3005-ARG2
                                      TO  HAKKO-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行価格
           MOVE  HAKKO-KKK            OF  PARM-SCZY3005-ARG2
                                      TO  HAKKO-KKK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 一口当り額面／単位額面
           MOVE  TANI-FACE            OF  PARM-SCZY3005-ARG2
                                      TO  KUTI1-FACE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算・利払回数
           MOVE  CMP-KESSAN-KAISU     OF  PARM-SCZY3005-ARG2
                                      TO  KESSAN-RIBAR-KAISU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日１
           MOVE  CMP-KESSAN-YMD-1     OF  PARM-SCZY3005-ARG2
                                      TO  KESSAN-RIBAR-YMD-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日２
           MOVE  CMP-KESSAN-YMD-2     OF  PARM-SCZY3005-ARG2
                                      TO  KESSAN-RIBAR-YMD-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日３
           MOVE  CMP-KESSAN-YMD-3     OF  PARM-SCZY3005-ARG2
                                      TO  KESSAN-RIBAR-YMD-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日４
           MOVE  CMP-KESSAN-YMD-4     OF  PARM-SCZY3005-ARG2
                                      TO  KESSAN-RIBAR-YMD-4
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日休日処理区分
           MOVE  CMP-KSYMD-QJT-SR-KBN OF  PARM-SCZY3005-ARG2
                                      TO  K-R-YMD-QJT-SYRI-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 付与率
           MOVE  HUYO-RT              OF  PARM-SCZY3005-ARG2
                                      TO  HUYO-RT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 行使期間FROM
           MOVE  KOUSI-KKN-FROM       OF  PARM-SCZY3005-ARG2
                                      TO  KOUSI-KKN-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 行使期間TO
           MOVE  KOUSI-KKN-TO         OF  PARM-SCZY3005-ARG2
                                      TO  KOUSI-KKN-TO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 調印日
           MOVE  CHOUIN-YMD           OF  PARM-SCZY3005-ARG2
                                      TO  CHOUIN-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 格付
           MOVE  KAKUDSUKE            OF  PARM-SCZY3005-ARG2
                                      TO  KAKUDSUKE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 最低取引単位
           MOVE  MIN-TRHK-TANI        OF  PARM-SCZY3005-ARG2
                                      TO  MIN-TRHK-TANI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 資産分類コード
           MOVE  SISAN-BUNRUI-CD      OF  PARM-SCZY3005-ARG2
                                      TO  SISAN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 行使価格
           MOVE  KOUSI-KKK            OF  PARM-SCZY3005-ARG2
                                      TO  KOUSI-KKK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 行使為替レート
           MOVE  KOUSI-KWS            OF  PARM-SCZY3005-ARG2
                                      TO  KOUSI-KWS
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分子）
           MOVE  JYOUSUU-BUNSI        OF  PARM-SCZY3005-ARG2
                                      TO  JYOUSUU-BUNSI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分母）
           MOVE  JYOUSUU-BUNBO        OF  PARM-SCZY3005-ARG2
                                      TO  JYOUSUU-BUNBO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ１
           MOVE  YOBI-FLG-1           OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-FLG-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード１
           MOVE  YOBI-CD-1            OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-CD-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字１
           MOVE  YOBI-SU-JI-1         OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-SU-JI-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント１
           MOVE  COMENT-1             OF  PARM-SCZY3005-ARG2
                                      TO  COMENT-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ２
           MOVE  YOBI-FLG-2           OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-FLG-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード２
           MOVE  YOBI-CD-2            OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-CD-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字２
           MOVE  YOBI-SU-JI-2         OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-SU-JI-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント２
           MOVE  COMENT-2             OF  PARM-SCZY3005-ARG2
                                      TO  COMENT-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ３
           MOVE  YOBI-FLG-3           OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-FLG-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード３
           MOVE  YOBI-CD-3            OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-CD-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字３
           MOVE  YOBI-SU-JI-3         OF  PARM-SCZY3005-ARG2
                                      TO  YOBI-SU-JI-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント３
           MOVE  COMENT-3             OF  PARM-SCZY3005-ARG2
                                      TO  COMENT-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- データソース
           MOVE  DATA-SOURCE          OF  PARM-SCZY3005-ARG2
                                      TO  DATA-SOURCE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 削除区分
           MOVE  SAKUJO-KBN           OF  PARM-SCZY3005-ARG2
                                      TO  SAKUJO-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成フラグ
           MOVE  SK-FLG               OF  PARM-SCZY3005-ARG2
                                      TO  SK-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成画面ID
           MOVE  SK-GAMEN             OF  PARM-SCZY3005-ARG2
                                      TO  SK-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ファイル名
           MOVE  SK-FILE              OF  PARM-SCZY3005-ARG2
                                      TO  SK-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成日時
           MOVE  SK-DATE              OF  PARM-SCZY3005-ARG2
                                      TO  SK-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ログインユーザ会社コード
           MOVE  SK-LOGIN-CMP-CD      OF  PARM-SCZY3005-ARG2
                                      TO  SK-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ユーザID
           MOVE  SK-SID               OF  PARM-SCZY3005-ARG2
                                      TO  SK-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成プログラムID
           MOVE  SK-PGMID             OF  PARM-SCZY3005-ARG2
                                      TO  SK-PGMID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新フラグ
           MOVE  UPD-FLG              OF  PARM-SCZY3005-ARG2
                                      TO  UPD-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新画面ＩＤ
           MOVE  UPD-GAMEN            OF  PARM-SCZY3005-ARG2
                                      TO  UPD-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ファイル名
           MOVE  UPD-FILE             OF  PARM-SCZY3005-ARG2
                                      TO  UPD-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新日時
           MOVE  UPD-DATE             OF  PARM-SCZY3005-ARG2
                                      TO  UPD-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ログインユーザ会社コード
           MOVE  UPD-LOGIN-CMP-CD     OF  PARM-SCZY3005-ARG2
                                      TO  UPD-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ユーザＩＤ
           MOVE  UPD-SID              OF  PARM-SCZY3005-ARG2
                                      TO  UPD-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新プログラムＩＤ
           MOVE  UPD-PGMID            OF  PARM-SCZY3005-ARG2
                                      TO  UPD-PGMID
                                      OF  PARM-SCZY3004-ARG2.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄基本属性（株式）データ編集処理終了".
      *-----------------------------------------------------------------
       APL-MGR-KS-EDIT-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(債券)データ編集処理
      ******************************************************************
       APL-MGR-BD-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(債券)データ編集処理開始"
      *-----------------------------------------------------------------
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3006-ARG2
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- コードリファレンス系列コード（リファレンス情報）
           MOVE  CD-REF-KRTU-CD       OF  PARM-SCZY3002-ARG2
                                      TO  RF-KEIRETU-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 外部銘柄コード（リファレンス情報）
           MOVE  GAIBU-MEG-CD         OF  PARM-SCZY3002-ARG2
                                      TO  RF-GAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 商品分類コード（リファレンス情報）
           MOVE  SYOHIN-BUNRUI-CD     OF  PARM-SCZY3002-ARG2
                                      TO  RF-SYOHIN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 証券種別コード（リファレンス情報）
           MOVE  SEC-SBT-CD           OF  PARM-SCZY3002-ARG2
                                      TO  RF-SEC-SBT-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄通貨コード（リファレンス情報）
           MOVE  MEG-TUKA-CD          OF  PARM-SCZY3002-ARG2
                                      TO  RF-MEG-TUKA-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 投資対象国コード（リファレンス情報）
           MOVE  TOUSI-TARGET-KUNI-CD OF  PARM-SCZY3002-ARG2
                                      TO  RF-TOUSI-TARGET-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体国コード（リファレンス情報）
           MOVE  HAKKO-TAI-KUNI-CD    OF  PARM-SCZY3002-ARG2
                                      TO  RF-HAKKO-TAI-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 株式種別（リファレンス情報）
           MOVE  KABU-SBT             OF  PARM-SCZY3002-ARG2
                                      TO  RF-KABU-SBT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 回（リファレンス情報）
           MOVE  KAYI                 OF  PARM-SCZY3002-ARG2
                                      TO  RF-KAYI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 号（リファレンス情報）
           MOVE  GOU                  OF  PARM-SCZY3002-ARG2
                                      TO  RF-GOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 満期日（リファレンス情報）
           MOVE  MNK-YMD              OF  PARM-SCZY3002-ARG2
                                      TO  RF-MNK-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 限月（リファレンス情報）
           MOVE  GENGETSU             OF  PARM-SCZY3002-ARG2
                                      TO  RF-GENGETSU
                                      OF  PARM-SCZY3004-ARG2
      *---------- ストライクプライス（リファレンス情報）
           MOVE  STRIKEPRICE          OF  PARM-SCZY3002-ARG2
                                      TO  RF-STRIKEPRICE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 適用開始日
           MOVE  TEKIYO-FROM          OF  PARM-SCZY3006-ARG2
                                      TO  TEKIYO-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄名称（日本語）
           IF  USE-MEG-NAME-J         OF  PARM-SCZY3006-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J       OF  PARM-SCZY3006-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J   OF  PARM-SCZY3006-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（日本語略称）
           IF  USE-MEG-NAME-J-RYAKU   OF  PARM-SCZY3006-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3006-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3006-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語）
           IF  USE-MEG-NAME-E         OF  PARM-SCZY3006-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E       OF  PARM-SCZY3006-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E   OF  PARM-SCZY3006-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語略称）
           IF  USE-MEG-NAME-E-RYAKU   OF  PARM-SCZY3006-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3006-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3006-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 発行体名称（日本語）
           MOVE  HAKKO-TAI-NAME-J     OF  PARM-SCZY3006-ARG2
                                      TO  HAKKO-TAI-NAME-J
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体名称（英語）
           MOVE  HAKKO-TAI-NAME-E     OF  PARM-SCZY3006-ARG2
                                      TO  HAKKO-TAI-NAME-E
                                      OF  PARM-SCZY3004-ARG2
      *---------- 上場区分
           MOVE  JYOJY-KBN            OF  PARM-SCZY3006-ARG2
                                      TO  JYOJY-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 保振対象区分
           MOVE  HOHURI-TARGET-KBN    OF  PARM-SCZY3006-ARG2
                                      TO  HOHURI-TARGET-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 現地源泉税非課税区分
           MOVE  LCL-GS-TAX-NOTAX-KBN OF  PARM-SCZY3006-ARG2
                                      TO  LCL-GS-TAX-NOTAX-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 売買単位
           MOVE  BUY-SEL-TANI         OF  PARM-SCZY3006-ARG2
                                      TO  BUY-SEL-TANI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 公募区分
           MOVE  PUB-KBN              OF  PARM-SCZY3006-ARG2
                                      TO  PUB-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行日
           MOVE  HAKKO-YMD            OF  PARM-SCZY3006-ARG2
                                      TO  HAKKO-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行価格
           MOVE  HAKKO-KKK            OF  PARM-SCZY3006-ARG2
                                      TO  HAKKO-KKK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 一口当り額面／単位額面
           MOVE  TANI-FACE            OF  PARM-SCZY3006-ARG2
                                      TO  KUTI1-FACE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算・利払回数
           MOVE  RIBAR-KAISU          OF  PARM-SCZY3006-ARG2
                                      TO  KESSAN-RIBAR-KAISU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日１
           MOVE  RIBAR-YMD-1          OF  PARM-SCZY3006-ARG2
                                      TO  KESSAN-RIBAR-YMD-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日２
           MOVE  RIBAR-YMD-2          OF  PARM-SCZY3006-ARG2
                                      TO  KESSAN-RIBAR-YMD-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日３
           MOVE  RIBAR-YMD-3          OF  PARM-SCZY3006-ARG2
                                      TO  KESSAN-RIBAR-YMD-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日４
           MOVE  RIBAR-YMD-4          OF  PARM-SCZY3006-ARG2
                                      TO  KESSAN-RIBAR-YMD-4
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日休日処理区分
           MOVE  RIBAR-YMD-QJT-SR-KBN
                                      OF  PARM-SCZY3006-ARG2
                                      TO  K-R-YMD-QJT-SYRI-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 付与率
           MOVE  HUYO-RT              OF  PARM-SCZY3006-ARG2
                                      TO  HUYO-RT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 行使期間FROM
           MOVE  KOUSI-KKN-FROM       OF  PARM-SCZY3006-ARG2
                                      TO  KOUSI-KKN-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 行使期間TO
           MOVE  KOUSI-KKN-TO         OF  PARM-SCZY3006-ARG2
                                      TO  KOUSI-KKN-TO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 調印日
           MOVE  CHOUIN-YMD           OF  PARM-SCZY3006-ARG2
                                      TO  CHOUIN-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 格付
           MOVE  KAKUDSUKE            OF  PARM-SCZY3006-ARG2
                                      TO  KAKUDSUKE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 最低取引単位
           MOVE  MIN-TRHK-TANI        OF  PARM-SCZY3006-ARG2
                                      TO  MIN-TRHK-TANI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 利付／割引区分
           MOVE  RITUKI-WARI-KBN      OF  PARM-SCZY3006-ARG2
                                      TO  RITUKI-WARI-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 固定変動区分
           MOVE  FIX-VRBL-KBN         OF  PARM-SCZY3006-ARG2
                                      TO  FIX-VRBL-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 償還日
           MOVE  SHOKAN-YMD           OF  PARM-SCZY3006-ARG2
                                      TO  SHOKAN-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 利払通貨
           MOVE  RIBAR-TUKA           OF  PARM-SCZY3006-ARG2
                                      TO  RIBAR-TUKA
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過日数計算方法
           MOVE  KEKA-NISU-CALC-HOU   OF  PARM-SCZY3006-ARG2
                                      TO  KEKA-NISU-CALC-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過日数計算方法１ヶ月３０日設定区分
           MOVE  KKNS-KSHH-1M30D-KBN  OF  PARM-SCZY3006-ARG2
                                      TO  KKNS-KSHH-1M30D-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過日数計算方法片端／両端区分
           MOVE  KKNS-KSHH-KTT-RT-KBN OF  PARM-SCZY3006-ARG2
                                      TO  KKNS-KSHH-KTT-RT-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 年日数計算方法
           MOVE  NEN-CALC-HOU         OF  PARM-SCZY3006-ARG2
                                      TO  NEN-CALC-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 年日数計算方法片端／両端区分
           MOVE  NEN-KSHH-KTT-RT-KBN  OF  PARM-SCZY3006-ARG2
                                      TO  NEN-KSHH-KTT-RT-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 単位１日あたり利息額
           MOVE  TANI-1-YMD-RSK-GAKU  OF  PARM-SCZY3006-ARG2
                                      TO  TANI-1-YMD-RSK-GAKU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過利息計算方法
           MOVE  KEKA-RSK-CALC-HOU    OF  PARM-SCZY3006-ARG2
                                      TO  KEKA-RSK-CALC-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- ユーロ債区分
           MOVE  EURO-BOND-KBN        OF  PARM-SCZY3006-ARG2
                                      TO  EURO-BOND-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 連動係数参照区分
           MOVE  RENKSU-REF-KBN       OF  PARM-SCZY3006-ARG2
                                      TO  RENKSU-REF-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 連動係数／ファクター
           MOVE  RENKSU               OF  PARM-SCZY3006-ARG2
                                      TO  RENKSU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 国債リオープン区分
           MOVE  KOKUSAI-REOPEN-KBN   OF  PARM-SCZY3006-ARG2
                                      TO  KOKUSAI-REOPEN-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 償還単価
           MOVE  SHOKAN-TNK           OF  PARM-SCZY3006-ARG2
                                      TO  SHOKAN-TNK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 償還通貨
           MOVE  SHOKAN-TUKA          OF  PARM-SCZY3006-ARG2
                                      TO  SHOKAN-TUKA
                                      OF  PARM-SCZY3004-ARG2
      *---------- 償還日休日処理区分
           MOVE  SHOKAN-QJT-SYRI-KBN  OF  PARM-SCZY3006-ARG2
                                      TO  SHOKAN-QJT-SYRI-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 利落日数
           MOVE  RIOTI-NISU           OF  PARM-SCZY3006-ARG2
                                      TO  RIOTI-NISU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過利息調整日数
           MOVE  KEKA-RSK-CHOSEI-NISU OF  PARM-SCZY3006-ARG2
                                      TO  KEKA-RSK-CHOSEI-NISU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 利率／割引率
           MOVE  RRT-WARI-RT          OF  PARM-SCZY3006-ARG2
                                      TO  RRT-WARI-RT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理桁数
           MOVE  HASU-SYRI-KETASU     OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-KETASU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理１方法
           MOVE  HASU-SYRI-1-HOU      OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-1-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理１FROM
           MOVE  HASU-SYRI-1-FROM     OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-1-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理１TO
           MOVE  HASU-SYRI-1-TO       OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-1-TO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理１数字
           MOVE  HASU-SYRI-1-SU-JI    OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-1-SU-JI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理２方法
           MOVE  HASU-SYRI-2-HOU      OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-2-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理２FROM
           MOVE  HASU-SYRI-2-FROM     OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-2-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理２TO
           MOVE  HASU-SYRI-2-TO       OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-2-TO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理２数字
           MOVE  HASU-SYRI-2-SU-JI    OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-2-SU-JI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理３方法
           MOVE  HASU-SYRI-3-HOU      OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-3-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理３FROM
           MOVE  HASU-SYRI-3-FROM     OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-3-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理３TO
           MOVE  HASU-SYRI-3-TO       OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-3-TO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理３数字
           MOVE  HASU-SYRI-3-SU-JI    OF  PARM-SCZY3006-ARG2
                                      TO  HASU-SYRI-3-SU-JI
                                      OF  PARM-SCZY3004-ARG2
      *---------- １００通貨端数処理桁数
           MOVE  T100-HASU-SYRI-KETA  OF  PARM-SCZY3006-ARG2
                                      TO  T100-HASU-SYRI-KETA
                                      OF  PARM-SCZY3004-ARG2
      *---------- １００通貨端数処理方法
           MOVE  T100-HASU-SYRI-HOU   OF  PARM-SCZY3006-ARG2
                                      TO  T100-HASU-SYRI-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払日
           MOVE  SHOKI-RIBAR-YMD      OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RIBAR-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払起算日
           MOVE  SHOKI-RIBAR-KS-YMD   OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RIBAR-KS-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払経過日数計算方法
           MOVE  SHOKI-RB-KKNS-KSHH   OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RB-KKNS-KSHH
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払経過日数１ヶ月３０日設定区分
           MOVE  SHOKI-RB-1M30D-KBN   OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RB-1M30D-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払経過日数片端／両端区分
           MOVE  SHOKI-RB-KKNS-KR-KBN OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RB-KKNS-KR-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払年日数計算方法
           MOVE  SHOKI-RIBAR-NEN-KSHH OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RIBAR-NEN-KSHH
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払年日数計算方法片端／両端区分
           MOVE  SHOKI-RB-KSHH-KR-KBN OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RB-KSHH-KR-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払日休日処理区分
           MOVE  SHOKI-RB-YMD-QJT-KBN OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RB-YMD-QJT-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期利払単位１日あたり利息額
           MOVE  SHOKI-RB-TANI-1D-RSK OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-RB-TANI-1D-RSK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期１００通貨端数処理桁数
           MOVE  SHOKI-T100-HASU-SRKT OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-T100-HASU-SRKT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 初期１００通貨端数処理方法
           MOVE  SHOKI-T100-HASU-SRH  OF  PARM-SCZY3006-ARG2
                                      TO  SHOKI-T100-HASU-SRH
                                      OF  PARM-SCZY3004-ARG2
      *---------- 最終利払日
           MOVE  LAST-RIBAR-YMD       OF  PARM-SCZY3006-ARG2
                                      TO  LAST-RIBAR-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 最終利払起算日
           MOVE  LAST-RIBAR-KISAN-YMD OF  PARM-SCZY3006-ARG2
                                      TO  LAST-RIBAR-KISAN-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期利払経過日数計算方法
           MOVE  SHUKI-RB-KKNS-KSHH   OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-RB-KKNS-KSHH
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期利払経過日数１ヶ月３０日設定区分
           MOVE  SHUKI-RB-1M30D-KBN   OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-RB-1M30D-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期利払経過日数片端／両端区分
           MOVE  SHUKI-RB-KKNS-KR-KBN OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-RB-KKNS-KR-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期利払年日数計算方法
           MOVE  SHUKI-RIBAR-NEN-KSHH OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-RIBAR-NEN-KSHH
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期利払年日数計算方法片端／両端区分
           MOVE  SHUKI-RB-KSHH-KR-KBN OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-RB-KSHH-KR-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期利払日休日処理区分
           MOVE  SHUKI-RB-YMD-QJT-KBN OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-RB-YMD-QJT-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期利払単位１日あたり利息額
           MOVE  SHUKI-RB-TANI-1D-RSK OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-RB-TANI-1D-RSK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期１００通貨端数処理桁数
           MOVE  SHUKI-T100-HASU-SRKT OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-T100-HASU-SRKT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 終期１００通貨端数処理方法
           MOVE  SHUKI-T100-HASU-SRH  OF  PARM-SCZY3006-ARG2
                                      TO  SHUKI-T100-HASU-SRH
                                      OF  PARM-SCZY3004-ARG2
      *---------- 権利行使価格
           MOVE  KRKS-KKK             OF  PARM-SCZY3006-ARG2
                                      TO  KRKS-KKK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 転換日
           MOVE  TENKAN-YMD           OF  PARM-SCZY3006-ARG2
                                      TO  TENKAN-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 転換／行使レート
           MOVE  TENKAN-KOUSI-RATE    OF  PARM-SCZY3006-ARG2
                                      TO  TENKAN-KOUSI-RATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行額
           MOVE  HAKKO-GK             OF  PARM-SCZY3006-ARG2
                                      TO  HAKKO-GK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 現存額
           MOVE  GENZON-GK            OF  PARM-SCZY3006-ARG2
                                      TO  GENZON-GK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 外債補助区分
           MOVE  GAISAI-HOJO-KBN      OF  PARM-SCZY3006-ARG2
                                      TO  GAISAI-HOJO-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 上場後時価自動振替
           MOVE  JIKA-AUTO-KAE        OF  PARM-SCZY3006-ARG2
                                      TO  JIKA-AUTO-KAE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分子）
           MOVE  JYOUSUU-BUNSI        OF  PARM-SCZY3006-ARG2
                                      TO  JYOUSUU-BUNSI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分母）
           MOVE  JYOUSUU-BUNBO        OF  PARM-SCZY3006-ARG2
                                      TO  JYOUSUU-BUNBO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ１
           MOVE  YOBI-FLG-1           OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-FLG-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード１
           MOVE  YOBI-CD-1            OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-CD-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字１
           MOVE  YOBI-SU-JI-1         OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-SU-JI-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント１
           MOVE  COMENT-1             OF  PARM-SCZY3006-ARG2
                                      TO  COMENT-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ２
           MOVE  YOBI-FLG-2           OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-FLG-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード２
           MOVE  YOBI-CD-2            OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-CD-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字２
           MOVE  YOBI-SU-JI-2         OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-SU-JI-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント２
           MOVE  COMENT-2             OF  PARM-SCZY3006-ARG2
                                      TO  COMENT-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ３
           MOVE  YOBI-FLG-3           OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-FLG-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード３
           MOVE  YOBI-CD-3            OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-CD-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字３
           MOVE  YOBI-SU-JI-3         OF  PARM-SCZY3006-ARG2
                                      TO  YOBI-SU-JI-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント３
           MOVE  COMENT-3             OF  PARM-SCZY3006-ARG2
                                      TO  COMENT-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- データソース
           MOVE  DATA-SOURCE          OF  PARM-SCZY3006-ARG2
                                      TO  DATA-SOURCE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 削除区分
           MOVE  SAKUJO-KBN           OF  PARM-SCZY3006-ARG2
                                      TO  SAKUJO-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成フラグ
           MOVE  SK-FLG               OF  PARM-SCZY3006-ARG2
                                      TO  SK-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成画面ID
           MOVE  SK-GAMEN             OF  PARM-SCZY3006-ARG2
                                      TO  SK-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ファイル名
           MOVE  SK-FILE              OF  PARM-SCZY3006-ARG2
                                      TO  SK-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成日時
           MOVE  SK-DATE              OF  PARM-SCZY3006-ARG2
                                      TO  SK-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ログインユーザ会社コード
           MOVE  SK-LOGIN-CMP-CD      OF  PARM-SCZY3006-ARG2
                                      TO  SK-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ユーザID
           MOVE  SK-SID               OF  PARM-SCZY3006-ARG2
                                      TO  SK-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成プログラムID
           MOVE  SK-PGMID             OF  PARM-SCZY3006-ARG2
                                      TO  SK-PGMID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新フラグ
           MOVE  UPD-FLG              OF  PARM-SCZY3006-ARG2
                                      TO  UPD-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新画面ＩＤ
           MOVE  UPD-GAMEN            OF  PARM-SCZY3006-ARG2
                                      TO  UPD-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ファイル名
           MOVE  UPD-FILE             OF  PARM-SCZY3006-ARG2
                                      TO  UPD-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新日時
           MOVE  UPD-DATE             OF  PARM-SCZY3006-ARG2
                                      TO  UPD-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ログインユーザ会社コード
           MOVE  UPD-LOGIN-CMP-CD     OF  PARM-SCZY3006-ARG2
                                      TO  UPD-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ユーザＩＤ
           MOVE  UPD-SID              OF  PARM-SCZY3006-ARG2
                                      TO  UPD-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新プログラムＩＤ
           MOVE  UPD-PGMID            OF  PARM-SCZY3006-ARG2
                                      TO  UPD-PGMID
                                      OF  PARM-SCZY3004-ARG2.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(債券)データ編集処理終了".
      *-----------------------------------------------------------------
       APL-MGR-BD-EDIT-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(先物OP)データ編集処理
      ******************************************************************
       APL-MGR-OP-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(先物OP)データ編集処理開始"
      *-----------------------------------------------------------------
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3007-ARG2
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- コードリファレンス系列コード（リファレンス情報）
           MOVE  CD-REF-KRTU-CD       OF  PARM-SCZY3002-ARG2
                                      TO  RF-KEIRETU-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 外部銘柄コード（リファレンス情報）
           MOVE  GAIBU-MEG-CD         OF  PARM-SCZY3002-ARG2
                                      TO  RF-GAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 商品分類コード（リファレンス情報）
           MOVE  SYOHIN-BUNRUI-CD     OF  PARM-SCZY3002-ARG2
                                      TO  RF-SYOHIN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 証券種別コード（リファレンス情報）
           MOVE  SEC-SBT-CD           OF  PARM-SCZY3002-ARG2
                                      TO  RF-SEC-SBT-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄通貨コード（リファレンス情報）
           MOVE  MEG-TUKA-CD          OF  PARM-SCZY3002-ARG2
                                      TO  RF-MEG-TUKA-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 投資対象国コード（リファレンス情報）
           MOVE  TOUSI-TARGET-KUNI-CD OF  PARM-SCZY3002-ARG2
                                      TO  RF-TOUSI-TARGET-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体国コード（リファレンス情報）
           MOVE  HAKKO-TAI-KUNI-CD    OF  PARM-SCZY3002-ARG2
                                      TO  RF-HAKKO-TAI-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 株式種別（リファレンス情報）
           MOVE  KABU-SBT             OF  PARM-SCZY3002-ARG2
                                      TO  RF-KABU-SBT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 回（リファレンス情報）
           MOVE  KAYI                 OF  PARM-SCZY3002-ARG2
                                      TO  RF-KAYI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 号（リファレンス情報）
           MOVE  GOU                  OF  PARM-SCZY3002-ARG2
                                      TO  RF-GOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 満期日（リファレンス情報）
           MOVE  MNK-YMD              OF  PARM-SCZY3002-ARG2
                                      TO  RF-MNK-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 限月（リファレンス情報）
           MOVE  GENGETSU             OF  PARM-SCZY3002-ARG2
                                      TO  RF-GENGETSU
                                      OF  PARM-SCZY3004-ARG2
      *---------- ストライクプライス（リファレンス情報）
           MOVE  STRIKEPRICE          OF  PARM-SCZY3002-ARG2
                                      TO  RF-STRIKEPRICE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 適用開始日
           MOVE  TEKIYO-FROM          OF  PARM-SCZY3007-ARG2
                                      TO  TEKIYO-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄名称（日本語）
           IF  USE-MEG-NAME-J         OF  PARM-SCZY3007-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J       OF  PARM-SCZY3007-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J   OF  PARM-SCZY3007-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（日本語略称）
           IF  USE-MEG-NAME-J-RYAKU   OF  PARM-SCZY3007-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3007-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3007-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語）
           IF  USE-MEG-NAME-E         OF  PARM-SCZY3007-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E       OF  PARM-SCZY3007-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E   OF  PARM-SCZY3007-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語略称）
           IF  USE-MEG-NAME-E-RYAKU   OF  PARM-SCZY3007-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3007-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3007-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 発行体名称（日本語）
           MOVE  HAKKO-TAI-NAME-J     OF  PARM-SCZY3007-ARG2
                                      TO  HAKKO-TAI-NAME-J
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体名称（英語）
           MOVE  HAKKO-TAI-NAME-E     OF  PARM-SCZY3007-ARG2
                                      TO  HAKKO-TAI-NAME-E
                                      OF  PARM-SCZY3004-ARG2
      *---------- 上場区分
           MOVE  JYOJY-KBN            OF  PARM-SCZY3007-ARG2
                                      TO  JYOJY-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 保振対象区分
           MOVE  HOHURI-TARGET-KBN    OF  PARM-SCZY3007-ARG2
                                      TO  HOHURI-TARGET-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 現地源泉税非課税区分
           MOVE  LCL-GS-TAX-NOTAX-KBN OF  PARM-SCZY3007-ARG2
                                      TO  LCL-GS-TAX-NOTAX-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 満期日
           MOVE  MNK-YMD              OF  PARM-SCZY3007-ARG2
                                      TO  MNK-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 転換先銘柄コード
           MOVE  TNKN-SAKI-MEG-CD     OF  PARM-SCZY3007-ARG2
                                      TO  TNKN-SAKI-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 転換先証券種別コード
           MOVE  TNKN-SAKI-SEC-SBT-CD OF  PARM-SCZY3007-ARG2
                                      TO  TNKN-SAKI-SEC-SBT-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 原証券コード
           MOVE  MOTO-SEC-CD          OF  PARM-SCZY3007-ARG2
                                      TO  MOTO-SEC-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 市場コード
           MOVE  SIJO-CD              OF  PARM-SCZY3007-ARG2
                                      TO  SIJO-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 取引期間（開始）
           MOVE  TRHK-KKN-KAISI       OF  PARM-SCZY3007-ARG2
                                      TO  TRHK-KKN-KAISI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 取引期間（終了）
           MOVE  TRHK-KKN-SYURYO      OF  PARM-SCZY3007-ARG2
                                      TO  TRHK-KKN-SYURYO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 権利行使価格（分子）
           MOVE  KENRI-KOS-KKK-BUNSI  OF  PARM-SCZY3007-ARG2
                                      TO  KENRI-KOS-KKK-BUNSI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 権利行使価格（分母）
           MOVE  KENRI-KOS-KKK-BUNBO  OF  PARM-SCZY3007-ARG2
                                      TO  KENRI-KOS-KKK-BUNBO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分子）
           MOVE  JYOUSUU-BUNSI        OF  PARM-SCZY3007-ARG2
                                      TO  JYOUSUU-BUNSI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分母）
           MOVE  JYOUSUU-BUNBO        OF  PARM-SCZY3007-ARG2
                                      TO  JYOUSUU-BUNBO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ１
           MOVE  YOBI-FLG-1           OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-FLG-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード１
           MOVE  YOBI-CD-1            OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-CD-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字１
           MOVE  YOBI-SU-JI-1         OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-SU-JI-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント１
           MOVE  COMENT-1             OF  PARM-SCZY3007-ARG2
                                      TO  COMENT-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ２
           MOVE  YOBI-FLG-2           OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-FLG-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード２
           MOVE  YOBI-CD-2            OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-CD-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字２
           MOVE  YOBI-SU-JI-2         OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-SU-JI-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント２
           MOVE  COMENT-2             OF  PARM-SCZY3007-ARG2
                                      TO  COMENT-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ３
           MOVE  YOBI-FLG-3           OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-FLG-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード３
           MOVE  YOBI-CD-3            OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-CD-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字３
           MOVE  YOBI-SU-JI-3         OF  PARM-SCZY3007-ARG2
                                      TO  YOBI-SU-JI-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント３
           MOVE  COMENT-3             OF  PARM-SCZY3007-ARG2
                                      TO  COMENT-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- データソース
           MOVE  DATA-SOURCE          OF  PARM-SCZY3007-ARG2
                                      TO  DATA-SOURCE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 削除区分
           MOVE  SAKUJO-KBN           OF  PARM-SCZY3007-ARG2
                                      TO  SAKUJO-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成フラグ
           MOVE  SK-FLG               OF  PARM-SCZY3007-ARG2
                                      TO  SK-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成画面ID
           MOVE  SK-GAMEN             OF  PARM-SCZY3007-ARG2
                                      TO  SK-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ファイル名
           MOVE  SK-FILE              OF  PARM-SCZY3007-ARG2
                                      TO  SK-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成日時
           MOVE  SK-DATE              OF  PARM-SCZY3007-ARG2
                                      TO  SK-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ログインユーザ会社コード
           MOVE  SK-LOGIN-CMP-CD      OF  PARM-SCZY3007-ARG2
                                      TO  SK-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ユーザID
           MOVE  SK-SID               OF  PARM-SCZY3007-ARG2
                                      TO  SK-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成プログラムID
           MOVE  SK-PGMID             OF  PARM-SCZY3007-ARG2
                                      TO  SK-PGMID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新フラグ
           MOVE  UPD-FLG              OF  PARM-SCZY3007-ARG2
                                      TO  UPD-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新画面ＩＤ
           MOVE  UPD-GAMEN            OF  PARM-SCZY3007-ARG2
                                      TO  UPD-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ファイル名
           MOVE  UPD-FILE             OF  PARM-SCZY3007-ARG2
                                      TO  UPD-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新日時
           MOVE  UPD-DATE             OF  PARM-SCZY3007-ARG2
                                      TO  UPD-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ログインユーザ会社コード
           MOVE  UPD-LOGIN-CMP-CD     OF  PARM-SCZY3007-ARG2
                                      TO  UPD-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ユーザＩＤ
           MOVE  UPD-SID              OF  PARM-SCZY3007-ARG2
                                      TO  UPD-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新プログラムＩＤ
           MOVE  UPD-PGMID            OF  PARM-SCZY3007-ARG2
                                      TO  UPD-PGMID
                                      OF  PARM-SCZY3004-ARG2.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(先物OP)データ編集処理終了".
      *-----------------------------------------------------------------
       APL-MGR-OP-EDIT-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(その他オフ)データ編集処理
      ******************************************************************
       APL-MGR-OF-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(その他オフ)データ編集処理開始"
      *-----------------------------------------------------------------
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3008-ARG2
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- コードリファレンス系列コード（リファレンス情報）
           MOVE  CD-REF-KRTU-CD       OF  PARM-SCZY3002-ARG2
                                      TO  RF-KEIRETU-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 外部銘柄コード（リファレンス情報）
           MOVE  GAIBU-MEG-CD         OF  PARM-SCZY3002-ARG2
                                      TO  RF-GAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 商品分類コード（リファレンス情報）
           MOVE  SYOHIN-BUNRUI-CD     OF  PARM-SCZY3002-ARG2
                                      TO  RF-SYOHIN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 証券種別コード（リファレンス情報）
           MOVE  SEC-SBT-CD           OF  PARM-SCZY3002-ARG2
                                      TO  RF-SEC-SBT-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄通貨コード（リファレンス情報）
           MOVE  MEG-TUKA-CD          OF  PARM-SCZY3002-ARG2
                                      TO  RF-MEG-TUKA-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 投資対象国コード（リファレンス情報）
           MOVE  TOUSI-TARGET-KUNI-CD OF  PARM-SCZY3002-ARG2
                                      TO  RF-TOUSI-TARGET-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体国コード（リファレンス情報）
           MOVE  HAKKO-TAI-KUNI-CD    OF  PARM-SCZY3002-ARG2
                                      TO  RF-HAKKO-TAI-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 株式種別（リファレンス情報）
           MOVE  KABU-SBT             OF  PARM-SCZY3002-ARG2
                                      TO  RF-KABU-SBT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 回（リファレンス情報）
           MOVE  KAYI                 OF  PARM-SCZY3002-ARG2
                                      TO  RF-KAYI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 号（リファレンス情報）
           MOVE  GOU                  OF  PARM-SCZY3002-ARG2
                                      TO  RF-GOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 満期日（リファレンス情報）
           MOVE  MNK-YMD              OF  PARM-SCZY3002-ARG2
                                      TO  RF-MNK-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 限月（リファレンス情報）
           MOVE  GENGETSU             OF  PARM-SCZY3002-ARG2
                                      TO  RF-GENGETSU
                                      OF  PARM-SCZY3004-ARG2
      *---------- ストライクプライス（リファレンス情報）
           MOVE  STRIKEPRICE          OF  PARM-SCZY3002-ARG2
                                      TO  RF-STRIKEPRICE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 適用開始日
           MOVE  TEKIYO-FROM          OF  PARM-SCZY3008-ARG2
                                      TO  TEKIYO-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄名称（日本語）
           IF  USE-MEG-NAME-J         OF  PARM-SCZY3008-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J       OF  PARM-SCZY3008-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J   OF  PARM-SCZY3008-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（日本語略称）
           IF  USE-MEG-NAME-J-RYAKU   OF  PARM-SCZY3008-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3008-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3008-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語）
           IF  USE-MEG-NAME-E         OF  PARM-SCZY3008-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E       OF  PARM-SCZY3008-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E   OF  PARM-SCZY3008-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語略称）
           IF  USE-MEG-NAME-E-RYAKU   OF  PARM-SCZY3008-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3008-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3008-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 発行体名称（日本語）
           MOVE  HAKKO-TAI-NAME-J     OF  PARM-SCZY3008-ARG2
                                      TO  HAKKO-TAI-NAME-J
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体名称（英語）
           MOVE  HAKKO-TAI-NAME-E     OF  PARM-SCZY3008-ARG2
                                      TO  HAKKO-TAI-NAME-E
                                      OF  PARM-SCZY3004-ARG2
      *---------- 上場区分
           MOVE  JYOJY-KBN            OF  PARM-SCZY3008-ARG2
                                      TO  JYOJY-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 保振対象区分
           MOVE  HOHURI-TARGET-KBN    OF  PARM-SCZY3008-ARG2
                                      TO  HOHURI-TARGET-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 現地源泉税非課税区分
           MOVE  LCL-GS-TAX-NOTAX-KBN OF  PARM-SCZY3008-ARG2
                                      TO  LCL-GS-TAX-NOTAX-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 満期日
           MOVE  MNK-YMD              OF  PARM-SCZY3008-ARG2
                                      TO  MNK-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 転換先銘柄コード
           MOVE  TNKN-SAKI-MEG-CD     OF  PARM-SCZY3008-ARG2
                                      TO  TNKN-SAKI-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 転換先証券種別コード
           MOVE  TNKN-SAKI-SEC-SBT-CD OF  PARM-SCZY3008-ARG2
                                      TO  TNKN-SAKI-SEC-SBT-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 原証券コード
           MOVE  MOTO-SEC-CD          OF  PARM-SCZY3008-ARG2
                                      TO  MOTO-SEC-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 市場コード
           MOVE  SIJO-CD              OF  PARM-SCZY3008-ARG2
                                      TO  SIJO-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 取引期間（開始）
           MOVE  TRHK-KKN-KAISI       OF  PARM-SCZY3008-ARG2
                                      TO  TRHK-KKN-KAISI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 取引期間（終了）
           MOVE  TRHK-KKN-SYURYO      OF  PARM-SCZY3008-ARG2
                                      TO  TRHK-KKN-SYURYO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 権利行使価格（分子）
           MOVE  KENRI-KOS-KKK-BUNSI  OF  PARM-SCZY3008-ARG2
                                      TO  KENRI-KOS-KKK-BUNSI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 権利行使価格（分母）
           MOVE  KENRI-KOS-KKK-BUNBO  OF  PARM-SCZY3008-ARG2
                                      TO  KENRI-KOS-KKK-BUNBO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 資産分類コード
           MOVE  SISAN-BUNRUI-CD      OF  PARM-SCZY3008-ARG2
                                      TO  SISAN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 取引通貨コード
           MOVE  TRHK-TUKA-CD         OF  PARM-SCZY3008-ARG2
                                      TO  TRHK-TUKA-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- コールプット区分
           MOVE  CALL-PUT-KBN         OF  PARM-SCZY3008-ARG2
                                      TO  CALL-PUT-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- カウンターパーティ
           MOVE  COUNTER-PARTY        OF  PARM-SCZY3008-ARG2
                                      TO  COUNTER-PARTY
                                      OF  PARM-SCZY3004-ARG2
      *---------- 用途
           MOVE  YOUTO                OF  PARM-SCZY3008-ARG2
                                      TO  YOUTO
                                      OF  PARM-SCZY3004-ARG2
      *---------- ヘッジ／カバー区分
           MOVE  HEDGE-COVER-KBN      OF  PARM-SCZY3008-ARG2
                                      TO  HEDGE-COVER-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 勘定科目出力商品名
           MOVE  KNJ-KAMK-OUT-SYOHIN  OF  PARM-SCZY3008-ARG2
                                      TO  KNJ-KAMK-OUT-SYOHIN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分子）
           MOVE  JYOUSUU-BUNSI        OF  PARM-SCZY3008-ARG2
                                      TO  JYOUSUU-BUNSI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分母）
           MOVE  JYOUSUU-BUNBO        OF  PARM-SCZY3008-ARG2
                                      TO  JYOUSUU-BUNBO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ１
           MOVE  YOBI-FLG-1           OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-FLG-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード１
           MOVE  YOBI-CD-1            OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-CD-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字１
           MOVE  YOBI-SU-JI-1         OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-SU-JI-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント１
           MOVE  COMENT-1             OF  PARM-SCZY3008-ARG2
                                      TO  COMENT-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ２
           MOVE  YOBI-FLG-2           OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-FLG-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード２
           MOVE  YOBI-CD-2            OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-CD-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字２
           MOVE  YOBI-SU-JI-2         OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-SU-JI-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント２
           MOVE  COMENT-2             OF  PARM-SCZY3008-ARG2
                                      TO  COMENT-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ３
           MOVE  YOBI-FLG-3           OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-FLG-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード３
           MOVE  YOBI-CD-3            OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-CD-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字３
           MOVE  YOBI-SU-JI-3         OF  PARM-SCZY3008-ARG2
                                      TO  YOBI-SU-JI-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント３
           MOVE  COMENT-3             OF  PARM-SCZY3008-ARG2
                                      TO  COMENT-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- データソース
           MOVE  DATA-SOURCE          OF  PARM-SCZY3008-ARG2
                                      TO  DATA-SOURCE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 削除区分
           MOVE  SAKUJO-KBN           OF  PARM-SCZY3008-ARG2
                                      TO  SAKUJO-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成フラグ
           MOVE  SK-FLG               OF  PARM-SCZY3008-ARG2
                                      TO  SK-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成画面ID
           MOVE  SK-GAMEN             OF  PARM-SCZY3008-ARG2
                                      TO  SK-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ファイル名
           MOVE  SK-FILE              OF  PARM-SCZY3008-ARG2
                                      TO  SK-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成日時
           MOVE  SK-DATE              OF  PARM-SCZY3008-ARG2
                                      TO  SK-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ログインユーザ会社コード
           MOVE  SK-LOGIN-CMP-CD      OF  PARM-SCZY3008-ARG2
                                      TO  SK-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ユーザID
           MOVE  SK-SID               OF  PARM-SCZY3008-ARG2
                                      TO  SK-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成プログラムID
           MOVE  SK-PGMID             OF  PARM-SCZY3008-ARG2
                                      TO  SK-PGMID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新フラグ
           MOVE  UPD-FLG              OF  PARM-SCZY3008-ARG2
                                      TO  UPD-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新画面ＩＤ
           MOVE  UPD-GAMEN            OF  PARM-SCZY3008-ARG2
                                      TO  UPD-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ファイル名
           MOVE  UPD-FILE             OF  PARM-SCZY3008-ARG2
                                      TO  UPD-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新日時
           MOVE  UPD-DATE             OF  PARM-SCZY3008-ARG2
                                      TO  UPD-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ログインユーザ会社コード
           MOVE  UPD-LOGIN-CMP-CD     OF  PARM-SCZY3008-ARG2
                                      TO  UPD-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ユーザＩＤ
           MOVE  UPD-SID              OF  PARM-SCZY3008-ARG2
                                      TO  UPD-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新プログラムＩＤ
           MOVE  UPD-PGMID            OF  PARM-SCZY3008-ARG2
                                      TO  UPD-PGMID
                                      OF  PARM-SCZY3004-ARG2.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(その他オフ)データ編集処理終了".
      *-----------------------------------------------------------------
       APL-MGR-OF-EDIT-EXT.
           EXIT.
      ******************************************************************
      *                 銘柄属性取得(その他オン)データ編集処理
      ******************************************************************
       APL-MGR-ON-EDIT-RTN    SECTION.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(その他オン)データ編集処理開始"
      *-----------------------------------------------------------------
      *---------- 内部銘柄コード
           MOVE  NAIBU-MEG-CD         OF  PARM-SCZY3009-ARG2
                                      TO  NAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- コードリファレンス系列コード（リファレンス情報）
           MOVE  CD-REF-KRTU-CD       OF  PARM-SCZY3002-ARG2
                                      TO  RF-KEIRETU-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 外部銘柄コード（リファレンス情報）
           MOVE  GAIBU-MEG-CD         OF  PARM-SCZY3002-ARG2
                                      TO  RF-GAIBU-MEG-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 商品分類コード（リファレンス情報）
           MOVE  SYOHIN-BUNRUI-CD     OF  PARM-SCZY3002-ARG2
                                      TO  RF-SYOHIN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 証券種別コード（リファレンス情報）
           MOVE  SEC-SBT-CD           OF  PARM-SCZY3002-ARG2
                                      TO  RF-SEC-SBT-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄通貨コード（リファレンス情報）
           MOVE  MEG-TUKA-CD          OF  PARM-SCZY3002-ARG2
                                      TO  RF-MEG-TUKA-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 投資対象国コード（リファレンス情報）
           MOVE  TOUSI-TARGET-KUNI-CD OF  PARM-SCZY3002-ARG2
                                      TO  RF-TOUSI-TARGET-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体国コード（リファレンス情報）
           MOVE  HAKKO-TAI-KUNI-CD    OF  PARM-SCZY3002-ARG2
                                      TO  RF-HAKKO-TAI-KUNI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 株式種別（リファレンス情報）
           MOVE  KABU-SBT             OF  PARM-SCZY3002-ARG2
                                      TO  RF-KABU-SBT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 回（リファレンス情報）
           MOVE  KAYI                 OF  PARM-SCZY3002-ARG2
                                      TO  RF-KAYI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 号（リファレンス情報）
           MOVE  GOU                  OF  PARM-SCZY3002-ARG2
                                      TO  RF-GOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 満期日（リファレンス情報）
           MOVE  MNK-YMD              OF  PARM-SCZY3002-ARG2
                                      TO  RF-MNK-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 限月（リファレンス情報）
           MOVE  GENGETSU             OF  PARM-SCZY3002-ARG2
                                      TO  RF-GENGETSU
                                      OF  PARM-SCZY3004-ARG2
      *---------- ストライクプライス（リファレンス情報）
           MOVE  STRIKEPRICE          OF  PARM-SCZY3002-ARG2
                                      TO  RF-STRIKEPRICE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 適用開始日
           MOVE  TEKIYO-FROM          OF  PARM-SCZY3009-ARG2
                                      TO  TEKIYO-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 銘柄名称（日本語）
           IF  USE-MEG-NAME-J         OF  PARM-SCZY3009-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J       OF  PARM-SCZY3009-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J   OF  PARM-SCZY3009-ARG2
                                      TO  MEG-NAME-J
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（日本語略称）
           IF  USE-MEG-NAME-J-RYAKU   OF  PARM-SCZY3009-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3009-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（日本語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3009-ARG2
                                      TO  MEG-NAME-J-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語）
           IF  USE-MEG-NAME-E         OF  PARM-SCZY3009-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E       OF  PARM-SCZY3009-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語）≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E   OF  PARM-SCZY3009-ARG2
                                      TO  MEG-NAME-E
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 銘柄名称（英語略称）
           IF  USE-MEG-NAME-E-RYAKU   OF  PARM-SCZY3009-ARG2
                                      =   SPACE
           THEN
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "＝初期値の場合"
      *-----------------------------------------------------------------
               MOVE  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3009-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           ELSE
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "取得したユーザ指定銘柄名称（英語略称）"
      D             "≠初期値の場合"
      *-----------------------------------------------------------------
               MOVE  USE-MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3009-ARG2
                                      TO  MEG-NAME-E-RYAKU
                                      OF  PARM-SCZY3004-ARG2
           END-IF
      *---------- 発行体名称（日本語）
           MOVE  HAKKO-TAI-NAME-J     OF  PARM-SCZY3009-ARG2
                                      TO  HAKKO-TAI-NAME-J
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行体名称（英語）
           MOVE  HAKKO-TAI-NAME-E     OF  PARM-SCZY3009-ARG2
                                      TO  HAKKO-TAI-NAME-E
                                      OF  PARM-SCZY3004-ARG2
      *---------- 上場区分
           MOVE  JYOJY-KBN            OF  PARM-SCZY3009-ARG2
                                      TO  JYOJY-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 保振対象区分
           MOVE  HOHURI-TARGET-KBN    OF  PARM-SCZY3009-ARG2
                                      TO  HOHURI-TARGET-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 現地源泉税非課税区分
           MOVE  LCL-GS-TAX-NOTAX-KBN OF  PARM-SCZY3009-ARG2
                                      TO  LCL-GS-TAX-NOTAX-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 売買単位
           MOVE  BUY-SEL-TANI         OF  PARM-SCZY3009-ARG2
                                      TO  BUY-SEL-TANI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 公募区分
           MOVE  PUB-KBN              OF  PARM-SCZY3009-ARG2
                                      TO  PUB-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行日
           MOVE  HAKKO-YMD            OF  PARM-SCZY3009-ARG2
                                      TO  HAKKO-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 発行価格
           MOVE  HAKKO-KKK            OF  PARM-SCZY3009-ARG2
                                      TO  HAKKO-KKK
                                      OF  PARM-SCZY3004-ARG2
      *---------- 一口当り額面／単位額面
           MOVE  KUTI1-FACE           OF  PARM-SCZY3009-ARG2
                                      TO  KUTI1-FACE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算・利払回数
           MOVE  KESSAN-RIBAR-KAISU   OF  PARM-SCZY3009-ARG2
                                      TO  KESSAN-RIBAR-KAISU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日１
           MOVE  KESSAN-RIBAR-YMD-1   OF  PARM-SCZY3009-ARG2
                                      TO  KESSAN-RIBAR-YMD-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日２
           MOVE  KESSAN-RIBAR-YMD-2   OF  PARM-SCZY3009-ARG2
                                      TO  KESSAN-RIBAR-YMD-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日３
           MOVE  KESSAN-RIBAR-YMD-3   OF  PARM-SCZY3009-ARG2
                                      TO  KESSAN-RIBAR-YMD-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日４
           MOVE  KESSAN-RIBAR-YMD-4   OF  PARM-SCZY3009-ARG2
                                      TO  KESSAN-RIBAR-YMD-4
                                      OF  PARM-SCZY3004-ARG2
      *---------- 決算日／利払日休日処理区分
           MOVE  K-R-YMD-QJT-SYRI-KBN OF  PARM-SCZY3009-ARG2
                                      TO  K-R-YMD-QJT-SYRI-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 利付／割引区分
           MOVE  RITUKI-WARI-KBN      OF  PARM-SCZY3009-ARG2
                                      TO  RITUKI-WARI-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 固定変動区分
           MOVE  FIX-VRBL-KBN         OF  PARM-SCZY3009-ARG2
                                      TO  FIX-VRBL-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 償還日
           MOVE  SHOKAN-YMD           OF  PARM-SCZY3009-ARG2
                                      TO  SHOKAN-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 利払通貨
           MOVE  RIBAR-TUKA           OF  PARM-SCZY3009-ARG2
                                      TO  RIBAR-TUKA
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過日数計算方法
           MOVE  KEKA-NISU-CALC-HOU   OF  PARM-SCZY3009-ARG2
                                      TO  KEKA-NISU-CALC-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過日数計算方法１ヶ月３０日設定区分
           MOVE  KKNS-KSHH-1M30D-KBN  OF  PARM-SCZY3009-ARG2
                                      TO  KKNS-KSHH-1M30D-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過日数計算方法片端／両端区分
           MOVE  KKNS-KSHH-KTT-RT-KBN OF  PARM-SCZY3009-ARG2
                                      TO  KKNS-KSHH-KTT-RT-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 年日数計算方法
           MOVE  NEN-CALC-HOU         OF  PARM-SCZY3009-ARG2
                                      TO  NEN-CALC-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 年日数計算方法片端／両端区分
           MOVE  NEN-KSHH-KTT-RT-KBN  OF  PARM-SCZY3009-ARG2
                                      TO  NEN-KSHH-KTT-RT-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 単位１日あたり利息額
           MOVE  TANI-1-YMD-RSK-GAKU  OF  PARM-SCZY3009-ARG2
                                      TO  TANI-1-YMD-RSK-GAKU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 経過利息計算方法
           MOVE  KEKA-RSK-CALC-HOU    OF  PARM-SCZY3009-ARG2
                                      TO  KEKA-RSK-CALC-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 資産分類コード
           MOVE  SISAN-BUNRUI-CD      OF  PARM-SCZY3009-ARG2
                                      TO  SISAN-BUNRUI-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 利率／割引率
           MOVE  RRT                  OF  PARM-SCZY3009-ARG2
                                      TO  RRT-WARI-RT
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理桁数
           MOVE  HASU-SYRI-KETASU     OF  PARM-SCZY3009-ARG2
                                      TO  HASU-SYRI-KETASU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 設定日
           MOVE  SET-YMD              OF  PARM-SCZY3009-ARG2
                                      TO  SET-YMD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 販売口数
           MOVE  HANBAI-KUTISU        OF  PARM-SCZY3009-ARG2
                                      TO  HANBAI-KUTISU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 委託会社コード
           MOVE  ITK-CMP-CD           OF  PARM-SCZY3009-ARG2
                                      TO  ITK-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 保管先
           MOVE  HOKAN-SAKI           OF  PARM-SCZY3009-ARG2
                                      TO  HOKAN-SAKI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理FROM
           MOVE  HASU-SYRI-FROM       OF  PARM-SCZY3009-ARG2
                                      TO  HASU-SYRI-FROM
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理TO
           MOVE  HASU-SYRI-TO         OF  PARM-SCZY3009-ARG2
                                      TO  HASU-SYRI-TO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 端数処理方法
           MOVE  HASU-SYRI-HOU        OF  PARM-SCZY3009-ARG2
                                      TO  HASU-SYRI-HOU
                                      OF  PARM-SCZY3004-ARG2
      *---------- 勘定科目出力商品名
           MOVE  KNJ-KAMK-OUT-SYOHIN  OF  PARM-SCZY3009-ARG2
                                      TO  KNJ-KAMK-OUT-SYOHIN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分子）
           MOVE  JYOUSUU-BUNSI        OF  PARM-SCZY3009-ARG2
                                      TO  JYOUSUU-BUNSI
                                      OF  PARM-SCZY3004-ARG2
      *---------- 乗数（分母）
           MOVE  JYOUSUU-BUNBO        OF  PARM-SCZY3009-ARG2
                                      TO  JYOUSUU-BUNBO
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ１
           MOVE  YOBI-FLG-1           OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-FLG-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード１
           MOVE  YOBI-CD-1            OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-CD-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字１
           MOVE  YOBI-SU-JI-1         OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-SU-JI-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント１
           MOVE  COMENT-1             OF  PARM-SCZY3009-ARG2
                                      TO  COMENT-1
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ２
           MOVE  YOBI-FLG-2           OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-FLG-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード２
           MOVE  YOBI-CD-2            OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-CD-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字２
           MOVE  YOBI-SU-JI-2         OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-SU-JI-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント２
           MOVE  COMENT-2             OF  PARM-SCZY3009-ARG2
                                      TO  COMENT-2
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備フラグ３
           MOVE  YOBI-FLG-3           OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-FLG-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備コード３
           MOVE  YOBI-CD-3            OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-CD-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- 予備数字３
           MOVE  YOBI-SU-JI-3         OF  PARM-SCZY3009-ARG2
                                      TO  YOBI-SU-JI-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- コメント３
           MOVE  COMENT-3             OF  PARM-SCZY3009-ARG2
                                      TO  COMENT-3
                                      OF  PARM-SCZY3004-ARG2
      *---------- データソース
           MOVE  DATA-SOURCE          OF  PARM-SCZY3009-ARG2
                                      TO  DATA-SOURCE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 削除区分
           MOVE  SAKUJO-KBN           OF  PARM-SCZY3009-ARG2
                                      TO  SAKUJO-KBN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成フラグ
           MOVE  SK-FLG               OF  PARM-SCZY3009-ARG2
                                      TO  SK-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成画面ID
           MOVE  SK-GAMEN             OF  PARM-SCZY3009-ARG2
                                      TO  SK-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ファイル名
           MOVE  SK-FILE              OF  PARM-SCZY3009-ARG2
                                      TO  SK-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成日時
           MOVE  SK-DATE              OF  PARM-SCZY3009-ARG2
                                      TO  SK-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ログインユーザ会社コード
           MOVE  SK-LOGIN-CMP-CD      OF  PARM-SCZY3009-ARG2
                                      TO  SK-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成ユーザID
           MOVE  SK-SID               OF  PARM-SCZY3009-ARG2
                                      TO  SK-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 作成プログラムID
           MOVE  SK-PGMID             OF  PARM-SCZY3009-ARG2
                                      TO  SK-PGMID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新フラグ
           MOVE  UPD-FLG              OF  PARM-SCZY3009-ARG2
                                      TO  UPD-FLG
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新画面ＩＤ
           MOVE  UPD-GAMEN            OF  PARM-SCZY3009-ARG2
                                      TO  UPD-GAMEN
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ファイル名
           MOVE  UPD-FILE             OF  PARM-SCZY3009-ARG2
                                      TO  UPD-FILE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新日時
           MOVE  UPD-DATE             OF  PARM-SCZY3009-ARG2
                                      TO  UPD-DATE
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ログインユーザ会社コード
           MOVE  UPD-LOGIN-CMP-CD     OF  PARM-SCZY3009-ARG2
                                      TO  UPD-LOGIN-CMP-CD
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新ユーザＩＤ
           MOVE  UPD-SID              OF  PARM-SCZY3009-ARG2
                                      TO  UPD-SID
                                      OF  PARM-SCZY3004-ARG2
      *---------- 更新プログラムＩＤ
           MOVE  UPD-PGMID            OF  PARM-SCZY3009-ARG2
                                      TO  UPD-PGMID
                                      OF  PARM-SCZY3004-ARG2.
      *-------------------<DEBUG>---------------------------------------
      D    DISPLAY  "銘柄属性取得(その他オン)データ編集処理終了".
      *-----------------------------------------------------------------
       APL-MGR-ON-EDIT-EXT.
           EXIT.
